{
    "year": 107,
    "term": 2,
    "name": "國際財務管理",
    "teachers": [
        "安用吉"
    ],
    "department": "OU57",
    "code": "BAU0056",
    "credit": 3,
    "serial": 2417,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 5,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "雲608"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎必須先修過【BAU0007  財務管理】",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "The course extends financial decision-making to the international setting. Topics include the foreign exchange market, predicting exchange rate movements, hedging exposures with various derivative and other alternatives, the challenges of raising funds internationally and the process and documents of international trade. The course makes extensive use of case studies and there is an expectation that students will make recommendations to real life problems and justify their decisions. This is a challenging course with a significant theory content which requires class attendance and participation in addition to the appropriate independent study and thought to be successful. \nThe first half of the course covers the determination of foreign exchange rates, and the basics of trading in financial markets and governmental exchange rate policy. The second half, which is the focus of the course, deals with the impact of foreign currency exchanges and global capital markets on firms’ investment, financing, and risk management policies. We also discuss currency speculation strategies and the impact of monetary policy on exchange rates.",
    "goals": [
        "Describe and understand the basic types of foreign exchange rate quotations",
        "Demonstrate a knowledge of the international monetary system, and an ability to calculate and interpret values for various exchange rate problems.",
        "Understand parity conditions, especially the interest rate parity.",
        "Understand the categorization and effect of foreign exchange exposure",
        "Outline and apply theories of international finance which are used by firms to forecast exchange rates",
        "Explain foreign exchange exposure and compare instruments and techniques available to manage it",
        "Apply theories of international finance to case studies so as to analyze, evaluate and then articulate solutions to real world problems",
        "Compare costs and sources of capital for international and domestic firms.",
        "Identify and design the basic risk management strategies to effectively conduct netting, hedging, and offsetting foreign exchange exposure."
    ],
    "syllabus": "I will hold one review session prior to the final exam.  I will not cover any new materials during the review session. The session is mainly intended to remind you of key concepts and answer your questions.\n\n*   Feb. 22: introduction\n*   Mar. 1: no class\n*   Mar. 8: foundations of international finance, balance of payment (Ch. 1,2,3)\n*   Mar. 15: foundations of international finance, balance of payment (Ch. 1,2,3)\n*   Mar. 22: foreign exchange market (Ch.5)\n*   Mar. 29: foreign exchange market (Ch.5)\n*   Apr. 5: no class\n*   Apr. 12: LOOP, IRP, PPP, and triangular arbitrage (Ch.6)\n*   Apr. 19: LOOP, IRP, PPP, and triangular arbitrage (Ch.6)\n*   Apr. 26: **midterm exam**\n*   May 3: currency and interest rate derivatives (Ch.7,14)\n*   May 10: currency and interest rate derivatives (Ch.7,14)\n*   May 17: foreign exchange risk management (Ch.8,9,10)\n*   May 24: foreign exchange risk management (Ch.8,9,10)\n*   May 31: **mini-conference**\n*   Jun. 7: no class\n*   Jun. 14: final review\n*   Jun. 21: **final exam**",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        },
        {
            "type": "其他",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 30,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 50,
            "note": "If your total score is less than 70% of the top 10% scores, then you will fail this course."
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "capstone project"
        }
    ],
    "prerequisite": "◎必須先修過【BAU0007  財務管理】",
    "general_core": []
}