{
    "year": 107,
    "term": 2,
    "name": "貨幣銀行學",
    "teachers": [
        "馮穎"
    ],
    "department": "OU57",
    "code": "BAU0045",
    "credit": 3,
    "serial": 2414,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 1,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "正204"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎必須先修過【BAU0039  經濟學（二）】",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course offers an exposition of lessons about monetary economics gleaned from the Overlapping Generations Models (OLG) of money. We use this class of economic model to understand fundamental questions in monetary economics: How does money promote exchange? What should serve as money? What causes inflation? What is the cost of inflation?\n\nThe course is divided into two parts. Part I examines money in isolation. Here we tackle the questions of the demand for money, a comparison of fiat money (which now serves as the primary means of exchange) and commodity money, inflation and exchange rates. Part II adds capital to study money’s interaction with other assets, banking and intermediation of these assets into substitutes for fiat money.\n\nWhile the course may not have practical applications in most business context, it offers one of the most rigorous treatment of the central issues concerning monetary economics. Above all, the analytical skills you acquire from the course extends to many areas of your life, your future job included. Please do not take this course if you are not willing to work hard",
    "goals": [
        "Able to identify relevant issues.",
        "Able to analyze gathered information using the appropriate methods and models",
        "Able to analyze business issues and opportunities with original insights.",
        "Able to address novel and relevant ideas.",
        "Students will demonstrate their ability to employ analytical approaches for business tasks (Management Science Model)",
        "Students will demonstrate their ability to understand the business analysis findings and make appropriate business recommendations"
    ],
    "syllabus": "**Following is the list of topics that will be covered in the term. How the course progresses may depend on students’ background knowledge and class participation**\n\n1.  Trade without record keeping: the role of money\n2.  A simple model of money\n3.  Barter and commodity money\n4.  inflation\n5.  Price surprises\n6.  International Monetary System\n7.  Capital\n8.  Liquidity and Financial Intermediation\n9.  Central Banking and Money Supply",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "其他",
            "note": "(please type in the methods applied but not provided in the\nabove list\n(please type in the methods applied but not provided in the\nabove list\n(please type in the methods applied but not provided in the\nabove list\n(please type in the methods applied but not provided in the\nabove list\n(please type in the methods applied but not provided in the\nabove list"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": "2 Assignments, 15 marks each"
        },
        {
            "type": "期中考",
            "weight": 20,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 30,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        }
    ],
    "prerequisite": "◎必須先修過【BAU0039  經濟學（二）】",
    "general_core": []
}