{
    "year": 110,
    "term": 2,
    "name": "進階諮商心理實習（二）",
    "teachers": [
        "許維素"
    ],
    "department": "ED01",
    "code": "PCD2009",
    "type": "必",
    "grade": 1,
    "credit": 2,
    "serial": 353,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 5,
            "to": 8,
            "campus": "本部",
            "classroom": "教615"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎必須先修過【PCM0089  諮商理論專題研究】 ◎課程不開放上修",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 4,
    "description": "實習內容： 1. 學生在實習機構的諮商實習，每週至少6小時，依各人排班時間，於實習單位進行。實習內容為： （1）個別諮商（含生涯諮商、婚姻與家庭諮商）： 每週約3 –4實際接案小時數。全學期不得低於50小時的實際接案小時數，全學年累計至少不得少於100實際接案小時數； （2）本學期至少帶領一個團體。實際帶領團體總小時數不得少於20小時； （3）其他實習項目：選擇性參予實習單位的測驗實施或解釋、班級座談、小型團體討論會、整理個案資料、諮商工作計畫擬定與實施等工作等。 2. 學生在實習機構接受每週一次每次一小時之合格諮商心理師之專業督導持續至實習結束，並於需要時接受機構之行政督導。 3. 每週到校課堂上課3-4小時",
    "goals": [
        "熟悉個案特定問題類型及其心理與行為",
        "熟悉將諮商理論應用於實務工作"
    ],
    "syllabus": "一、教學目標\n\n1.  透過機構實習、個案研討與督導，提升諮商心理實務知能與個案概念化能力。\n2.  透過閱讀、課堂討論與實務經驗相互印證與反芻，協助學生對諮商心理專業認同與效能提升的專業發展。\n3.  運用諮商心理學之「科學家-實務者」整合教育模式，培育在地之諮商心理專業高階人才。\n\n二、教學內容與進度\n\n日期\n\n主題\n\n2/16\n\n課程定向、實習計畫討論及文獻討論 A1 概念化＆ B4 評估與概念化\n\n2/23\n\n個案研討（含錄音檔或/及逐字稿），以及其他實習議題討論\n\n3/2\n\n文獻討論C7 紀錄\n\n3/9\n\n個案研討（含錄音檔或/及逐字稿），以及其他實習議題討論\n\n3/16\n\n文獻討論B5＆A9  Evidence-based therapy \n\n3/23\n\n個案研討（含錄音檔或/及逐字稿），以及其他實習議題討論\n\n3/30\n\n文獻討論B10 危機與特殊族群\n\n4/6\n\n個案研討（含錄音檔或/及逐字稿），以及其他實習議題討論\n\n4/13\n\n文獻討論 C8  自我照顧\n\n4/20\n\n個案研討（含錄音檔或/及逐字稿），以及其他實習議題討論\n\n4/27\n\n文獻討論C10＆C11結案與結束實習\n\n5/4\n\n個案研討（含錄音檔或/及逐字稿），以及其他實習議題討論\n\n5/11\n\n個人自選章節/主題報告\n\n5/18\n\n個人自選章節/主題報告庚  Y，以及其他實習議題討論\n\n5/25\n\n實習經驗統整與分享 \n\n6/01\n\n實習經驗統整與分享\n\n6/08\n\n獨立研究；出席相關研討會議或諮商訓練工作坊    \n\n6/15\n\n獨立研究；出席相關研討會議或諮商訓練工作坊\n\n*   實習內容\n*   實習計畫相關事宜\n\n1.  於實習前提出實習計畫，且需獲授課教師同意後方可實習。本門課不同於碩班的兼職實習，不只是諮商實務的演練，還有對諮商心理專業生涯發展的認同與學習。請根據個人的諮商心理專業生涯發展需求規劃。\n2.  需取得實習機構之實習同意書，並發寄公文。\n3.  個別督導每週至少一小時，人選須獲授課教師同意，以具豐富諮商心理實務之諮商心理博士優先。\n4.  下學期如有更換實習機構，於開學第一週前，提出諮商心理實習計畫一份（原則上開學後開始實習，如欲提前或延後開始實習者，請於實習前提交、並獲授課教師同意）與個人諮商實務履歷資料。實習計畫獲授課教師同意後方可進行實習。\n5.  博士生在實習機構的諮商實習，以系上規範為準則，每週兩個半天(至少6-8小時)，依個人排班時間，於實習單位進行。實習內容請依據本系針對「博士班兼職『進階諮商心理實習（一）（二）』課程實施要點」規劃與執行，目的在透過機構實習經驗，發展個人對諮商心理專業認同與效能提升，因此，實習計畫原則上應包括：\n    1.  個別諮商： 每週約3–4個實際接案小時數。上學期不低於40小時的實際接案時數，全學年累計不少於100實際接案時數。其中至少有兩個個案屬於連續晤談個案（至少連續七週以上）。\n    2.  團體諮商：每學期得帶領一個團體、實際帶領團體總時數自訂；\n    3.  其他實習項目：參與實習單位的其他與諮商心理相關之工作，如測驗實施與心理衡鑑、婚姻與家庭諮商、心理諮詢與心理衛生推廣工作、危機處遇、個案管理，或其他配合實習機構要求，有助於展現諮商心理效能與個人專業發展之實習工作；以及，如何運用機構實習作為，發展對諮商心理專業認同與效能提升之規劃。\n    4.  博士生在實習機構接受每週一次、每次至少一小時之資深諮商心理師之專業督導（需經授課教師同意＆事前需先告知當事人），並持續至實習結束；配合機構要求，必要時，接受機構之行政督導。\n6.  依照實習機構規定填寫個別與團體諮商紀錄。切實記錄每週諮商實習時數，並且遵守諮商與實習機構工作倫理。\n7.  每週到校上課3小時；上課方式包括個案研討、班級團體督導、文獻報告討論，以及實習問題討論等。課堂團體督導時，請報告者事前準備好書面資料，其中包括個案研究報告與錄音/錄影及逐字稿資料，以及其他需要討論的諮商實習議題相關資料。\n8.  期末繳交：(a) 諮商心理實習時數累計表；(b) 實習機構督導評量表；(c) 實習專業督導評量表；(d) 期末個人諮商理論與學習心得報告；以及（e）三份諮商實習月誌（2-3月, 4月, 5-6月）。\n\n註.實習機構部分：\n\n*   在職生請勿選擇原服務機構。\n*   請選擇個案較多、能提升與發展諮商心理專業認同之機構實習。\n*   個別督導請優先找具博士學位、諮商與心理治療實務經驗、主修諮商心理學者；為避免雙重關係，請勿邀請本系教師擔任督導；專業督導人選需獲授課教師同意。\n\n*   課程要求與評量\n\n1.完成本課程要求（35%）\n\n1.  切實完成前述實習內容。\n2.  個別諮商於取得當事人同意下，進行錄音或錄影，每週強烈建議觀看（聆聽）自己接案的錄影（音）帶一小時；個案報告時，除依據附錄格式撰寫個案報告外，並謄寫至少20分鐘晤談逐字稿及反思；並於期末，將所謄寫之逐字稿，採用本學期所閱讀文獻，進行分析與統整。\n3.  每次個案研討，請參考本大綱所提供個案報告格式撰寫。個案研討目的在精緻化諮商技術與提升對個案概念化能力，因此，包含兩個以上的案主及兩次本學期所接的個案，整理個案概念化、提供錄音檔＆諮商逐字稿（約20分鐘，與督導需求有關）及反思、提出督導需求與反思。同時可以提出其他諮商實習議題的討論（如團體諮商或機構實習，需要時提供書面資料）。個案研討報告書面資料，請於上課前三日EMAIL提供給任課教師與同學，並以報告日期設為WORD檔密碼。\n4.  輪流負責報告規定的文獻資料，以及個人自選教科書之章節或者另備主題報告（先告知任課教師與同學章節或相關文章，英文頁數30以上）。報告時間以80-90分鐘為限，以PPT形式報告。報告之後，需設計與帶領討論方向，嘗試探討諮商相關文獻與實務工作的連結（如討論議題、案例等）。請於上課前三日將PPT先EMAIL提供給任課教師。\n5.  期末實習經驗統整與分享：配合期末學習心得作業向度（如接案經驗、諮商風格探究、受督經驗、專業認同、諮商機構運作等專業成長），以PPT形式報告，報告時間以90分鐘為限。任課教師與同學給予回饋。請於上課前三日EMAIL提供給任課教師。\n6.  一學期內至少參加一次諮商訓練作坊或研討會（六小時以上），心得併入期末作業。\n7.  於每月下旬上課時繳交諮商實習月誌（含該月實習工作內涵），全學期共3份(2-3、4、5-6月，期末再次合併繳交)\n\n2.期末個人諮商理論與學習心得報告（15%）。於期末6/8日繳交，以15000-16000字為主（列出字數）。期末個人諮商理論與學習心得報告之目的在協助整理個人諮商心理理論與實務取向，因此請依據個人學習所得整理內容需包含以下向度：\n\n*   課堂個案重要反思與分析（如前所述，將本學期所謄寫之逐字稿與個案研討報告，進行個案概念化分析與整理，並將所謄寫之逐字稿，採用本學期所閱讀文獻，進行分析與統整）。\n*   個人諮商風格發展與專業認同、與案主關係的建立與處理的能力、實習期間的專業與自我成長的評估、成為諮商心理學家之學習體驗\n*   各項諮商實習工作之學習經驗深度探索、在機構實習經驗反思、在諮商實習中發生的重要事件、督導經驗與倫理議題\n*   參與研討會或訓練工作坊，或其他重要學習收穫等等。\n\n3.實習機構評分(50%)。\n\n五、課堂期待\n\n        以開放與尊重的態度、對個案資料的保密、對彼此提供誠摯、不評價的回饋意見、積極參與討論與提供回饋的態度等。所有抄襲報告一經發現，均以零分計算。個案報告需以目前正在進行、且未在其他課堂或個案研討會議中提報；如經發現重複提報者，其「完成實習要求」成績將以零分計算。因應COVID-19疫情，必要時，將採網路教學方式進行課程。若有任何一人感冒、生病，以及所屬地區有群聚感染之危機，將改為視訊上課。\n\n六、備註\n\n        本課程大綱於寒假期間提供，授課內容於開學後，可能因修課學生人數與過去諮商專業經驗之條件而進行部分調整。\n\n七、教科書\n\n1.  Berman, P. S. (2015). Case conceptualization and treatment planning: integrating theory with clinical practice. Sage. CH1＆9（最新版2019）\n2.  Christin, M. J., & Judith, S.（2019）. Practicum & Internship: Textbook and Resource Guide for counseling and Psychotherapy. Routledge. ---CH. 4. 5. 10\n3.  Baird, B. N. (2014). The internship, practicum, and field placement handbook: A guide for the helping professions.. NJ: Prentice Hall. ---CH7. 8.10（最新版2019）\n4.  Zubernis, L. S. (2016). Case conceptualization and effective interventions: assessing and treating mental, emotional and behavioral disorders. Sage.\n\n*   A1 概念化＆B4 評估與概念化\n*   C7 紀錄\n*   B5＆A9  Evidence-based therapy  \n*   B10 危機與特殊族群\n*   C8 自我照顧\n*   C10＆C11 結案與結束實習\n*   於教科書中或其他諮商相關英文書籍自選1-2章，或數篇文章（需英文30頁以上）",
    "methodologies": [
        {
            "type": "講述法",
            "note": "講解文獻與諮商工作細則"
        },
        {
            "type": "討論法",
            "note": "針對文獻與案例資料進行討論"
        },
        {
            "type": "實驗/實作",
            "note": "進行實地諮商實習"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 35,
            "note": "上課文獻報告、個案研討報告"
        },
        {
            "type": "報告",
            "weight": 15,
            "note": "期末實習心得報告"
        },
        {
            "type": "其他",
            "weight": 50,
            "note": "機構實習督導評量"
        }
    ],
    "prerequisite": "◎必須先修過【PCM0089  諮商理論專題研究】",
    "general_core": []
}