{
    "year": 108,
    "term": 2,
    "name": "國際環境傳播",
    "teachers": [
        "林冠慧"
    ],
    "department": "SM46",
    "code": "EEC8050",
    "credit": 3,
    "serial": 2624,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 2,
            "from": 6,
            "to": 8,
            "campus": "公館",
            "classroom": "行304"
        }
    ],
    "programs": [],
    "comment": "要求具備相關基礎課程",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "This course is designed for graduate students who are interested on the contemporary environmental issues with a specific interest on using English as main media for communication. The purpose of the course is to provide students a free environment to enable their English speaking and listening abilities as well as writing and reading. Thus students are not required to have high standard English ability to participate in the class. Students who are NOT confident in English speaking and listening are especially encouraged to sign up for this course to gain the chances for steady English practices on the global environmental issues every week. The ultimate goal of the course is to nurture students to have international competence on reviewing, examining, and further communicating progress of environmental education in Taiwan to the world. Moreover, students are empowered to have international communication ability in the long run to broaden their international visions for future career and life planning.",
    "goals": [
        "Enhancing students’ English speaking, listening, reading as well as writing ability",
        "Broadening environmental literacy and global understanding on the environmental issues",
        "Constructing students’ confidence on using English as media for communication in future careers"
    ],
    "syllabus": "Every week, we will select a scientific report or relevant environmental news as our weekly reading(s). In class, we will discuss those assigned reading(s), meanwhile, the teacher will provide further resources such as visual material or e-media (e.g. bbc, cnn, United Nation news, Reuters) to enhance other forms of English training and interpretation. We will also invite specialists working in international media, enterprises, or NGOs to give us talks or visit their working places.\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=b66a33ff1a4c4e678e1a1bbf967e96d9&fno=ab92a637197d4ef0aa6d6cb2866809a9)",
    "methodologies": [
        {
            "type": "討論法",
            "note": "Every student will discuss the weekly readings in the class"
        },
        {
            "type": "合作學習",
            "note": "Students will form groups for project discussion"
        },
        {
            "type": "媒體融入教學",
            "note": "Teacher will use visual materials or e-media in class"
        },
        {
            "type": "專題研究",
            "note": "Students will be organized into groups working on a certain topic of environmental issues as term project"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": "Every student has to actively participate in the class discussion"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Students need to participate in every class"
        },
        {
            "type": "成果展覽",
            "weight": 20,
            "note": "Oral presentation of the term project"
        },
        {
            "type": "專題",
            "weight": 40,
            "note": "Students will be organized into groups working on a certain topic of environmental issues and making a video to communicate their ideas as term project"
        }
    ],
    "prerequisite": "",
    "general_core": []
}