{
    "year": 111,
    "term": 1,
    "name": "國際財務管理",
    "teachers": [
        "阿曼德"
    ],
    "department": "OU57",
    "code": "BAU0056",
    "credit": 3,
    "serial": 2478,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 4,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "誠207"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎必須先修過【BAU0007  財務管理】",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "Describe and understand the basic types of foreign exchange rate quotations",
        "Demonstrate a knowledge of the international monetary system, and an ability to calculate and interpret values for various exchange rate problems.",
        "Understand parity conditions, especially the interest rate parity.",
        "Understand the categorization and effect of foreign exchange exposure",
        "Outline and apply theories of international finance which are used by firms to forecast exchange rates",
        "Explain foreign exchange exposure and compare instruments and techniques available to manage it",
        "Apply theories of international finance to case studies so as to analyze, evaluate and then articulate solutions to real world problems",
        "Compare costs and sources of capital for international and domestic firms.",
        "Identify and design the basic risk management strategies to effectively conduct netting, hedging, and offsetting foreign exchange exposure."
    ],
    "syllabus": " Week 1(from 17th Feb) and Week 2 are self-study  \n Week 3 (3rd March) to Week 6 (24th March)(no class, a total of 12 hours teaching will be evenly distributed to Week 7 toWeek 18)Week 7 (31st March) to Week 9 (14th April) will be online teaching.  \nWeek 10 (21st April) to Week 18 (16th June) will be teaching in the classroom.  \n\n\\- Week 1 (from 17th Feb) and Week 2 are self-study (no class)\n\n\\- Week 3 (3rd March) to Week 6 (24th March) (no class, a total of 12 hours teaching will be evenly distributed to Week 7 to Week 18)  \nWeek 7 (31st March) to Week 9 (14th April) will be online teaching.  \nWeek 10 (21st April) to Week 18 (16th June) will be teaching in the classroom.\n\n**Topic**\n\n**Chapter**\n\n**Week**\n\nSyllabus Class/Introduction\n\nCh.1 & 2\n\nW1: February 17  \nNo class, self study\n\nInternational Financial Management & The International Monetary System\n\nCh.1 & 2\n\nW2: February 24  \nNo class, self study\n\nThe Foreign Exchange Market\n\nCh.5\n\nW3: March 3  \nNo class\n\nInternational Parity Conditions\n\nCh.6\n\nW4: March 10  \nNo class\n\nInternational Parity Conditions\n\nCh.6\n\nW5: March 17  \nNo class\n\nBalance of Payments\n\nCh.3\n\nW6: March 24  \nNo class\n\nTutorial Question- Midterm Exam Review\n\nAll covered materials\n\nW7: March 31  \nTeaching online\n\nPlease provide students online teaching link\n\n**MID-TERM EXAM**\n\nAll covered materials\n\nW8: April 7  \nTeaching online\n\nPlease provide students online teaching link\n\nCurrency Derivatives\n\nCh.7\n\nW9: April 14\n\nTeaching online\n\nPlease provide students online teaching link\n\nInterest Rate Derivatives\n\nCh.14\n\nW:10 April 21\n\nTeaching in the classroom\n\nExchange Rate Exposure I: Transaction and Translation Exposure\n\nCh.8 &10\n\nW11: April 28\n\nTeaching in the classroom\n\nExchange Rate Exposure II: Economic Exposure\n\nCh.9\n\nW12: May 5\n\nTeaching in the classroom\n\nInternational Portfolio Theory and Diversification\n\nCh.15\n\nW13: May 12\n\nTeaching in the classroom\n\nCost & Availability of Capital and Political Risk\n\nCh.12, 13, &17\n\nW14: May 19\n\nTeaching in the classroom\n\nInternational Capital Budgeting\n\nCh.18\n\nW15: May 26\n\nTeaching in the classroom\n\nGroup Project Presentation\n\nAssigned group project\n\nW16: June 2\n\nTeaching in the classroom\n\nFinal Exam Review\n\nAll covered materials\n\nW17: June 9\n\nTeaching in the classroom\n\n**Final Exam**\n\nAll covered materials\n\nW18: June 16\n\nTeaching in the classroom",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "The course is based on a combination of readings from the text, lectures delivered via the course website (by instructor and guest lecturers), articles, readings, videos and discussions on the course discussion board. For each section, students are expected to read the assigned chapters and lecture notes, view any assigned slides and/or videos, actively participate in the online discussion, and complete required assignments and exercises. Please consult the course plan that accompanies this syllabus and the Blackboard or Canvas site for this course to see a list of class preparation assignments by topic.\n\nAdditional readings, lecture notes, and problem sets will be posted on the course web (Blackboard or Canvas). Students are required to check this site periodically for updates."
        },
        {
            "type": "Group discussion",
            "note": "Interaction on the discussion is a significant and required part of this class. As with any course, the more the class participates in the discussion, the more interesting and valuable the course will become. Since our primary means of group discussion is the class discussion board, this area becomes a critical portion of the course.\n\nAs a business school class, I anticipate a high level of interaction. Five percent of your grade includes your discussion and the points you add to the class discussion, your role in class and overall participation."
        },
        {
            "type": "Problem base learning",
            "note": "I will assign material to read for each class (in addition, you should follow along in the syllabus and read the materials that each class will cover).  If a problem set/ data analysis is assigned, it is the responsibility of each student to complete it and turn it in on time.  Late assignments are not accepted."
        },
        {
            "type": "Media, audio, visual materials",
            "note": "I will be sharing with you some examples from media clips, music, \nnews articles, and students’ own experiences that would make our class more exciting and more comfortable. To personalize the class to student experiences, I might ask a student or two about their jobs and use those examples to discuss finance concepts like decision making under uncertainty. I truly believe if students do not see a variety of ways in which finance concepts can be applied to the real world they will fail to see how it matters to them."
        },
        {
            "type": "Case studies",
            "note": "The purpose of group project is to get familiar with recent developments of international financial markets to make up the under-coverage of them in the lectures. Groups of two people must beformed and should stay together until the end of semester. Each group could choose a topic by themselves. The topics should be related to the material discussed in class, and address issues faced by companies operating in the market."
        },
        {
            "type": "Other:",
            "note": "I reserve the right to add deliverables, quizzes, assignments, data analysis, cases, etc. where I believe it serves the class"
        }
    ],
    "grading": [
        {
            "type": "Midterm Exam",
            "weight": 25,
            "note": ""
        },
        {
            "type": "Final exam",
            "weight": 35,
            "note": ""
        },
        {
            "type": "Class discussion involvement",
            "weight": 15,
            "note": ""
        },
        {
            "type": "Attendances",
            "weight": 10,
            "note": ""
        },
        {
            "type": "Presentation",
            "weight": 15,
            "note": "Group Project/Students’ presentation"
        }
    ],
    "prerequisite": "Prerequisite course: 【BAU0007  Financial Management】",
    "general_core": []
}