{
    "year": 111,
    "term": 1,
    "name": "服務業經營管理研究",
    "teachers": [
        "未定"
    ],
    "department": "HM70",
    "code": "IEM0096",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 1115,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 5,
            "to": 6,
            "campus": "本部",
            "classroom": "研討一"
        },
        {
            "day": 2,
            "from": 9,
            "to": 9,
            "campus": "本部",
            "classroom": "研討一"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "A service is a provider/client interaction that creates and captures value. Because a successful services provider/client relationship has a critical dependency upon a well-defined and functional relationship, this course will provide an overview of service management from an integrated viewpoint with a focus on customer satisfaction. The material will integrate operations, marketing, strategy, information technology and organizational issues.\n\n\nTherefore, the course aims to help MOT majored students in understanding the \"state of the art\" in service management strategies, develop an awareness of how information technology can enhance service firms' competitiveness, understanding the tools for analyzing and optimizing the service experience, understanding the operational processes for managing the service encounter to achieve internal and external customer satisfaction, and understanding the complexities associated with implementing change.\nand sustain competitive advantage. The course includes lectures, readings, case discussion, presentations, field visits, and term project.",
    "goals": [
        "協助學生瞭解服務業經營及管理之理論、進展與方法"
    ],
    "syllabus": "",
    "methodologies": [
        {
            "type": "",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "",
            "weight": null,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}