{
    "year": 107,
    "term": 1,
    "name": "進階筆譯（中譯英）",
    "teachers": [
        "鄭永康"
    ],
    "department": "LM25",
    "code": "TIM1043",
    "credit": 3,
    "serial": 1648,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 5
    },
    "schedule": [
        {
            "day": 3,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "譯505"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "本課程旨在讓學生學習文史哲相關文件的英文翻譯技巧。\n透過16篇翻譯作業，學生將學會文史哲文件的關鍵翻譯技巧和詞彙。作業將涵蓋：中國哲學，歷代文物介紹，歷史相關論文，中西文化比較等等。",
    "goals": [
        "Students will be familiar with the use of the correct terminology in Chinese –English translation of various industries in cross-cultural contexts.",
        "Students will exercise and develop adequate competence of translating academic research papers on various topics from Chinese to English"
    ],
    "syllabus": "This course is a practice-based training designed to help students learn the skills necessary for translating Chinese texts dealing with laws and regulations mainly into English. Students will study and learn language of a higher register necessary for translating formal texts, official documents and legal texts.\n\n本課程重點為法律文件翻譯。透過十幾篇中翻英作業，學生將學習如何翻譯中文法律條款和相關文體。作業難度將採漸進模式，讓學生逐步累積相關法律知識，熟悉文件格式並學會法律文件翻譯技巧。\n\n選課要求\n\n1.  **Must have completed at least THREE credits of Chinese into English _practical_ translation courses.**\n2.  **This is a difficult and challenging course. If you tend to be lazy, and/or faint-hearted, or have short attention span, this course is not for you.**\n3.  **Students will  not be allowed to \"play\" with their laptops/cellphones in class.**\n\n  \n**評量方式 Grading**  \nWeekly Exercises: 30%  \nClass Attendance: 20%\n\n**Participation: 20%**  \nExams: 20%  \nTerm Project: 10%  \n  \n**Classes will be conducted as follows:**  \n(1) A weekly translation exercise of about 700 Chinese characters long; at least 14 exercises during the term. Dropbox or Moodle Submission.  \n(2) Source-language texts will include select articles dealing with laws and regulations, such as contracts, charters, etc. In the first few weeks, students will learn more formal language expressions and legalese necessary to handle law texts. Difficulty of the text will be graduated.\n\n(3) Weekly translation projects submitted by students will be discussed in class, including analysis of mistranslations, corrections and improvements.  \n(4) Emphasis of student-work analysis: textual content, grammar, diction, vocabulary, language register and format.  \n(5) Students will be assigned to study and comment on the work of their classmates as a means to learn others’ adopted techniques, as well as consider their pros and cons, in comparison with their own work.  \n(6) Towards the latter part of the term, students will be assigned inter-textual comparison of existing translations with their original, to pinpoint weak points and to offer possible improvements.  \n(7) As a way to develop speed, students will at times be required to do translation of short passages on-site, to be followed by a review of their work.  \n(8) Students will sit for their mid-term and final exams.  \n(9) Students will be required to compile a glossary of terms based on the assigned exercises, to be submitted by the end of the semester.\n\n**Course Schedule**\n\n第1週 Introduction and Formal language 1  \n第2週 Formal language 2\n\n第3週 Translation of Written Message\n\n第4週 Translation of Course Introduction 1\n\n第5週 Translation of Course Introduction 2\n\n第6週 Translation of Course Introduction 3\n\n第7週 Translation of Simple Regulations 1\n\n第8週 Mid-Term Exam\n\n第9週 Translation of Simple Regulations 2\n\n第10週Translation of University Regulations 1\n\n第11週 Translation of University Regulations 2\n\n第12週 Translation of Written Agreements 1\n\n第13週 Translation of Written Agreements 2\n\n第14週 Translation of Job Contracts 1\n\n第15週 Translation of Job Contracts 2\n\n第16週 Translation of Government Decrees\n\n第17週 Translation of Government Regulations\n\n第18週 （Final Exam）  \n \n\n課程目標  \n\nTo make students learn Chinese into English translation skills, as well as ways of handling different types of official documents and legal texts. \n\n**課程要求** \n\n(1) A weekly translation exercise of about 700 Chinese characters long\n\n(2) Students will sit for their mid-term and final exams.\n\n(3) Students will be required to compile a bilingual glossary of terms based on the assigned exercises, to be submitted at the end of the semester.",
    "methodologies": [
        {
            "type": "討論法",
            "note": "In-class discussion of weekly assignments"
        },
        {
            "type": "合作學習",
            "note": "Students may be assigned to work in pairs"
        },
        {
            "type": "媒體融入教學",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 25,
            "note": "Weekly assignments"
        },
        {
            "type": "期末考",
            "weight": 20,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 25,
            "note": "Participation and Attentiveness; PROPER USE OF YOUR COMPUTER AND CELLPHONES; 2 POWERPOINT REPORTS IN ENGLISH"
        },
        {
            "type": "出席",
            "weight": 30,
            "note": "Attendance and tardiness；AWOL; NO MORE THAN 3 ABSENCES IN THE TERM"
        }
    ],
    "prerequisite": "",
    "general_core": []
}