{
    "year": 110,
    "term": 1,
    "name": "分項華語文教學實習：IB國際學校",
    "teachers": [
        "楊秉煌"
    ],
    "department": "IM84",
    "code": "CLM0098",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 4863,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 16,
            "to": 11,
            "campus": "本部",
            "classroom": "綜10樓華語系教室"
        }
    ],
    "programs": [
        "國際教師學程-華語文"
    ],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course aims to cultivate teacher candidates’ competences of Chinese teaching practice. To complete this course, they have to demonstrate being capable of teaching Chinese language independently. Through learning by doing, teacher candidates have various opportunities to exercise teaching and learning theories by taking real contexts of local and international schools into consideration. Specifically, to systematically enhance teaching methods and strategies, they are required to visit Chinese centers, observe Chinese language lessons, design unit plans, practice course designs, and conduct teaching practicum in real classroom settings. Moreover, to become Chinese teaching professionals, they have to learn to improve themselves via self-reflection as well as constructive feedback from peers, instructors, and mentors in practicum schools. Furthermore, it is encouraged to set up communities of practices (CoP), either online or in physical settings, in order to support self-discovery learning and life-long commitment to Chinese education.",
    "goals": [
        "Understand the principles of and approaches to teaching Chinese as a second language in contexts of local institutes and international schools.",
        "Possess professional ability to link up teaching practices with teaching and learning theories, especially taking authentic learning into consideration.",
        "Appreciate how Chinese teaching and learning are carried out in different education settings (e.g., IB schools, local schools, or Chinese language centers) and reflect to teacher candidates’ own pedagogies.",
        "Design learning activities and teaching strategies that are appropriate to Chinese language learners with different backgrounds, including their first languages, nations and cultures.",
        "Demonstrate cross-cultural diversity awareness to design appropriate Chinese teaching materials that integrate global contexts.",
        "Experience Chinese teaching with plans that are embedded with IB principles.",
        "Develop a professional teacher profile, including vision statement, teaching philosophy, teaching experience, reflection on various teaching-related activities, and future plans as a Chinese educator."
    ],
    "syllabus": "",
    "methodologies": [
        {
            "type": "",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "",
            "weight": null,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}