{
    "year": 108,
    "term": 2,
    "name": "教育研究論文寫作",
    "teachers": [
        "林宗進",
        "蔡今中"
    ],
    "department": "E",
    "code": "E0C8010",
    "credit": 3,
    "serial": 345,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 5,
            "from": 5,
            "to": 7,
            "campus": "本部",
            "classroom": "教育學院第一會議室"
        }
    ],
    "programs": [],
    "comment": "上課教室：教育學院三樓第一會議室",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "本課程的目的是幫助研究生進行教育研究論文的撰寫，尤其是英文期刊論文的撰寫。本課程的內容包括：評析教育研究論文、教育研究期刊分析、論文審查、論文格式與結構、論文全文撰寫。期望經由本課程的引導，修習本課程的學生能夠讓研究之論文有更好地呈現，甚至將成果發表在國際知名期刊。",
    "goals": [
        "評析教育研究論文",
        "了解論文審查要點與撰寫格式",
        "撰寫教育研究期刊論文"
    ],
    "syllabus": "**本課程上課教室：教育學院大樓3樓第1會議室**\n\n**Classroom: Conference room 1, Third floor, Education Building, Library Campus, NTNU** \n\nWeek 1 (March. 06) Course introduction\n\nWeek 2 (March 13) One-to-one meeting (checking the data, research topic, and potential journal)\n\nWeek 3 (March 20) Searching literature by using relevant databases\n\nWeek 4 (March 27) Writing research question/purposes and publication attitude\n\nWeek 5 (April 03) Holiday (No class)\n\n\\*Week 6 (April 10) Tips for writing “Research Method.”\n\n\\*Week 7 (April 17) Academic writing from native English proofreader (by guest speaker)\n\n\\*Week 8 (April 24) One-to-one meeting about the writing of research questions and purposes.\n\nWeek 9 (May 01, midterm) Writing “Research Method” (No class)\n\n(Evaluation of Self-directed learning assignment I, Due: May 01)\n\n\\*Week 10 (May 08) Tips for writing “Research Results”\n\n\\*Week 11 (May 15) One to one meeting (“Research Method)\n\n\\*Week 12 (May 22) Tips for writing “Discussion, conclusion, and implications.”\n\n\\*Week 13 (May 29) Tips for writing introduction and literature review\n\nWeek 14 (June 05) One to one meeting (for Research Results and Discussion)\n\nWeek 15 (June 12) Writing a good “Abstract” (30 mins)/ One to one meeting (introduction/literature review)\n\nWeek 16 (June 19) Final paper submission including abstract\n\n(Evaluation of Self-directed learning assignment II, Due: June 19)\n\n\\*Classes marked with asterisks (\\*) will be taught remotely.\n\nNote 1: For the weeks of one-to-one meeting, please email your writings (either in WORD or PDF format) beforehand on Mondays of the listed weeks.   \nTsai, Chin-Chung: tsaicc@ntnu.edu.tw  \nLin, Tzung-Jin: tzungjinlin@ntnu.edu.tw\n\nNote 2：Each one-to-one meeting schedule will be prioritized for those who formally enrolled this course. For those who only intend to audit this course, they will be arranged when the instructors are available for discussions. Moreover, these auditing students will be given only twice opportunities at top for one-to-one meeting throughout the semester.",
    "methodologies": [
        {
            "type": "講述法",
            "note": "對期刊論文撰寫之要點進行講解"
        },
        {
            "type": "討論法",
            "note": "經上課時與同學之討論及一對一討論時間探討寫作方法與方向"
        },
        {
            "type": "專題研究",
            "note": "以學生收集之資料分析並進行專題寫作"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "\tSelf-directed learning assignment I: Search 10 most relevant articles within recent five years and list them in APA style. Each article should have at least 5 sentences for summarizing its main ideas and relations with your own research. (10%)\n\n\tSelf-directed learning assignment II: Search 5 most relevant journals and understand the scope and aims for each journal. Provide justifications of why each journal is suitable for publishing your own article. Also, search 3 most relevant articles within each journal for the references section. (10%)"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "Class participation、one to one meeting (20%)"
        },
        {
            "type": "報告",
            "weight": 60,
            "note": "\tSubmit research questions and purposes (10%)\n\n\tSubmit the part of Research Method (10%)\n\n\tSubmit the part of Results and Discussion (10%)\n\n\tSubmit the part of Introduction and literature review(10%)\n\n\tFinal paper submission (including abstract, main text and references) (20%)"
        }
    ],
    "prerequisite": "",
    "general_core": []
}