{
    "year": 107,
    "term": 1,
    "name": "圖像學",
    "teachers": [
        "韓德森"
    ],
    "department": "TM67",
    "code": "AHM0020",
    "credit": 3,
    "serial": 3201,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 1
    },
    "schedule": [
        {
            "day": 4,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "上課地點：藝史所教室",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "In art history, 'iconography' can be said to be the identification of the subject matter or meaning of images. The term 'iconology' is sometimes used to refer specifically to the wider study of the significance of images in their cultural contexts. The two practices are inter-related, and for the purposes of this course, the term 'iconography' refers to any interpretation of the subject matter, meaning, or significance of images.\nThis course will investigate how iconography has been formulated and practiced by some of the leading figures in academic art history since the late nineteenth century. It will begin with an historical account of the Hamburg School of art history, and the scholarship of its pioneers, Aby Warburg and Erwin Panofsky. You will be shown how the identification of the subject matter of artworks, and appraisal of their cultural significance, through the study of textual and visual sources, became central concerns of art history.\nSubsequently, you will study the application of iconographic methodology to prehistoric, Classical, and early modern Christian images. We will then use this knowledge in a two-week groupwork project to identify the subjects of unidentified or minimally identified early modern prints. This will be followed by a series of weekly case studies comparing iconographic interpretations of individual artworks by various scholars. Through this process, you will identify when two or more interpretations of an artwork are independent of each other, complementary, or competing. In addition, you will assess the evidential basis of iconographic analyses, to determine which, among competing analyses, is the more persuasive.\nThe course will conclude with a comparison of iconography and semiotics, and a consideration of the limits of iconography in the study of contemporary art.",
    "goals": [
        "For students to acquire a knowledge of the historical origins of iconography in the field of art history",
        "For students to acquire skills in iconographic analysis",
        "For students to be able to discern when iconographic analyses of a work of art by various scholars are independent, complementary, or competing.",
        "For students to be able to verify, question, or reject evidence presented in support of iconographic interpretations in the literature.",
        "For students to be able to present their own iconographic analyses, orally and in writing, following common academic conventions of form and content.",
        "For students to recognize the areas in the study of art in which the application of iconographic analysis is conventional, and those in which it is less applicable."
    ],
    "syllabus": "1.    Introduction\n\na)    overview of the subject content, explanation of class procedures and scholarly methodology, and details of the assessment, including discussion and distribution of topics for student presentations and papers\n\nb)   Art History’s prehistory: a brief survey of approaches to the study of the visual arts before academic Art History, from ekphrasis, to art collecting and display, connoisseurship, and exhibition curating and art criticism\n\n2.    Aby Warburg, from Hamburg to London\n\na)    Warburg’s scholarship\n\nb)   His Library and Atlas\n\n3.    Erwin Panofsky, from Hamburg to Princeton\n\na)    Descriptions of iconography and iconology\n\nb)   Contribution to the development of Art History as an academic discipline\n\n4.    Prehistoric Art as a Test of Iconographic and Iconological Approaches\n\na)    The _Woman_ of Hohle Fels, 28,000–25,000 BC, Naturhistorisches Museum, Vienna\n\n5.    Identifying Greco-Roman Gods, Myths, and Human Subjects, in Classical Sculpture\n\n6.    Identifying Christian Subjects, in Princeton University’s ‘The Index of Medieval Art’\n\n7.    Group Project, Part 1: Locating Uncatalogued, Early Modern, Visual Culture Material Online\n\n8.    Group Project, Part 2: Iconographic Analysis\n\n9.    Group Project, Part 3: Group Presentations and Discussions  \n\n10.      Theories of Disguised Symbolism\n\na)    Erwin Panofsky’s interpretation of Jan van Eyck’s _Giovanni (?) Arnolfini and His Wife_, 1434, National Gallery, London\n\nb)   Meyer Schapiro’s interpretation of the Campinesque Mérode Altarpiece, mid-to-late 1420s, Metropolitan Museum of Art, New York\n\n11.      Pragmatic Interpretations of Early Netherlandish Painting\n\na)    Hugo van der Velden’s interpretation of Petrus Christus’ _A Goldsmith in His Shop_, 1449, Metropolitan Museum of Art, New York\n\nb)   Hugo van der Velden’s interpretation of Petrus Christus’ _Virgin of the Dry Tree_, 1460s, Museo Thyssen-Bornemisza, Madrid\n\n12.      Hieronymus Bosch: Alchemical and/or Christian Allegory\n\na)    Laurinda S. Dixon’s interpretation of Bosch’s _Garden of Earthly Delights_ triptych, c.1500, Museo del Prado, Madrid\n\nb)   Joseph Leo Koerner’s interpretation of _Garden of Earthly Delights_\n\n13.      Giorgione’s ‘Myth and Enigma’\n\na)    Salvatore Settis’ interpretation of Giorgione’s _La Tempesta_, c. 1505, Galleria dell’Academia, Venice\n\nb)   Ursula and Warren Kirkendale’s interpretation of _La Tempesta_\n\n14.      Titian’s Allegory\n\na)    Panofsky’s interpretation of Titian’s _Sacred and Profane Love_, c. 1515, Galleria Borghese, Rome\n\nb)   Rona Goffen’s interpretation of _Sacred and Profane Love_\n\n15.      Bellini, Dossi, and Titian, and the Interpretation of Conservation Evidence\n\na)    Edgar Wind’s interpretation of Bellini, Dossi, and Titian’s, _The Feast of the Gods_, 1514–1529, National Gallery of Art, Washington\n\nb)   Susan Nalezyty’s interpretation of _The Feast of the Gods_\n\n16.      Albrecht Dürer’s Laconic Melancholia\n\na)    Raymond Klibansky, Erwin Panofsky, and Fritz Saxl’s interpretation of Dürer’s _Melancholia I_, 1514, British Museum, London\n\nb)   Philip M. Sohm’s interpretation of _Melancholia I_\n\n17.      Homoeroticism in Caravaggio’s Paintings:\n\na)    According to David Posner\n\nb)   According to Leo Bersani and Ulysee Dutoit\n\nc)    According to Genevieve Warwick\n\n18.     Perspectives on Iconography and Iconology in the late Twentieth and Twenty-First Centuries",
    "methodologies": [
        {
            "type": "講述法",
            "note": "A one hour presentation each week, in 15 of the 18 weeks, by the Professor"
        },
        {
            "type": "討論法",
            "note": "A one-to-two hour discussion each week, in 15 of the 18 weeks, led by the Professor, based on set readings and the case studies listed in the weekly schedule of this syllabus"
        },
        {
            "type": "問題解決教學",
            "note": "A special project will be undertaken over three weeks, to identify the iconography of uncatalogued, early modern visual culture materials online"
        },
        {
            "type": "專題研究",
            "note": "Students will select a case study from the list in the syllabus schedule, or another example chosen in consultation with the professor, as the basis for their assessed oral presentation."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 60,
            "note": "A written paper, in essay form, between 10 and 14 pages long"
        },
        {
            "type": "課堂討論參與",
            "weight": 5,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 5,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "An oral presentation, with visual aids, of around 45 minutes"
        }
    ],
    "prerequisite": "",
    "general_core": []
}