{
    "year": 107,
    "term": 1,
    "name": "攝影史",
    "teachers": [
        "諾斯邦"
    ],
    "department": "TM67",
    "code": "AHM0031",
    "credit": 3,
    "serial": 3034,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 1
    },
    "schedule": [
        {
            "day": 3,
            "from": 7,
            "to": 9,
            "campus": "校外",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "Appeared with the industrialization and associated to its mechanical character, the photographic medium was not considered at its very beginnings as an art. Though photography took rapidly an important place in the creative process of traditional mediums such as painting or sculpture, it is only one hundred and fifty years after its invention – from the 1970s onward – that it has gained a cultural and institutional legitimacy. It makes no doubt that the apparition of photography in the field of images transformed the whole mode of visual perception, not to say that it affected the means of artistic production, and changed several criteria defining the notions of art and author. Walter Benjamin in his essay The Artwork in the Age of its Technological Reproducibility already perceived at the end of the 1930’s, thatthe loss of authenticity revealed by the substitution of the hand, the eye and the traditional tools of the drawer, the painter, the etcher or the sculptor for an optical and chemical machine (the camera), as well as the possibility of multiplying the work, modified the perception of the original artwork, and annihilated its aura. The changes made possible with the coming of the photographic medium can be understood through the collective perception dictated by it. The same conception was also mentioned by the great photographer Henri Cartier-Bresson in an interview he gave to a Brasilian newspaper in 1969, arguing that photography democratized the notion of art and artist: “From the photographic point of view everybody is potentially an artist.” The course will provide a comprehensive survey on the history of photography by focusing the most important issues related to its relationship to art and to its status as an art. As we will see the relations between the photographic medium and the traditional arts have been marked by rivalry, or contempt, but also by emulation and mutual respect.",
    "goals": [
        "To impart in-depth knowledge of the history of photography to students.",
        "To analyze and understand the historical development, theoretical issues and specific context.",
        "To cultivate student’s abilities to observe, understand, compare and interpret photographs.",
        "To shape student’s abilities to question and solve issues related to the photographic medium and its relationships to art.",
        "To encourage their critical thinking.",
        "To train students to collect, study, and analyze primary and secondary sources, to select and comment the literature related to photography."
    ],
    "syllabus": "**Schedule  \n**\\- Week 1: Introduction  \n\\- Weeks 2-3: The Invention of Photography: the Age of Light  \n\\- Weeks 4-5: Photography as the Image-Machine  \n\\- Weeks 6-7: Photography: the Artistic Tool  \n\\- Weeks 8: Snapshot Photography and the Democratization of the Medium  \n\\- Weeks 9-10: Marcel Duchamp and the Photography as a the Paradigm of Art  \n\\- Weeks 11-12: Photomontage: Photography and Cinema  \n\\- Weeks 13-14: Conceptual Art, Photography and the Indiciary Paradigm  \n\\- Weeks 15-17: New Truths: Digital Photography  \n\\- Week 18: Conclusion  \n  \n  \n**Teaching Methods  \n**For each lesson students are given a handout. It includes the essential bibliography mentioning monographs, academic studies, articles, documents, archives, and/or critics related to the topic. It provides the list of works (illustrations) analyzed during the lesson  \nEach session tends to tackle a specific issue. Its goal is to present, analyze, and discuss the most important theoretical and practical aspects related to the topic in question. The outlines and the main issues are introduced at the beginning of each lesson. A brief summary of the previous lesson introduces the new issues which will be discussed. If questions related to previous lessons are still pending, they are answered, and/or recontextualized.  \nThe topics are addressed through a close reading and detailed analysis of a single, or a group of works of art. The main issues related to a subject are examined through concrete examples. Different points of view are privileged in order to open new perspectives on well or-less known objects. I select various scientific texts, documents and sources and comment on them. Images, texts, and documents are used in order to present original and critical approaches.  \nStudents’ abilities to gather, investigate and analyze art history resources are trained through personal contributions, such as the essays they are asked to present orally during the semester, and complete in a 10-page length written paper by the end of the semester. The topics are carefully chosen in order to propose issues that are closely related to the main topic of the course. Their relevance depends also on their accessibility. When selecting the topics I always take into account the literature at disposition. The students are in this respect given a selected bibliography which helps them to access the topic with the most appropriate tools. Students are also asked to complete their research with other readings.",
    "methodologies": [
        {
            "type": "實地考察、參訪",
            "note": "Study visits are organized when possible and according to the course topic – depending on the cultural actuality (exhibitions, events etc.)"
        }
    ],
    "grading": [
        {
            "type": "出席",
            "weight": 20,
            "note": "During the course the skills of the students are tested through questions intended to tackle problems in direct relationship to the topic. They are trained in the observation of artworks. They are taught how to describe a work (from the more general to the more specific), to understand its structure, its content, and its meaning. They are asked to compare works (or documents) with similar or contradictory examples. They are taught to identify and to interpret the different meanings of a work. Their aesthetic sensitivity and their critical thinking are encouraged through an acute observation and analysis of the works, documents, and academic writings introduced throughout the course. If the content presented seems to be unclear to the students, it is clarified through questions and answers."
        },
        {
            "type": "報告",
            "weight": 80,
            "note": "Paper 50%: Students are asked to hand out a final paper respecting some formal, but essential points according to the common use in the academic field of art history (table of contents, quotations and correct referencing, presence of bibliography, illustrations etc.). Students are given a style sheet on which they can take example. The content should be well structured, written correctly, and thoroughly documented. Presentation 30%: Students’ abilities to formulate a specific issue on a specific topic related to the course attended are trained, and improved. They are asked to present and structure their argumentation coherently, to produce a critical research based on an acute observation of the works analyzed, and to find possible solutions in a 30 minute time-lapse. The discussions, comments, and critics formulated during and/or after their oral presentation are always thought in a constructive way. They are intended to encourage the students to improve their critical approach, to redirect their previous intentions."
        }
    ],
    "prerequisite": "",
    "general_core": []
}