{
    "year": 109,
    "term": 1,
    "name": "文學與文化老年學專題討論",
    "teachers": [
        "蘇榕"
    ],
    "department": "LM21",
    "code": "ENC1120",
    "credit": 3,
    "serial": 1674,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 3
    },
    "schedule": [
        {
            "day": 3,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "勤302"
        }
    ],
    "programs": [
        "高齡學程"
    ],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "Population ageing has been emerging as a global issue ever since the late twentieth century. Japan and other western developed countries foresaw its patent crisis earlier than the rest of the world because population ageing in these countries tends to appear as a slower, gradual process. Accordingly, governments or academia of these countries have more time to ruminate on problems caused by ageing before making policies. The unprecedentedly rapid speed of population ageing in Taiwan, compared with the above areas, strikes one as a rare case. The need to cope with its impacts is thus even more pressing. \n    This course aims to equip the students with the essential knowledge of ageing studies from the disciplines of literary and cultural studies. We will guide students through the new terrain of literary and cultural gerontology by a perusal of several critical scholarly works. Apart from studying the still-evolving, ever-changing critical discourses of literary and cultural gerontology, we will also incorporate a few literary and cinematic texts into our exploration of the subject. \n     It is hoped that through excavating several significant works of contemporary ageing studies from the perspectives of literary and cultural studies, this course can prepare the students for the coming of a super-aged society, which demands not only a wise, perceptive mind but also an emphatic, benevolent heart.",
    "goals": [
        "To explore and investigate how contemporary emerging ageing population may bring forth questions and problems never experienced or envisioned in the previous century and ponder on their critical significance",
        "To help students reflect on the emerging issues of ageing and quipped them with the sufficient knowledge of ageing and a keen mind to discern between ageist discourse and hospitality.",
        "To critique, interrogate, and redefine the conception of ageing in order to foster the students’ capability of confronting the coming of a super-aged society."
    ],
    "syllabus": "Population ageing has been emerging as a global issue ever since the late twentieth century. Japan and other western developed countries foresaw its patent crisis earlier than the rest of the world because population ageing in these countries tends to appear as a slower, gradual process. Accordingly, governments or academia of these countries have more time to ruminate on problems caused by ageing before making policies. The unprecedentedly rapid speed of population ageing in Taiwan, compared with the above areas, strikes one as a rare case. The need to cope with its impacts is thus even more pressing. This course aims to equip the students with the essential knowledge of ageing studies from the disciplines of literary and cultural studies. We will guide students through the new terrain of literary and cultural gerontology by a perusal of several critical scholarly works. Apart from studying the still-evolving, ever-changing critical discourses of literary and cultural gerontology, we will also incorporate a few literary and cinematic texts into our exploration of the subject. It is hoped that through excavating several significant works of contemporary ageing studies from the perspectives of literary and cultural studies, this course can prepare the students for the coming of a super-aged society, which demands not only a wise, perceptive mind but also an emphatic, benevolent heart.\n\n\\*This course will include a few sinophone films and reading materials in our investigation of ageing issues. Therefore, even though the course is taught in English, students who take this course are required to have good reading, speaking, and listening proficiency in Mandarin Chinese.\n\n**Textbooks & course organization:** \n\nA tentative syllabus based on the reference listed below will be provided in the first class meeting and may be slightly revised after discussion.\n\nDate\n\nWeek\n\nAssignments\n\n9/16\n\n1\n\nIntroduction\n\n9/23\n\n2\n\n_The Oxford Book of Aging: Reflections on the Journey of Life_\n\n9/30\n\n3\n\nA field trip to an elderly community\n\n10/7\n\n4\n\n_Cato Maior de Senectute_\n\n10/14\n\n5\n\n_Cato Maior de Senectute_\n\n《微霞與桑榆：陳亮恭醫師的世紀思索》\n\n10/21\n\n6\n\n_Disciplining Old Age: The Formation of Gerontological Knowledge_.\n\n10/28\n\n7\n\n_Disciplining Old Age: The Formation of Gerontological Knowledge_.\n\n11/4\n\n8\n\n_Foucault and Ageing_.\n\n11/11\n\n9\n\n_Foucault and Ageing_.\n\n11/18\n\n10\n\n_The History of Sexuality_. Vol. 1: An Introduction.\n\n11/25\n\n11\n\n_The History of Sexuality_. Vol. 1: An Introduction.\n\n12/2\n\n12\n\n“The Coming of Age of Literary Gerontology.”\n\n_Amour_\n\n12/9\n\n13\n\n“The Challenge of Cultural Gerontology.”\n\n_The Intern_\n\n12/16\n\n14\n\n_Roultedge Handbook of Cultural Gerontology_\n\n_Go Grandriders_\n\n12/23\n\n15\n\n_Roultedge Handbook of Cultural Gerontology_\n\nA field trip to an elderly community (pending)\n\n12/30\n\n16\n\nRecapitulation & case study\n\n1/6\n\n17\n\nFinal paper proposal presentation\n\n1/13\n\n18\n\nIndividual Conference\n\nFinal paper Due: 20 Jan, 2021\n\n**Teaching method:**\n\nThe course will be run as a seminar combined with lectures.\n\n**Grading Policy:** attendance, participation, oral presentations 50%\n\nFinal paper proposal 10%: (a one-two page proposal of your final paper)\n\nFinal paper 40%: (a well-organized scholarly paper; the ideal length of the paper will be 10-15 pp for MA students and 15-20pp for PhD students)\n\n### Course Etiquette and guidelines During COVID-19:\n\n### 1.    Please be respectful of social distancing to each other and others’ space.\n\n### 2.    Using hand sanitizer and reporting measurement of body temperature **before class** are compuls**o**ry.\n\n### 3.    Wear the mask whenever necessary.\n\n### 4.    Make sure all windows and door(s) of the classroom are open during the class.\n\n### 5.    You may be excused to ask a sick leave if you have symptoms of suspected Covid-19 infection or feel ill.\n\n### 6.    Long distance teaching may be implemented whenever necessary. This course will use Microsoft Teams as the platform of our online instruction. The webcam will not be turned on in class unless necessary.",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Lectures combined with discussion"
        },
        {
            "type": "討論法",
            "note": "In-class discussion of critical points"
        },
        {
            "type": "問題解決教學",
            "note": "It is hoped that students may learn how to find out adequate solutions to the condition of ageing after the entire semester’s brainstorming and rigorous study of theories related to ageing and literary and cultural texts dealing with the concept of ageing."
        },
        {
            "type": "實地考察、參訪",
            "note": "One field trip to an elderly community will be arranged."
        },
        {
            "type": "媒體融入教學",
            "note": "Multi-media teaching resources may be used."
        },
        {
            "type": "專題研究",
            "note": "Special topics targeting on the representations of ageing in literary and cultural products will be selected."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 10,
            "note": "One-page weekly response paper"
        },
        {
            "type": "課堂討論參與",
            "weight": 15,
            "note": "Active class participation is a must."
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Students who are absent without excuse for three times will automatically flunk the course."
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "Regular in-class oral presentation(s) (15-20 mins)"
        },
        {
            "type": "專題",
            "weight": 40,
            "note": "a well-organized scholarly paper; the ideal length of the paper will be 10-15 pp for MA students and 15-20pp for PhD students"
        },
        {
            "type": "其他",
            "weight": 5,
            "note": "a one-two page proposal of your final paper"
        }
    ],
    "prerequisite": "",
    "general_core": []
}