{
    "year": 109,
    "term": 1,
    "name": "全球的回憶，回憶的全球",
    "teachers": [
        "路愷宜"
    ],
    "department": "LM21",
    "code": "ENC1104",
    "credit": 3,
    "serial": 1673,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 1,
            "from": 3,
            "to": 5,
            "campus": "本部",
            "classroom": "雲201"
        }
    ],
    "programs": [],
    "comment": "上課教室在雲和街大樓二樓，地址為雲和街1號(位於雲和小火鍋斜對面、Cafe a la mode正對面)，從師大側門右轉看見Starbucks右轉進入巷子步行約2分鐘(130公尺)，右手邊就會看到雲和街大樓，亦可使用Google Maps APP查詢位置。請同學使用學生證感應，進出雲和街上課教室。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "This interdisciplinary course focuses on the global interconnectedness of memory and forms of memorialization in the 20th and 21st centuries and their reflection in the English-speaking world.\nIt discusses landmark historical moments and the varied forms of memorialization that historical events imply, together with their cultural and political consequences. The course also analyzes the affective implications of tragic events and catastrophes upon individuals or entire communities. \nFocusing on the Holocaust, the apartheid regime in South Africa, the Rwandan genocide, the NATO intervention in Kosovo, 9/11 and Hurricane Katrina, the course examines forms of global memory, activism and the ethical turn that contemporary texts present us with. \n       The course also traces critical positions/interventions and landmark genre transformations in the literary canon of the English-speaking world. By introducing students to various types of primary materials (literary texts, documentaries, films, historical documents, newspaper articles), the course familiarizes them with key concepts in history, memory and affect studies; at the same time, it undertakes a close reading of the literary and visual texts presented.\n     Cultural background of the texts (literary, visual) discussed will lead to an enhanced knowledge of the literary periods covered and the cultural landscape in the English-speaking world in general, thereby complementing (but not overlapping with) other literature-oriented and theory-oriented courses.",
    "goals": [
        "To offer students  in-depth knowledge of the historical events the course is centered on and their cultural background",
        "To offer students in-depth knowledge of the historical moments and forms of memorialization discussed, as well as their global ramifications",
        "To familiarize students with forms of memorialization and their affective implications (mourning and grief), as well as their implications at national, regional and global scale.",
        "To enable students to read critically representations of history and memory in a variety of texts, as well as analyze the representations in visual arts of the topics discussed.",
        "To familiarize students with concepts such as “lieux de memoire,” “collective memory,” “cultural memory,” “postmemory”  “affect,” “structures of feeling,” etc."
    ],
    "syllabus": "Instructor: Ioana Luca\n\nE-mail: ioanaluca.ntnu@yahoo.com    \n\nGlobal Memories, Memories of the Global\n\nDepartment of English, NTNU, Spring 2016\n\n**_Course description_**\n\n       This interdisciplinary course focuses on the global interconnectedness of memory and forms of memorialization in the 20th and 21st centuries and their reflection in the English**\\-**speaking world. It discusses landmark historical moments and the varied forms of memorialization that historical events imply, together with their cultural and political consequences. The course also analyzes the affective implications of tragic events and catastrophes upon individuals or entire communities. Focusing on the Holocaust, Hiroshima, the apartheid regime in South Africa, the NATO intervention in Kosovo, and 9/11, the course examines forms of global memory, activism and the ethical turn that contemporary texts present us with. The course also traces critical positions/interventions and landmark genre transformations in the literary canon of the English-speaking world. By introducing students to various types of primary materials (literary texts, autobiographies, graphic narratives, documentaries, films, historical documents), the course familiarizes them with key concepts in history, memory and affect studies; at the same time, it undertakes a close reading of the literary and visual texts presented. The cultural background of the texts (literary, visual) discussed will lead to an enhanced knowledge of the literary periods covered and the cultural landscape in the English-speaking world in general, thereby complementing (but not overlapping with) other literature-oriented and theory-oriented courses.\n\n**_Objectives_**\n\nThe main goals of the course are the following:\n\n1.      To offer students in-depth knowledge of the historical moments and forms of memorialization discussed, as well as their global ramifications;\n\n2.      To familiarize students with forms of memorialization and their affective implications (mourning and grief), as well as their implications at national, regional and global scale;\n\n3.      To familiarize students with concepts such as “lieux de memoire,” “collective memory,” “cultural memory,” “postmemory”  “affect,” “structures of feeling,” etc.\n\n**_Textbooks_**\n\nCourse pack\n\nHandouts & lecture notes on Moodle [http://moodle.ntnu.edu.tw/](http://moodle.ntnu.edu.tw/)\n\n**_Course requirements_**\n\nStudents are expected to be familiar with the required readings prior to class discussions. Students will be graded on the basis of (1) their active participation in class 20% (2) moodle activity 10%, (3) individual response papers/presentations 20%, (4) research paper at the end of the term 50%. Failure to attend classes and meet the above mentioned requirements will result in the student inability to pass the exam.  Late assignments are **NOT** accepted.\n\n**_Academic Dishonesty_**\n\nAcademic dishonesty is defined as but not limited to plagiarism, cheating, misrepresenting one’s work, and forging documentation. Academic dishonesty is a serious matter. Any student who plagiarizes or cheats will fail the course.\n\n**_Tentative schedule_** **(changes in the sequence of the topics below are likely to happen & the required readings will be available in the course pack)**\n\n**Week 1 Introduction**\n\n**Week 2**\n\n**Readings**\n\nDefinitions, terms and concepts: what is the global, the transnational?\n\nForms of memory and memorialization\n\n**Week 3-4 Writing the Holocaust**  \n\n**Readings**\n\nJames E Young, “On Reading Holocaust Diaries” (1988)\n\nAnne Frank, _The Diary of a Young Girl Anne Frank_ (1947) excerpts\n\nElie Wiesel, _Night_ (1960) excerpts\n\nMarianne Hirsch, _The Generation of Post-memory_ (excerpts)\n\nJames E. Young, “Memorials and Museums,” “Holocaust Memorials and Meanings”\n\n**Week 5-6** **Hiroshima**\n\n**Readings**\n\nJohn Hersey, _Hiroshima_ (1946) excerpts\n\nKatsuzo Oda “Human Ashes” (1969)\n\nKatsuzo Oda, “Crazy Iris”\n\nAstrid Erll, “Literature, Film and Mediality of Cultural Memory” (2010)\n\nRobert Rosentsone, “The Historical Film as Real History”\n\nPaul Ricoeur, “Memory-History-Forgetting”\n\n**Film clips**\n\n**Week 7-8** **The Vietnam War**\n\n**Readings**\n\nAleida Assman, “Canon and Archive”\n\nPaul Connerton, “How Societies Remember”\n\nTim O’Brien, “How to tell a War Story”\n\nMarita Sturken, _Tangled Memories_ (excerpts)\n\n**Film clips**\n\n**Week 9-10 South African Apartheid & TRC**\n\n**Readings**\n\nAntjie Krog, _Country of My Skull_ (excerpts) 1999.\n\nKay Schaffer & Sidonie Smith, “Truth, Reconciliation and the Traumatic Past of South Africa”\n\nDaniel Levy, and [Natan Sznaider](http://www.worldcat.org/search?q=au%3ASznaider%2C+Natan%2C&qt=hot_author \"以此作者深入搜尋\"), “Human Rights and the Clash of Memories”\n\n**Week 11-12 The Balkan Wars**\n\n**Readings**\n\nAleksandar Zograf, _Regards from Serbia_ (2007) (excerpts)\n\nJoe Sacco, _Safe Are Gorazde_ (2000) (excerpts)\n\nAleksandar Hemon, _The Lazarus Project_, 2008.\n\nDaniel Levy and Natan Sznaider, “The Post-Cold War Period: Globalization and the Cosmopolitan Turn,” “Kosovocaust”\n\n**Week 11-12 Traumatic Memories from the Caribbean**\n\nEdwidge Danticat, _Brother I am Dying_ (2008)\n\n_The Farming of Bones_ (1999)\n\nJunot Diaz, _The Brief Wondrous Life of Oscar Wao_ (2008)\n\n**Week 13-14- 9/11 Media and Memory**\n\n**Readings**\n\nAndreas Huyssen, “Present Pasts: Media, Politics, Amnesia”\n\nBarbie Zelizer, “Canibalizing Memory in the Global Flow of News”\n\nIan McEwan, _Saturday_ (2005) excerpts\n\nDon Delilo, _Falling Man_\n\nAnna Reading, “On Media Memory”\n\nMarita Sturken, _Tourists of History: Memory, Kitsch, and Consumerism from Oklahoma City to Ground Zero_ (2007) excerpts\n\n**Film clips**\n\n**Week 15 Tiananmen**\n\n**Week 16 Environmental Disasters: Katrina and Fukushima. Media Hype and the Ethics of Mourning**\n\n**Week 17** Wrap up\n\n**Week 18** Students’ mini conference papers",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": "Team work, class and after class group assignments  students cooperation in class and home assignments, in written  and oral responses to class activities  Student teacher interactive cooperation,"
        },
        {
            "type": "實地考察、參訪",
            "note": "Students’ visit of possible exhibitions in Taipei related to the topic when these available, students and teacher attending academic talks related to the course at NTNU/ NTU/Academia Sinica"
        },
        {
            "type": "媒體融入教學",
            "note": "Moodle activity, documentary & feature film clips showed and discussed in class. Teacher’s power point presentations, students’ interactive presentations"
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 10,
            "note": "moodle activity"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "class participation"
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "short individual response papers 15% individual presentation 15%"
        },
        {
            "type": "專題",
            "weight": 40,
            "note": "individual research paper project"
        },
        {
            "type": "其他",
            "weight": 10,
            "note": "quizz"
        }
    ],
    "prerequisite": "",
    "general_core": []
}