{
    "year": 110,
    "term": 2,
    "name": "科技與工程師資教育專題研究",
    "teachers": [
        "林坤誼"
    ],
    "department": "HD71",
    "code": "ITD0043",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 1057,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 5
    },
    "schedule": [
        {
            "day": 4,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "科技系TA513"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course focused on exploring the theory and practices, trends and issues of teacher education in technology and engineering education for the purpose of developing technology and engineering teacher educators’ professional competency. The following teaching methods and learning activities will be employed in this course: lecture, discussion, presentation et al.",
    "goals": [
        "To explore the trends and issues of technology and engineering preservice teacher education, educational internship, teacher certification and professional development.",
        "Learn to conduct a small study of technology and engineering teacher education."
    ],
    "syllabus": "week 1\n\nl   Introduction to the curriculum outline, the method of comments and the national teacher education system.\n\nl   The importance of technology and engineering education and its benefits of employment for the future.\n\nl   Professional ethics of technology and engineering education scholars.\n\nl   White paper on teacher education.\n\nl   Teacher Training Center.\n\nl   How to apply for the project from Ministry of Education.（http://edu.law.moe.gov.tw/LawContent.aspx?id=GL000952）\n\nl   To read and comment the literature and hand in the assignment within two pages.\n\nweek 2\n\nl   Teacher training model.\n\nl   Research of pre-service teacher course in technology and engineering education field in Curriculum Guidelines of 12-Year Basic Education Curriculum Guidelines.\n\nl   The strategy of teacher training in Junior high school.\n\nl   The strategy of teacher training in senior high school.\n\nl   To read and comment the literature and hand in the assignment within two pages.\n\nweek 3\n\nl   The topic of teacher education: Important topics in SSCI\\_TATE Journals.\n\nl   Contribution the teacher education research in technology and engineering education field: Set the theme.\n\nl   To read and comment the literature and hand in the assignment within two pages.\n\nweek 4\n\nl   The topic of teacher education: Important topics in SSCI\\_JTE Journals.\n\nl   Contribution the teacher education research in technology and engineering education field: Introduction.\n\nl   To read and comment the literature and hand in the assignment within two pages.\n\nweek 5\n\nl   The topic of teacher education: Important topics in SSCI\\_APJTE Journals.\n\nl   Contribution the teacher education research in technology and engineering education field: Content I.\n\nl   To read and comment the literature and hand in the assignment within two pages.\n\nweek 6\n\nl   The topic of teacher education: Important topics in SSCI\\_EJTE Journals.\n\nl   Contribution the teacher education research in technology and engineering education field: Content II.\n\nl   To read and comment the literature and hand in the assignment within two pages.\n\nweek 7\n\nl   The topic of teacher education: Important topics in SSCI\\_IJSME Journals.\n\nl   Contribution the teacher education research in technology and engineering education field: Content II.\n\nl   To read and comment the literature and hand in the assignment within two pages.\n\nweek 8\n\nl   Draft journal paper presentation (20 minutes report, and 30 minutes Q & A).\n\nl   Explain the process of proposing the research project of the Ministry of Science and Technology.\n\nl   Explain the format of research project of the Ministry of Science and Technology.\n\nl   Explain the tips of research project of the Ministry of Science and Technology.\n\nweek 9\n\nl   The professional development of teachers: STEM education.\n\nl   To read and comment the literature and hand in the assignment within two pages.\n\nl   Propose the research project of the Ministry of Science and Technology: Topic selection.\n\nweek 10\n\nl   The professional development of teachers: Engineering Design Process, Design Thinking.\n\nl   To read and comment the literature and hand in the assignment within two pages.\n\nl   Propose the research project of the Ministry of Science and Technology: Background and purpose.\n\nweek 11\n\nl   The professional development of teachers: Professional development standards in ITEEA.\n\nl   To read and comment the literature and hand in the assignment within two pages.\n\nl   Propose the research project of the Ministry of Science and Technology: The importance and current status of the plan.\n\nweek 12\n\nl   Examination of teacher selection and qualification: How to do and plan?\n\nl   To read and comment the literature and hand in the assignment within two pages.\n\nl   Propose the research project of the Ministry of Science and Technology: Literature and review.\n\nweek 13\n\nl   Technology and engineering pre-service teacher internships and mentoring.\n\nl   To read and comment the literature and hand in the assignment within two pages.\n\nl   Propose the research project of the Ministry of Science and Technology: Research method, subjects and instrument.\n\nweek 14\n\nl   Technology and engineering teacher assessment. (Including primary, secondary school teacher and university teacher)\n\nl   To read and comment the literature and hand in the assignment within two pages.\n\nl   Propose the research project of the Ministry of Science and Technology: Data analysis, the progress of research, may encounter difficulties and solutions.\n\nl   The future of technology and engineer education.\n\nl   To read and comment the literature and hand in the assignments within two pages.\n\nl   Propose the research project of the Ministry of Science and Technology: Data analysis, the progress of research, may encounter difficulties and solutions.week week 15-16\n\nl   Final research proposal/research paper presentation (30 minutes report, and 20 minutes Q & A).\n\n@ Self-learning activity I: Positioned paper related to technology teacher education (words count: 5,000-10,000 words in English)\n\n@ Self-learning activity II: Positioned paper related to technology teacher education (words count: 5,000-10,000 words in English)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "To explain the important concepts of each topic."
        },
        {
            "type": "討論法",
            "note": "Students must read the data, then have to publish their comment and discuss with teacher and classmates."
        },
        {
            "type": "問題解決教學",
            "note": "Students must conduct small studies and try to solve problems."
        },
        {
            "type": "合作學習",
            "note": "Students conduct a small research project through the team-based cooperative learning approach."
        },
        {
            "type": "媒體融入教學",
            "note": "To use network multimedia resources to improve students' learning outcome."
        },
        {
            "type": "專題研究",
            "note": "To improve students' understanding of the actual situation through knowledge sharing and case discussions."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "Students must read the data, then try to guild and discuss with teacher and classmates."
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "To discuss the topics of each week."
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "To assess students’ attendance and attitudes toward learning."
        },
        {
            "type": "報告",
            "weight": 50,
            "note": "(1) Journal paper (25%) Each student must write an article about technology and engineering teacher education. Then have to publish in international journals or seminars with censorship system before mid-term exam week.\n(2) Research Project (25%) Each student writes a research project of the Ministry of Science and Technology about technology and engineering teacher education. The project must be published during final exam week."
        }
    ],
    "prerequisite": "",
    "general_core": []
}