{
    "year": 108,
    "term": 1,
    "name": "義大利文藝復興初期藝術",
    "teachers": [
        "哈德森"
    ],
    "department": "TM67",
    "code": "AHM0179",
    "credit": 3,
    "serial": 3119,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 2,
            "to": 4,
            "campus": "校外",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "上課地點:校區外，台北市青田街5巷6號4樓藝史所教室。",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course provides a survey of sculpture, painting, drawing, manuscript illumination, and allied arts of the early Renaissance period in Italy, dating approximately between 1400 and 1500. Initially, we will study the rapidly changing visual arts in Florence in the first decades of the fifteenth century, with the decline of the International Gothic style, the revival of Classical forms, and the development of single-point perspective. Remarkable artists, such as Brunelleschi, Ghiberti, Donatello, Masaccio, Masolino, Uccello, Fra Angelico, Domenico Veneziano, Castagno, and Filippo Lippi, made Florence the leading centre of early Renaissance art in Italy.\n\n\n\nThese artists' lives and works will be contextualized through the study of excerpts from contemporary sources of humanistic art theory, such as Ghiberti’s I commentari(Commentaries), Leon Battista Alberti’s De pictura(On Painting) and Antonio Manetti’s Vita di Filippo Brunelleschi(Life of Filippo Brunelleschi). Historical information about the patronage and reception of artworks will contribute to understanding their significance, not just for the elite men that usually commissioned them, but also for the women, children, lower classes, and others whose autonomy within society was much more restricted.\n\n\n\nWe will explore the visual arts across the north Italian courts, republican city states, and dominion towns of Prato, San Sepolcro, Arezzo, Urbino, Venice, Padua, Verona, Mantua, and Rome. We will consider how their various forms of government influenced the arts differently. Ultimately, we will address the mobility of Italian artists working as far west as the Kingdom of Castille and as far east as the Ottoman Empire.\n\n\n\nA range of stylistic, technical, iconographic, and documentary evidence will be used to examine the roles played by art as representations of religious beliefs, statecraft, political propaganda, family identity, gender relations, and sexuality. These roles will be discussed in terms of varied contexts of artworks—in artists' workshops, in churches, convents, government buildings, private palazzi, villas, and public spaces.\n\n\n\nThree key themes of this course are: 1) the importance for the arts of Humanistic learning, modelled in part on Classical sources; 2) the renewed interest in the natural world arising out of the study of Classical sources and empirical observation; and 3) increased civic development and its profound effects on society and culture.",
    "goals": [
        "Abilities in analysis of works of art and architecture and in gathering and exploring resources relative to art historical research.",
        "Abilities in formulating and investigating special topics in art history.",
        "Basic abilities to identify and analyse art works.",
        "Abilities in practical application of art history knowledge.",
        "Aesthetic sensitivity and concern for humanities",
        "Independent judgment and critical thinking",
        "Comprehension of cultural heritage conservation and preservation",
        "Global vision in cross-culture issues and international-exchange affairs and respect for the diversity and difference between arts and cultures"
    ],
    "syllabus": "1.     Introduction\n\nIn the first session, you will be given an explanation of the syllabus and the assessment for the course. This will be followed by a presentation providing a brief history of late medieval Florence, focussing on its government, society, economy, and culture. Special attention will be given to the city's most important architectural and artistic project of the time, the rebuilding of its Cathedral, the Basilica di Santa Maria del Fiore. This project continued from the end of the thirteenth century to the end of the fifteenth, and is emblematic of the close relationship between the city's government, professional guilds, and the Catholic Church, which provided the administration, and ideological underpinning, for a great deal of the city's art production. Finally, we will study a list of course-specific terminology.\n\n2.     The artist's profession\n\nIn this session, we will examine the professional lives of Florentine early Renaissance artists, from their training under a master, joining of a guild, membership of a confraternity, setting up of a workshop, use of modelbooks, and the materials and techniques they employed in their artworks. We will also consider the differences between contracted works and speculative production for the open market, and the division of labor between the master and their assistants. We will then investigate artists' advisory roles, such as assessing the value of others artists' works to resolve disputes, and occasional political and diplomatic service.\n\n3.     Gothic Tradition and Classical Revival in Early Renaissance Sculpture\n\nThe 1401 competition between Lorenzo Ghiberti and Filippo Brunelleschi for the commission for the second set of bronze doors for Florence's Battistero di San Giovanni (Baptistery) provides a point of departure for this survey of early Renaissance sculpture in Florence. We will read excerpts from Ghiberti’s _I commentari_ (_Commentaries_) and Antonio Manetti’s _Vita di Filippo Brunelleschi_ (_Life of Filippo Brunelleschi_) to investigate these sculptors' knowledge of Classical models, and how such influences were integrated with the prevailing International Gothic style. Then, we will examine the emergence of the young Donatello out of Ghiberti's workshop, and his independent work for the Cathedral and Orsanmichele, alongside Brunelleschi, Ghiberti, and Nanni di Banco, later to be joined by Verrocchio.\n\n4.     Altarpieces and Mural Paintings in Florentine Churches\n\nChurches were among the most common places for artistic patronage throughout the Italian Renaissance. In this session, we will examine how artists responded to the requirements of ecclesiastic authorities, the aspirations of religious and private patrons, communal traditions, contemporary politics, and their own ambitions, to realise increasingly veristic and iconographically sophisticated images, in altarpieces and mural paintings for churches.\n\n5.     Development of Single-Point Perspective\n\nOur study of the development of single-point perspective technique will be based on the evidence of drawings, the _sinopie_ of mural paintings, the underdrawing and incisions in panel paintings, and fifteenth-century written sources, notably Leon Battista Alberti's _De pictura_, Manetti’s _Vita di Filippo Brunelleschi_, and inventories of the Medici family possessions. We will investigate examples of single-point perspective by Brunelleschi (based on written sources), Masaccio, and Uccello, working in a range of contexts in the first half of the fifteenth century, to understand its conventional nature and range of possible applications.\n\n6.     Mural Paintings in Florentine Convents\n\nMendicant religious orders in Florence, notably the Dominicans, Franciscans, Carmelites, and Servites, were prolific and learned patrons of art. Art was used in the religious observances of the brothers and sisters, and as a means to communicate their missions to the public. Some orders included artists producing artworks for their needs (such as Fra Angelico and Filippo Lippi). Convents also often hosted confraternities (mostly lay, religious associations) that commissioned artworks for their own worship and commemorations, as well as for the honour of the host order, and these confraternities also often numbered artists among their members. \n\n7.     Mural paintings for the Florentine Commune\n\nThe Palazzo Vecchio was the seat of the Florentine government in the fifteenth century. Its decoration promoted the religious and secular values of the Republic through the representation of patron saints, Classical heroes, communal symbols, and Florentine history. The iconography was informed by the Humanist writings of the fifteenth-century Florentine Chancellors: Coluccio Salutati, Leonardo Bruni, Carlo Marsuppini, Poggio Bracciolini, Benedetto Accolti, Bartolomeo Scala, and Niccolò Machiavelli.\n\n8.     Art for Florentine _Palazzi_ I: the representation of honour and devotion at home\n\nFlorence's leading families, among them the Medici, Strozzi, Rucellai, Pitti, and Pazzi, built grand palazzi in the fifteenth century, and filled them with religious and secular artworks, as is known from inventories and surviving works. While intended primarily for the use and enjoyment of the patron's family, domestic artworks would have been seen by their relatives, friends, business associates, and honoured guests, especially when located on a facade, in a courtyard, reception room, and occasionally also in a garden. We shall focus our discussion on Donatello's _David with the Head of Goliath_from the Medici palazzo, and ask how its erotic representation of the male body could be consistent with the promotion of virtue and honour found in the iconography of so many domestic artworks. \n\n9.     Art for Florentine _Palazzi_ II: The Representation of Women and Women’s Roles in a Patriarchal Society\n\nWomen's agency in Italian early Renaissance public life was greatly circumscribed by patriarchal religious beliefs, laws, and customs. Nevertheless, women routinely contributed significantly to aspects of domestic life, particularly as wives, mothers, and widows. Even if artworks in the home were usually commissioned or purchased by men, their iconography frequently reflected the important roles women played in the family.\n\n10.  Art for Villas in the Florentine Contado \n\nFor elite Florentine families, a villa in the _contado_ (countryside) provided a retreat from urban life—a place where artworks, alongside nature, provided an ambience for diversion, relaxation, healthy living, and self-improvement. The cultural aspirations of Florentines for their villas is reflected in Alberti's short treatise of c. 1438, called Villa. \n\n11.  Inspired in part by Classical literature such as Plutarch's _Parallel Lives_, a popular subject for paintings across northern Italy in the early Renaissance was a series of celebrated women and men. Figures from the Bible, Classical literature, or recent history represented exemplars of moral virtue. Such series could be found in a government building, a cardinal or merchant's _palazzo_, a villa, or an illuminated manuscript.\n\n12.  Prato\n\nLocated just over 20 kilometres north-west of Florence, and under its authority from the mid-fourteenth century, the town of Prato has a distinctive history as a centre for textile production, and with the wealth from the industry its citizens commissioned artworks from the leading Florentine artists of the late Middle Ages and early Renaissance. In particular, they provided what is now the Cattedrale di Santo Stefano with mural painting cycles, bronze screens, a candelabrum, and a marble pulpit from which to show the city's venerated relic of the Virgin's girdle.\n\n13.  San Sepolcro, Arezzo, and Urbino\n\nSan Sepolcro was from the fifteenth century another town over which Florence had authority. Piero della Francesca was born there, and after working as a young man in Florence, he returned to produce mural and panel paintings in the city and in neighbouring territories, as well as writing and illustrating treatises on mathematics, geometry, and perspective.\n\n14.  Venice\n\nIn the early fifteenth century, Venetian authorities sometimes turned to Florentine artists for major artistic commissions. However, over the second half of the century, the Venetian school of painting rose to become one of the leading schools in Italy, through the work of artists such as Alvise, Antonio, and Bartolomeo Vivarini, Giovanni d'Alemagna. and Jacopo, Gentile, and Giovanni Bellini.\n\n15.  Padua, Verona, and Mantua \n\nDonatello worked in Padua on commissions for the Basilica di Sant'Antonio and the Equestrian Monument for Erasmo da Narni. As well as local sculptors, his work profoundly influenced the Paduan school of painting, which emerged from the workshop of Francesco Squarcione, master of Mantegna and Marco Zoppo, among others. Mantegna earned a reputation for altarpieces, mural paintings and smaller works displaying his profound knowledge of Classical art and literature, elegant compositions, refined execution, and for Keith Christiansen, a moral power unequalled by any other early Renaissance artist. Mantegna became the court artist in Mantua, and in the Palazzo Ducale he painted the ducal family in mural paintings of unparalleled spleandour, charm, and wit.\n\n16.  Rome\n\nIn Rome, popes, cardinals, and patrician families commissioned artworks from leading Italian artists, notably artists from Florence. These commissions celebrated the city's Classical past and its temporal and sacred authority, while embracing recent developments in the arts.\n\n17.  Individual Consultations\n\nThe second last session of the course is set aside for individual consultations with the professor to discuss research, writing, and presentation of the assignment. Make an appointment by email.\n\n18.  Itinerant Artists\n\nBy the early Renaissance, much of Europe was connected by networks of trade, pilgrimage, and travel routes, over land and water. Italian artists journeyed far and wide to undertake commissions—as far as the Kingdom of Castille in the west, and the Ottoman Empire in the east. Meanwhile, northern European artists occasionally travelled south of the alps, where they were influenced by the work of their Italian peers, and where their own works were, in turn, highly prized by Italian collectors and imitated by Italian artists.",
    "methodologies": [
        {
            "type": "講述法",
            "note": "The professor will deliver a one hour presentation in 17 of the 18 weeks of the course."
        },
        {
            "type": "討論法",
            "note": "Classes will include a one or two hour discussion each week, in 17 of the 18 sessions, led by the professor, based on key readings from the bibliography, and the case studies and topics listed in the weekly schedule of the syllabus, as well as the students’ class Presentations."
        },
        {
            "type": "合作學習",
            "note": "In the final session there is a groupwork quiz on the course contents."
        },
        {
            "type": "實地考察、參訪",
            "note": "Students who elect to participate in the separate overseas study trip in this semester will study early Renaissance art in Venice, Padua, and elsewhere in Italy, in relation to this course."
        },
        {
            "type": "媒體融入教學",
            "note": "Students will be provided with weekly Powerpoint Presentations, and will view documentary videos on aspects of the course subject matter."
        },
        {
            "type": "專題研究",
            "note": "Each of the weekly topics contains a number of case studies that will be presented by the professor in the Powerpoint Presentations, accompanied by selected readings from the literature on these case studies."
        },
        {
            "type": "其他",
            "note": "In the second last week, students are invited to make an appointment with the professor for an individual consultation about their assignments."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 60,
            "note": "Written research paper"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "This mark is based on attendance, punctuality, and the quality of contributions to class discussion and activities, especially as demonstrating engagement with the key texts."
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "Research paper presentation"
        }
    ],
    "prerequisite": "",
    "general_core": []
}