{
    "year": 108,
    "term": 1,
    "name": "文化資產保存與文化政策",
    "teachers": [
        "哈德森"
    ],
    "department": "TM67",
    "code": "AHM0206",
    "credit": 3,
    "serial": 3120,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 2,
            "to": 4,
            "campus": "校外",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "上課地點:校區外，台北市青田街5巷6號4樓藝史所教室。",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "Cultural Heritage Preservation and Policy (On the Conservation of Art and Architecture)\n\nThis course provides an introduction to histories of, current practices in, and theories of the conservation of art and architecture. It begins with an investigation of painter-restorers from the Renaissance to the nineteenth century, before focussing on the modern development of the profession from the mid-twentieth century, with the shift in emphasis from restoration to conservation in the naming of the field.\n\n \n\nWe will study landmarks in the modern history of conservation, such as the Van Meegeren forgery scandal after World War II, which gave conservation science worldwide media coverage and greater legal standing. The cleaning of the Ghent Altarpiece, completed in 1950, was one of the first times a major work of art was studied and conserved by a team of specialist historians and conservators, with documentation provided in a scholarly volume. The establishment of the Institut Royal du Patrimoine Artistique in 1957 maintained this approach in its pioneering series of publications combining historical research and technical analysis. A tragic disaster demonstrating the urgent need for international cooperation in conservation was the flooding of the Arno River in Florence in 1966, which required significant efforts to mitigate damage to countless artworks of global cultural significance.\n\n\n \n\nWe will also examine practical aspects of conservation, to understand how specialised analyses of the materials, technique, and condition of artworks—such as infrared and ultraviolet light imaging, x-radiography, raman spectroscopy, and microsample analysis—inform decisions made in treatments. We are fortunate to be allowed to visit the Research Center for Conservation of Cultural Relics at National Taiwan Normal University, for a demonstration of some of these techniques.\n\n \n\nFurther, we will consider a range of theoretical and ethical issues, such as decisions about destructive and non-destructive testing. Various philosophical approaches to the integration of losses, such as inpainting, will be considered, as well as the principle of anastylosis (or 'anastelosis') in the restoration of ancient monuments. A key ethical principle in conservation is reversability of treatments, and we will look at how this is followed in practice. We will then trace the development of charters on cultural heritage advocating conservation principles internationally, including distinctions made between preventive conservation, remedial conservation, and restoration.",
    "goals": [
        "建立文化資產的新觀念",
        "認識文化現象與文化政策新發展",
        "學習理論性的思辯能力"
    ],
    "syllabus": "1.  Introduction\n\nIn the first session, you will be given an explanation of the syllabus and assessment for the course. This will be followed with a presentation by the professor on his experience of conservation science in researching Italian and Netherlandish Renaissance art. Finally, we will study a list of course-specific terminology. \n\n2.  Painter-Restorers from the Renaissance to the Nineteenth Century\n\nConservation of some kind has probably existed as long as there have been artworks. However, this course will begin with the Renaissance, when public museums emerged for the first time, and with them the desire to display artworks optimally. Prior to the training of specialist art conservators in the twentieth century, an artist was usually called on when the appearance of an artwork was considered unsatisfactory. This might be because it was dirty, physically degraded, or simply looked old fashioned. In this session we will consider how clear a distinction can be made in the Renaissance between restoring the original appearance of an artwork, elaborating it, censoring it, or updating it.\n\n3.  Nineteenth-Century Debates About the Preservation of Architectural Monuments\n\nIn the second half of the nineteenth century, debates grew in France and Great Britain about the preservation and restoration of architectural heritage, particularly Medieval Gothic monuments. We will discuss the extent to which the arguments presented by leading advocates, such as William Morris, John Ruskin, and Eugène Viollet-le-Duc privileged aesthetics or history, and pragmatism or idealism. We will look at some case studies of Viollet-le-Duc's practice in detail.\n\n4.  Cesare Brandi, the Istituto Centrale del Restauro, and Conservation Ethics\n\nFounded in 1939, the Istituto Centrale del Restauro in Rome was a pioneering centre of modern conservation. Cesare Brandi was its first director, and his Theory of Restoration, published in Italian in 1963, was one of the first sustained discussions of modern conservation ethics. While sometimes obscure, and occasionally even contradictory, it nevertheless formulated some key ethical propositions: that all artworks must be regarded as equally worthy of treatment, that artworks should be treated with regard for their individual circumstances and context, that an artwork's patina (appearance of age) must not be removed or disguised for purely aesthetic reasons, that a treatment must not impede any future treatment (must be reversible), that additions must be identifiable, and that creative restoration must be avoided. We will study how these and other conservation principles are applied—or not—in current practice.\n\n5.  Han van Meegeren and the Scientific Detection of Forgeries\n\nPerhaps the most celebrated art forger of all time is the Dutch painter Han van Meegeren. He produced forgeries in the manner of Frans Hals, Pieter de Hoogh, and Jan Vermeer, with some eventually bought by high profile collectors, such as the Nazi Reichsmarschall Hermann Göring. At the end of World War II, Van Meegeren faced charges of collaboration from Dutch prosecutors. To avoid this, he admitted to forging the works. In his subsequent trial for fraud, experts were called upon to confirm that the paintings were forged. Among them was Paul Coremans, a Belgian conservation scientist, administrator, and professor. His investigations in the case were published in a book that set a new standard for presenting technical studies of art to a general audience. We will consider the openness of Coremans' investigation, the conclusiveness of his analyses, and the validity of his conclusions at the time and in retrospect.\n\n6.  Cleaning Controversies at the National Gallery London, and Later in the Brancacci Chapel, Florence, and the Sistine Chapel, Rome\n\nOne of the most debated aspects of art conservation in the twentieth century was the cleaning of paintings. For some, the changing appearance of an artwork over time was an integral part of its historical and cultural significance. For others, cleaning brought an artwork closer to how the artist intended it to be seen when it was made. Some worried that lack of precision in analytical techniques meant that cleaning could not be guaranteed not to damage original parts of an artwork, however well intended and carefully conducted. We will consider how these and other views were argued, on the basis of technical evidence and cultural history, focussing on how conservators participated in these debates.\n\n7.  The Conservation of the Ghent Altarpiece by the Archives Centrales Iconographiques d’Art National et Laboratoire Central des Musées de Belgique\n\nAt the end of World War II, the Ghent Altarpiece was found at the Aultaussee salt mine in Austria, where it had been hidden by the Nazis. On its return to Belgium, its condition was assessed as requiring treatment. The Archives Centrales Iconographiques d’Art National et Laboratoire Central des Musées de Belgique, in Brussels, undertook an extensive campaign of historical research, scientific analysis, and cleaning. This were documented in a detailed publication in 1953, including interpretations of technical observations that had a bearing on longstanding art historical questions. We will look at some of the discussions that ensued, in which technical evidence about the Altarpiece played a central part.\n\n8.  The Use of Conservation Evidence in Attributions at the Institut Royal du Patrimoine Artistique\n\nThe Archives Centrales Iconographiques d’Art National et Laboratoire Central des Musées de Belgique were transformed into the Institut Royal du Patrimoine Artistique in 1957. At this time, its staff were examining, cleaning, and restoring the _Virgin and Child with a Book_from the National Gallery of Victoria, Melbourne. This small painting had been all but universally attributed to Jan van Eyck for over a century. Nevertheless, senior members of the Institut's staff believed the work was a nineteenth-century forgery. A similar conclusion was reached by them after analysing the _Saint Jerome in His Study_from the Detroit Institute of Arts, just a few years later. However, their conclusions are now not generally accepted. In this session, we will consider the influences of institutional objectives and management structures in the interpretation of conservation evidence for attributing artworks.\n\n9.  Examination Techniques: Infrared, Ultraviolet, and X-radiography Imaging, and Other Methods\n\nWe will visit the Center for Conservation of Cultural Relics at National Taiwan Normal University to see how conservation examinations and treatments are caried out. We will be given demonstrations of analytical equipment providing data invisible to the naked eye, including infrared, ultraviolet, and x-radiography imaging. You will be shown how to interpret this data to understand aspects of the materials, technique, and condition of artworks, bearing in mind the limitations of each analytical technique. We will also discuss ethical choices in examinations, between invasive and noninvasive, and destructive and nondestructive testing.\n\n10.          Paper and Parchment: Medieval Manuscripts\n\nLibby Melzer, Senior Paper Conservator at Centre for Cultural Materials Conservation at The University of Melbourne will join the class by Skype to discuss the kinds of degradation that works on paper and parchment are prone to, and a selection of her most challenging assessments and treatments.\n\n11.          Painting: The Leonardesque Salvator Mundi\n\nThere has been no more prominent, intriguing, and controversial issue in art conservation since 2006 than Dianne Dwyer Modestini's cleaning and restoration of the Leonardesque _Salvator Mundi_. In the ensuing arguments for the painting's attribution, whether to Leonardo da Vinci, to Leonardo and an assistant, or solely to an assistant, conservation evidence and practice have been central considerations.\n\n12.          Ceramics and Glass: The Portland Vase\n\nThe Portland Vase in the British Museum, London, is a superb example of Classical Roman cameo glass. Its history of breakages, dating from antiquity to the nineteenth century, and the series of restorations it has received, make it a fascinating and informative case study in the conservation of glass. Among other issues raised by this case is that of the lifespans of conservation treatments. We will also study examples of conservation treatments of ceramics.\n\n13.          Sculpture: Tullio Lombardo's Adam\n\nIn 2002, the plinth supporting Tullio Lombardo's _Adam_at the Metropolitan Museum of Art collapsed. The sculpture fell, and smashed into hundreds of fragments. A complete restoration of the sculpture was undertaken, with scarcely any signs of damage now visible. This case illustrates the importance of preventative conservation, and poses questions about the circumstances in which 'invisible' restoration is most appropriate.\n\n14.          Ancient Monuments: The Acropolis\n\nSince 1975, a key phase in the long-running conservation works at the Acropolis in Athens developed from the initial rescuing of degraded masonry and sculpture to the reconstruction of buildings, incorporating as much of the surviving original materials as possible, as well as the cleaning of carvings. We will discuss the concept of anastylosis (alternatively spelled anastelosis), its origins, and use in the restoration of the Parthenon, and other ancient monuments.\n\n15.          Modern Architecture: Brutalism\n\nBrutalist architecture emerged in the mid-twentieth century, distinguished by its extensive use of bare concrete, geometric forms, and minimal ornament. Though often economical and relatively quick to build, its typically machine-like, uncompromising aesthetic divided critics and the public. We will ask whether all architectural movements are worthy of preservation, and how Brutalist buildings can be made fit for today's uses without compromising their original designs.\n\n16.          Charters, Legislation, and Agreements\n\nIn this session we will study the development of international heritage conservation charters, over the course of the twentieth and twenty-first centuries, with a view to understanding changing approaches over time. Further, we will consider Taiwan's heritage conservation legislation and agreements, and their implications.\n\n17.          Individual Consultations\n\nThe second last session of the course is set aside for individual consultations with the professor to discuss research, writing, and presentation of the assignment. Make an appointment by email.\n\n18.          Conservation in the Courtroom\n\nDr Wu Chieh-Hsiang, Associate Professor in the Department of Art at National Changhua University of Education, and Ms Joyce Ke, Executive Director, Taiwan Art Gallery Association, Taipei Art Economy Research Centre, will give a presentation and then lead a discussion on the use of conservation evidence for the authentication of artworks in a legal context in Taiwan and internationally",
    "methodologies": [
        {
            "type": "講述法",
            "note": "The professor will deliver a one hour presentation in 17 of the 18 weeks of the course."
        },
        {
            "type": "討論法",
            "note": "Classes will include a one or two hour discussion each week, in 17 of the 18 sessions, led by the professor, based on key readings from the bibliography, as well as the student class Presentations."
        },
        {
            "type": "問題解決教學",
            "note": "Students will undertake an exercise in the interpretation of scientific analyses from a conservation laboratory."
        },
        {
            "type": "合作學習",
            "note": "In the final session there is a groupwork quiz on the course contents."
        },
        {
            "type": "實地考察、參訪",
            "note": "We will visit the Center for Conservation of Cultural Relics at National Taiwan Normal University to see a demonstration of scientific analyses of artworks."
        },
        {
            "type": "媒體融入教學",
            "note": "Students will be provided with weekly Powerpoint Presentations, and will view documentary videos on aspects of the course subject matter."
        },
        {
            "type": "專題研究",
            "note": "Each of the weekly topics contains a number of case studies that will be presented by the professor in the Powerpoint Presentations, accompanied by selected readings from the literature on these case studies."
        },
        {
            "type": "其他",
            "note": "In the second last week, students are invited to make an appointment with the professor for an individual consultation about their assignments."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 60,
            "note": "Written paper"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "This mark is based on attendance, punctuality, and the quality of contributions to class discussion and activities, especially as demonstrating engagement with the key texts."
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "Oral presentation"
        }
    ],
    "prerequisite": "",
    "general_core": []
}