{
    "year": 108,
    "term": 1,
    "name": "藝術的挪用：複製、現成物與再利用專題研究",
    "teachers": [
        "諾斯邦"
    ],
    "department": "TM67",
    "code": "AHM0151",
    "credit": 3,
    "serial": 3118,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 3,
            "to": 5,
            "campus": "校外",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "Course description The course is broadly based on an attempt at understanding the principles of reusing and appropriating old materials in the creation of new artworks. Creation and its relation to originality and invention, needs to be considered through imitation, appropriation, or theft. While it is important to put in perspective the individual participation of the artist in the inventive process, it is in the same time necessary to take into account the way he assumes that he is under the influence of pre-existing models or an established tradition. We will see that preservation and innovation are twofold strategies. From the fourth century, for example, recycled architectural or  sculptural elements were already imported in the conception of new buildings. Far from being unique this example of appropriation is one amongst several others, which cover the history of art. The spolia of the Constantine period are, up to a point, the predecessors of more recent precedents like ready-mades or film remakes. We will measure the amplitude of the metaphor of the artistic theft through different periods and examples. We will see that appropriation is legitimized in different historical and cultural contexts such as for example in the ancient Greek myths, in the traffic of relics during the Middle Ages, or in the creation of numerous collections of artworks. We will also analyze the way imitation and copies – essential to the apprenticeship of the arts during the Renaissance and after – encouraged it. We will question the recurrence and permanence of this principle during the 20th century, through the apparition of the ready made with Marcel Duchamp, and the perpetuation of its principles in the art of the 1980s’. Finally we will see that appropriation is not only related to the frequent remakes  of the history of cinema. It is deeply inscribed in the cinematographic imagery, as well. Profoundly linked to the cinematic medium, appropriation already belongs to the photographic capture. It becomes with cinema an issue of an astute ruse, whose anthropological aspect has to be asked.",
    "goals": [
        "To impart a critical approach on the issue of appropriation",
        "To analyze and understand the origins, and cultural legitimization of appropriation",
        "To cultivate student’s abilities to understand principles of reusing an appropriating old materials in the creation of new original works of art",
        "To shape student’s abilities to question and solve issues related to the topic. To encourage their critical thinking",
        "To train students to collect, study, and analyze primary and secondary sources"
    ],
    "syllabus": "*   Weeks 1-2: Rhetoric of Appropriation: Spolia in Early Christian Rome\n*   Weeks 3-8: Appropriation as Imitation: From Zeuxis to the Academy\n*   Weeks 9-12: Appropriation and its Institutional Legitimacy: Art Collection and Thefts\n\n(Medieval _Furta Sacra_, The Spoliation of Europe’s Masterpieces: the _Musée Napoléon_, Hitler’s Museum, Soviet Plunder)\n\n*   Weeks: 13-14: Marcel Ducham and After: The Ready-made and its Perpetuation in the 1980s’\n*   Weeks: 15-18: Film Remakes",
    "methodologies": [
        {
            "type": "實地考察、參訪",
            "note": "Study visits are organized when possible and according to the course topic, and depending on the cultural actuality (exhibitions, events etc.)"
        }
    ],
    "grading": [
        {
            "type": "出席",
            "weight": 20,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 80,
            "note": "口頭報告30%、書面報告50%"
        }
    ],
    "prerequisite": "",
    "general_core": []
}