{
    "year": 108,
    "term": 1,
    "name": "二十世紀下半視覺藝術",
    "teachers": [
        "諾斯邦"
    ],
    "department": "TM67",
    "code": "AHM0221",
    "credit": 3,
    "serial": 3121,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 7,
            "to": 9,
            "campus": "校外",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "上課地點:校區外，台北市青田街5巷6號4樓藝史所教室。",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "The arts of the immediate post-war can be defined both in the West and in Japan by a dynamic of transgression that was provocative, violent, and also festive. This spirit and revivifying ardour that characterized the artistic creation in both aforementioned areas is also illustrated by common references rooted in neo-primitivism. A specific attention will be paid on the artistic production of the 1950s and 1960s. The attitudes and new forms of creation that took place during this period in Japan, Europe and the United States will be compared their impact on the next generations will be analysed critically.The multiplication of attitudes and artistic mixings of diverse origins that have been taking place since WWII needs and in-depth analysis. The course will provide tools to understand the different stakes related to the period analyzed. Divided in two parts, the course will on the one hand describe the different postures and traits that have defined the decades of creation following WWII. It will on the other hand comment through concrete case studies the links between the artistic creation and the larger realm of visual culture of this period marked by the emergence of television and new media. Visits to institutions hosting and promoting the art that has developed during the second half of the 20th century will be scheduled according to the calendar of events taking place during the semester.",
    "goals": [
        "1.\tTo impart in-depth knowledge of the artistic creation and visual culture within the period analyzed",
        "2.\tTo analyze and understand the latest development, theoretical issues and debates in the period in the second half the 20th century",
        "3.To cultivate student’s abilities to observe, understand, compare and interpret works of art",
        "4.\tTo shape student’s abilities to question and solve issues related to the latest development of art. To encourage their critical thinking",
        "5.\tTo train students to collect, study, and analyze primary and secondary sources, to select and comment the literature related to the art of the second half of the 20th century"
    ],
    "syllabus": "Schedule\n\n  \n\\-       Week 1: Introduction\n\n\\-       Weeks 2-5: Art in the 1950s\n\n\\-       Week 6-9: Art in the 1960s\n\n\\-       Week 10-13: Art in the 1970s\n\n\\-       Week 14-15: Art in the 1980s\n\n\\-       Week 16-18: Art in the 1990s",
    "methodologies": [
        {
            "type": "講述法",
            "note": "For each lesson students are given a handout. It includes the essential bibliography mentioning monographs, academic studies, articles, documents, archives, and/or critics related to the topic. It provides the list of works (illustrations) analyzed during the lesson\nEach session tends to tackle a specific issue. Its goal is to present, analyze, and discuss the most important theoretical and practical aspects related to the topic in question. The outlines and the main issues are introduced at the beginning of each lesson. A brief summary of the previous lesson introduces the new issues that will be discussed. If questions related to previous lessons are still pending, they are answered, and/or recontextualized."
        },
        {
            "type": "問題解決教學",
            "note": "The topics are addressed through a close reading and detailed analysis of a single, or a group of works of art. The main issues related to a subject are examined through concrete examples. Different points of view are privileged in order to open new perspectives on well or-less known objects. Various scientific texts, documents and sources are selected and commented. Images, texts, and documents are used in order to present original and critical approaches."
        },
        {
            "type": "實地考察、參訪",
            "note": "As much as possible field work is encouraged through museum visits or study trip. A 10-day study trip to Tokyo will provide the students with a comprehensive and concrete apprehension of significant buildings and works of art that illustrate the development of modernism after WWII. The post-war Westernization accelerated by the American occupation spurred a generation of artists mixing Western and Japanese influences. This singular phenomenon can be analysed critically, and will be the focus of the study trip. Students will be confronted directly to the physical, material and contextual realities of the artistic production that took place during that period. They will measure the specificities of the works of art and monuments beyond the theoretical point of view assumed in classroom."
        },
        {
            "type": "專題研究",
            "note": "Students’ abilities to gather, investigate and analyze art history resources are trained through personal contributions, such as the essays they are asked to present orally during the semester, and complete in a 10-page length written paper by the end of the semester. The topics are carefully chosen in order to propose issues that are closely related to the main topic of the course. Their relevance depends also on their accessibility. When selecting the topics the literature at disposition is taken into account as well as the latest contributions at hand. The students are in this respect given a selected bibliography which helps them to access the topic with the most appropriate tools. Students are also asked to complete their research with other readings."
        }
    ],
    "grading": [
        {
            "type": "出席",
            "weight": 20,
            "note": "During the course the skills of the students are tested through questions intended to tackle problems in direct relationship to the topic. They are trained in the observation of artworks. They are taught how to describe a work (from the more general to the more specific), to understand its structure, its content, and its meaning. They are asked to compare works (or documents) with similar or contradictory examples. They are taught to identify and to interpret the different meanings of a work. Their aesthetic sensitivity and their critical thinking are encouraged through an acute observation and analysis of the works, documents, and academic writings introduced throughout the course. If the content presented seems to be unclear to the students, it is clarified through questions and answers."
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "Students’ abilities to formulate a specific issue on a specific topic related to the course attended are trained, and improved. They are asked to present and structure their argumentation coherently, to produce a critical research based on an acute observation of the works analyzed, and to find possible solutions in a 30 minute time-lapse. The discussions, comments, and critics formulated during and/or after their oral presentation are always thought in a constructive way. They are intended to encourage the students to improve their critical approach, to redirect their previous intentions."
        },
        {
            "type": "專題",
            "weight": 50,
            "note": "Students are asked to hand out a final paper respecting some formal, but essential points according to the common use in the academic field of art history (table of contents, quotations and correct referencing, presence of bibliography, illustrations etc.). Students are given a style sheet on which they can take example. The content should be well structured, written correctly, and thoroughly documented."
        }
    ],
    "prerequisite": "",
    "general_core": []
}