{
    "year": 108,
    "term": 1,
    "name": "十九世紀建築",
    "teachers": [
        "王維周"
    ],
    "department": "TM67",
    "code": "AHM0183",
    "credit": 3,
    "serial": 3289,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 4,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "上課地點:校區外，台北市青田街5巷6號4樓藝史所教室。",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "The underlying objective of this course is to give an overview of the multi-faceted developments and fundamental changes in the field of architecture during ‘the long 19th century’ (a term coined by the British historian Eric Hobsbawm [1917–2012]). After centuries of stylistic consistency in Europe, the architecture of that period bore the hallmarks of a great formal diversity based on multifarious traditions of the past. We shall discuss the phenomenon of the dissolving epochal styles and the new availability of stylistic forms, which culminated in the question “In what style should we build?,” asked by the German architect Heinrich Hübsch (1795–1863) in his essential essay of 1828. Another innovation consists in the fact that builders developed new constructive properties benefitting from innovative materials, in particular glass and iron. \nThe course’s topics will span from Neoclassicism at the transition from the 18th to the 19th century with some utopian projects of the French Romantic classical architects Claude-Nicolas Ledoux (1736–1806) and Étienne-Louis Boullée (1728–99) to the diverse national variants of Art Nouveau towards the end of the century. A view on the great international exhibitions of London 1851, Chicago 1893 and Paris 1900 will open the perspective to transcultural processes. Special emphasis is, finally, being given to urbanism exemplified by the reorganization of Paris and Vienna during the second half of the century (Baron Haussmann and Ringstraße). \nThe participants will be introduced to an independent analysis of the buildings. In case studies, they will be trained to apply different research techniques. In this respect, John Ruskin’s words “Don’t look at buildings… watch them” will be our motto. For an investigation of the theoretical background, excerpts of elementary texts—such as Heinrich Hübsch’s In what style should we build? (1828), John Ruskin’s Stones of Venice (1851–53), Charles Eastlake’s History of Gothic Revival (1872) and Camillo Sitte’s City Planning According to Artistic Principles (1889)—will be read and analyzed together. \nField trips to major historicist monuments in Taipei built during the 1st half of the 20th century will give ample opportunity to apply analytic skills outside the classroom.",
    "goals": [
        "To increase students’ knowledge of the stylistic and iconographic development of 19th-century architecture.",
        "To increase students’ knowledge of the historical, socio-political and cultural background of the buildings and to discuss the development of their function during the 19th century.",
        "To train students’ ability of analytical description and comparative analysis of form using the correct terminology.",
        "To improve students’ capacity of aesthetic judgment.",
        "To instruct students how to read and interpret primary sources and evaluate them with regard to the relevant art works.",
        "To promote students’ competencies to collect and interpret related literature and to encourage them to maintain a critical distance towards scientific opinions."
    ],
    "syllabus": "  從大航海時期開始，歐洲人在其行經的航海貿易路徑上，建立了一個一個的貿易商站，進而發展成佔領的殖民地與殖民城市。在這個歐洲影響世界的過程之中，歐洲觀點的建築，進行全球尺度的擴散，從最初的十六世紀的葡萄牙與西班牙海外建築，到荷蘭人與英國人加入這場世界尺度的資源貿易爭奪戰，建築擴散的尺度變得更快更大。十九世紀，隨著歐洲海權國家全面投入，海外殖民地建築，因著政治權力或是宗教權力的海外輸送，成為當地的地標與重要建築。城鎮與建築的發展，在海外殖民的概念下成為一體。\n\n  而過去以歐洲中心觀點的建築史觀，無論是由義大利或是法國所建構的「正統」建築史，或是由邊陲海外的英國挾著日不落國的經濟及語言權力所建立的英國觀點建築史，均不太討論這些同個時段在海外進行的建築生產。然而，龐大的建築生產個案，卻是十九世紀及廿世紀最具異國風情的建築現象。被排除在主流建築史的海外殖民地建築，形塑了在地的城鎮與建築面貌，成為一部待發掘、書寫、詮釋的建築史。本課程將針對海外殖民地，討論其與母國「正史」中間的關係，以及無獨有偶所建立出來的在地風格建築，其與歐洲建築之混血現象及混血過程。\n\n  本課程將從大航海時期歐洲的海外擴張歷程開始，先進行歷史背景的說明，有助於理解大航海時期歐洲國家如何投入海外殖民競賽，以及在競賽的過程中，如何取得各個後來的殖民地。殖民地的攫取於十九世紀中期之後逐漸穩定，各個殖民宗主國亦逐漸在各殖民地的主要城市中進行建設。殖民政府的官署建築逐步完成，更逐步形成有意識的統治樣貌。並討論這些有意識或無意識所出現建築現象。\n\n·       第1週 課程簡介 – 課程大綱與參考書目介紹 Introduction – syllabus and bibliography\n\n·       第2週 中世紀的文明技術發展與地理概念 Civilization, development of technology andgeographical concept of Middle Age\n\n·       第3週 航海探險與殖民城市的建立 Exploration of the world and establishment of colonial cities.\n\n·       第4週 全球殖民經濟系統的建立 Establishment of global colonial economic system. 殖民地的經營與建城策略 Management of colonies and strategy of building cities\n\n·       第5週 美洲發現、探索與開發經營\n\n·       第6週 亞洲殖民城市 – 澳門Asian colonial cities – Macao\n\n·       第7週 印地法與西班牙殖民地城市 – Antigua (Guatemala)、Manila (Philippines)\n\n·       第 8 週. 荷屬印度尼西亞 Dutch Indonesia\n\n·       第 9 週 法屬印度支那 I French Indochina – I\n\n.\n\n·       第 10 週 法屬印度支那 II French Indochina – II\n\n·       第 11 週 彭蒂茄利、卡薩布蘭加 Pondicherry – a base for French in Eastern India & Casablanca and Morocco\n\n·       第 12 週 印度 India\n\n·       第 13 週 馬來西亞、新加坡、暹羅 Malaisia, Singapore & Siam\n\n·       第 14 週 東北都市計畫 City planning in Manchouria\n\n·       第15週台灣I Taiwan–I\n\n·       第16週台灣II Taiwan–II\n\n·       第 17 週 期末報告 Final Report\n\n·       第 18 週 期末考週 繳交期末報告 Final Report",
    "methodologies": [
        {
            "type": "講述法",
            "note": "將由授課教師進行背景內容講述說明"
        },
        {
            "type": "實地考察、參訪",
            "note": "若有適當機會，會進行實地考察參訪"
        },
        {
            "type": "專題研究",
            "note": "將由學生針對教學內容進行專題研究並討論"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 30,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 40,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}