{
    "year": 110,
    "term": 2,
    "name": "日本文學名著選讀",
    "teachers": [
        "洪韶翎"
    ],
    "department": "L",
    "code": "L0U1016",
    "type": "選",
    "grade": null,
    "credit": 2,
    "serial": 1508,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 5,
            "to": 6,
            "campus": "本部",
            "classroom": "樸201"
        }
    ],
    "programs": [
        "日語學程"
    ],
    "comment": "",
    "restrict": "◎第一階段限 日語學程 ◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "透過介紹芥川龍之介、宮沢賢治、金子みすず等代表性日本近代文學作家的作品,讓同學們對日本兒童文學名著有更進一步的認識；同時，在解讀的過程中，提升同學的日語能力與對日本文學的興趣。",
    "goals": [
        "培養日本語閱讀的能力。",
        "了解日本歷史、文學、文化的內涵與特色。"
    ],
    "syllabus": "★本課程依本學期學校規定，選擇授課時數為：「16+2」週\n\n★防疫期間請同學隨時查詢學校最新規定，若學校規定必須遠距上課，遠距上課期間上課網址：https://meet.google.com/qqy-aqqx-gva（若無規定，僅能到校上課）\n\n★本課程以課堂短文及課後長文並行的方式進行，鍛鍊對名著、名文的理解力與感受力。依同學可理解之程度調整中、日語授課比例。\n\n★国語（知識言語）は全科目の基本である。国語は体育で、読書はスポーツだ。\n\n★小学生から全世代が繰り返し味わいたい「すごみ」のある名文で、一流のテキストで、日本語力をトレーニングしようと決意したら、一緒に最高レベ  \nルの日本語に出会おう。\n\n★1、課程導論：瞭解同學程度、傾聽同學們的學習期待、說明教學內容、授課方式及成績考核、學期報告作品、作者初選。\n\n★2、日本近、現代文學概論  \n        分發課堂短文選文資料。  \n★3、『人形』～～小林秀雄一（兼論日本文學的寫實技巧與音樂性）  \n        小林秀雄既是作家亦是日本重要的文藝評論家。其文筆精準凝練，以文字為讀者製造了觸摸實境的時間，而他的主張卻多半存藏於對靜默之物的注視   \n        之中。藉由閱讀這篇短文讓同學一窺為何知名的詩人及作家都對他推崇備至，《墮落論》的作者坂口安吾甚至稱他是文學教祖。\n\n         課後延伸閱讀：中原中也、川端康成、村上春樹  \n★4、『人形』～～小林秀雄二（兼論日本文學的寫實技巧與音樂性）\n\n★5、『風と光と二十の私と』～～坂口安吾一（兼論日本近世文學的「粹」、「通」與「意氣」）  \n        坂口安吾一如腰纏一劍到處找人辯論、比拼的俠士，帶著江湖氣息且精力旺盛的他，厭惡裝模作樣、厭惡日本人熱愛的詫寂枯淡、厭惡一切虛妄與將  \n        就。這樣的代課老師，意外地特別地能夠與孩子交心。在看他其他的名作之前，先來品味代課老師時代的安吾Style。\n\n        課後延伸閱讀：太宰治、開高健、大江健三郎  \n★6、『風と光と二十の私と』～～坂口安吾二（兼論日本近世文學的「粹」、「通」與「意氣」）  \n        \n★7、『海』～～太宰治（兼論日本文學中的自虐情結）  \n        孤單與破滅亦是一點一點累積而來。太宰治文字就像是摳下還未痊癒的傷口上的痂後的粉紅皮膚，帶著仍很揪心的刺痛，卻存在感十足。一而再、再   \n        而三、很痛但卻仍忍不住要去摳。本篇短文寫作時間與『走れメロス』相近，可以從中讀到太宰治此一時期文字的敏銳、快意、力度與節奏。\n\n        課後延伸閱讀：太宰治、井伏鱒二\n\n★8、『名人伝』～～中島敦（兼論日本文學中的漢學）  \n        日本的漢學研究脈絡綿長，江戶時代以來，上流菁英們的家教必定強調漢學修養，直至西風東漸的維新時代後，漢文才急速衰退，中島敦就正巧出現  \n        於此時，家學淵源的他，在創作中自在地驅策對日本人來說生硬難讀且艱澀的漢語詞彙，宛如一羽需要特別保護行將絕種的雉鳥。本文雖短，但已可  \n        讀出中島敦名作『山月記』、『李陵』的況味。  \n       \n        課後延伸閱讀：土井晚翠、井上靖、有吉佐和子\n\n  \n★9  期中報告發表（以所選之課後延伸閱讀為主）\n\n  \n★10 『夢十夜』～～夏目漱石一（兼論日本文學中來自英國文學的養分）  \n        要鍛鍊日語力，怎能不枕流漱石？夏目漱石雖是漢學素養極高（由他選「漱石」為筆名即得窺），不過他亦熱愛落語，加之教授英國文學多年，使得  \n        他的文字及小說技法即便今日讀之，亦不會有陳舊之感。漱石的文字與修辭甚至被譽為近代日本寫作詞彙之基礎。  \n      \n        課後延伸閱讀：夏目漱石  \n★11、『夢十夜』～～夏目漱石二（兼論日本文學中來自英國文學的養分）  \n           \n★12、『勝負事』～～菊池寛（兼論日本文學出版及文藝雜誌）  \n        菊池寬的作品不是寫給文學同好看的，是能勾起幾十萬一般讀者的興趣的故事。菊池寬的小說總有鮮明的主題，敘事脈絡有趣，翔實描述充滿人味的  \n        現實百態，當然亦是鍛鍊寫作整合力的絕佳文本。\n\n         課後延伸閱讀：三島由紀夫\n\n★13、『学者アラムハラドの見た着物』～～宮沢賢治（兼論日本文學的宗教性）  \n        科學與宗教、文學與農業在宮澤賢治的身上毫無違和地融為一體。宮澤賢治的想像力豐富，本篇童話不是他有名的作品，卻營造出色彩斑斕、形象清  \n        晰且絕不遜於哈利波特的魔法教室。  \n課後延伸閱讀：志賀直哉、有島武郎、武者小路實篤\n\n★14   『杯』～～森鴎外（兼論日本西化過程中的德國影響）  \n        森鷗外不只是作家、還是留德醫生、是高階官員，更是風骨孤高的近代武士。本文是他早期的作品，第八個女兒不黨不群的格調，亦是鷗外自己的寫  \n        照。藉由對杯子及女孩的描寫，批判當時極不自然的自然主義文學。  \n         課後延伸閱讀：島崎藤村、大正期私小說  \n★15   『時代』～～芥川龍之介（兼論日本文學中的左翼思潮）  \n        芥川龍之介的小說豐富多彩，是新思潮派的代表作家。其歷史小說依題材可分為：王朝物與江戶物、禁止天主教時期的「切之丹物」及明治初期的  \n「開化物」、亦有取材自中國及印度的作品。大正轉為昭和時期，開始撰寫一連串的私小說（保吉物），當然亦描述出其晚年的苦惱。本文選自其遺稿  \n『或る阿呆の一生』  \n★16   期末報告發表（以所選之課後延伸閱讀為主）  \n備註:若因疫情等相關不可抗力因素，視情況需要,本課程擬採數位遠端課程。\n\n        空出之兩週為讓學生進行延伸閱聽之時間，無特定指攝日期",
    "methodologies": [
        {
            "type": "講述法",
            "note": "教師講解文本"
        },
        {
            "type": "討論法",
            "note": "同學必須事先預習、上課依指示朗讀、分享心得"
        },
        {
            "type": "實驗/實作",
            "note": "依課程指示選定課後延伸閱讀並製作報告"
        },
        {
            "type": "媒體融入教學",
            "note": "上課時播放與作家、文本相關的影片教學。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 10,
            "note": "同學必須事先預習、並依上課指示進行課後複習及作業"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "同學必須事先預習、上課依指示朗讀、分享心得"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 60,
            "note": "期中與期末必須繳交報告，各佔30%"
        }
    ],
    "prerequisite": "",
    "general_core": []
}