{
    "year": 110,
    "term": 1,
    "name": "諮商督導研究與實習（一）",
    "teachers": [
        "陳秀蓉"
    ],
    "department": "ED01",
    "code": "PCD2006",
    "type": "必",
    "grade": 2,
    "credit": 2,
    "serial": 349,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 8,
            "to": 10,
            "campus": "本部",
            "classroom": "教615"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎必須先修過【PCD2008  進階諮商心理實習（一）】、【PCD2009  進階諮商心理實習（二）】 ◎課程不開放上修",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "1. 透過閱讀與討論，學生能瞭解諮商督導的主要模式的理論與實務 2. 透過實習與討論，學生能夠成為勝任的諮商督導 3. 透過閱讀與報告撰寫，學生能夠發展適合個人的督導風格與特色 4. 透過督導技能的切磋，能夠對同儕提供善意與建設性的回饋，也能夠虛心的接受同儕的建議。",
    "goals": [
        "瞭解諮商督導的主要模式的理論與實務",
        "透過實習與討論，學生能夠成為勝任的諮商督導",
        "實踐諮商倫理與督導倫理的守則"
    ],
    "syllabus": "*   授課教師：心輔系陳秀蓉教授（[hsiujung@ntnu.edu.tw](mailto:hsiujung@ntnu.edu.tw) ; TEL:7749-3762，研究室：教育大樓502室。）\n\n二、教學目標\n\n1\\. 透過知識概念的閱讀與討論，學生能瞭解諮商督導相關理論與實務。\n\n2\\. 透過督導實習與討論，學生能夠成為有勝任力的諮商督導者。\n\n3\\. 透過專題研究與臨床督導實習，學生能夠整合知識與實作，逐步發展適合個\n\n   人的督導風格與專業特色。\n\n4\\. 透過督導技能的精進與切磋，能夠對同儕提供善意與建設性的回饋，發展自我督導與同儕督導能力。\n\n5\\. 透過本課程的學習，學生可獲得台灣諮商督導認證的部分相關基本條件。\n\n三、教科書\n\n1.  林家興、趙舒禾、方格正、黎欣怡、李露芳、葉安華合著（2011）：諮商督導實務。台北市：雙葉書廊。.\n2.  _Bernard_, J.M., & _Goodyear_, R.K. (_2014_). _Fundamentals of clinical supervision_, 6th _edition_. Upper Saddle River, NJ: Pearson. (Hardcopy 114.97，Paperback 64.08)\n3.  徐西森、黃素雲(2007)：諮商督導—理論與研究。台北市：心理。\n4.  洪志美等譯(2011)：系統取向督導完全指南。台北市：心靈工坊。譯自Storm & Todd (1997). The Complete Systemic Supervisor: Concept, Philosophy and Pragmatics.\n5.  高慧芬譯(2017) ：臨床督導:專業知能本位督導模式。台北市：心理。譯自Falender, C. A. & Shafranske, E. P. (2004). Clinical supervision: A competency-based approach.\n6.  曾文星（2010）：心理治療---督導與運用。台北市：心理。\n7.  林家興（2017）：諮商督導的臨床筆記。台北市：心理。\n\n四、教學內容與進度\n\n1.\n\n第一週\n\n課程導論\n\n我的督導地圖\n\n督導實習規劃\n\n2.\n\n第二週\n\nA第01章 諮商督導緒論  B Introduction to clinical supervision  ch1  E.第01章 諮商督導的基本概念。\n\n督導實習問題討論\n\n3.\n\n第三週\n\nA第06章 如何開始督導。第08章 心理師的專業發展。第09章 實習心理師的挑戰與督導上的建議。\n\n督導實習問題討論\n\n4.\n\n第四週\n\nA.第04章 督導者的專業知能。 E. 第02章優質臨床督導之內涵。第03章強化督導專業知能。\n\n督導報告與討論1\n\n5.\n\n第五週\n\nA第03章 受督者的評量。E. 第08章督導歷程的評鑑\n\n督導報告與討論2\n\n6.\n\n第六週\n\nE.第4章處理督導歷程中的個人因素。E.第6章 建立督導多元專業知能\n\n督導報告與討論3\n\n7.\n\n第七週\n\nA. 第05章 七眼督導模式概述與實務應用\n\n督導報告與討論4\n\n8.\n\n第八週\n\nA.第07章 臨床督導的方式\n\nB. Organizing the supervision experience ch 6\n\n專題研究大綱討論\n\n9.\n\n第九週\n\nB. ch 7 Individual supervision   \n\n交反思督導歷程的學習評論2500字\n\n督導報告與討論5\n\n10.\n\n第十週\n\nB.  ch 9 Live supervision \n\n督導報告與討論6\n\n11.\n\n第十 一週\n\n專題演講 \n\n交反思個人擔任諮商師時受督經驗2500字\n\n督導報告與討論7\n\n12.\n\n第十二週\n\n1.  A. 第10章 受督者的自我揭露。\n\n      2. A. 第11章 督導者的反移情。\n\n督導報告與討論8\n\n13.\n\n第十三週\n\n專題研究報告與討論一  \n\n督導報告與討論9\n\n14.\n\n第十四週\n\nA.第02章 督導倫理與法律議題\n\nE. 第07章 危機管理與倫理法律判斷。\n\n督導報告與討論10\n\n15.\n\n第十五週\n\nB. ch 10 Evaluation\n\n督導報告與討論11/12\n\n16.\n\n第十六週\n\n評量受督者與質性回饋(活動)\n\n課程心得報告。\n\n專題研究分析與整理(一)\n\n督導模式與受督改變的關聯與反思\n\n17.\n\n第十七週\n\n 專題研究分析與整理(二)(非實體)\n\n非實體課程\n\n18.\n\n第十八週\n\n 統整督導實習與反思\n\n  期末專題報告繳交\n\n1.  交督導記錄與反思成冊總整\n\n      2. 交期末督導心得報\n\n         告及整體督導表現\n\n五、學習活動與評量\n\n1\\. 課外督導實習活動與專業發展\n\n1.  **請勿在原來服務單位進行實習，以避免多重關係，並宜多拓展經驗。**\n2.  **實習督導對象與時數：**\n\n1.  每人需要負責系上大學部團體督導一個，個別督導二人。\n2.  個別受督者為系上碩三與碩二實習生，依當年度實習會議媒合為原則。若無時本系督生，可以接受校外實習生或校外心理師，需與授課教師先行討論。\n3.  與接受個別督導的受督者，於本學期每週一人進行1小時，至少約20次（須配合受督者的課程時數要求）。\n4.  接受小團督的受督者，於本學期每週進行兩小時，配合大學部諮商實習課程要求之次數與課程規定（約一學期10-12次，一次兩小時）。\n5.  有其困難時與督導課程教授討論應變選項（如改為一個個督，兩個團督之類。或接受校外實習生或校外心理師為受督者等），需與授課教師先行討論。\n6.  若為系上的實習生，請配合受督生諮商實習相關課程之規定及本督導課程之要求（參考其課程綱要重點，確認進行方式，評量方式，知後同意書，相互回饋向度等）。其他系所受督生，需確認其督導被期許的督導職責及相關規定。\n7.  若不是本系分配的受督生，請經由授課教授同意受督者身份，並告知授課教師＆實習單位彼此聯繫相關方式或其所屬職責。也需告知相關單位（如該系所，接案機構）會有課堂及個別的「督導的督導」設置，並獲取同意函。\n8.  個別督導需完成督導契約簽署。需將部分的督導歷程錄音或錄影。使用錄音錄影作為上課討論，請先徵求受督者同意。\n9.  個別督導請勿以網路督導進行，網路督導為危急或臨時性使用，最多以0.5次計算，且不超過1/4督導時數。\n\n1.  個別督導與團體督導的進行\n\n1.  一開學時，請先規劃團體督導與個別督導如何進行的方式，如自我介紹、專業背景、實習場域文化與系統聯繫方式、期待與需求、個人實習概況及整體流程等\n2.  協助受督生預備督導的內容與瞭解相關各項規定，如關係建立與界線確立、受督者狀態開始與成效的評估量表、督導順序與架構、平日聯繫方式、資料加密、自訂作業、危機處理的主動告知及緊急狀況的聯繫方式，尤其是督導者要求受督者相關作業的完成，如逐字稿、錄音檔或個案報告，以及時數的符合等。參考附錄資料。\n3.  督導主要討論方式，常包含簡易個案概況，單次個案記錄指導，多次後的個案報告，配合督導需求的逐字稿（15分鐘）以及錄音檔分析與回饋，或者，針對特定需要提出相關資料及建議相關閱讀讀物的簡易討論等。\n4.  督導的內容意圖於協助諮商理論、歷程、技術與個案概念化之連結與整合，諮商師專業角色與知能的成長，以及增進各種議題的專業能力，如評估與診斷能力的提升，非自願個案、創傷失落等議題的處理，而非重新上諮商理論與技術或進行個別諮商。\n5.  以諮商督導為主，行政系統督導為次，例如：為幫助個案，協助受督者認識與處理個案的生態系統。也需支持受督者整個實習經驗或職場適應，尤其是影響其接案時。\n6.  需要諮商錄音錄影進行督導，督導歷程也需部分錄音或錄影，以為上課討論。記得處理相關同意函（如單位主管或個案家長）。\n\n1.  **特殊事件處理：**\n\n1.  若系上受督生有特殊狀況，危機事件或違反倫理事件，鼓勵受督生主動聯繫督導及授課老師，實習督導亦需主動告知督導及實習相關授課教師。\n2.  若受督生授課教師或機構有主動聯絡實習督導時，或實習督導發現受督生需要特殊協助與關注時，亦請告知督導授課教授，並與受督生授課教師討論商議。\n3.  對於實習機構的相關處理，以授課教師出面為主。\n4.  於需要時，會由相關授課教師提請系上實習委員會審議或申請相關協助資源。\n\n1.  為了**有效的學習如何督導**，如果從未接受過一對一的諮商督導至少一年，需要自行找督導來「接受督導」，學習了解受督者的需要。諮商督導，選擇條件為具有諮商心理相關博士學位，並且具備督導經驗至少一年。\n2.  **督導的督導**：\n\n1.  一學年請自行找至少接受四次「督導的督導」，以督導者的位置接受資深督導者的督導，以能提升擔任督導者的效能。\n2.  尋找督導的督導時，須說明尋找的理由與課程的相關設置。\n3.  自行注意申請學會督導證書的相關規定（如其課程項目以及接受「督導之督導」時數），並符合其要求。\n4.  建議新手督導自行增加一對一的「督導之督導」次數。\n\n2.課前章節閱讀5%\n\n課程進行方式主要包括：前面60分鐘討論課前指定閱讀的章節（彙整書籍，輪流導讀）。每章閱讀教材由指定同學於課堂口頭重點報告20分鐘，另開放40分鐘討論。上課前需兩日前傳給授課教師。\n\n3\\. 課堂上團體督導20％：\n\n1.  除討論需要緊急確認事件後，平均修課同學輪流進行個別或團體督導口頭報告與每人每次報告與討論的時間為70分鐘。口頭報告時必須呈現錄音或錄影的片段，並提供適當的書面資料（每人一份）以供參考與討論。此資料需事前兩日傳給授課教師及同學，並設有密碼。\n2.  討論，次數班級人數平均分配。每位個督及團督輪流為佳。於需要時，立即於課堂提出相關疑慮。\n3.  書面資料中需先將目前所有進行的，附於最前面。即是先將從一開始到目前的團體督導及各受督生的每次督導摘要重點與心得，附上簡要的書面說明團體督導及個別督導各次內容（時間，重點與評估）摘要（持續累積即是）。此外，依據督導需求，提供相關所需資料，以進入脈絡。\n4.  時間分配為：\n\n（1）15分鐘\n\na. 摘要說明該次及整體督導歷程（包括受督者及案主背景與重要互動資訊簡述）。\n\nb. 該次與受督者討論的主要議題（包含督導目標，受督生來督導及進行諮商時的目標，以及來談個案的整體狀況等）。\n\nc. 影響督導歷程或督導關係的因素分析（如關係互動，工作取向）。\n\nd. 擔任督導的個人心得（如對受督者的各方觀察評估，對督導角色的反思，對個案的幫助等）。\n\ne.可參考附錄的向度＆附上協助討論的資料\n\nf.需要督導的需求與方向（如案主議題的處理，如何引導諮商師有效介\n\n入，督導關係的處理等）\n\n（2）10分鐘：呈現10分鐘錄影或錄音，與督導需求有密切關係，可以是最重要的、最有進展的、或最困難的、最困惑的片段，並說明為何要選這片段呈現、這片段的主要內容、督導者意 \n\n        圖與行為、對提出討論的期待。\n\n（3）40分鐘：開放討論、協助報告者反思、給回饋與建議。\n\n（4）5分鐘：報告者總結。\n\n4\\. 督導研究專題報告（20%）\n\n        自行選擇一個與督導有關的主題，閱讀國內外相關的督導研究論文，撰寫出督導研究專題報告一份。於第八週提出大綱方向，並進行討論，並於規定時間進行課堂報告（以PPT呈現）。書面1/14交出，字數約為8000-10000字（以預備投稿的方式撰寫），用APA格式，需統整所閱讀的文獻，並且加以評析。\n\n5\\. 每次個督與團督後的紀錄（含反思）及整體督導表現（25%）\n\n1.  紀錄內容參考附錄，如：當次督導目標、督導目標的達成、督導歷程的簡述、使用的督導取向與方法、主要討論的議題等，也可包括：對個案問題的評估、介入處理、受督者與個案建立的關係、出現的倫理議題、危機處理、對受督者與個案進展的評估、督導與受督者建立的關係與處理、對受督者出現個人議題的處理、對督導進展的評估等、以及個人及督導員角色反思等等(參考督導紀錄表向度)\n2.  於5-15週間，請於打星號週繳交有進行的督導記錄與反思。\n3.  期末彙整所有成冊於1/14繳交再交來。\n\n6.期末督導心得報告以及整體督導表現（20%）\n\n期末督導心得報告內容可以包括個別督導與團體督導書面心得報告，以10000-12000字為限。於1/14繳交。內容可包括：\n\nA.上課的學習與心得。\n\nB.同時設計受督生給予回饋表格，並加入受督生的意見之反思。\n\nC.督導者的學習經驗：\n\n1.  如在督導歷程中發生的重要事件與議題並從中的學習、與受督者關係建立與處理的能力、對自我的覺察、督導模式與方法的使用、自己督導風格的了解、對自己身為督導者的評估、未來期待督導模式\n2.  也可包含督導與受督者的學習向度（督導者的發展階段，諮商員的發展階段，督導方法與技巧，督導關係，評量，行政技巧，倫理、法律和專業調節議題，多元文化知能，督導研究的知識等（參考督導紀錄表向度，或現有督導量表之參考)。\n3.  也可督導者生命歷程的主題，如對於成為督導的認同、成為督導的信心、自主和依賴他人的程度、使用權力和權威（包含考核的方式和歷程）、介入的結構以及彈性和多樣的程度、聚焦在受督者和/或自身的需求、投注在受督者和個案成功的程度、督導關係的使用、覺察和評價自身對於督導關係和歷程的影響、真實的評價知能與限制（如覺察和涵容自身議題、偏誤和反移情程度）等。\n\n7.出缺席課堂參與，以及實習督導表現（如實習整體品質，有無違反倫理事件等）整體加權處理，或實習督導特殊表現之成績整體加權評量。若違反重大倫理事件則不予以通過本課程，或送交系上實習委員會議審議之。\n\n8\\. 督導歷程的學習評論(5%)\n\n針對閱讀書籍E中的督導案例予以評論，包含學習與建議，以及其他心得評論。約2500字。於11/19繳交。\n\n9.個人擔任諮商師時的受督經驗反思（5%）：\n\n反思過去個人擔任諮商師時的受督經驗（應有一對一，至少一年個別督導，及其他團督），彙整出有效督導歷程與督導者特質。約2500字。於12/03繳交。若無受督經驗者，於接受諮商督導後於期末補繳。（下學期則為撰寫督導的督導經驗) 。",
    "methodologies": [
        {
            "type": "講述法",
            "note": "督導理論知識"
        },
        {
            "type": "討論法",
            "note": "章節討論、課程團體督導討論"
        },
        {
            "type": "合作學習",
            "note": "課堂討論與分享"
        },
        {
            "type": "實驗/實作",
            "note": "每次個別督導或團督及反思+整體表現"
        },
        {
            "type": "專題研究",
            "note": "督導研究專題報告"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 25,
            "note": "每次個別督導或團督紀錄及反思+整體表現"
        },
        {
            "type": "期末考",
            "weight": 20,
            "note": "期末心得與整體實作及概念理解"
        },
        {
            "type": "課堂討論參與",
            "weight": 25,
            "note": "課前章節閱讀5%、課堂團體督導20%"
        },
        {
            "type": "報告",
            "weight": 10,
            "note": "督導歷程學習評論5%+擔任諮商師受督經驗反思5%"
        },
        {
            "type": "專題",
            "weight": 20,
            "note": "督導研究專題報告"
        }
    ],
    "prerequisite": "◎必須先修過【PCD2008  進階諮商心理實習（一）】、【PCD2009  進階諮商心理實習（二）】",
    "general_core": []
}