{
    "year": 110,
    "term": 1,
    "name": "進階諮商心理實習（一）",
    "teachers": [
        "王麗斐"
    ],
    "department": "ED01",
    "code": "PCD2008",
    "credit": 2,
    "serial": 348,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 8,
            "to": 10,
            "campus": "本部",
            "classroom": "教621"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎必須先修過【PCM0089  諮商理論專題研究】 ◎課程不開放上修",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 4,
    "description": "本課程旨在透過實習接案、督導、相互討論、閱讀、錄影帶賞析等的方式，統整諮商所學，協助學生能成為更有效能的諮商師，進而統整諮商師自己的個人諮商理論，並應用所學於個人日常生活中增進其個人心理健康，並培養樂於從事諮商工作的興趣與態度。",
    "goals": [
        "瞭解諮商的理論與實務，透過同學的研討與督導，更深入了解不同個案的問題型態與學習多元介入處理的諮商相關知識",
        "透過實習、討論與督導，協助學生能更有效進行諮商，能將所習得的諮商專業，應用於接案過程中，增進對應用諮商理論的認識，提昇諮商專業實務能力，對諮商理論與實務有更深入的瞭解與統整，而成為勝任的諮商師",
        "培養諮商師能夠由不同的角度，多元思考案主的問題，並不僵化、彈性因應處在不同文化下，案主不同的需求",
        "發展與統整諮商師的個人諮商理論，尊重每位諮商師不同的諮商風格",
        "能應用所學於個人日常生活中，以增進個人心理健康並培養諮商師應具有的態度與特質",
        "熟習並實踐諮商專業倫理守則",
        "培養以「人」為本的態度與人文情懷，及樂於從事諮商工作興趣與態度"
    ],
    "syllabus": "**一、教學目標**\n\n(一)   透過機構實習、個案研討與督導，提升諮商心理實務知能與個案概念化能力\n\n(二)   透過閱讀、課堂討論與實務經驗相互印證與反芻，協助學生對諮商心理專業認同與效能提升的專業發展\n\n(三)   運用諮商心理學之「科學家\\-實務者」整合教育模式，培育在地之諮商心理專業高階人才\n\n**二、教學內容與進度**\n\n**週次**\n\n**主題**\n\n**備註**\n\n1.           \n\n課程定向與督導團體形成\n\n確定報告與督導分工\n\n2.               \n\n實習現況報告與個案議題文獻報告1\n\n3.           \n\n個案研討1與個案議題文獻報告2\\*\n\n確定自選研究議題\n\n4.           \n\n個案研討2與個案議題文獻報告3\n\n5.           \n\n國定假日\n\n6.           \n\n個案研討3與個案議題文獻報告4\n\n7.           \n\n個案研討4與期中經驗回顧\\*\n\n8.           \n\n專題講演\n\n9.           \n\n自選議題研究報告初步分享\n\n10.       \n\n個案議題文獻報告5\n\n11.       \n\n個案研討5與個案議題文獻報告6\n\n12.       \n\n個案研討6與個案議題文獻報告7\\*\n\n13.       \n\n個案研討7與個案議題文獻報告8\n\n14.       \n\n個案研討8與個案議題文獻報告9\n\n15.       \n\n個案研討9與個案議題文獻報告10\n\n16.       \n\n個案研討10與學習經驗統整分享\\*\n\n17.       \n\n自選議題研究報告\n\n18.       \n\n個人學習整理與反芻\n\n繳交所有期末報告 \n\n**  \n實習內容**\n\n1.      於開學第一週前，提出諮商心理實習計畫一份（附件一；原則上開學後開始實習，如欲八月份開始實習者，請於七月底前提交、並獲授課教師同意）與個人諮商實務履歷資料。實習計畫獲授課教師同意後方可實習之。上學期機構實習，最慢需於開學三週內開始。\n\n2.      博士生在實習機構的諮商實習，以系上規範為準則，每週兩個半天(至少6-8小時)，依各人排班時間，於實習單位進行。實習內容請依據本系針對「博士班兼職『進階諮商心理實習（一）（二）』課程實施要點」（附件二）規劃與執行，目的在透過機構實習經驗，發展個人對諮商心理專業認同與效能提升，因此，實習計畫原則上應包括：\n\n（1）    個別諮商（含生涯諮商、婚姻與家庭諮商）： 每週約3–4個實際接案小時數。上學期不低於40小時的實際接案時數，全學年累計不少於100實際接案時數；\n\n（2）    團體諮商：每學期至少帶領一個團體、實際帶領團體總時數約15-20小時；\n\n（3）    其他實習項目：參與實習單位的其他與諮商心理相關之工作，如測驗實施與心理衡鑑、婚姻與家庭諮商、心理諮詢與心理衛生推廣工作、危機處遇、個案管理，或其他配合實習機構要求，有助於展現諮商心理效能與個人專業發展之實習工作；以及\n\n（4）    如何運用機構實習作為，發展對諮商心理專業認同與效能提升之規劃。\n\n3.        博士生在實習機構接受每週一次、每次至少一小時之資深諮商心理師之專業督導（需經授課教師同意），並持續至實習結束；配合機構要求，必要時，接受機構之行政督導。\n\n4.        每週到校上課3小時；其中，90分鐘個案研討、50分鐘個案議題文獻報告。團體督導時，請報告者事前準備好書面與PowerPoint資料，其中包括個案研究報告與錄音/錄影及逐字稿資料等。\n\n5.        課堂內容包括個案研討，以及與個案議題相關之文獻報告。每次個案研討，請依據本大綱所提供之個案報告格式撰寫（附件三）。個案研討目的在精緻化諮商技術與提升對個案概念化能力，因此除自行整理個案概念化能力與提供諮商逐字稿（約20分鐘）外，特增加個案相關議題之文獻探討(中文或英文之相關研究報告)之閱讀與討論，並於前一週課堂進行報告。除報告內容，亦挑選其中最重要兩篇文獻，供班上其他同學閱讀，以便同學於下週個案研討時，可依據推薦文獻理解個案與進行討論。個案報告與閱讀報告等相關書面資料請於上課前一週提供給任課教師與同學。  \n  \n\n**課堂期待**\n\n        以開放與尊重的態度、對個案資料的保密、對彼此提供誠摯、不評價的回饋意見、積極參與討論與提供回饋的態度等。所有抄襲報告一經發現，均以零分計算。個案報告需以目前正在進行、且未在其他課堂或個案研討會議中提報；如經發現重複提報者，其「完成實習要求」成績將以零分計算。\n\n**備註**\n\n        本課程大綱於暑假期間提供，授課內容於開學後，可能因修課學生人數與過去諮商專業經驗之條件，而進行部分調整。",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "實驗/實作",
            "note": ""
        },
        {
            "type": "實地考察、參訪",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": "(一)\t完成實習要求（40%） (1)\t需取得實習機構之實習同意書，並發寄公文。 (2)\t依照實習機構規定填寫個別與團體諮商紀錄，並且遵守諮商與實習機構工作 倫理。 (3)\t每週完成個別諮商與心理治療實務至少3小時（本學期個別諮商時數至少40小時），其中至少有兩個個案屬於連續晤談個案（至少連續七週以上）。 (4)\t個別諮商於取得當事人同意下，進行錄音或錄影，每週強烈建議觀看（聆聽）自己接案的錄影（音）帶一小時，報告時，謄寫至少20分鐘晤談逐字稿，可採用現有分析架構進行分析（如CCRT）。 (5)\t平均每週接受至少一小時的個別督導(事前需先告知當事人)。 (6)\t記錄每週諮商實習時數。 (7)\t觀察兩位以上專業同仁的接案歷程並與對方討論。 (8)\t於每月月底上課時繳交諮商實習月誌（含該月實習工作內涵；附件四），全學期共四份(9、10、11、12月打*者) (9)\t最後一週準時繳交：(a) 諮商心理實習時數累計表一份（附件五）；(b) 實習機構督導評量表一份（附件六）；(c) 實習專業督導評量表一份（附件七）；(d) 自選議題研究報告一份；以及(e) 期末個人諮商理論與學習心得報告一份。 (10)\t本學期參加至少一場諮商心理相關專業團體之年會與學術研討會。 註：實習機構部分：   1. 在職生請勿選擇原服務機構。   2. 請選擇個案較多、能提升與發展諮商心理專業認同之機構實習。   4. 個別督導請優先找具博士學位、諮商與心理治療實務經驗、主修諮商心理學者；為避免雙重關係，請勿邀請本系教師擔任督導；專業督導人選需獲授課教師同意。 \n (二)\t自選研究議題書面報告（30%） 根據個人專業發展需要，進行自選研究議題報告。進行方式，建議採「科學家—實務者」之整合教育模式，也就是運用實習經驗與相關素材閱讀之交織學習，發展出個人之在地諮商心理專業認同與效能提升目的。報告含口頭與書面報告。報告重質不重量，以不超過15頁為原則。此報告若能於期末成績送出前投稿發表，將額外加分以資獎勵。\n  (三)\t「期末個人諮商理論與學習心得報告」（30%） 期末個人諮商理論與學習心得報告之目的在協助你整理個人諮商心理理論與實務取向，因此請依據個人學習所得整理，內容可包含各項諮商實習工作之學習經驗深度探索、在機構實習經驗反思，成為諮商心理學家之學習體驗與專業認同，在諮商實習中發生的重要事件、督導經驗與倫理議題，與案主關係的建立與處理的能力、實習期間的專業與自我成長的評估、或其他重要學習收穫等等。於期末繳交，報告重質不重量，以不超過15頁為原則。"
        }
    ],
    "prerequisite": "◎必須先修過【PCM0089  諮商理論專題研究】",
    "general_core": []
}