{
    "year": 110,
    "term": 2,
    "name": "青少年健康問題研究",
    "teachers": [
        "高松景"
    ],
    "department": "EM05",
    "code": "HEC8005",
    "type": "選",
    "grade": null,
    "credit": 2,
    "serial": 433,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 10,
            "to": 11,
            "campus": "本部",
            "classroom": "誠602"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 2,
    "description": "本課程的主要目的在導引學習者深入探討青少年身心發展與行為之特色和相關理論，並分析當代青少年健康研究的重點、方向、新觀念與方法，藉以增進學習者對青少年健康問題的認識和興趣，並提升進行相關研究的知能。本課程採講述、文獻研讀與整理以及小組研討進行之。",
    "goals": [
        "引學習者深入探討青少年身心發展與行為之特色和相關理論",
        "分析當代青少年健康研究的重點、方向、新觀念與方法",
        "增進學習者對青少年健康問題的認識和興趣，並提升進行相關研究的知能"
    ],
    "syllabus": "一、課程名稱：青少年健康問題研究\n\n二、課程簡介：\n\n青少年雖只佔總人口的20%，但他們卻是這個社會未來的百分之百；因此，青少年的健康問題一直是全球各國關注的議題。從發展心理學的觀點，100年前人類的青少年期是很短的，直到1904年霍爾提出「青少年期」這年齡階段後，隨著平均餘命的提升與接受教育年限的提高，青少年期已被視為生命的「轉型期」，也是健康危害行為增加的時期。從公共衛生的觀點而言，成人的高危險行為大多數在青少年開始，若能整合家庭、學校、醫院與社區及早介入，將是有效的健康促進策略。WHO(2015)提出「提昇青少年健康照護服務品質的全球標準」，WHO（2017）再進一步提出「全球加快青少年健康行動（AA-HA!）」倡導各國應支持青少年健康行動可採取「參與、行動、創新」等策略。\n\n    本課程將目前學術界對青少年健康問題與健康行為做一有系統整理，除了運用健康行為科學相關理論外,將特別從「生物心理社會模式」、「生物生態理論」與「挫折復原力」等更貼切青少年健康行為的觀點來探討與批判；進而如何以青少年為中心，來整合家庭、學校和社區健康促進來防制危害青少年健康行為。本課程教學法係以學習者為中心，在探究、發表、論證、與實作中淬練學生成為協作性的學習者；教學方法採「探究本位學習」（Enquiry-Based Learning, EBL）、小組合作學習、開放空間會議、世界咖啡館、資源人物座談…等多元教學方法。在小組探究青少年健康問題與行為的實務主題中，透過期中進行一項青少年健康行為的小型調查, 引導學生後設性思考，實作提出促進青少年健康的「倡議行動方案」,以培育研究生成為倡議關懷青少年健康促進的專業人才\n\n**三****、****教學進度與主題【16+2週】**\n\n1.2月16日：相見歡、課程簡介、作業與評量說明\n\n2.2月23日：基本概念（一）當前國人健康問題與挑戰-為何要重視青少年健康行為\n\n3.3月2日：基本概念（二）青少年之健康行為--健康促進與衛生教育的觀點\n\n4.3月9日：基本概念（三）青少年之發展狀態--教育人員的觀點\n\n5.3月16日：基本概念（四）運用健康行為科學探討青少年健康行為\n\n6.3月23日：基本概念（五）探究與實作：擬定健康行為觀察及訪查計畫初稿\n\n7.3月30日：青少年健康行為相關理論與模式（一）生物心理社會模式\n\n（Biopsychosocial Model）（導讀2030年兒童健康白皮書-營養與飲食、物質濫用防治）\n\n8.4月6日：探究與實作：小組進行健康行為觀察及訪查（與老師討論）\n\n9.4月13日：探究與實作：小組進行健康行為觀察及訪查（停課、小組進行調查）\n\n10.4月20日：青少年健康行為相關理論與模式（二）生物生態理論\n\n（Bioecological Theory）（導讀2030年兒童健康白皮書-身體活動、心理健康促進）\n\n11.4月27日：青少年健康行為相關理論與模式（三）挫折復原力Resilience\n\n（導讀2030年兒童健康白皮書-睡眠、3c產品的使用）\n\n12.5月4日：青少年健康行為觀察及訪查結果口頭報告（期中報告調查結果）\n\n13.5月11日：規劃倡議青少年健康行動方案（邀請董氏基金會來分享）\n\n14.5月18日：接軌全球：「提昇青少年健康照護服務品質的全球標準」，「全球加快青少年健康行動」（WHO,2015；WHO,2017）\n\n15.5月25日：青少年健康危害行為之防制--以青少年為中心、整合家庭、學校和\n\n             社區健康促進與健康服務支持網路\n\n16.6月1日：倡議搶救青少年健康公益行動方案報告（你的一票，決定愛的力量）\n\n17.6月8日：小組自主學習：進行小組書面報告\n\n18.6月15日：小組自主學習：完成青少年健康行為調查書面報告",
    "methodologies": [
        {
            "type": "講述法",
            "note": "配合學習單並ppt簡報，有系統論述青少年健康行為與問題的核心概念及青少年健康行為重要議題內容"
        },
        {
            "type": "討論法",
            "note": "依教學目標，適切採取六六討論法、小組討論、世界咖啡館、開放空間等討論方法，以促進學生間互動、對話，交流觀點"
        },
        {
            "type": "合作學習",
            "note": "採學習共同體的小組協同學習及分組合作學習，針對各類青少年健康行為議題進行觀點交流與觀點取替，來促進學生對話與學習。"
        },
        {
            "type": "實驗/實作",
            "note": "分組合作採探究與實作，進行青少年健康行為觀察與訪查，實地訪談相關資源人物，反思針對青少年危害健康行為提出倡議行動方案。"
        },
        {
            "type": "媒體融入教學",
            "note": "播放DVD影片、自製PPT等輔助媒體"
        },
        {
            "type": "專題研究",
            "note": ""
        },
        {
            "type": "其他",
            "note": "邀請青少年健康行為與問題等議題相關的各領域專家擔任資源人物，來到課堂與學生做面對面對話。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "配合上課進行作業：1.導讀2030兒童醫療與健康政策建言書評析作業：以小組方式進行,從「國家衛生研究院」網站的「兒童醫學及健康研究中心」下載「2030兒童醫療與健康政策建言書」找一個有興趣的主題,進行研讀與評析，並上台以新聞報導方式分享。Ps.也可以選老師建議的主題\n2.配合課堂介紹重要概念後進行小考（1-2次）\n3.學習單撰寫"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "學習的產生來自於彼此聆聽、對話與分享，因此課堂積極參與課堂進行的學習活動，是課堂美麗風景的呈現。"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "請假同學請務必於課前告知，出席情形10%"
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "青少年健康行為觀察及訪查口頭報告與書面報告：採小組探究與實作方式進行，小組依據興趣選定想探討\n之青少年特定健康行為，以及觀察與訪查對象，研擬行為觀察與訪查計畫。然後，依據計畫進行實地觀察與訪查（計畫格式另外提供），最後彙整資料並分析個人身心特色、家庭、同輩、學校、社區及社會等因素如何影響青少年的特定健康行為。"
        },
        {
            "type": "專題",
            "weight": 20,
            "note": "倡議搶救青少年健康公益行動方案報告：採小組合作完成，延續期中青少年健康行為觀察及訪查報告，深入探究青少年該健康行為，運用所本學期所學習的理論、研究與實務，發揮創意，擬定一份完整的搶救青少年健康倡議行動方案（方案格式另外提供）,該評量採小組互評（20%）"
        },
        {
            "type": "其他",
            "weight": 10,
            "note": "個人期末整體學習心得10%（格式另外提供,於6/19前繳交）"
        }
    ],
    "prerequisite": "",
    "general_core": []
}