{
    "year": 107,
    "term": 1,
    "name": "東方美學與策展研究",
    "teachers": [
        "黃光男"
    ],
    "department": "TM60",
    "code": "ATC8035",
    "credit": 3,
    "serial": 3031,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 6,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "美202"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "在中國古代，關於對美的本質的探討，有幾個特點。一是不明確的，是自覺的意向，也就是我們所說的不思辨；二是沒有維心和維物之分，維心與維物的區分是真正的舶來品；三是這些探討基本上都從屬於倫理學範疇。關於美的本質的探討，古代東方有儒家、道家和禪宗三中說法。",
    "goals": [
        "東方藝術及美學概念的關係",
        "討論特定的博物館展示和東方美學藝術的關係"
    ],
    "syllabus": "一、何謂東方\n\n1\\. △地域上的分野：自土耳其以東，日本疆域以西為大要分嶺。\n\n△文化上的區別，以印度、中國為主軸，旁及韓國、日本、越南等中南半島主       國的文明歷程。\n\n△宗教上的信仰，印度教、道教、回教、儒家為主，基督教為輔的神學觀。\n\n△哲學思想，則以中國之老莊、孔孟學說，以及禪學之神祕主義為主。\n\n2\\. 事實上，文化是文明程度的攝取與應用，在廿一世紀來臨時，東方是人類史上的動詞，也是名詞。\n\n二、東方美學的意涵\n\n1.民族主義與人文精神：就中華文化來說，儒家的美學觀在倫理與生活品味       上，是五倫，是秩序，以及天時、地利、人和；在道家來說，是自然與真實，並在隱與顯的旋迴上有道與有名之間，力求生命價值的平衡。\n\n2.社會發展與政治理想：君主制度的演進，從我為你作主的專制，到你們為主的民主，雖然經歷數千年的起起伏伏，但在社運大同篇的理想，以及孟子說：「民為貴，君為輕，社稷次之」的反轉思緒，均在平衡百姓生活幸福的道路上。\n\n3.自然美學與人為美學：自然美起源於老莊哲學，也興盛於魏晉南北朝，並在品味上探求人生的價值與意義；人為美則來自古代生活經驗，包括孔子的「里仁為美」，孟子的「充實之謂美」，莊子的「至真則美」，老子的「善為美」等等，都在說明人民在生活進化中的經驗，有益於生命價值與理想的主張。\n\n4.禪學與美學：源自宗教信仰，如心經的「真實不虛」，以及印度教中的種姓制度，以神秘思想做為追求心靈平靜，再造未來世界的富有(包括物質與精神的)，並建造心靈的幸福城堡，不斷在抑制人性的慾望之餘力，求精神上的富有，在虛空求實，在景象中求意的過程，故事的發生不論是六祖的「悟」或佛陀的神化，都在宗教信仰中化為藝術美的力量。\n\n5.圖騰與圖像的應用，來自各族群對於自然物與社會性的崇拜與記憶，如回教之幾何圖案，基督教的十字架，佛教的卍，或中國的龍，印度的象，以及泛靈中的鵝卵石，或飛禽、走獸等，都成為氏族的信仰與文化。如印度文化中崇拜太陽神的毗須努、須瓦派，以及崇拜月神的沙克提派。\n\n6.經典儀式、巫術與祭壇：着重在文字思想的文明傳遞，如孔孟思想、佛道經文之中闡述了人性造境的意涵與價值，四書五經明確簡直，道德經、南華經內在修養，以及佛經的論文等。而宗教儀式，配合巫術與祭祀的進行，凝聚大眾情思，並傳達人性的過程，成為文化特徵與價值。\n\n7.神靈、偶像與藝術：教堂是西方宗教信仰的聚會所，也是祭祀與祈福的地方，從建築設計、室內設計、到傢俱陳設，除了神像供奉外，作為安魂詩唱的表演器上鑲上細巧藝術品，包括在可能的範疇下，如天主教的玫瑰窗必定朝向東方，以攝取朝陽彩光，增強教堂內的神祕氛圍等等，以此前推，東方的印度廟宇，中國的各地廟堂宗祠，則是文化的傳習中心，既有心靈的寄託與崇拜，所設計的建築物均是人文精神與藝術的結合體，更為歷史、社會與生活價值的縮影。\n\n8.擬人化的物象：如繪畫中的四君子畫、六君子畫、三友畫，不論是空谷幽蘭，勁節高風，或松柏長青等等人格轉換，都有它的歷史與故事。就如象徵財神的象頭神，除了中國有此定位外，印度文化也以它為財富的象徵；乃至福祿壽，或天官賜福，八仙過海的傳說，除了擬人化的情節外，更有教化人性的意涵。\n\n9.家庭倫理、婚姻制度、風俗語言：此為人類繁衍生命的章典規範，一則是天下大地自然規律，以應日月星辰、陰陽互動的發展；二則是社會倫理與秩序的建立，維護優生傳承文化，以增強民族自強的健康文明等等人為措施，如中華文化中的婚姻制度都在力求血統的關係，或通婚之禮儀，或明定婚姻法的實施，其中血統倫理的嚴格規定，促發文化進展的軌跡，是文化經驗中最具自動遵守的規範，尤其在東方文化長河上展現浪花。\n\n10.藝術創作與表現：如詩經、古典文學中的詩、歌詞曲、小說中的經典創作。─封神榜、七侠五義，楚辭、水滸傳、三國演義、西遊記、紅樓夢、西廂記等等，而如印度的「羅庫耶郎」史詩，或各項經典著作，不僅是文化傳承的內容，更是文化豐富內容的現場。尤其以藝術作為人類情智的代表，各項繪畫作品，或各項的壁畫與雕塑，所反應的精神文明與社會價值，構成強大的文化力量。\n\n(二)\n\n一、策展角色\n\n1.策展人。指的是一項展覽的研究者，在主題確定後，有關學   理、教育、展品或研究成果的綜合承辦人，權責則是該項展覽是否成功的角色，其中有關經費、參觀人數或品質，都得有紀律的規定。通常指的是研究者，或是主持者的專業人員，可能是研究費(    )或是館長等等。\n\n2.策展主題：指的是博物館或美術館依其性質訂定年度計畫，或中長期計畫作為策展主題，並經指定專業人員從事研究，以其主題要求進行展出前後的評論成果收集。通常在年度計畫中由館長在會議分配研究人員進行策展工程。其中包括經費來源、效果評論以及品質展現，學術交流等活動。\n\n3.策展計畫：依受予展出主題之內容與呈現方式，作為該案執行預定表，其中應有展品選件、場地設計、觀眾預估、經費來源；邀請對象、教育場次、安全保險、衍生展出、宣傳媒體、合作單位、開幕貴賓、學者專文，或市場機制等等的程序與執行。\n\n4.藝術美學原則：展覽場藝術設計，與美學呈現事策展人必須深切研究，不論是自然科學、或人文科學，以藝術美作為環境佈置的標準，是最基本的條件，例如考古遺跡的重建，或文人生活的書房布置，以及市場文化的重現等等，不僅有原物(文物品)亦應該有造景造境的美學呈現。否則，失去引人入勝視覺美，展覽現場將失去效能。\n\n5.策展主題的選擇與規劃：均在前述之中提及博物館依其專題風格計畫策展。那麼本節則應在東方美學議題，試舉下列的項目，此供策展研究。\n\n其一、宗教文化、民俗文化\n\n其二、茶文化、竹文化……\n\n其三、插花文化、造景文化……\n\n其四、燈會文化、婚紗文化\n\n其五、裝飾品文化、珠寶文化\n\n其六、…",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 15,
            "note": "課堂專題報告、評論與討論"
        },
        {
            "type": "課堂討論參與",
            "weight": 15,
            "note": "課堂專題報告、評論與討論"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 60,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}