{
    "year": 108,
    "term": 1,
    "name": "綠色設計專題",
    "teachers": [
        "曾俊儒"
    ],
    "department": "TM68",
    "code": "VDC8005",
    "credit": 3,
    "serial": 3130,
    "group": "",
    "quota": {
        "limit": 40,
        "additional": 2
    },
    "schedule": [
        {
            "day": 5,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "設計系2A教室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "綠色設計專題",
    "goals": [
        "Special Topics in Green Design"
    ],
    "syllabus": "This course is aimed for anyone that would like to learn how to design and launch a new product with the lowest environmental footprint. It also assesses the role of ICT (Information and Communication Technologies) in the sustainable development of the electrical and electronics goods manufacturing sector in Taiwan and the world. The negative environmental impact of current consumption patterns is increasing and becoming more evident. A growing number of governments and Non-Governmental Organisations (NGOs) are focusing on solving this problem. Technological advances and consumer fashions mean that electrical and electronic goods have shorter lives resulting in a dramatic increase in the quantities of these products in landfill sites. In the UK, 76% of TVs and 95% of vacuum cleaners are either land-filled or incinerated. In 1998, British homes and business threw out nearly a million tonnes of electrical and electronics equipments including computers. According to the DTI (2002), the total annual electrical and electronic waste in the UK is estimated to be more than 900,000 tonnes. Computers workstations and systems account for nearly 14% of this and ‘white goods’ over 30% reuse and recovery could greatly reduce this waste. A research study of the industry and academic representatives was conducted previously to discuss the contents of this scoping study on the problem. It was found that most of the work to date on sustainable products has been carried out by Japanese and US multi-national companies. Therefore, the following design topics for sustainability will be discussed in this course:\n\n*   Environmentally conscious products\n*   Environmentally conscious production\n*   Environmentally conscious management\n*   Product recovery\n*   Procurement and logistic issues\n*   Product usage\n*   Packaging and distribution\n*   Waste management",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "實地考察、參訪",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 30,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 30,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}