{
    "year": 110,
    "term": 2,
    "name": "文化創意產業研究",
    "teachers": [
        "廖世璋"
    ],
    "department": "EM02",
    "code": "SOC0147",
    "credit": 3,
    "serial": 418,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 10,
            "to": 12,
            "campus": "本部",
            "classroom": "教710"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "文化創意產業是國內近幾年較為新的研究領域，文化研究從批判理論轉折至文化經濟研究，在後現代社會中以新經濟之姿，發展成為許多城市地方發展重要的文化及經濟發展策略。  本課程將以文化創意產業理論為主軸，為有系統的教導其相關研究之專業課程，課程將對相關之理論、概念、文化法規、現況發展等作全面性的介紹，讓同學先有一個全面性的瞭解，並訓練朝向「文化創意產業經理人」（Cultural and Creative Industries Manager）發展及其所需要具備的專業知識。  本課程除了將一般性的介紹與文化創意產業相關的研究基礎，讓同學瞭解文化創意產業發展的歷史脈絡；社會學發展歷史脈絡下的文化經濟學；經濟學概念下的文化經濟學；文化經濟與文化產業之關係；文化產業與城市地方再生間之關係：並從文化創意、文化行銷、文化經營等角度分析，也可從實務經驗出發回溯解析背後的理論及概念。  本課程除了在課堂上介紹國內外相關文化創意產業的事件或案例之外，並將在課堂上即時補充國外（以美國為主）正在同步進行中的文化創意產業計畫、策略及作法，包括：文化產業政策、文化建設計畫、藝術節慶策略、城市行銷方法、古蹟再利用與文化產業、博物館產業化、社區藝術產業營造與生產等，所以在課堂上授課講述之部分案例將會與世界同步。  本課程不考試，書籍資料閱讀及討論是課堂重點，原則上除了同學閱讀報告外，授課老師將針對每一個單元提出目前現況的實際案例，在課堂上除了理論的報告及反思之外，並與實務案例進行相互交叉討論，讓理論與實務能相互回饋。",
    "goals": [
        "文化創意產業相關理論之研析",
        "文化創意產業國內外重要案例的分析",
        "國內外文化創意產業發展趨勢的研析",
        "培養初步「文化創意產業經理人」（Cultural and Creative Industries Manager）的人才發展（文創中介人才）及其所需要具備的專業知識。"
    ],
    "syllabus": "**110-2****文化創意產業研究課程大綱**\n\n廖世璋老師\n\n**壹、課程設計重點**\n\n**一、本課程本學習開課之後，預計要再二、三年之後，才會再次開設本課程。**\n\n**二、本課程主要分成三大部分進行設計：**\n\n1.文化創意產業實務技術。\n\n2.文化創意產業理論。\n\n3.文化創意產業反思及批判。\n\n**三、本課程也計畫培養國內文化創意產業最缺少的人才：「文化創意產業經理人」（文化部稱為「文化中介人才」）。**\n\n**貳、每週單元**\n\n**一、文化創意產業實務技術（6****週）**\n\nWeek 1 授課重點、文創全球概況\n\n1.全球文化創意產業發展分析（全球五大洲及各文創產業分析）\n\n2.文化創意產業經理人（廖世璋（2015）。以「文化資本概念」對文化創意產業經理人之研究。產業與管理論壇，17（1），48-79。）\n\n3.國內文創產業發展問題分析（文化部文創司之文創問題專題演講）\n\nWeek 2 文創產業通論、文創產品、市場與創意\n\n廖世璋（2011，5刷）。文化創意產業。新北市：巨流圖書公司。（國立臺灣師範大學外審傑出專書）\n\n1.文化、產業、經理概念（文化概念、文化創意產業、文化創意產業經理人）\n\n2.文化創意產品（文化創意產品類型與組合、文化創意產品開發、文化創意產品風險、文化創意產品與文化品牌之關係）\n\n3.文化創意產業（文化創意產業市場、文化創意產業鏈、文化創意產業群聚）\n\n4.文化創意（文化創造力、文化創意思考、符號創造與日常生活）\n\nWeek3 文創品牌與行銷\n\n5.文化品牌（品牌符號學、品牌概念、文化品牌經營）\n\n6.文化行銷（文化行銷的基本概念、「PCRV」行銷組合、符號行銷）\n\n7.文化行銷企劃（有形的文化創意產品行銷企劃、藝術文化節慶活動之行銷企劃、綠色行銷企劃）\n\nWeek4 文創經營\n\n8.文化創意產業專案（產品及品牌生命週期整合規劃、智慧財產權及藝術授權、專案管理）\n\n9.文化創意產業組織（文化組織與組織文化、關鍵績效指標、組織的管理知識、學習型組織）\n\n10.地方文化產業經理（社區經理的「四生」概念、地方文化產業及社會企業、地方自主營造模式）\n\n**Week5****文創「元宇宙」與NFT****（非同質化代幣，Non-fungible tokens****）專題**\n\nChen, Kevin陳根（2022）。元宇宙Metaverse：連接虛擬和現實，開啟無限可能性。台北市：博碩。\n\n1.元宇宙曙光初現（元宇宙從哪開始？、從「元」到「元宇宙」、網際網路的終極形態、加速出圈的元宇宙）\n\n2.誰在驅動元宇宙？（算力重構：搭建元宇宙、5G：雲宇宙的網路底座、人工智慧：成就元宇宙的「大腦」、數位孿生：元宇宙的雛形）\n\n3.打造元宇宙經濟系統（「 區塊」和「鏈」、NFT推動區塊鏈進入元宇宙、解決元宇宙的關鍵問題、區塊鏈之未完成）\n\n4.虛擬技術鋪墊關鍵路徑（XR正在進化、虛擬實境走向市場、VR生活仍有未竟之路、虛擬的未來混合現實、全息時代在崛起）\n\n5.源於遊戲超越遊戲（遊戲的藝術、遊戲是元宇宙的呈現方式、Roblox：基於UGC生態拓展元宇宙邊界、Axie Infinity：構建元宇宙閉環經濟系統、Fortnite：虛實交互走向元宇宙）\n\n6.一級玩家花落誰家（偽風口還是真未來？元宇宙市場有多大？網際網路巨頭佈局元宇宙、技術大廠搶佔元宇宙市場）\n\n7.元宇宙需要制定憲章（通往未來元宇宙、創建元宇宙猶存困境、亞健康的元宇宙、元宇宙價值新取向、從現實中來到現實中去）\n\n**Week6** **文創「IP****」及其產業鏈專題**\n\n文化創意產業「IP」（Intellectual property）及其產業鏈分析報告（學生自選關心主題與報告）\n\n**二、文化創意產業理論（4****週）**\n\nWeek7 文化創造與文化產業理論\n\n1.Verganti, Roberto著/呂奕欣譯（2011）。設計力創新。臺北市：馬可孛羅。\n\n2.Hesmondhalgh, David (2007). The Cultural Industries. New York: Sage Publications Ltd.（Hesmondhalgh, David著/廖珮君譯（2008）。文化產業分析。新北市：韋伯。）\n\nWeek8 文創產業的消費文化理論\n\n3.Chris, Barker (2008). Cultural Studies: Theory and Practice. Sage Publication.（Chris, Barker著/羅世宏譯（2010）文化研究：理論與實踐（二版）。台北：五南。）\n\n4.Featherstone, Mike(2007). Consumer Culture and Postmodernism.NTC: Sage Publications Ltd.（Featherstone, Mike著/趙偉妏譯（2009）。消費文化與後現代主義。新北市：韋伯。）\n\nWeek9 文創產業的流行文化理論\n\n5.高宣揚（2002）。流行文化社會學。台北市：揚智文化。\n\n6.Hills, Matt(2004). Fan Cultures. UK: Routledge.（Hills, Matt著/朱華瑄譯（2009）。探究迷文化。新北市：韋伯。）\n\nWeek10 文創產業的符號消費理論\n\n7.星美克野（1988）。符號社會的消費。台北市：遠流。\n\n8.李幼蒸（2007）。理論符號學導論（第三篇「一般符號學」、第四篇「文化符號學」）。北京：中國人民大學出版社。。\n\n**三、文化創意產業批判與反思（6****週）**\n\nWeek11 文化消費批判與反思\n\n1.Baudrillard, Jean著/林志明譯（2018）。物體系。台北市：麥田。（林志明，譯後記：一個閱讀）\n\n2.Storey, John (1999). Culture Consumption and Everyday Life, Oxford University Press.（Storey, John著/張君玫譯（2001）。文化消費與日常生活。新北市：巨流。）\n\nWeek12 大眾流行文化批判與反思\n\n3.Storey, John (2021). Cultural Theory and Popular Culture: An Introduction 3/e. New York: Routledge.（Storey, John著/李根芳、周素鳳譯（2003）。文化理論與通俗文化導論。新北市：巨流。\n\nWeek13 符號消費批判與反思\n\n4.Lash, Scott and Urry, John (1994). Economies of Signs and Space, Sage Publication. （趙偉妏譯（2012）。符號與空間的經濟分析。新北市：韋伯。）\n\n5.Tomlinson, John, (1999). Globalization and Culture. University of Chicago\n\nPress.（鄭棨元、陳慧慈譯（2007）。文化與全球化的反思。新北市：韋伯。）\n\nWeek14 文化觀光批判與反思\n\n6.Urry, John and Larsen, Jonas (2011). The Tourist Gaze 3.0. New York: Sage Publications Ltd.（Urry, John and Larsen, Jonas著/黃宛瑜譯（2016）。觀光客的凝視3.0。台北市：書林。\n\nWeek15 期末報告\n\nWeek16 期末報告\n\n**參、評量方法**\n\n文獻研析：50 %\n\n出席及參與討論實況：20%\n\n報告及期末報告：30％\n\n**附錄：**\n\n一、本課程鎖定文化創意產業中的文創關鍵產業之相關案例：\n\n1.流行文化產業（文創政策中流行文化的重要性。BTS空降美國告示牌冠軍寫下K-POP歷史新頁 曝防彈少年團創造南韓GDP\"0.3%\"產值（22：43）（5：12開始講GDP）。[https://www.youtube.com/watch?v=IJi0Bux3xf8](https://www.youtube.com/watch?v=IJi0Bux3xf8)。）\n\n2.文創IP（什麼是IP?文創產業新革命！（10：06）[https://www.kingshine.com.tw/news-detail.php?sn=24](https://www.kingshine.com.tw/news-detail.php?sn=24)。\n\n3.文化觀光產業。（同學較為熟悉，在此受限篇幅不放案例）\n\n二、文化創意產業相關研究論文可思考方向（含目前臺灣已經出現的碩博士論文題目）：文化創意產業促進地方經濟、服務品質與遊客滿意度探討地方文化館經營管理創意生活產業競爭力指標、台灣文化產業策略～以數位休閒娛樂產業為例、台灣木製家具產業文化之研究-以器物層次為範疇、桃米生態村永續發展策略之研究、設計文化因素、創意生活產業遊客體驗與遊客滿意、購買行為關聯性、文化園區永續經營、振興地方產業、文化節之意象構築、在地認同與主體性、文創體驗及體驗行銷、文化價值與文創購買行為、藝企合作、兩岸文創政策比較博物館IP、國家品牌政策及問題、流行文化的文創研究（偶像劇、韓流）、動漫產業的文創產業變動、疫情的文創變動、地方產業與社會關係（柚子產業文化）、觀光客的凝視城市文化資產、文化產業與社會關係（雲門演出等）、文創產業政策比較研究（整體政策、個別產業政策、電視動漫等）、文創法規分析、文創產業分析、文創市場分析、文創園區經營、文創品牌研究、文創行銷（策略、方法、模式）、新媒體與文創、文創IP、文化商品開發模式、文創授權、文創符號、文化消費（文創消費者滿意度調查、文創消費批判）、文創批判、文創全球化、文創治理、文創館舍經營、地方文創產業與地方創生（文創與地方、社區發展）、文創價值鏈分析、文創轉型（地方特產、一般產業）、文創與古蹟再利用、民族（客家、原住民、中國各族等）與文創、新科技與文創（原宇宙等）、文創設計運用、文創故事、文創敘事、文化觀光（含觀光工廠經營、體驗、行銷）、文化民俗節慶模式分析、文創手做經濟（創意市集、DIY經濟）、文創整合行銷傳播、文創永續經營、文創投資、文創的地方參與、文創的文化因素、文創指標、文創消費統計、文創教育課程設計、文創商品代言與購買意願、文創產業群聚（華山、松菸等）、文創電影分析、新媒體獲利模式（網紅）、新媒體與公共關係改變（梗圖）、文創補助、藝術村行銷、文創消費行為、博物館文創化研究、宗教文創化、文化資本與文創、設計風格與文創、文化認同與文創商品、文化創意思考（方法與策略）、文創投資（投資、融資、信貸）、文創空間（產業及園區經營、文化地理學異質空間批判）、文創轉譯運用（文學、國畫、圖騰、易經）、文創成功因素（商業模式）、文創創業、文創媒體、文創城市品牌城市行銷、文創空間設計、文創消費支出、文創藝術品拍賣、文創群眾募資、文創觀光。\n\n三、期末報告同學可選擇自己有興趣的類型進行實證案例的資料收集、分析及報告，範圍包括：\n\n（1）流行音樂文化產業（K-POP、哈日、美國流行音樂、中國好聲音等）\n\n（2）電影文化產業（007、星際大戰等好萊塢電影文化產業、寶萊塢電影文化產業、台灣電影文化產業等）\n\n（3）社會企業的文化產業（非營利組織的文化產業、地方社區文化產業、弱勢族群文化產業經營、少數民族文化產業等）\n\n（4）神明文化產業（媽祖文化產業、關聖帝君文化產業、電音三太子文化產業、聖誕節文化產業、萬聖節文化產業等）\n\n（5）身心靈文化產業（國內外瑜伽文化產業、算命文化產業、生態、綠活及樂活等綠色文化產業、其他身心靈休閒文化產業等）\n\n（6）美食料理文化產業（泰國菜、韓國菜國內外美食文化產業等）\n\n（7）地方特色族群文化產業（國內外各少數民族文化產業、客家文化產業、原住民文化產業等）\n\n（8）地方文化觀光產業（國內外各種文化觀光產業等）\n\n（9）文化資產文化產業（世界文化遺產產業化、國內化各歷史城鎮、歷史地區、歷史老街、古蹟及歷史建築聚落再利用、等文化資產再利用重要案例分析）\n\n（10）博物館文化產業（國內外明星博物館、生態博物館、博物館文化園區、觀光工廠、零售商店類博物館化、超級大展等案例分析）\n\n（11）大型會議及展覽產業（國際會議、台北花卉博覽會、文化創意產業博覽會、旅展、家具博覽會、國內外各腫國際大型會議及展覽文化產業等）\n\n（12）文創IP及其衍生商品之產業鏈、商業經營模式研究。\n\n（13）元宇宙文創產業。\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=3c2c87f6eca047b78d205adb66203d8a&fno=6ecd59c9021544339375776c7bb064e7)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "由老師講述文化創意產業的相關理論、概念、重要案例、目前全世界發展的況狀與時勢等。"
        },
        {
            "type": "討論法",
            "note": "針對老師及同學的報告及議題，進行討論及分享。"
        },
        {
            "type": "媒體融入教學",
            "note": "播放全世界的成功案例及幻燈片方式進行授課。"
        },
        {
            "type": "專題研究",
            "note": "期末繳交研究報告。"
        },
        {
            "type": "其他",
            "note": "同學需要自行研析重要的文化創意產業文獻。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 50,
            "note": "文獻研析"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "參與討論"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "出席率"
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "報告及期末報告"
        }
    ],
    "prerequisite": "",
    "general_core": []
}