{
    "year": 110,
    "term": 2,
    "name": "數位學習與資訊素養",
    "teachers": [
        "王雅鈴"
    ],
    "department": "EM02",
    "code": "SOM0146",
    "type": "選",
    "grade": null,
    "credit": 2,
    "serial": 411,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "教710"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "This seminar is designed to provide a foundational overview of theories and research on e-learning for seniors and intergenerationality. Topics to be covered include the differences between traditional learning and e-learning, culture, gender, and individual differences regarding online learning, acceptance and barriers of technology use for older adults as well as digital games for intergenerational learning. To maximize the benefit that students get from the seminar, students are required to complete a review regarding each topic before class. Aside from pre-course readings, students are required to engage in guided in-class activities and discussions. Also, in order to cultivate students’ ability to raise an issue, address a research question, and develop a research proposal, at the end of the seminar, a mini-conference activity is built into the course.",
    "goals": [
        "Understand the trend of digital learning and its application in adult teaching",
        "Able to ask questions about doubtful points in the paper and express ideas courageously.",
        "Be able to propose research topics and methods for the field of digital learning."
    ],
    "syllabus": "**授課教師**\n\n**與課程時間**\n\n**授課教師：王雅鈴**\n\n教育大樓732；分機：3815\n\nEmail: ylwang47@gapps.ntnu.edu.tw; ylwang47@ntnu.edu.tw\n\n**上課時間、地點：**\n\n每週三2-4節（10:20-12:10）\n\n**教學進度與主題**\n\n**Presentation**\n\n1.  2/16\n\n**Introduction**  \n\n1.  2/23\n\n**Special Issues: Culture, Gender, and Individual Differences**    \n\n1.  3/2\n\n**Aging Smart Together ! (I)**\n\n(Collaborative/ Group-based Project)\n\nOral Presentation\n\n1.  3/9\n\n**行動學習****(Mobile learning)**\n\n1.  3/16\n\n**Aging Smart Together ! (II)**\n\n(Collaborative/ Group-based Project)    \n\nOral Presentation\n\n1.  3/23\n\n**遊戲式學習****(Game-based learning)**\n\n1.  3/30\n\n**擴增實境****(Augmented reality, AR)**\n\n1.  4/6\n\n**科技在多模教學中之運用****(I)**\n\n台師大英語系\n\n劉宇挺特聘教授\n\n1.  4/13\n\n**科技在多模教學中之運用****(II)**\n\n台師大英語系\n\n劉宇挺特聘教授\n\n1.  4/20\n\n**資訊與非資訊領域學生程式設計學習觀點、學習策略與自我效能之關聯分析**\n\n輔大英語系\n\n周德嬚助理教授\n\n1.  4/27\n\n**華語文教學及批判思考寫作數位學習技術之發展**\n\n台師大心輔系\n\n張雨霖助理教授\n\n1.   5/4\n\n**教學實況錄影應用於數位學習的效用**\n\n文化大學休閒事業管理學位學程\n\n郭彥谷副教授\n\n1.  5/11\n\n**當遊戲遇到學習：談遊戲化學習與教學應用**\n\n台師大資教所\n\n陳志洪教授\n\n1.  5/18\n\n**眼球追蹤方法應用於數位學習研究**\n\n台師大學習科學學位學程\n\n蔡孟蓉教授團隊\n\n1.  5/25\n\n**Mini Conference (I): Oral & Poster Presentation**\n\n台師大學習科學學位學程\n\n林宗進助理教授\n\n16\\. 6/1\n\n**Mini Conference (II): Oral & Poster Presentation**\n\n台師大學習科學學位學程\n\n林宗進助理教授\n\n17\\. 6/8\n\n彈性補充教學\n\n\\*\\*數位工具輔助教與學、文獻搜尋\\*\\*\n\n配合二週彈性課程，本專題請同學搭配自主學習、三校聯盟圖書館資源及線上資源，自行找時間學習Endnote (自主學習時間至少為三小時，並於期末報告中附上學習證明)，並將成果於期末報告撰寫時之使用。\n\n18\\. 6/15\n\n彈性補充教學\n\n\\*\\*數位工具輔助教與學、文獻搜尋\\*\\*\n\n配合二週彈性課程，本專題請同學搭配自主學習、三校聯盟圖書館資源及線上資源，自行找時間學習Endnote (自主學習時間至少為三小時，並於期末報告中附上學習證明)，並將成果於期末報告撰寫時之使用。",
    "methodologies": [
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "實地考察、參訪",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "出席",
            "weight": 25,
            "note": "Attendance and Class Participation\nAttendance is required. Repeated failure to attend lectures or discussion may result in a lowered semester grade. Participation in class discussions also counts. \n\nStudents will be required to complete a review and raise a question regarding weekly topics before class. In doing so, students will earn points each week for their contributions to class discussions.\n\nExamples: \n\t2~3(points)*4(Reading Previews) = 8~12 points\n\tRaising one good question or discussion will earn 1 extra point. If you participate in class discussions 10 times thorough the whole semester, you will get 10 points."
        },
        {
            "type": "報告",
            "weight": 40,
            "note": "Collaborative/ Group-based Project(Paper Reading & Wise Aging Life)\n1.\tPaper Reading\nThis assignment will be marked as collaborative or group-based. Students must work with the other members in the group including hosting discussion or presenting in class. Each group is required to select a topic related to e-learning and review latest research papers for class discussion.\n2.Aging Smart Together\n(1)Please investigate at least three organizations or groups that provide senior services with digital technology. (2)Also explore the special issues and problems when we provide services or design digital devices for older adults may keep in mind. What are your solutions? Present the findings with your classmates on Week 3 & Week 6."
        },
        {
            "type": "成果展覽",
            "weight": 35,
            "note": "Mini Conference: Oral Presentation\nEach student is required to propose his research ideas or questions and discuss with the lecturer during the midterm week. Research topics may focus on relevant theories or methods in the fields of e-learning. Please submit the abstract onto MOODLE in the 12th week and be prepared to share them at the end of the semester. \n\nTry to limit the abstract to a short paragraph (about 300 words) and prepare for a 10-15 min presentation. Each abstract and presentation will be graded based on clarity, coherence, relevance, and originality."
        }
    ],
    "prerequisite": "",
    "general_core": []
}