{
    "year": 111,
    "term": 1,
    "name": "專題討論（三）",
    "teachers": [
        "曾瑋玲"
    ],
    "department": "SD44",
    "code": "ESD0053",
    "type": "必",
    "grade": 2,
    "credit": 1,
    "serial": 2648,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 8,
            "to": 9,
            "campus": "公館",
            "classroom": "Ｓ101"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限本系(含雙主修)、輔系修習   ◎限博二修習 ◎課程開放上修",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "",
    "goals": [
        "the course is designed to provide students with the latest progress in earth sciences via a series of lectures; there are also sessions for students to present their own research result which aim to help"
    ],
    "syllabus": "＊＊＊ Druration: 16 weeks\\*\\*\\*\n\nFaculty members in charge of this course regularly (typically once a week) invite scholars and researchers, in the field of earth sciences (including its sub-fields such as geology, geo-physics, astronomy, atmospheric sciences, and oceanography), from other universities and institutes in Taiwan or overseas to offer lectures on their recent research and latest results. Discussions will also take place after the lectures. The objectives of this course are to provide graduate students with the knowledge and understanding about recent development and research trends in the field of earth sciences.  \n \n\nLectures. Journal papers, Presentation material of the speakers",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": ""
        },
        {
            "type": "Group discussion",
            "note": ""
        },
        {
            "type": "Lab/Studio",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "other:",
            "weight": 100,
            "note": "attendance, discussion"
        }
    ],
    "prerequisite": "◎Exclusive for students within this department(including dual degree program) ◎Exclusive for students taking minor within this department    ◎Exclusive for second year of doctoral program ◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}