{
    "year": 108,
    "term": 1,
    "name": "外語習得",
    "teachers": [
        "孔繁偉"
    ],
    "department": "LM21",
    "code": "ENC3035",
    "credit": 3,
    "serial": 1645,
    "group": "C",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 5,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "勤301"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "Course Objective: On completion of this course, participants will have: \tdeveloped a critical awareness and understanding of the relevance of second language acquisition theories to the practice of second language teaching and learning.  Transferable skills: \tthe ability to make a critical analysis and assessment of relevant theory, empirical studies and practical applications; \tthe ability and knowledge required in order to engage in independent reflection and enquiry; \tgreater confidence and proficiency in oral and written communication \tthe ability to engage in creative thinking  Learning activities: Interactive lectures, whole-class discussion of topics, hands-on tasks, group- and pair-based discussion and problem solving, demonstrations, student-led presentations based on key readings, independent reading, library research.  Participants will be expected to contribute actively to the sessions.  Learning outcomes: In general, participants will be expected to: \thave an understanding of the theoretical rationales and principles behind different theories of SLA; \tbe able to critically appraise, adapt and implement different theoretical SLA frameworks to suit their own teaching/learning contexts; \tbe able to identify areas for personal research and development",
    "goals": [
        "To developed a critical awareness and understanding of the relevance of second language acquisition theories to the practice of second language teaching and learning"
    ],
    "syllabus": "**Objectives**\n\n1.  To learn the relationship between psychology, linguistics, and L2/FL language teaching and learning\n2.  To learn about recent brain research and its implications to teaching and learning of L2/FL\n3.  To learn about the basic tenets of humanistic approach and its implications to teaching and learning of L2/FL\n4.  To learn the basic tenets of language learning theory and its implications to teaching of L2/FL\n5.  To learn and understand the research in applied linguistics and its implications to teaching and learning of L2/FL\n6.  To learn alternative ways of teaching second and foreign languages\n7.  To learn to develop resource manuals based on SLA approaches\n8.  To learn to prepare, research, organize, and present an effective research presentation on L2/FL language teaching and learning\n\n1\\. Participation and attendance. You are expected to attend all classes. You are expected to complete all assigned readings before each class meeting and to participate in all class activities and discussions. You will be given numerous chances to participate in classroom discussions, however, it is your responsibility to demonstrate familiarity with the assigned texts. Pop-up quizzes may be used to test your familiarity with the readings. **Extra credit** will be offered for 2-3 page papers that describe and analyze invited lectures that will take place during the Spring semester and relate them to class readings and discussions.\n\n 2. Group presentations. Throughout the semester, each of you will participate in a few group presentations, whereby the group in question is expected to prepare a set of data for analysis by your classmates (you can use the data from one of your learners or a literature reviewer of an important issue identified). You will distribute data handouts to your classmates, guide their analysis of your learner language data, then explain the analysis your group prepared ahead of time, and discuss how you would address these issues in the classroom. You will be graded on: (1) correctness and comprehensiveness of analysis; (2) appropriate use of new terminology; (3) teaching implications; (4) presentation structure and timing (presentations should be around **10-15 minutes**).\n\n3\\. Final paper. Please note that the timeline for the final paper is non-negotiable – late papers will not be accepted. Your final paper is a small action research project of your learner’s development and should include the following components:\n\nThe final project will be a **case study of an L2 learner** and will focus on a literacy-related area of interest for the participant(s) (30% of final grade). \n\nTopics may include, but are not limited to:\n\n\\-EFL/ emergent literacy in the native/primary language\n\n\\-EFL/ emergent literacy in the second language\n\n\\-EFL/ biliteracy in elementary grades\n\n\\-EFL/ native language literacy in the content areas\n\nThe final project will demonstrate how an EFL/ bilingual learner applies literacy strategies to his/her situation. The project will document how the participant _observed an EFL/ bilingual learner, recorded his/her performance, collected samples of the learner’s work, and documented literacy development_. _Participants_ will _relate readings, models of instruction, and other sources to critically analyze and discuss learner’s performance and to evaluate the effectiveness of the strategies_ that were _employed/observed._ \n\nThe final paper should contain the following components: \n\n(1) a cover page\n\n(2) introduction and literature review (approximately 5-6 pages);\n\n(3) methodology (approximately 2 pages);\n\n(4) results and discussion (approximately 3-4 pages);\n\n(5) conclusion with teaching implications (approximately 1-2 pages);\n\n(6) references in the APA format\n\n(7) Appendices: Transcripts, exercises, and the learner’s **consent form**\n\nThe recommended **total length** of the paper is 11-14 pages plus appendices. Please do not forget to number all the sections and also the pages.\n\nWeekly schedule (tentative and subject to change based on our progress):\n\nWeek 1 Course overview and introduction\n\nWeek 2 The role of L1 in acquiring an L2 (The study of SLA: Intro)\n\nWeek 3 Principles of language acquisition and development I (SLA and related fields: Chapter 2)\n\nWeek 4 Principles of language acquisition and development II (2nd & foreign language data: Chapter 3)\n\nWeek 5 Instructional strategies for scaffolding ELLs I (The role of L1 and others: Chapters 4 & 5)\n\nWeek 6 Instructional strategies for scaffolding ELLs II (Formal approaches to SLA: Chapter 6)\n\nWeek 7 Approaches to facilitating the development of an L2 I (Interlanguage: Chapter 8)\n\nWeek 8 Approaches to facilitating the development of an L2 II (Interlanguage in a context: Chapter 9)\n\nWeek 9 Teaching an L2 : theory and practice (Input, interaction & output: Chapter 10)\n\nWeek 10 Teaching L2 vocabulary: theory and practice (The lexicon: Chapter 13)\n\nWeek 11 Different aspects of SLA I (Chapters 11 & 14; Lightbown Chapters 3 & 4)\n\nWeek 12 Different aspects of SLA II (Beyond the domain of language: Chapter 12)\n\nWeek 13 L1 and L2 for SLA (Lightbown Chapter 1)\n\nWeek 14 Linguistic and cultural considerations of teaching and learning an L2 I (Lightbown Chapter 2)\n\nWeek 15 Linguistic and cultural considerations of teaching and learning an L2 II (Lightbown Chapter 5)\n\nWeek 16 Conversational competence: theory and practice in SLA (Lightbown Chapters 6-7)\n\nWeek 17 Final presentations I \n\nWeek 18 Final presentations II",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Weekly lecture"
        },
        {
            "type": "討論法",
            "note": "Group discussion"
        },
        {
            "type": "合作學習",
            "note": "Group work and presentation"
        }
    ],
    "grading": [
        {
            "type": "期末考",
            "weight": 40,
            "note": "Final paper"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "Group discussion"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Attendance"
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "Group presentations"
        }
    ],
    "prerequisite": "",
    "general_core": []
}