{
    "year": 108,
    "term": 1,
    "name": "文化與英語教學",
    "teachers": [
        "孔繁偉"
    ],
    "department": "LM21",
    "code": "ENC3045",
    "credit": 3,
    "serial": 1647,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 4,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "雲202"
        }
    ],
    "programs": [],
    "comment": "上課教室在雲和街大樓二樓，地址為雲和街1號(位於雲和小火鍋斜對面、Cafe a la mode正對面)，從師大側門右轉看見Starbucks右轉進入巷子步行約2分鐘(130公尺)，右手邊就會看到雲和街大樓，亦可使用Google Maps APP查詢位置。請同學使用學生證感應，進出雲和街上課教室。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "This graduate course provides an overview of current issues in English language education with a particular focus on issues in culture, the development of World Englishes and the roles of Non-native English speaking teachers (NNEST) in ELT.  The course will encourage students to reflect critically about the relations between language, power, social and cultural practices, and to explore topics of their own interest.",
    "goals": [
        "Gain knowledge about some of the main issues in culture and politics discussed in the field of English language education.",
        "Understand theories, perspectives, and arguments related to the above issues.",
        "Explore how the theories, perspectives, and arguments can be incorporated in a potential research study of one’s own interest.",
        "Develop deeper awareness of the roles of Non-native English speaking professional in the ELT field."
    ],
    "syllabus": "### COURSE DESCRIPTION:\n\nThis course examines the different theories and practices in teaching ELLs at beginning, intermediate and advanced levels within the framework of culture and ELT.  Approaches to literacy instruction will be explored, using theories, research, and current methods for bilingual and biliteracy development.  We will also examine the role of cultural practices in the development of biliteracy and multiliteracy. Participants will evaluate their practices in light of the course content, generate new approaches, and draft appropriate outcomes for literacy instruction for ELLs. \n\n**COURSE OBJECTIVES:**\n\n1.   Through course readings and class discussions, expand the understanding and awareness of biliteracy and multiliteracy development and practices, language and cultural issues critical to the effective methodology and instructional practices for students learning in two or more languages.\n\n2.   Review L1 (Native Language Art) and L2 (English Language Art) or L3 acquisition process.\n\n3.   Become familiar with current research and theories about L1 (NLA) and L2 (English) language acquisition, reading acquisition and the stages of development.\n\n4.   Students will develop a plan for implementing process-oriented biliteracy and multileracy activities, bilingual materials and appropriate methods of assessment and evaluation for the case study. \n\n5.  Students will understand the socio-cultural nature of language and its implication for the classroom within the framework of world Englishes.\n\n COURSE REQUIREMENTS  \n\n**1****.  Demonstration of thoughtful completion of readings:**\n\nParticipants are expected to complete the reading assignments prior to the class and should be prepared to discuss them in class (announced one week prior to the meeting). With partners, present and lead a discussion in class on one of the topics.  \n\n**2\\.  Field visits (conference day) and reflective responses:**\n\nParticipants will go to two international conferences (weeks 3 & 8) in applied linguistics & TESOL and write a reflective response for each visit.\n\n**3.  Research Project/ Case Study:**\n\nThe final project will be a **case study of an ELL (or more)** and will focus on a literacy-related area of interest for the participant. \n\nTopics may include, but are not limited to:\n\n\\-EFL literacy in the native/primary language or FL from a sociocultural framework\n\n\\-Taiwan's EFL education policy in regard to the framework of world Englishes\n\n\\-biliteracy or multiliteracy in elementary grades or high school\n\n\\-native language literacy in the content areas (Taiwan's CLIL or EMI policy in higher education)\n\nThe final project will demonstrate how an ELL (or more) applies literacy strategies to his/her situation. Topics are open to what's been included in this course within culture and ELT. This case study will showcase your ability to conduct independent research at a small scale linking theory and practice to foster your critical thinking skill. \n\nClass schedule\n\nThe core texts will be two textbooks along with a reading packet of journal articles selected thematically (EIL, ELF, world Englishes, language & cultural identities, native & non-native English speakers, intercultural communication, language, race and power...etc).  Topics will be integrated into the following themes (subject to change based on our progress and need):\n\nWeek 1.      Introduction\n\nWeek 2.      Language variation & what is language? (Mooney et al. (2011) chapter 1)\n\nWeek 3.      Conference day\n\nWeek 4.      Language thought and representation (Mooney et al. (2011) chapter 2)\n\nWeek 5.      Language and politics (Mooney et al. (2011) chapter 3)\n\nWeek 6.      Spring break\n\nWeek 7.      Faces of bilingualism (Bialystok (2001) chapter 1)  \n\nWeek 8.      Conference day\n\nWeek 9.      Starting with one language (Bialystok (2001) chapter 2)  \n\nWeek 10.    Midterm presentation \n\nWeek 11.    And adding another  (Bialystok (2001) chapter 3)  \n\nWeek 12.    Language in the mind (Bialystok (2001) chapter 4) \n\nWeek 13.    Thinking about language (Bialystok (2001) chapter 5)  \n\nWeek 14.    Link to literacy (Bialystok (2001) chapter 6)  \n\nWeek 15.    Beyond language (Bialystok (2001) chapter 7)  \n\nWeek 16.    The extent of the bilingual mind (Bialystok (2001) chapter 8)  \n\nWeek 17.    Final presentation \n\nWeek 18.    Final presentation",
    "methodologies": [
        {
            "type": "講述法",
            "note": "The course will be offered in a seminar format with a combination of mini-lectures and class discussions."
        },
        {
            "type": "討論法",
            "note": "The course will be offered in a seminar format with a combination of mini-lectures and class discussions."
        },
        {
            "type": "合作學習",
            "note": "Each week, there will be a student facilitating a topic discussion."
        },
        {
            "type": "專題研究",
            "note": "A final case study is required at the end of this course."
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": "Student-led Discussion"
        },
        {
            "type": "出席",
            "weight": 15,
            "note": "Class participation"
        },
        {
            "type": "報告",
            "weight": 15,
            "note": "Class presentation"
        },
        {
            "type": "專題",
            "weight": 40,
            "note": "Final project: midterm oral presentation 10%, written paper 30%"
        }
    ],
    "prerequisite": "",
    "general_core": []
}