{
    "year": 110,
    "term": 1,
    "name": "東亞區域專題研究",
    "teachers": [
        "張碧君",
        "莊仁傑",
        "王冠雄",
        "關弘昌",
        "田正利"
    ],
    "department": "ID83",
    "code": "EAD0003",
    "credit": 3,
    "serial": 1388,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "東亞系第二教室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "重視東亞區域研究方法與歷史發展。",
        "採取跨區域的比較視野與研究。",
        "要求同學必須撰寫評論及專題論文。",
        "進行東亞區域研究比較，並放在全球視野中進行比較。"
    ],
    "syllabus": "**【授課方式：16週】(Course Duration: 16 Weeks)**\n\n◆本課程大綱（授課進度、評量方式、參考書目等）僅供參考，實際授課安排依上課情形或授課老師發放之課程大綱為準◆\n\n(This course outline is subject to change. Please refer to the syllabus available in the first week of this course. Thank you.)\n\n**Teacher: Kuan-Hsiung WANG, Prof.**\n\n**1\\. Nature of South China Sea Disputes**\n\n\\[Reading List\\]\n\nMark J. Valencia, Jon Van Dyke, and Noel A. Ludwig, _Sharing the Resources of the South China Sea_ (University of Hawaii, 1999). Chapter III.\n\nA preliminary understanding the nature of disputes of the South China Sea.\n\n**2. Latest Developments of the SCS Disputes**\n\n\\[Reading List\\]\n\nSerafettin Yilmaz, “Island Development and Reclamation in South China Sea: A Comparative Study of the Activities of China, Vietnam, and the Philippines”. 2015. https://www.researchgate.net/publication/287196097\\_Island\\_Development\\_and\\_Reclamation\\_in\\_South\\_China\\_Sea\\_A\\_Comparative\\_Study\\_of\\_the\\_Activities\\_of\\_China\\_Vietnam\\_and\\_the\\_Philippines.\n\nHoang Thi Ha, “Pitfalls for ASEAN in Negotiating a Code of Conduct in the South China Sea”, _Perspective_, Issue 2019, No. 57 (23 July 2019).\n\nViet Hoang, “The Code of Conduct for the South China Sea: A Long and Bumpy Road”, _The Diplomat_, (28 September 2020).\n\nThe purpose of this week is to understand the latest developments in the South China Sea disputes. Two developments will be focused: one is the land reclamation projects, and the other is about the negotiation of the Code of Conduct for the South China Sea.\n\n**3\\. Taiwan’s Role in the Disputes**\n\n\\[Reading List\\]\n\nKuan-Hsiung Wang, “From Dangerous Ground to Safe Playground: A Revisit to Fishery Co-operation in the South China Sea”, Chinese (Taiwan) Yearbook of International Law and Affairs, Vol. 34 (2016), pp. 20-38.\n\nThe purpose of this week is to touch upon two issues: one is the possible cooperation for the parties to the South China Sea disputes, the other one is Taiwan’s role in this possible cooperation.\n\n**Teacher: Chengli TIEN**\n\n**1. Introduction on the Theories of International Trade and Investments**\n\n\\[Reading List\\]\n\n1\\. International Economics: Theory and Policy (GE), 2015 (10e) or 2018 (11e), Paul R. Krugman, MauriceObstfeld, Marc J. Melitz, Pearson Education.  \n2\\. International Business: The Challenge of Global Competition, 2012 (13e), Don Ball, J. Michael Geringer, Jeanne M. McNett, Michael S. Minor, McGraw-Hill Education.\n\nThe purpose of this week is to introduce this section for the following three weeks as well as fundamental theories of international trade and investments, including gravity model, comparative advantage and internalization.\n\n**2. Introduction to the Methods for Case Analysis**\n\n\\[Reading List\\]\n\nHandouts/to be continued\n\nThe purpose of this week is to introduce the fundamental methods to analyze cases. These methods include SWOT, BCG and Five-Forces Analysis.\n\n**3. Case Presentations**\n\n\\[Reading List\\]\n\nCases to be announced\n\nThe purpose of this week is to wrap up this section with students' presentations on the assigned cases.\n\n(The info above for Tien's section is subject to change. Thank you.)\n\n**Teacher:** **Henry Chong Ren Jie**\n\n**1. Migration as a Perspective**\n\nMigration is a common phenomenon in East Asia. How could we do research by perspective of migration?\n\n**2\\. Fieldwork as a Method**\n\nFieldwork is not only the main method for anthropology and sociology but also becomes much more popular in history, political science, and others. Today, we will discuss how to conduct a fieldwork and related skills such as oral interview by the study of the Chingay parade in Johor Bahru.\n\n**3. Tricks of the Trade**\n\nHow can we understand precisely and thoroughly our research subjects and the phenomena they present? In this week, we will explore these tricks that help us to do our research better.\n\n**Teacher: Pi-Chun CHANG**  \n**1\\. 東南亞做為《區域》的形成**\n\n\\[Reading List\\]\n\n1\\. Reynolds, Craig J. Ch. 1 “A New Look at Old Southeast Asia” in Seditious Histories: Contesting Thai andSoutheast Asian Pasts.  \n2\\. Reynolds, Craig J. Ch. 2 “Paradigms of the Premodern State” in Seditious Histories.  \n3\\. 吳小安，〈試論歷史上的東南亞國家與國家形成: 形態、屬性和功能〉，載《亞太研究論叢》，北京：北京大學出版社，2008年，第5輯, 頁244-264。\n\n**2\\. 戰前與戰後的東南亞社會**\n\n\\[Reading List\\]\n\n1\\. Sidel, John T. “Social Origins of Dictatorship and Democracy Revisited: Colonial State and Chinese Immigrantin the Making of Modern Southeast Asia.”  \nComparative Politics, Vol. 40, No. 2 (Jan., 2008), pp. 127-147  \n2.《比較的幽靈》第三部分 東南亞：比較研究\n\n**3\\. 研究東南亞的視角**\n\n\\[Reading List\\]\n\n1\\. Goh, Beng-Lan. “Moving Theory and Methods in Southeast Asian Studies” in Methodology and ResearchPractice in Southeast Asian Studies  \n. Palgrave Macmillan, 2014. pp. 27-43  \n2\\. Chua, Beng Huat. “Inter-Referencing Southeast Asia: Absence, Resonance and Provocation” in Methodologyand Research Practice in Southeast Asian Studies . Palgrave Macmillan, 2014. pp. 273-288.  \n3.《台灣東南亞研究新論：圖象與路向》第二章 東南亞研究的三種亞洲視點：在地論、跨國論與亞洲作為方法/邱炫元\n\n**Teacher: Hung-Chang KUAN**\n\n**1\\. Chinese Citizens and Democracy**\n\nYida Zhai. Remarkable economic growth, but so what? The impacts of modernization on Chinese citizens’political satisfaction. _International Political Science Review_ Vol. 37(4) 533–549. (2016)\n\nNarisong Huhe, Min Tang, and Jie Chen. Creating Democratic Citizens: Political Effects of the Internet in China. _Political Research Quarterly_ Vol. 71(4) 757–771. (2018)\n\n**2\\. China in the Eyes of Foreign Publics**\n\nFrancis L.F. LEE, WANG Haiyan and ZHANG Fan. Are Foreign Publics Interested in News about China? Analysis of a Cross-National Survey. _China: An International Journal_ Vol.14 (4) 1-21. (2016)\n\nThomas J. Scotto, and Jason Reifler. Getting tough with the dragon? The comparative correlates of foreign policy attitudes toward China in the United States and UK. _International Relations of the Asia-Pacific_ Volume 17, 265–299. (2017)\n\n**3\\. Political Effects of Trade with China**\n\nScott L. Kastner. Buying Influence? Assessing the Political Effects of China’s International Trade. _Journal of Conflict Resolution_ Vol. 60(6) 980-1007. (2016)\n\nCharles Miller and Helen Taylor. Can economic interests trump ethnic hostility? Trading ties versus outgroup hostility in Australian perceptions of China as a security threat. _International Relations of the Asia-Pacific_ Volume 17, 67–99. (2017)",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "Lecturing"
        },
        {
            "type": "Group discussion",
            "note": "Discussion"
        },
        {
            "type": "Media, audio, visual materials",
            "note": "Multimedia for some modules"
        }
    ],
    "grading": [
        {
            "type": "Class discussion involvement",
            "weight": 15,
            "note": "Class participation"
        },
        {
            "type": "Attendances",
            "weight": 15,
            "note": "Attendance"
        },
        {
            "type": "Presentation",
            "weight": 70,
            "note": "Term paper/presentation"
        }
    ],
    "prerequisite": "◎Unavailable for M.A. program students (M.A. program courses excepted) and B.A. program students.",
    "general_core": []
}