{
    "year": 107,
    "term": 1,
    "name": "公民與社會（公民）教學實習（教）",
    "teachers": [
        "陳素秋"
    ],
    "department": "EU07",
    "code": "CEUE011",
    "credit": 2,
    "serial": 852,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 6,
            "to": 9,
            "campus": "本部",
            "classroom": "誠大樓公團部"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大四修習",
    "form_s": "4",
    "classes": "1",
    "dept_group": "",
    "hours": 4,
    "description": "本課程是延續公民與社會教材教法課程之後，另一重要師培課程。整個課程內容包括三個階段：第一個階段要師培生到國高中見習，觀摩第一線教師的實際教學；第二階段為校內試教，試教範圍包括現行國高中公民與社會各單元；第三階段則為外埠教學參觀，印證教學理論與教學策略，每一個階段環環相扣，建構一套完整的師資培育體系。\n本課程為全學年教學實習之上半階段，學生透過此課程 1. 能精進公民教學的專業知識 2. 能嫻熟公民教學的策略與技巧 3. 能有效運用公民教學相關資源 4  能增進對公民教學的信心與使命感 5. 能應用所學於未來教學生涯",
    "goals": [
        "能精進公民教學的課程教學專業知識",
        "能嫻熟公民教學的策略與技巧",
        "能增進對公民教學的信心與使命感",
        "能應用所學於未來教學生涯"
    ],
    "syllabus": "第一週 課程簡介\n\n第二週 教案設計與試教準備\n\n第三週 教案設計與試教準備\n\n第四週 第一組試教（第一輪）國中公民\n\n第五週 第二組試教（第一輪）國中公民\n\n第六週 第三組試教（第一輪）國中公民\n\n第七週 第四組試教（第一輪）國中公民\n\n第八週 第五組試教（第一輪）國中公民\n\n第九週 第六組試教（第一輪）國中公民\n\n第十週 第一組試教（第二輪）高中公民與社會\n\n第十一週第二組試教（第二輪）高中公民與社會\n\n第十二週第三組試教（第二輪）高中公民與社會\n\n第十三週第四組試教（第二輪）高中公民與社會  \n第十四週第五組試教（第二輪）高中公民與社會\n\n第十五週第六組試教（第二輪）高中公民與社會\n\n第十六週 補試教\n\n第十七週 補試教\n\n第十八週 期末檢討",
    "methodologies": [
        {
            "type": "合作學習",
            "note": "校內分組試教，培養團體合作精神"
        },
        {
            "type": "實地考察、參訪",
            "note": "校內試教前現場教學見習與外埠教學參觀活動"
        },
        {
            "type": "其他",
            "note": "1. 教學實務見習 見習時間：自9月20日起至10月01日止至敦化國中進行為期兩周的教學實務見習公民見習每組依實際選修人數而定，每組選定二位老師，每位老師各見習兩週，每週一節課（同一班級）。 每組推選組長一人，小組長中再推選一人為分科召集人，每班由一位分科召集人與兩位小組長負責聯繫見習事宜。 每週見習均需撰寫見習報告。 每組需繳交見習生資料卡給國中指導老師，資料卡需有個人資料簡介、見習班級、見習時間，並附照片。 見習時須著大學服，儀容整潔，須穿著襪子，且不得穿著拖鞋、涼鞋、露腳跟鞋、長統馬靴等。 2. 分組教案設計與試教 每組六人，每位同學本學期必須上台試教國中公民、高中公民與社會各一次，每次試教時間20分鐘。 教案設計與試教採分組合作學習方式，每組六人。舉凡教學單元選定、教學活動構思、教案設計與撰寫等均須由全體小組成員共同參與、協力完成；個人試教單元於上課前抽籤決定。 公民教案需從南一版第1-6冊中，每組選定一冊六課（六單元）撰寫，每課教案之預定授課時數為二節（實際試教僅擇其中20分鐘內容）。童軍教案依據版本另定。 教案需使用多元教學法，並納入視聽媒體教學；但實際試教時須利用替代方案，可自製教具，但不得使用視聽媒體或電腦。 每位同學試教前必須先進行小組內試教演練。 教案須於試教前一週完成，並影印分送教師與同學（第一組同學於試教當日分送即可）。 試教不理想者，須於期末進行再試教。 所有組別教案需繳交電子檔案給分科負責人，期末統一燒錄光碟。 3. 團體討論與分享 每週試教後進行90分鐘的團體回饋與意見分享，提供試教者改進教學之參考。 非試教同學須針對每位試教者填寫試教回饋表。 4. 教師補充說明與回饋"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 40,
            "note": "校內分組試教"
        },
        {
            "type": "報告",
            "weight": 60,
            "note": "每一組繳交國中和高中各一冊教案"
        }
    ],
    "prerequisite": "",
    "general_core": []
}