{
    "year": 111,
    "term": 1,
    "name": "流行病學的數理模型（一）",
    "teachers": [
        "陳建隆"
    ],
    "department": "SU40",
    "code": "MAC9046",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 2791,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 2,
            "to": 4,
            "campus": "公館",
            "classroom": "Ｓ202"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "9",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        ""
    ],
    "syllabus": "This course would like to attract students who are interested in mathematical models and their applications to various mathematical models of infectious diseases. The mathematical models provide approaches to studying how mathematical concepts could help us in investigating the spread of infectious pathogens (e.g., viruses, bacteria) through dynamic populations. There are three main objectives:\n\n(1) Basic principles of mathematical models in infectious disease epidemiology\n\n(2) Mathematics and methods required for studying these mathematical models in epidemiology.\n\n(3) Applying mathematical models to existing data as little projects/experiments (e.g., math. models vs. growth of HIV, Covid-19 infectious population respectively). \n\nSchedule and Topics\n\nWeeks 1-10:\n\nPart I. Basic Concepts of Mathematical Epidemiology\n\n1.  Introduction to Mathematical Epidemiology\n2.  Simple Compartmental Models for Disease Transmission\n3.  Endemic Disease Models\n4.  Epidemic Models\n5.  Models with Heterogeneous Mixing\n6.  Models for Diseases Transmitted by Vectors\n7.  Discussions of Exercises and Reports\n\nWeeks 11-14 :\n\nPart II. Models for Specific Diseases\n\n1.  Models for Tuberculosis.\n2.  Models for HIV/AIDS\n3.  Discussions of Exercises and Reports\n\nWeeks 15-16: Project Studies (in Working Groups) and Reports of Topics.\n\nWeeks 17-18: Students study online materials and discuss \n\n\\========================================\n\n本課程希望吸引對數學模型及其在各種傳染病數學模型中的應用感興趣的學生。數學模型提供了研究數學概念如何幫助我們調查傳染性病原體（例如病毒、細菌）通過動態種群傳播的方法。有三個主要目標：  \n(1) 傳染病流行病學數學模型的基本原理  \n(2) 在流行病學中研究這些數學模型所需的數學和方法。  \n(3) 將數學模型作為小項目/實驗應用於現有數據（例如，數學模型分別與 HIV、Covid-19 感染人群的增長）。\n\n時間表和主題  \n第 1-10 週：  \n第一部分 數學流行病學的基本概念數學流行病學導論疾病傳播的簡單隔間模型  \n地方病模型  \n流行病模型  \n具有異構混合的模型  \n載體傳播疾病模型  \n練習和報告的討論\n\n第 11-14 週：  \n第二部分。特定疾病模型  \n結核病模型。  \n艾滋病毒/艾滋病模型  \n練習和報告的討論\n\n第 15-16 週：項目研究（在工作組中）和主題報告。\n\n第 17-18 週：學生學習在線材料並討論。",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "In this course, we will teach the basic principles and knowledges of related mathematical models and algorithms with examples."
        },
        {
            "type": "Group discussion",
            "note": "The key points of the related studying topics are discussed in groups by students."
        },
        {
            "type": "Lab/Studio",
            "note": "The students of the course will report in groups the related algorithms for each selected mathematical models."
        },
        {
            "type": "Case studies",
            "note": "The students of the course will report in groups the related algorithms and computer programs for each selected topics."
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 30,
            "note": "The students will need to do the home works of mathematical models and its applications to various mathematical models of infectious diseases."
        },
        {
            "type": "Midterm Exam",
            "weight": 30,
            "note": "We will give an exam. to test the students for the study of basic related mathematical models and knowledges."
        },
        {
            "type": "Case study reports",
            "weight": 40,
            "note": "For each group students will read and give a report of selected exercises and related topics of mathematical models of infectious diseases."
        }
    ],
    "prerequisite": "",
    "general_core": []
}