{
    "year": 110,
    "term": 1,
    "name": "電子電路",
    "teachers": [
        "丁玉良"
    ],
    "department": "HU71",
    "code": "ITU0165",
    "credit": 3,
    "serial": 1245,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "科技系TC411"
        }
    ],
    "programs": [
        "太陽能源與工程學程"
    ],
    "comment": "",
    "restrict": "",
    "form_s": "1",
    "classes": "1",
    "dept_group": "",
    "hours": 3,
    "description": "首先介紹基本之電學概念，及相關原理，亦包括各種基本電子元件，其特性和在電路上之運用。接著說明電子電路之簡單設計與製作之概念，及其應用。除了訓練學生具備基本電路電路計算、分析和設計之能力，並訓練其簡單實作。其次能將這些能力應用在日常生活。",
    "goals": [
        "在電子電路理論方面，培養學生瞭解各種電子電路元件之特性及基本電子電路分析計算之能力。",
        "在實用技術方面，培養學生如何實作電子電路的知識與技能，及簡易電子電路之線路設計及應用。"
    ],
    "syllabus": "課程教學理念：  \n1.本課程以Learning By teaching(中文翻譯為「教中學」)的模式進行授課(以下簡稱LBT)：  \nLBT的教學模式指上課同學在選定主題後,可以透過探索各種資源(網路、紙本...)來獲取知識,並以小組報告的形式將你所學到的知識內容教給全班同學。  \n不同於以前大家可能聽聞過的翻轉教室，在這門課中，從教材的準備、安排到實作活動的設計、教授都是由各主題負責的組別決定，老師和助教們在課程中的角色就是在旁邊協助大家、分享經驗，並如有必要時導正觀念而已，我們原則上「不會」主動進行授課。  \n本課程欲培養同學從「自己理解」的層次提升到「教會他人理解」此更高一層的能力。畢竟這裡是大學，不是以前國高中，對於知識的追求除了被動接受外，主動確定知識主題，及尋找、探索、及建構知識，並透過分組報告的模式，進行知識交換的過程去挖掘新知，我們相信這才是大學課程存在的目的。  \n最根本地說：這門課看似有課綱，但實際上學到什麼，是由每學期的學生與老師共同討論與決定詳細內容，學理上這種課程稱為協商式課綱(negotitated syllabus)。  \n2.工具很重要，但工具背後代表的精神更重要：工具很重要，因為它們能幫助我們完成很多事情。但在技術不斷進步的情況下，無論什麼科目，學習其的邏輯概念比起工具導向式的學習更為重要。  \n3.這堂課裡，各位需要透過問問題以及探索，才能得到你所需的答案：  \n「問問題」是什麼？讓你得到想要的答案，又或者是一個無意義的行為？  \nAsking a good question is a good training practice! When you think about the question and formulate the question, you will probably know the answer quite well, knowing how to find the solution and what the solution would be.  \n我們覺得，「得到你想知道的」，才是大家問問題的動機！所以在課堂上，希望學生能夠透過精確的問題，讓老師帶給你更多的知識以及思考。   \nThe teaching by asking question is to make sure that the question will motivate students and they are willing to take the ownerships. Thereafter, students will explore the related knowledge and answer the question.  \n一堂良好的課程，希望是建立在師生與同儕間的緊密學習互動，在LBT的課綱建構下，希望大家竭盡全力設計每學期的課程，然後在課堂上一來一往的過程中創造Learning By teaching下的最佳學習效益\n\n授權碼發放順序：  \n1\\. 科技系本系該學期所屬開課班級學生  \n2\\. 科技系本系延畢或經轉學入學之大專生：依年級順序發放  \n3\\. 具生活科技領域資格之碩博班師資培育生或教育學程生身分者：不論碩博，依年級順序發放，並以科技所學生優先  \n4\\. 科技系本系非所屬開課年級學生：依年級順序發放  \n5\\. 科技系本系該學期與所屬開課班級同年級但非同班級之學生  \n6\\. 具科技系輔系資格，且身分為109學年前(不含109學年)生效：依年級順序發放  \n7\\. 具科技系輔系資格，且身分為109學年後(含109學年)生效：依年級順序發放，並以本校學生優先  \n8\\. 具科技系預修生資格，且身分為111學年後(含111學年)生效：依年級順序發放  \n9\\. 具太陽能源與工程學程資格：依年級順序發放  \n※同一順位內如額滿，將採抽籤方式決定  \n※曾修課但因故被當者「不會」因此具優先權，請注意！  \n※本課程除符合以上順位者外，不受理外系(校)學生加簽，另不受理跨修課程申請表、旁聽申請。如有疑問或特殊狀況，請與開課教授聯絡。\n\n課程內容及上課方式：  \n這門課身為大一的系上共同必修，主要目的希望建構大家對電子零件最基本的認識。然而我們不是機電系；不是資工系；更不是電機系，所以這門課絕非照本宣科地將電子學、電路學……等大學基本電子電路知識拿出來當教條上，而是透過Arduino和一些電子零件、電子模組，透過自己搭建一個有「實際功能」的電路，進而感受機電整合的力量，為後續系上程式類或設計類課程搭建橋樑。  \n承襲LBT的精神，學期初我們會帶著大家認識全班，並透過一些測驗幫助大家對建立課程有所瞭解。接續我們會將最基本的觀念用講解的方式帶給全班。當我們上完基本概念後，全班依組別就要挑選和Arduino有關的知識，將其介紹給全班，同時需要搭配實作課程活動讓全班透過實作來體驗及學習該知識與相關應用，實作課程應有任務性及創意性，而非重複完全相同的實作過程。最後會有一個期末專題，主要將大家這學期所有學習到的知識進行整合後，製作一個有實際功用或是學習新知與應用的機器數位或實體成品(甚至是利用TinkerCAD進行模擬)，讓大家感受電子電路的力量。  \n不過，縱然LBT的本質是將原本老師的角色還給大家，不過我們也需要確認大家的課程品質，所以各組上台授課前，原則上助教會和大家先約時間幫大家看看上課內容提供建議，事後老師也會講評，中間如果有什麼需要也都可以找助教們！請大家不需過度擔心上課品質的問題！  \n此外，這門課會有大量的實作，而且我們鼓勵大家利用能在教室的時間，好好地使用這裡面的所有資源！不過在這堂課上，希望大家能夠去珍惜教室裡的零件：在實作前，能夠事先模擬的部分，就先做模擬，零件雖然可以拿來做實驗，但也是有限器材，希望大家在使用電子零件實從中學習，即使失敗，也能知道自己的問題在哪，並與他人分享自己失敗的經驗，讓他人避免錯誤，從實驗中學習、試錯，讓自己學到更多，並與同儕一同成長。也因為會有實作，環境整潔的維持是很重要的。前面評分提到的上課環境分數就會在這邊適用啦！詳細的規則會在開學時和大家說明。  \n最後，這門課希望大家自行攜帶筆電，以利課程順利進行！\n\n評分方式：  \n這門課程會有90%的成績主要整合：「1. 上課實作成果(課堂被動參與) 2. 各組LBT成果(課堂主動參與) 3. 期末專題」進行評分，至於詳細的比例，在每學期課程進度確認後會再和大家說明，屆時也會隨同上課情況進行調整。  \n另外10%是行政分數，包含：不定時上課點名、上課環境分數(上面有提到)等，另外如果有特殊表現，也會加至這部份滿分止。",
    "methodologies": [
        {
            "type": "講述法",
            "note": "講述電路理論的相關原理，介紹各種電路元件之特性及基本電路分析計算之能力，以培養學生具有運用科技解決問題之能力"
        },
        {
            "type": "討論法",
            "note": "透過分組討論以激發學生對新科技之好奇心與培養勇於嘗試和接觸之態度，並加深學生於課堂所習得的相關知能"
        },
        {
            "type": "問題解決教學",
            "note": "透過問題解決教學策略以協助學生如何安全用電的知識，及透過實作解決生活中常見電路運作問題"
        },
        {
            "type": "合作學習",
            "note": "透過合作學習策略以設計期末的報告活動，讓學生透過小組分工合作的方式進行規劃、設計、製作與討論"
        },
        {
            "type": "實驗/實作",
            "note": "透過探索與工程設計等方式進行實驗與實作學習"
        },
        {
            "type": "媒體融入教學",
            "note": "本課程將利用Moodle教學平台輔助教學，另將善用如影片及投影片等網路多媒體資源以提升學生學習成效"
        },
        {
            "type": "專題研究",
            "note": "期末需結合本學期所學，製作小型專題作品"
        },
        {
            "type": "其他",
            "note": "上課內容將會依實際上課進度之情況而作調整"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "出席情形與課堂相關表現"
        },
        {
            "type": "報告",
            "weight": 90,
            "note": "各組基本電路原理介紹、電子零件實作及期末專題，另須完成其他組別報告時所進行的實作活動"
        }
    ],
    "prerequisite": "",
    "general_core": []
}