{
    "year": 110,
    "term": 1,
    "name": "多媒體教材設計與製作",
    "teachers": [
        "丁玉良"
    ],
    "department": "HU71",
    "code": "ITU2053",
    "type": "必",
    "grade": 3,
    "credit": 3,
    "serial": 1259,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "科技系TC411"
        }
    ],
    "programs": [],
    "comment": "學習與科技組優先選課",
    "restrict": "",
    "form_s": "3",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "本課程將探討數位學習教學策略與多媒體教材設計原則，應用各類多媒體技術及工具與軟體製作多媒體教材。課程內容包括課堂理論講解與討論、相關應用教材說明、及數位教材的設計與製作。學期中及期末需繳交多媒體教材設計成品。",
    "goals": [
        "認識規劃與製作多媒體教材的流程",
        "知道如何撰寫多媒體教材設計腳本",
        "學會製作多媒體教材的技巧",
        "能夠上傳多媒體教材至網路伺服器"
    ],
    "syllabus": "課程教學理念：  \n1.本課程以Learning By teaching(中文翻譯為「教中學」)的模式進行授課(以下簡稱LBT)：  \nLBT的教學模式指上課同學在選定主題後,可以透過探索各種資源(網路、紙本...)來獲取知識,並以小組報告的形式將你所學到的知識內容教給全班同學。  \n不同於以前大家可能聽聞過的翻轉教室，在這門課中，從教材的準備、安排到實作活動的設計、教授都是由各主題負責的組別決定，老師和助教們在課程中的角色就是在旁邊協助大家、分享經驗，並如有必要時導正觀念而已，我們原則上「不會」主動進行授課。  \n本課程欲培養同學從「自己理解」的層次提升到「教會他人理解」此更高一層的能力。畢竟這裡是大學，不是以前國高中，對於知識的追求除了被動接受外，主動確定知識主題，及尋找、探索、及建構知識，並透過分組報告的模式，進行知識交換的過程去挖掘新知，我們相信這才是大學課程存在的目的。  \n最根本地說：這門課看似有課綱，但實際上學到什麼，是由每學期的學生與老師共同討論與決定詳細內容，學理上這種課程稱為協商式課綱(negotitated syllabus)。  \n2.工具很重要，但工具背後代表的精神更重要：工具很重要，因為它們能幫助我們完成很多事情。但在技術不斷進步的情況下，無論什麼科目，學習其的邏輯概念比起工具導向式的學習更為重要。  \n3.這堂課裡，各位需要透過問問題以及探索，才能得到你所需的答案：  \n「問問題」是什麼？讓你得到想要的答案，又或者是一個無意義的行為？  \nAsking a good question is a good training practice! When you think about the question and formulate the question, you will probably know the answer quite well, knowing how to find the solution and what the solution would be.  \n我們覺得，「得到你想知道的」，才是大家問問題的動機！所以在課堂上，希望學生能夠透過精確的問題，讓老師帶給你更多的知識以及思考。   \nThe teaching by asking question is to make sure that the question will motivate students and they are willing to take the ownerships. Thereafter, students will explore the related knowledge and answer the question.  \n一堂良好的課程，希望是建立在師生與同儕間的緊密學習互動，在LBT的課綱建構下，希望大家竭盡全力設計每學期的課程，然後在課堂上一來一往的過程中創造Learning By teaching下的最佳學習效益\n\n本課程授權碼發放順序為：  \n1\\. 科技系本系所屬開課年級學生，且屬學習與科技組者  \n2\\. 科技系本系非所屬開課年級學生，且屬學習與科技組者：依年級順序發放，且不受理低年級超修  \n3\\. 具生活科技領域資格之碩博班師資培育生或教育學程生身分者：不論碩博，依年級順序發放，並以科技所學生優先  \n4\\. 科技系本系且屬設計與科技組之學生：依年級順序發放，且不受理低年級超修  \n※同一順位內如額滿，將採抽籤方式決定  \n※曾修課但因故被當者「不會」因此具優先權，請注意！  \n※本課程除符合以上順位者外，不受理外系(校)學生(含具本系輔系、預修生資格)加簽，另不受理跨修課程申請表、旁聽申請。如有疑問或特殊狀況，請與開課教授聯絡。\n\n課程內容及上課方式：  \n這門課身為大三的學習科學組必修，主要在建構於系上電腦多媒體與數位學習課程等課程的基礎上，每組需利用自身經驗，完成一種多媒體教材的製作，並和全班介紹。另在此過程中逐步瞭解理論與實務銜接的困難與挑戰。多媒體教材不同於數位學習教材，除與數位學習結合外，近年來顯有實體授課內容引入多媒體教材的情況，甚有公司利用多媒體進行理念分享或甚至商業行為。這門課奠基於此基礎上，鼓勵大家以多元視角，進行相關教材之設計！  \n承襲LBT的精神，各組於本學期需完成一種多媒體教材的製作，將其和全班分享，並搭配實作課程讓全班實際操作。在此過程中會穿插一些多媒體教材的介紹與分享，透過理論與實務的同時洗禮，帶領大家進入多媒體教材的世界。這門課上課方式因課程需要會採取類似專題指導之形式進行，類似後續將進行之專題製作，請各位有心理準備，但也請放輕鬆：實際評分時無論規格大小，而是教學成效！  \n此外，系上近來為這門課添購許多器材，有很多器材甚至是新加入課程的生力軍。希望大家珍惜，並透過這些器材去瞭解各種傳播技術對多媒體教材的影響。從實作中學習、試錯，讓自己學到更多，並與同儕一同成長。  \n最後，這門課希望大家自行攜帶筆電，以利課程順利進行！\n\n評分方式：  \n這門課程會有90%的成績主要整合：「1. 上課實作成果(課堂被動參與) 2. 各組多媒體教材設計成果(課堂主動參與) 3. 期末專題」進行評分，至於詳細的比例，在每學期課程進度確認後會再和大家說明，屆時也會隨同上課情況進行調整。  \n另外10%是行政分數，由不定時上課點名等各種課程表現決定，另外如果有特殊表現，也會加至這部份滿分止。",
    "methodologies": [
        {
            "type": "講述法",
            "note": "講述多媒體教材設計與製作的概念"
        },
        {
            "type": "討論法",
            "note": "討論重要議題，分為全班討論與小組討論"
        },
        {
            "type": "問題解決教學",
            "note": "透過教學現場問題之探討，引導學生適當製作多媒體教材進行解決"
        },
        {
            "type": "合作學習",
            "note": "全班透過分組合作之方式，完成多媒體教材製作專案"
        },
        {
            "type": "實驗/實作",
            "note": "多媒體教材之實作"
        },
        {
            "type": "實地考察、參訪",
            "note": "針對特定議題，以適當形式安排考察，闢利學生了解實際應用之情形"
        },
        {
            "type": "媒體融入教學",
            "note": "本課程將利用Moodle教學平台輔助教學，另將善用如影片及投影片等網路多媒體資源以提升學生學習成效"
        },
        {
            "type": "專題研究",
            "note": "透過教師引導，進行分組多媒體教材的企畫與製作"
        },
        {
            "type": "其他",
            "note": "上課內容將會依實際上課進度之情況而作調整"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "出席情形與課堂相關表現"
        },
        {
            "type": "報告",
            "weight": 90,
            "note": "各組多媒體教材發表及其他組別多媒體教材體驗"
        }
    ],
    "prerequisite": "",
    "general_core": []
}