{
    "year": 110,
    "term": 1,
    "name": "電腦多媒體",
    "teachers": [
        "丁玉良"
    ],
    "department": "HU71",
    "code": "ITU2073",
    "type": "必",
    "grade": 2,
    "credit": 3,
    "serial": 1257,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "科技系TC411"
        }
    ],
    "programs": [
        "科技藝術學程"
    ],
    "comment": "",
    "restrict": "",
    "form_s": "2",
    "classes": "1",
    "dept_group": "",
    "hours": 3,
    "description": "本課程以綜合性的角度介紹各類與多媒體相關議題，如智慧材產權、多媒體種類(文字、圖片、聲音、影片、動話、及三D影片) 、多媒體技術、多媒體設備與規程等，讓學生對多媒體能有整體概念。之後進行課程主題，電腦多媒體製作，透過各種上述多媒體素材的製作方式，如拍攝多媒體影片，學習腳本的撰寫和相片、影片、聲音等多媒體的處理方式和表現技巧。課程內容包括每星期課堂討論以及課後電腦多媒體影片、網頁製作兩部份。期中多媒體企劃書說明，期末多媒體製作及製作過程報告，以分組方式進行，毎組同學須製作電腦多媒體。學期中需提出多媒體影片製作企畫書，學期末將舉行多媒體影片發表會。本課程需要多媒體素材的製作方式，如拍攝、製作影片、設計網頁等。",
    "goals": [
        "認識規劃與製作影片的流程",
        "學會如何設計劇本、撰寫影片腳本",
        "學會拍攝、剪輯影片的技巧",
        "學會製作多媒體的技巧",
        "能夠瞭解電腦多媒體製作目的"
    ],
    "syllabus": "課程教學理念：  \n1.本課程以Learning By teaching(中文翻譯為「教中學」)的模式進行授課(以下簡稱LBT)：  \nLBT的教學模式指上課同學在選定主題後,可以透過探索各種資源(網路、紙本...)來獲取知識,並以小組報告的形式將你所學到的知識內容教給全班同學。  \n不同於以前大家可能聽聞過的翻轉教室，在這門課中，從教材的準備、安排到實作活動的設計、教授都是由各主題負責的組別決定，老師和助教們在課程中的角色就是在旁邊協助大家、分享經驗，並如有必要時導正觀念而已，我們原則上「不會」主動進行授課。  \n本課程欲培養同學從「自己理解」的層次提升到「教會他人理解」此更高一層的能力。畢竟這裡是大學，不是以前國高中，對於知識的追求除了被動接受外，主動確定知識主題，及尋找、探索、及建構知識，並透過分組報告的模式，進行知識交換的過程去挖掘新知，我們相信這才是大學課程存在的目的。  \n最根本地說：這門課看似有課綱，但實際上學到什麼，是由每學期的學生與老師共同討論與決定詳細內容，學理上這種課程稱為協商式課綱(negotitated syllabus)。  \n2.工具很重要，但工具背後代表的精神更重要：工具很重要，因為它們能幫助我們完成很多事情。但在技術不斷進步的情況下，無論什麼科目，學習其的邏輯概念比起工具導向式的學習更為重要。  \n3.這堂課裡，各位需要透過問問題以及探索，才能得到你所需的答案：  \n「問問題」是什麼？讓你得到想要的答案，又或者是一個無意義的行為？  \nAsking a good question is a good training practice! When you think about the question and formulate the question, you will probably know the answer quite well, knowing how to find the solution and what the solution would be.  \n我們覺得，「得到你想知道的」，才是大家問問題的動機！所以在課堂上，希望學生能夠透過精確的問題，讓老師帶給你更多的知識以及思考。   \nThe teaching by asking question is to make sure that the question will motivate students and they are willing to take the ownerships. Thereafter, students will explore the related knowledge and answer the question.  \n一堂良好的課程，希望是建立在師生與同儕間的緊密學習互動，在LBT的課綱建構下，希望大家竭盡全力設計每學期的課程，然後在課堂上一來一往的過程中創造Learning By teaching下的最佳學習效益\n\n本課程授權碼發放順序為：  \n1\\. 科技系本系該學期所屬開課班級學生  \n2\\. 科技系本系非所屬開課班級之年級學生：依年級順序發放，且不受理低年級超修  \n3\\. 具生活科技領域資格之碩博班師資培育生或教育學程生身分者：不論碩博，依年級順序發放，並以科技所學生優先  \n4\\. 科技系本系該學期與所屬開課班級同年級但非同班級之學生  \n5\\. 具科技藝術學程資格：依年級順序發放，但不發予低於所屬開課班級之年級之學生  \n※同一順位內如額滿，將採抽籤方式決定  \n※曾修課但因故被當者「不會」因此具優先權，請注意！  \n※本課程除符合以上順位者外，不受理外系(校)學生(含具本系輔系、預修生資格)加簽，另不受理跨修課程申請表、旁聽申請。如有疑問或特殊狀況，請與開課教授聯絡。\n\n課程內容及上課方式：  \n這門課身為大二的系上共同必修，主要目的希望帶領大家瞭解各種多媒體表達的媒介、方式及效果。在課程內我們將探討各種現今多媒體表達方式，另外建構於LBT的精神下，我們將循大一電子電路作法，由班上分組介紹不同多媒體媒介與製作方式，讓大家在同儕教學中進行學習。  \n承襲LBT的精神，學期初我們會帶著大家簡單介紹各種多媒體媒介及表現方式，接續全班依組別就要挑選和多媒體有關的知識，將這種媒介或製作方式介紹給全班，同時需要搭配實作課程讓全班熟悉。最後會有一個期末作業，主要將大家這學期所有學習到的知識進行整合後，利用所學製作一個影片或多媒體內容，讓大家感受數位傳播的力量。  \n此外，這門課和電子電路一樣會有大量的實作，而且我們鼓勵大家利用能在教室的時間，好好地使用這裡面的所有資源！系上近來為這門課添購許多器材，有很多器材甚至是新加入課程的生力軍。希望大家珍惜，並透過這些器材去瞭解各種傳播技術的運作方式。從實作中學習、試錯，讓自己學到更多，並與同儕一同成長。  \n最後，這門課希望大家自行攜帶筆電，以利課程順利進行！\n\n評分方式：  \n這門課程會有90%的成績主要整合：「1. 上課實作成果(課堂被動參與) 2. 各組LBT成果(課堂主動參與) 3. 期末作業」進行評分，至於詳細的比例，在每學期課程進度確認後會再和大家說明，屆時也會隨同上課情況進行調整。  \n另外10%是行政分數，由不定時上課點名等各種課程表現決定，另外如果有特殊表現，也會加至這部份滿分止。",
    "methodologies": [
        {
            "type": "講述法",
            "note": "講述多媒體相關技術及各類型態之多媒體的重要概念"
        },
        {
            "type": "討論法",
            "note": "討論重要議題，分為全班討論與小組討論"
        },
        {
            "type": "問題解決教學",
            "note": "透過實際多媒體應用情境，帶領大家思考如何適當應用多媒體技術進行解決"
        },
        {
            "type": "合作學習",
            "note": "透過分組合作，思考如何向全班介紹各自組別所負責之多媒體技術，並思考適當之應用媒介及表現方式"
        },
        {
            "type": "媒體融入教學",
            "note": "本課程將利用Moodle教學平台輔助教學，另將善用如影片及投影片等網路多媒體資源以提升學生學習成效"
        },
        {
            "type": "專題研究",
            "note": "在各組分工下，研究各組所負責的多媒體方法或技術，並將其介紹給大家"
        },
        {
            "type": "其他",
            "note": "上課內容將會依實際上課進度之情況而作調整"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "出席情形與課堂相關表現"
        },
        {
            "type": "報告",
            "weight": 90,
            "note": "各組多媒體技術報告與實作設計，另需完成各組所提出之多媒體技術製作作業及個人學習作業"
        }
    ],
    "prerequisite": "",
    "general_core": []
}