{
    "year": 108,
    "term": 1,
    "name": "新興市場專題",
    "teachers": [
        "何宗武"
    ],
    "department": "OM56",
    "code": "IAM0032",
    "credit": 3,
    "serial": 2505,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "雲608"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "全球經濟的重心快速從已開發世界轉向新興市場, 本課程藉由中國大陸及新南向如越南市場等,分析討論進入新興市場之企業在攀向顛峰會面臨之挑戰與克服之要點。",
    "goals": [
        "知識與認知層面",
        "職能導向層面",
        "個人特質層面",
        "價值與倫理層面"
    ],
    "syllabus": "**Part I Economics and Finance**\n\n1 The Political Economy of Financial Development: A Review\n\n2 Role of Intermediaries in Providing Financial Access: Current and Future Research Trends\n\n**Part II Financial Technology**\n\n3 Digital Technologies and Pro-poor Finance\n\n4 Mobile Banking Adoption: Key Challenges and Opportunities and Implications for a Developing Country\n\n**Part III Digital Business**\n\n5 Hyper-localizing e-Commerce Strategy: An Emerging Market Perspective\n\n6 Exploring E-Business in Indian SMEs: Adoption, Trends and the Way Forward\n\n7 Opportunities and Challenges of Augmented Reality Shopping in Emerging Markets\n\n**Part IV Information Systems and Communication Technologies**\n\n8 Social Media Research in and of India: A Snapshot\n\n9 Readiness of Smart City: Emerging Economy Perspective\n\n**Part V Marketing**\n\n10 Adoption of Pro-poor Innovations in the Context of the Base of the Pyramid and Subsistence Marketplaces: Challenges, Opportunities and Research Agenda\n\n11 Branding for Bottom of the Pyramid: A Case of Branded Footwear Consumer in Indian Rural Setting\n\n12 Rurality in Flux: A Perspective on Rural Tourism Enterprise.\n\n**Part VI Management and International Business**\n\n13 Institutional Export Barriers on Exporters from Emerging Markets: Evidence from China\n\n14 Advances in Talent Management Research: A Review of Extant Literature\n\n15 Networking and Entrepreneurial Activity in Kuwait\n\n16 The Ethics and Governance of an Emerging Technology in an Emerging Market: The Case of Private Umbilical Cord Blood Banking in India\n\n17 Institutional Voids and Indian Automotive Industry: Challenges and Reflection\n\n18 Final exam",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Professor will lecture the main text"
        },
        {
            "type": "討論法",
            "note": "Students will prepare to present case studies since week 3, and group discussion will be presented."
        },
        {
            "type": "問題解決教學",
            "note": "Students have to propose solution for each case"
        },
        {
            "type": "合作學習",
            "note": "Team work will be highly valued"
        },
        {
            "type": "專題研究",
            "note": "Each team must lead case discussion in class"
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 25,
            "note": "Understand what the “emerging market perspectives” mean"
        },
        {
            "type": "期末考",
            "weight": 25,
            "note": "Able to apply basic analytical tools to case studies"
        },
        {
            "type": "課堂討論參與",
            "weight": 50,
            "note": "Each team must demonstrate their ability to lead cases studies."
        }
    ],
    "prerequisite": "",
    "general_core": []
}