{
    "year": 110,
    "term": 1,
    "name": "英文（一）",
    "teachers": [
        "多德"
    ],
    "department": "LU21",
    "code": "ENU0168",
    "type": "必",
    "grade": 1,
    "credit": 3,
    "serial": 1838,
    "group": "D",
    "quota": {
        "limit": 25,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "誠304"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "To introduce students to readings on a wide variety of themes",
        "To teach students how to think critically about the issues addressed in the readings",
        "To discuss, in English, the issues addressed in the readings",
        "To help students become familiar with new vocabulary and culture points and discuss how they are used in the readings",
        "To prepare students to be able to paraphrase passages from the readings and answer essay questions related to the readings"
    ],
    "syllabus": "**Overview:**  \nThis course has a number of goals:  \n1\\. To introduce students to readings on a wide variety of themes  \n2\\. To teach students how to think critically about issues addressed in the readings  \n3\\. To discuss, in English, the issues addressed in the readings  \n4\\. To help students become familiar with new vocabulary and how it is used  \n5\\. To prepare students to be able to paraphrase passages taken from the readings  \n6\\. To enable students to answer essay questions related to the readings. One or two class sessions will be devoted to each reading. There will be some lecturing, but the course is conducted primarily through discussing the main ideas the author is trying to express and to what extent the students agree or disagree with the author. Cultural points, vocabulary and grammar will be addressed as appropriate.\n\n**Schedule:**  \nRefer to the attached document for a tentative schedule.\n\n**Class Activities:**  \nLecturing / Presentations / Group and Class Discussions / Writing",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": ""
        },
        {
            "type": "Group discussion",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "other:",
            "weight": 100,
            "note": "ASSESSMENT Midterm Exam 30% Final Exam 30%  Quizzes & Homework 30% Participation 10%"
        }
    ],
    "prerequisite": "",
    "general_core": []
}