{
    "year": 110,
    "term": 1,
    "name": "英語教學概論",
    "teachers": [
        "羅美蘭"
    ],
    "department": "LU21",
    "code": "ENU0150",
    "credit": 2,
    "serial": 1866,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "正305"
        }
    ],
    "programs": [],
    "comment": "建議修習輔系第一年時選修",
    "restrict": "",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "Course Description: This is a one emester, 2 credit, mandatory course for English majors. The main objective of this course is to introduce you to theories and methods of teaching English to speakers of other languages. In this course, we will trace the historical development of second language teaching methods from grammar based curricula to present day interactive methods, where most of our focus will be placed. TESOL approaches and methods will be studied in their practical settings and in terms of their theoretical underpinnings. In addition to the theoretical focus, we will also discuss the practical aspects of teaching English as a foreign/second language. By the end of the course, you will be well-versed in applying major teaching methods that are currently being used in most EFL/ESL classrooms. teaching.",
    "goals": [
        "To introduce you to theories and methods of teaching English to speakers of other languages",
        "To trace the historical development of second language teaching methods from grammar-based curricula to present-day interactive methods",
        "To discuss the practical aspects of teaching English as a foreign/second language"
    ],
    "syllabus": "**Course Description**\n\nThis 2-credit course provides students with an initial overview of the field of English teaching from an interdisciplinary, multi-dimensional approach. The topics covered revolve around teaching techniques and procedures along with the underlying theories and principles.  \n\n**Required Text**\n\nNunan, D. (2015). Teaching English to speakers of other languages: An introduction. New York, NY: Routledge.\n\n(Available at 師大書苑02-83695556~8台北市和平東路1段182-3號2樓)\n\n**Grading Criteria**\n\nParticipation   \n\n20%\n\nIndividual Assignments (resume, autobiography, video link, 5 responses, reading note)\n\n30%\n\nGroup Presentation   \n\n20%\n\nFinal Project (ppt slides, 10-minute video link, 5 responses)\n\n20%\n\nFinal Reflection \n\n10%\n\n  \n**Tentative Schedule (Course Design:16+2 Weeks): Please refer to the pdf file.**",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 40,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 40,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}