{
    "year": 110,
    "term": 1,
    "name": "當代世界文學",
    "teachers": [
        "林秀玲"
    ],
    "department": "LU21",
    "code": "ENU0334",
    "type": "選",
    "grade": 2,
    "credit": 3,
    "serial": 1884,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 8,
            "to": 10,
            "campus": "本部",
            "classroom": "誠701A"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course is to introduce students to a number of major writers of the twentieth and twenty-first centuries from around the world. Their works will help the reader examine enduring topics such as love, suffering, redemption, humanity as displayed through novelistic imagination and narration, and, respectively and together, each work demonstrates the ways literature responds to its time. As each text addresses its specific social, historical, and political context, the course seeks to show how each literary text, with its particularity and uniqueness, can still be relevant to our specific setting and may help re-shape our perception and our understanding of “reality” and being.",
    "goals": [
        "1.\tThis course aims to provide students with a mapping of contemporary world literature and to encourage students to conduct a critical investigation on the novelistic perception of the contemporary."
    ],
    "syllabus": "**Contemporary World Literature**\n\n**Spring 2020**  \n\nInstructor: Jessie Shao 邵毓娟                  Email: [ycshao@ntnu.edu.tw](mailto:ycshao@ntnu.edu.tw)\n\nOffice: Cheng 808                             Tel: 77491786\n\n**I. Goals:**\n\nThis course is to introduce students to a number of major writers of the twentieth and twenty-first centuries from around the world. The selected works are meant to help students examine enduring topics such as love, suffering and redemption, historical trauma and legacy, and the complexity of humanity as displayed through novelistic imagination and narration. Respectively and together, each work demonstrates the ways literature responds to its time and looks into the difficulties people of different historical conditions were confronted with. As each text addresses its specific social, political, and existential context in particular, the course seeks to show how each literary text, with its particularity and uniqueness, can still be relevant to our specific setting and may help re-shape our perception and our understanding of reality and being. \n\n**II. Required Textbooks:**\n\n1.  _Disgrace_ by J. M. Coetzee\n2.  _The Unbearable Lightness of Being_ by Milan Kundera\n3.  Course pack\n\n**II. Tentative Syllabus:**\n\n**Week 1 (March 2):** Orientation\n\n**Week 2 (March 9):**\n\nTopic: Memory of Innocence?\n\nAssigned Readings: Selected Chapters from _The Museum of Innocence_ by Orhan Pamuk (Chapters 1-2, 8-11, 13, and 15); “Quotidian Utopia: Orhan Pamuk’s The Museum of Innocence and the Heritage of Love” by Tracy Ireland\n\n**Week 3 (March 16):**\n\nTopic: The Politics and Poetics of Collecting\n\nAssigned Readings: Selected Chapters from _The Museum of Innocence_ by Orhan Pamuk (Chapters 39, 51-55, 80-82); “Bridging the Gap between People and Things: The Politics and Poetics of Collecting in Pamuk’s _The Museum of Innocence_” by Hulya Yagcioglu\n\n**Week 4 (March 23):**\n\nTopic: The Western Gaze and Cultural Identity\n\nAssigned Reading: Excerpts from _Istanbul: Memories and the City_ by Orhan Pamuk (Chapters 1-5, 10, 19-20, and 25); Supplementary material: “Melancholy and _Huzun_ in Orhan Pamuk’s _Istanbul_” by Banu Helvacioglu\n\n**Week 5 (March 30):**\n\nTopic: Historical Legacies and Human Relationships\n\nAssigned Readings: _Disgrace_ by J. M. Coetzee (Chapters 1-8); “Introduction: From Victims and Perpetrators to Implicated Subjects” from _The Implicated Subject: Beyond Victims and Perpetrators_ by Michael Rothberg\n\n**Week 6 (April 6):**\n\nTopic: Historical Legacies and Human Relationships\n\nAssigned Readings: _Disgrace_ by J. M. Coetzee (Chapters 9-14); “Disgrace, Desire, and the Dark Side of the New South Africa” from _J. M. Coetzee and Ethics_\n\n**Week 7 (April 13):**\n\nTopic: Historical Legacies and Human Relationships\n\nAssigned Readings: _Disgrace_ by J. M. Coetzee (Chapters 15-24); “Age of Bronze, State of Grace” from _J. M. Coetzee and the Ethics of Reading_\n\n**Week 8 (April 20):**\n\nTopic: Humans, Animals, and Morality\n\nAssigned Readings: “The Philosophers and the Animals” and “The Poets and the Animals” from _The Lives of Animals_ by _J. M. Coetzee_; “Guest Column: Why Animals Now?” by Marianne Dekoven; “Shopenhauer and Secular Salvation in the Work of J. M. Coetzee” by Richard Alan Northover\n\n**Week 9 (April 27): Film-Viewing Week**\n\n**Week 10 (May 4):**\n\nTopic: What does the Novel Do?\n\nAssigned Readings: “The Depreciated Legacy of Cervantes” and “Dialogues on the Art of the Novel” by Milan Kundera (From _The Art of the Novel_); Part I from _The Unbearable Lightness of Being_ by Milan Kundera\n\n**Week 11 (May 11):**\n\nTopic: Desire, Being, and Novels\n\nAssigned Reading: Part II from _The Unbearable Lightness of Being_ by Milan Kundera; Supplementary material: “Feeling as Illusion: Rousseau to Proust” from _Sentimentalism, Ethics, and the Culture of Feeling_ by Michael Bell\n\n**Week 12 (May 18):**\n\nTopic: History, Life, and Being\n\nAssigned Reading: Part III from _The Unbearable Lightness of Being_ by Milan Kundera\n\n**Week 13 (May 25):**\n\nTopic: History, Life, and Being\n\nAssigned Reading: Part IV from _The Unbearable Lightness of Being_ by Milan Kundera\n\n**Week 14 (June 1):**\n\nTopic: Truth of Being: _Einmal ist keinmal_?\n\nAssigned Reading: Part V from _The Unbearable Lightness of Being_ by Milan Kundera\n\n**Week 15 (June 8):**\n\nTopic: Truth of Being: _Einmal ist keinmal_?\n\nAssigned Readings: Part VI from _The Unbearable Lightness of Being_ by Milan Kundera; “Humanity’s ‘True Moral Test’: Shame, Idyll, and Animal Vulnerability in Milan Kundera’s _The Unbearable Lightness of Being_” by Joseph Mai\n\n**Week 16 (June 15):**\n\nTopic: Testimony and Literature\n\nAssigned Reading: “Chapter 1 Education and Crisis” from _Testimony: Cries of Witnessing in Literature, Psychoanalysis, and History_.\n\nTexts for discussion: _Schindler’s List_ (1993); _Life Is Beautiful_ (1997) (Films for class discussion)\n\n**Week 17 (June 22): Take-home Exam**\n\n**Week 18 (June 29): Individual Conference (By appointment)**\n\n**V. Requirements:**\n\n1\\. Finish assigned readings in advance of each class meeting.\n\n2\\. Follow basic classroom etiquette rules: show up in class punctually; send a notice in advance when you cannot attend a class meeting.\n\n3\\. Assignments:\n\n  A. Individual Work:\n\n  (1) Online comments: Students are expected to write a critical response to the given topic and post it on the assigned section of the course board.\n\n  (2) Midterm movie response: Write a movie response essay on the assigned section of the course board.  \n\n(3) Take-home exam: The test range is based on the assigned texts on the reading list. \n\n  B. Group Work:\n\n  Group discussion: In each class meeting, students are expected to discuss with class members on given topics so as to help facilitate class discussion.\n\nGroup presentation: Each group is to give an oral presentation on one selected chapter of _Istanbul_. Each presentation is expected to be about 10-15 minutes in length.\n\n**VI. Grading Policy**: Your grade will be given based on your performance on the following aspects:\n\n1\\. Attendance and participation 15%\n\n2\\. Online Comments 25%\n\n3\\. Midterm Movie Response 10%\n\n4\\. Group Work 20%\n\n5\\. Take-home Exam 30%",
    "methodologies": [
        {
            "type": "講述法",
            "note": "The lecture will follow the selected topics and points listed on the lecture outline."
        },
        {
            "type": "討論法",
            "note": "From time to time students will be asked to work with their class members on given topics."
        },
        {
            "type": "合作學習",
            "note": "Students have to work their group members on the group presentation."
        },
        {
            "type": "媒體融入教學",
            "note": "Materials from the media will be incorporated in the lecture."
        },
        {
            "type": "其他",
            "note": "Students are encouraged to work on a project that better fulfills their competence and vision. They may write an academic paper or creative writing to fulfill the requirement of a term project."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 40,
            "note": "Moodle Forum and Term Project"
        },
        {
            "type": "期中考",
            "weight": 20,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "Group Project"
        }
    ],
    "prerequisite": "",
    "general_core": []
}