{
    "year": 110,
    "term": 1,
    "name": "英國文學：中古時期至十八世紀（一）",
    "teachers": [
        "狄亞倫"
    ],
    "department": "LU21",
    "code": "ENU0291",
    "credit": 2,
    "serial": 1897,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 8,
            "to": 9,
            "campus": "本部",
            "classroom": "正303"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "2",
    "classes": "2",
    "dept_group": "",
    "hours": 2,
    "description": "The purpose of this two-semester course is to introduce students to a sample of writing in English from the Medieval period up to the eighteenth century. This semester we shall be studying literature from the time of Chaucer to the early seventeenth century. The ideas or themes we shall be considering include: gender, sexuality, political and familial bonds, voice and vision, religion, mutability and flattery.  Historical context is provided in the seminars but students will need to be doing their own background reading if they are to be successful in their work. Students are advised to bring English-Chinese dictionaries to class and to keep a notebook in which to add new vocabulary.",
    "goals": [
        "to introduce students to the range of writing in English from the Medieval period up to the eighteenth century"
    ],
    "syllabus": "**Dr. Aaron Deveson**\n\n**Email: aaron.c.deveson@gmail.com**\n\nOffice: 721 (office hours by appointment)\n\nText: The Norton Anthology of English Literature. Vol. 1.\n\nThe purpose of this two-semester course is to introduce students to a sample of writing in English from the Medieval period up to the eighteenth century. This semester we shall be studying literature from the time of Chaucer to the early seventeenth century. The ideas or themes we shall be considering this semester include the following: gender, sexuality, selfhood and autonomy, religion, mutability, empire, travel, and overreaching.\n\nHistorical context is provided in the seminars, but students will need to be doing their own background reading if they are to be successful in their work. Students are advised to bring English-Chinese dictionaries to class and to keep a notebook in which to add new vocabulary.\n\n**Grading Policy**\n\n**Midterm: 40%**\n\nHistorically-informed practical criticism-style essay responses to short renaissance poems and an extract from Chaucer’s _The Miller’s Tale_\n\n**Final:  40%**       Part I  Practical criticism-style essay responses to extract(s)\n\n       Part II Medium-length essay response to **one** question\n\n**Presentation:  20%**\n\nEach student will be required to give a four-minute powerpoint presentation on one or more of the following: the life and/or works of an author on the course, a text or passage, and a historical/political/cultural context. **The Powerpoint presentation must be sent to the instructor by the day of the presentation.** **Any material taken from books or websites must be properly acknowledged. Originality will be rewarded.** (Please use quotation marks where appropriate and do not wait until the final screen to reveal sources.) You will also be rewarded for clarifying complex ideas in original language. (You may provide Chinese translations of difficult key terms.)\n\n**SCHEDULE (may be affected by Taiwanese holidays)**\n\nWEEK 1\n\nOrientation. Historical and cultural background to Chaucer and the medieval period\n\nWEEKS 2-4\n\nChaucer: _The Canterbury Tales, The Miller’s Tale_\n\n(If you choose to read a translation, remember that you will need to recognize features in the original when it comes to the midterm exam!)\n\nWEEK 5\n\nChaucer: wider literary context, including _The Wife of Bath's Prologue and Tale_\n\nWEEK 6\n\nBackground to (English) Renaissance, Reformation, and Elizabethan England\n\nWEEK 7\n\nPost-Petrarchanism (Wyatt); the English sonnet (Sidney)\n\nWEEK 8\n\nMidterm work (detail will depend on what is happening around Covid-19)\n\nWEEKS 9\n\nBackground to Marlowe\n\nWEEKS 10-11\n\nMarlowe: _Hero and Leander_  \n\nWEEK 12-14\n\nShakespeare’s Sonnets\n\nWEEKS 15-16\n\nJohn Donne: _Songs and Sonnets_\n\nFinal essay due on Moodle and by email in week 18",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": "Grading Policy \n(New Weighting)\n Midterm: 25%\nPractical criticism-style essay responses to extract(s)\n\nFinal: 60%         Part I  Practical criticism-style essay responses to extract(s)          Part II Medium-length essay response to one question \n Presentation:  15% Each student will be required to give a three-minute powerpoint presentation on one or more of the following: the life and/or works of an author on the course, a text or passage, and a historical/political/cultural context. The powerpoint presentation must be sent to the instructor by the day of the presentation. Any material taken from books or websites must be properly acknowledged. Originality will be rewarded. (Please use quotation marks where appropriate and do not wait until the final screen to reveal sources.) You will be rewarded for clarifying complex ideas in original language. (You may provide Chinese translations of difficult key terms.)"
        }
    ],
    "prerequisite": "",
    "general_core": []
}