{
    "year": 110,
    "term": 1,
    "name": "英文（一）",
    "teachers": [
        "高瑪麗"
    ],
    "department": "LU21",
    "code": "ENU0168",
    "type": "必",
    "grade": 1,
    "credit": 3,
    "serial": 1835,
    "group": "A",
    "quota": {
        "limit": 25,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "正302"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "To introduce students to readings on a wide variety of themes",
        "To teach students how to think critically about the issues addressed in the readings",
        "To discuss, in English, the issues addressed in the readings",
        "To help students become familiar with new vocabulary and culture points and discuss how they are used in the readings",
        "To prepare students to be able to paraphrase passages from the readings and answer essay questions related to the readings"
    ],
    "syllabus": "Text: The Norton Reader, 15th edition, available from BOOKMAN BOOKS\n\n         Occasional handouts and other materials from instructor\n\nSee the ENGLISH COURSE DESCRIPTION for a tentative reading schedule for Fall 2021\n\n**Freshman English I**\n\n**Fall 2021/ Tuesday 1320-1620**\n\n **Professor Goodwin (profgood@ntnu.edu.tw)**\n\n**COURSE GOALS**: In Freshman English I, our course goals are to build English reading, writing and speaking skills by (1) introducing students to readings on a wide variety of themes; (2) encouraging students to think critically about the issues addressed in the readings; (3) discussing issues in English; (4) helping students become familiar with new vocabulary and aspects of world culture, and discussing how they are used in the readings; and (5) preparing students to be able to paraphrase passages from the readings and answer essay questions related to the readings.\n\n**GRADING:** Attendance and participation: 15%; assignments: 15%; midterm 35%; final 35%. Students are expected to be active participants in class discussions, and to show respect to each other and to the instructor at all times. Phones must \\*always\\* be turned off in class. If your phone or device rings, you will be asked to leave class.\n\n**TEXT**:\n\n_The Norton Reader, Shorter 15th Edition_. Goldthwaite, Melissa et al., eds. (textbook available from Bookman Books)\n\n**ATTENDANCE**: Attendance is required. If you wish to ask for leave, please present the appropriate school form within one week of your absence. If you miss more than three class sessions (unexcused), you will fail the course. Please arrive for class on time. If you only attend one hour of the class for a particular day, you will be marked absent for half the class. If you are often late, points will be deducted from your grade on a regular basis.\n\n**PLAGIARISM**:\n\nPlagiarism, even a first offense, will earn you a failing grade. Plagiarism is defined as offering someone else’s work or opinion as your own, including ideas, conclusions, and ways of organizing material. If you use words, sentences, ideas, conclusions, examples, and/or organization of an assignment or exam from another source (a book, an article, online sources, another student’s paper, etc.) without correctly acknowledging the source, you are plagiarizing. If you have any question about how to cite sources, check first with the instructor or another faculty member or the MLA Handbook.\n\n**TENTATIVE READING SCHEDULE:**\n\n**WEEK**\n\n**DATE**\n\n**ASSIGNMENT**\n\n**PAGES**\n\n1\n\n9.22\n\nOrientation and Introduction to Course\n\n2\n\n9.29\n\nAngelou, \"Graduation\"\n\n210-219\n\n3\n\n10\\. 6\n\nNguyen, \"The Displaced\"\n\n24-27\n\n4\n\n10.13\n\nKingsolver, \"#MeToo Isn't Enough\"\n\n119-122\n\n5\n\n10.20\n\nRoisin, \"Meet a Muslim\"\n\n495-499\n\n6\n\n10.27\n\nGottschall, \"Fiction is Good for You\"\n\n461-465\n\n7\n\n11\\. 3\n\nReview for Midterm\n\n8\n\n11.10\n\n**MIDTERM**\n\n9\n\n11.17\n\nSolnit, \"How to Be a Writer\"\n\n231-234\n\n10\n\n11.24\n\n  Pollan, \"An Animal's Place\"                                      400-416                                                      \n\n11\n\n12.1\n\nPollan continued                                                        \n\n400-416\n\n12\n\n12.8\n\nTurkle, \" The End of Forgetting\"\n\n326-337\n\n13\n\n12.15\n\nDinan, \"Be Nice\"\n\n374-377\n\n14\n\n12.22\n\nChemerinsky and Gillman, \"What Students Think About Free Speech\"\n\n532-536\n\n15\n\n12.29\n\nReview for Final\n\n16\n\n1.5\n\n**FINAL EXAM**\n\n17\n\n1.12\n\nFLEXIBLE SCHEDULE, FILM/TV/READINGs TBA\n\n18\n\n1.19\n\nFLEXIBLE SCHEDULE, Assignment TBA",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": ""
        },
        {
            "type": "Group discussion",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 15,
            "note": ""
        },
        {
            "type": "Midterm Exam",
            "weight": 35,
            "note": ""
        },
        {
            "type": "Final exam",
            "weight": 35,
            "note": ""
        },
        {
            "type": "Class discussion involvement",
            "weight": 15,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}