{
    "year": 110,
    "term": 1,
    "name": "高級寫作（一）",
    "teachers": [
        "吳美貞"
    ],
    "department": "LU21",
    "code": "ENU0289",
    "type": "必",
    "grade": 3,
    "credit": 2,
    "serial": 1909,
    "group": "B",
    "quota": {
        "limit": 16,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "正306"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎必須先修過【ENU0287  中級寫作（一）】、【ENU0288  中級寫作（二）】",
    "form_s": "3",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "In Advanced Writing, the course aims to integrate writing skills students learned in previous two years with their knowledge of a topic, subject, or theme in order to prepare students for future career. Creative use of different types of essays will be expected to be contextualized in different fields, including exam-related, work-related, or research paper related fields. Language-based writing can also be integrated with different modes of communication, such as pictures, audios, webpages as an individual or group project.",
    "goals": [
        "To help students rehearse skills in various modes of writing",
        "Help students build a good sense of the difference between smart, sophisticated, quality writing and bland, hackneyed writing",
        "Students are expected to integrate writing techniques with their knowledge of the topic/subject"
    ],
    "syllabus": " **Schedule:**\n\nWeeks\n\nTopics\n\nReadings & Assignments\n\n1\n\nIntroduction\n\n2\n\nUse all your senses\n\nReading Jigsaw:\n\n_An unexpected party_\n\n_The sorting hat_\n\n3\n\nPeer editing\n\n**Essay 1: first draft**\n\n4\n\nReading the signs\n\n_Semiotics (WT: p.1-10)_\n\n_How do I argue about popular cultural texts? (WT: p.33-42)_\n\n5\n\nCreative mini task\n\n6\n\nBrought to you b(u)y –\n\nAnalysis of advertisement and commercials\n\n_The sign of advertising (SL: p.141-149)_\n\n_The weasel words (WT: p.569-580)_\n\nCases of advertisement analysis_: Tommy girls, Tommy boys, and America Lee Jeans (SL: p. 35-37)_\n\n**Essay 1: revision**\n\n7\n\nWhat are we to advertisers?\n\n_Men’s men and women’s women (SL: p.161-172)_\n\n_Metrosexuals come out (SL: p.174-177)_\n\n_Kid kustomers (SL: p. 178-182)_\n\n_Hanes her way (WT: p.566-568)_\n\n8\n\nPeer editing\n\n**Essay 2: first draft**\n\n9\n\nLife on the big screen: Reflection or distortion?\n\n_High school confidential (SL: p.343-348)_\n\n_Asian women in film: No joy, no luck (SL: p.359-367)_\n\n_Class and virtue (WT: p.316-319)_\n\n10\n\nGone baby gone\n\n**Essay 2: revision**\n\n11\n\nCreative mini writing task\n\n12\n\nPeer editing\n\n**Essay 3: first draft**\n\n13\n\nCreative Writing: Narration\n\n_Elements of story (To be provided later)_\n\n14\n\nCreative Writing: Narration\n\n_In class group work_\n\n15\n\nPresenting and editing\n\n**Essay 4: First draft**\n\n16\n\nPresenting and editing\n\n Essay 4\n\n17\n\nOn-line learning\n\n**Portfolio Due**\n\n**Essay Four revision**\n\n18\n\nOn-line learning\n\n \n\n**Assignments:**\n\nEssay 1: Descriptive essay \n\nYou are to writea two-page (minimum, but no more than three pages) descriptive essay about yourexperience in a beautiful/mysterious/unusual place (landscape or natural scene)that has stuck in your mind.  Whendescribing the scenery, try to use the strategies that we discuss inclass.  Although the main focus is“painting” the natural scene, you can also weave in stories and events youexperienced there (e.g. kinds of people that you saw and things thathappened).  Remember you are walking thereaders through your experience and the images in your mind.  In addition, you need to consider yourpurpose in writing this descriptive essay.\n\nEssay 2: Analyze an advertisement\n\nIn thisassignment, you will need to do a semiotic interpretation of a commercial or anadvertisement of your choice.  You willcritically read and analyze both the written and visual rhetoric used in thecommercial/advertisement.  In your essay,you will present the readers with a thesis that suggests your interpretation ofthe commercial/advertisement.  You mayalso make some connections to how this particular piece, in your opinion,function as or reflect a sign within the larger sign and cultural system (seeboth Craig, John, and Gray’s pieces).  The body of your essay should be used todevelop and defend your interpretation and thesis with details based on thecommercial/advertisement.  Also, be sureto include description and introduction of the commercial/advertisement.  Summary of the commercial/advertisement islimited only to one paragraph. You must also hand in your links to yourcommercial or a copy of your advertisement with your essay.    \n\nIn addition tothe guided questions provided in class, you might also want to consider thefollowing questions while you are working on your analysis.\n\n1.  How do the characters in the ad function as signs?\n2.  Who and what appears/doesn’t appear in this ad? What might be the intention behind it?\n3.  How is this ad/commercial playing off its audience’s feeling?\n\nP.S. The readingassigned for our class discussion can be good examples for your essay\n\nEssay 3: Writing about an issue identified from a movie\n\n        Forthis assignment, you will review the movie “Gone baby gone” with a criticallens of your choice, for example, ethnicity, social class, or power etc. Youressay does not need to include plot summary or review of the movie story line.Instead, your critical essay should focus on selecting an issue depicted in themovie and reflect the issue in relation to the question of whether the movie isa reflection of reality, a distortion, or something in the blurry area. Thefollowing questions are for your reference, but your essay does not and probablyshould not be limited to or include all these questions. (The essays that weread for the section on “life on the big screen” can be a good sample.)\n\n1.  What does the film say about people’s values?\n\n2.     Towhat extent does the film reflect the phenomenon in nowadays society?  \n\n3.     Whosevoices are heard? And whose voices are not heard?\n\n4.     Howdoes this movie relate to other movies or things presented in the media thatyou have observed?\n\nEssay4:  Creative writing through narration(group)\n\nForyour last essay, you will write a fictional story in a group of 3 people.  The format to present your last essay caninclude a short video, a role play, or a comic strip.  The purpose of writing this story is to sellan item on a magazine.  In writing yourfictional story, you must integrate elements from the first three essays youhave written previously. The intention of this essay is to encourage yourcritical thinking skills by integrating what you have learned from each segmentof this writing class into writing an interesting story.  Thus, your creativity in reflecting upon whatyou have learned will be greatly appreciated. Please consider the following guidelines when writing your story.  Since you will be working in groups of 3people, you will have to decide how to use your previous assignments to bestpresent your creativity in this story. Your story must include elements from each of your three essays.\n\n1.  Choose the setting you have described from Essay 1\n2.  Relate your story to what you have done for Essay 2 (e.g. selling an item)\n3.  Use the theme you have identified for Essay 3 to continue your story",
    "methodologies": [
        {
            "type": "討論法",
            "note": "Students will discuss readings."
        },
        {
            "type": "合作學習",
            "note": "Students will work in groups in discussing and peer editing."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 60,
            "note": "4 assignments"
        },
        {
            "type": "課堂討論參與",
            "weight": 15,
            "note": ""
        },
        {
            "type": "其他",
            "weight": 25,
            "note": "portfolio of writing in class"
        }
    ],
    "prerequisite": "◎必須先修過【ENU0287  中級寫作（一）】、【ENU0288  中級寫作（二）】",
    "general_core": []
}