{
    "year": 110,
    "term": 1,
    "name": "美國文學",
    "teachers": [
        "路愷宜"
    ],
    "department": "LU21",
    "code": "ENU0226",
    "type": "必",
    "grade": 3,
    "credit": 3,
    "serial": 1921,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 3,
            "to": 5,
            "campus": "本部",
            "classroom": "正303"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "3",
    "classes": "2",
    "dept_group": "",
    "hours": 3,
    "description": "This course is a one-semester introduction to the history of American literature, surveying material from the discovery period through the mid-nineteenth century. The course takes a chronological approach to the literary material, with discussion of the historical circumstances and social and intellectual trends in each period. We will cover a variety of genres: history, sermon, political pamphlet, lyric, short story and novel.",
    "goals": [
        "To survey American literature from the discovery period through the mid-nineteenth century",
        "To cover a variety of genres: history, sermon, political pamphlet, lyric, short story and novel"
    ],
    "syllabus": "    **IMPORTANT NOTE: PLEASE REGISTER ON MOODLE for latest updates and class link when school starts. Do reach out via email for any other query ioanaluca.ntnu@yahoo.com**\n\nAmerican Literature  \nDepartment of English, NTNU, Fall 2021\n\nCourse description  \nThe course offers and overview of and introduces students to canonical American literary voices, from the early beginnings to the Second World War. This historical period covers roughly the Puritan period, the Enlightenment, American Renaissance and the modern era. We will explore how a variety of writers responded to, imagined, and in a sense created what is seen as the “American” experience. The lectures and class discussions will consider the historical, cultural and political movements that contextualize these voices as well as the literary history that informs their work. While we will cover some historical background to contextualize the texts we explore, the focus will be on the textual artefacts and on learning techniques of literary analysis.\n\nObjectives\n\n**_Objectives_**\n\nThe main goals of the lectures are the following:\n\n1.  To understand the development and major themes of American literature.\n2.  To give a critical reading of a representative set of classic fictional and poetic works and a comparative study of the cultural milieu of each work.\n3.  To draw the connections and differences between authors, styles, and thematic concerns.\n\n**_Textbooks_**\n\n1.  _The Norton Anthology of American Literature_. Shorter Ninth edition. Ed. Robert S. Levine. New York: Norton, 2017 (Bookman)\n2.  Lecture notes, handouts, film clips or any extra materials posted on Moodle [http://moodle.ntnu.edu.tw/](http://moodle.ntnu.edu.tw/)\n\nCourse requirements  \nStudents are expected to be familiar the required readings prior to the class discussion. Students will be graded on the basis of active participation in the class discussions, reports on moodle (30%). Midterm test 30%, final test 40%. Failure to take the mid and final test, to attend the classes, take quizzes and posts on moodle (ten reports on moodle and four responses to colleagues’ posts) will result in the student’s inability to pass the exam. The posts on moodle should be around 200 words in length and could range from your thoughts on the assigned readings, the answer to the study guides posted by the instructor or a close reading of a certain paragraph.\n\nAcademic Dishonesty  \nAcademic dishonesty is defined as but not limited to plagiarism, cheating, misrepresenting one’s work, and forging documentation. Academic dishonesty is a serious matter. I am savvy and vigilant in detecting students who use unattributed sources in their reports on moodle, citing references without indicating the sources or “collaborate” with fellow students during exams. Any student who plagiarizes or cheats will fail the course.\n\n**W****.**\n\n**R****equired** **R****eading** **/ Content**\n\n**1**\n\n*   Christopher Columbus, “Letter of Discovery,” “Letter to Ferdinand and Isabella,” 45-51.\n\n**2**\n\n*   John Smith, “A Description of New England” 66-69\n*   William Bradford, “Of Plymouth Plantation” 73-91.\n*   John Winthrop, “A Model of Christian Charity” 93-104 (excerpts)\n\n**3**\n\n*   Anne Bradstreet “The Prologue,” 114-115 “The Author to Her Book” 122-123, “To My Dear Loving Husband” 124\n*   Mary Rowlandson, “A Narrative of the Captivity” 132-151\n*   Jonathan Edwards, “Sinners in the Hands of an Angry God” 193-204.\n\n**4**\n\n*   Benjamin Franklin’s _The Autobiography_\n\n**5**\n\n*   Benjamin Franklin’s _The Autobiography_ continued\n*   John de Crevecoeur “What is an American?” 323-332.\n\n**6**\n\n*   Washington Irving, “Rip Van Winkle” 515-527\n\n**7**\n\n*   R. W. Emerson, “Nature,” 553-582, “Self-Reliance,” 596-613.\n*   H.D. Thoreau, “Where I Lived and What I Lived for,” 962-972.\n\n**8**\n\n*   Walt Whitman, “Preface to _The Leaves of Grass_” (excerpts,), “One’s –Self I Sing” 1024, “Song of Myself” (1, 2, 6, 21, 43, 51 & excerpts)\n\n**9**\n\n**10**\n\n*   Emily Dickinson, selected poems, 207, 260, 269, 372, 479, 519, 591, 764, 1096.\n*   Frederick Douglass, _Narrative of the Life of Frederick Douglass_ 1000-1066.\n\n**11**\n\n*   Nathaniel Hawthorne, “Young Good Man Brown” 668-678; “The Minister’s Black Veil,” 685-694.\n*   Edgar Allan Poe, “The Raven” 735-738, “Annabel Lee” 738, “The Purloined Letter” 772-785. “The Fall of the House of Usher” 749-762.\n\n**12**\n\n*   Mark Twain, _The Adventures of Huckleberry Finn_ 108-291 (excerpts)\n*   & Critical Controversy 292-304\n\n**13**\n\n*   Mark Twain, _The Adventures of Huckleberry Finn_ 108-291 (excerpts)\n*   & Critical Controversy 292-304\n\n**14**\n\n*   Henry James, “The Art of Fiction,” 584-586\n*   Henry James, _Daisy Miller_, 342-382\n\n**15**\n\n*   Charlotte Perkins Gilman, “The Yellow Wall-Paper,” 511-523.\n*   Kate Chopin, “Desiree’s Baby,” 442-446.\n*   Sui Sin Far, Mrs “Spring Fragrance” 550-559.\n\n**16**\n\n*   W. E. B. Du Bois, _The Souls of Black Folk_, Chapter I: “Of Our Spiritual Strivings,” 562-568.\n*   Paul Laurence Dunbar, “We Wear the Mask,” “Sympathy,” “Harriet Beecher Stowe,” “Frederick Douglas” 636-639.\n\n**17-18**\n\n*   Flexible learning and final exam",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}