{
    "year": 110,
    "term": 1,
    "name": "生態演化研究方法",
    "teachers": [
        "李壽先"
    ],
    "department": "SM43",
    "code": "BIC8010",
    "type": "選",
    "grade": null,
    "credit": 1,
    "serial": 2712,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 4,
            "to": 4,
            "campus": "公館",
            "classroom": "Ｃ302"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 1,
    "description": "This course is designed for beginning graduate students in the field of ecology and evolution. The aim is to provide training in developing an independent research project. In this class, you will be asked to write and present a research proposal as a part of the training. You will also be asked to actively participate in class discussion, and provide constructive feedback to other classmates' research questions, experiment design and overall justification of their proposed project.",
    "goals": [
        "提升研究生開展進行生態與演化領域研的基本能力"
    ],
    "syllabus": "第1週 Scope of researches in the field of ecology and evolutionary biology\n\n第2週 Scope of researches in the field of ecology and evolutionary biology\n\n第3週How to pick a research question\n\n第4週 How to pick a research question\n\n第5週 How to decide the approach to answer the question\n\n第6週 How to decide the approach to answer the question\n\n第7週 How to test hypothesis with experiments\n\n第8週 How to test hypothesis with experiments\n\n第9週 How to write a research proposal\n\n第10週 How to write a research proposal\n\n第11週 How to analyze and interpret data\n\n第12週 How to analyze and interpret data\n\n第13週 How to prepare an oral presentation\n\n第14週 How to prepare an oral presentation\n\n第15週 How to publish your results\n\n第16週 How to publish your results\n\n第17週 Research ethics\n\n第18週 Research ethics",
    "methodologies": [
        {
            "type": "討論法",
            "note": "文獻討論"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 100,
            "note": "2-1 (30%) 3-1 (30%) 4-1 (40%)"
        }
    ],
    "prerequisite": "",
    "general_core": []
}