{
    "year": 108,
    "term": 2,
    "name": "運動贊助策略研究",
    "teachers": [
        "程紹同"
    ],
    "department": "AM30",
    "code": "PEM0100",
    "credit": 3,
    "serial": 15,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 5,
            "from": 8,
            "to": 10,
            "campus": "本部",
            "classroom": "體002"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "The global sport sponsorship market is estimated to be worth about US$57 billion dollars in 2020 with annual year growth rate of 4.74%. It has become of vital importance to any sport professional that is in sport industry. “Topics on Strategic Sport Sponsorship” is the first graduate course in Taiwan focusing on professional sport sponsorship and providing a comprehensive, multi-disciplinary analysis of this industry. Topics covered include the global trends and strategic nature of sport sponsorship after COVID 19 outbreak; motivation and benefits of corporate sport sponsorship, activation mix of sport sponsorship, international mega sport event sponsorship, individual athlete sponsorship, the development of effective sponsorship plan and methods of evaluation. Global Sport Sponsorship is essential competence for anyone involved in the practice or academic study of one of the world's largest industries. The characteristic of this course is to integrate the lecturer’s personal field experiences of the Olympics marketing and other major sport properties into his instruction, which will strengthen the student competitive competence in their job market.",
    "goals": [
        "To understand the fundaments of modern sport sponsorship and its importance of strategic applications in global sport business.",
        "To cultivate students ability of developing the effective sport sponsorship proposal and the ability to work with others (team work).",
        "To develop the essential capability of being an outstanding modern global sport industry leader who is able to deal with various challenges and issues successfully in the sport world."
    ],
    "syllabus": "第1週 課程內容介紹與討論（觀念建立）\n\n第2週 運動贊助基本理念建立一：趨勢與發展\n\n第3週 運動贊助基本理念建立二：贊助效益與雙贏觀念\n\n第4週 運動贊助整合策略解析：韓國三星電子亞奧運行銷個案\n\n第5週 2008北京奧林匹克運動會之贊助活動一\n\n第6週 2008北京奧林匹克運動會之贊助活動二；狙擊行銷與決戰時刻\n\n第7週 世界杯足球賽之贊助活動：adidas運動贊助整合策略解析\n\n第8週 運動員個人贊助：名人代言策略分析；運動贊助成效評估(ROI)\n\n第10週 運動贊助個案報告（一）\n\n第11週 運動贊助個案報告（二）\n\n第12週 運動贊助計畫的研擬與教戰守則\n\n第13週 運動贊助計畫的實例討論\n\n第14週 運動贊助計畫口頭報告\n\n第15週 運動贊助計畫口頭報告\n\n第16週 運動贊助計畫口頭報告\n\n第17週 網路學習運動贊助計畫案例\n\n第18週 網路總結討論",
    "methodologies": [
        {
            "type": "講述法",
            "note": "單元主題介紹時運用"
        },
        {
            "type": "討論法",
            "note": "單元主題介紹、個案討論、以及贊助企劃書報告時運用"
        },
        {
            "type": "問題解決教學",
            "note": "贊助企劃書撰寫時運用"
        },
        {
            "type": "合作學習",
            "note": "贊助企劃書撰寫時運用"
        },
        {
            "type": "實驗/實作",
            "note": "個案研究與贊助企劃書撰寫時運用"
        },
        {
            "type": "實地考察、參訪",
            "note": "配合時勢進行運動賽會贊助活動之參訪與觀摩（如全運會或其他國際賽會等）"
        },
        {
            "type": "媒體融入教學",
            "note": "播放三星等知名國際品牌實戰個案及相關影片融入教學"
        },
        {
            "type": "專題研究",
            "note": "個案報告及贊助企劃書撰寫時運用"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 15,
            "note": "運動贊助活動剪報資料搜集"
        },
        {
            "type": "課堂討論參與",
            "weight": 5,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "運動贊助個案書面暨口頭報告"
        },
        {
            "type": "專題",
            "weight": 40,
            "note": "運動贊助企劃書書面暨口頭報告"
        }
    ],
    "prerequisite": "",
    "general_core": []
}