{
    "year": 108,
    "term": 2,
    "name": "西洋文學概論",
    "teachers": [
        "張瓊惠"
    ],
    "department": "LU21",
    "code": "ENU0120",
    "credit": 3,
    "serial": 1703,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "正303"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大二大三大四修習",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course offers an introduction to the development of literature in Western civilization through a closer study of some major works of Ancient Greece, the Middle Ages and Renaissance. It focuses on the major themes and developments that have had significant impact on the Western literary tradition. It also aims to familiarize students with the significant religious, historical and social events that have shaped Western society and literature.",
    "goals": [
        "to familiarize students with the main themes of Greek drama, early Christian writings and the Renaissance",
        "to enable them to compare and contrast significant characters, events, symbols",
        "familiarize students with the historical and cultural background of the texts studied",
        "to give students some familiarity with the visual arts that depict the works studied"
    ],
    "syllabus": "Please see the PDF file.\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=f361ec7955cf4eaeaa82dc5f29052890&fno=7b6c94a55fbf419f8fd1252d82e5bd74)",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": "Students are expected to be familiar with the required readings prior to class discussions. Students will be graded on the basis of (1) their active participation in the class/moodle discussions & group project—40%, (2) midterm & final—60%. Failure to take the midterm and final test, attend classes/quizzes and submit the project on time will result in the student inability to pass the exam."
        }
    ],
    "prerequisite": "",
    "general_core": []
}