{
    "year": 108,
    "term": 2,
    "name": "文學作品導讀（二）",
    "teachers": [
        "曾思旭"
    ],
    "department": "LU21",
    "code": "ENU0258",
    "credit": 2,
    "serial": 1697,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "誠305"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大一修習",
    "form_s": "1",
    "classes": "1",
    "dept_group": "",
    "hours": 2,
    "description": "The course introduces students to a wide range of literary genres, from different geographical areas and historical periods. It is meant to develop skills necessary to read, understand, critically analyze, and (hopefully!) enjoy literary texts. We will learn what to look for while reading fiction, non-fiction, poetry, drama, and graphic narratives. We will use techniques of literary analysis, apply literary studies terminology, and demonstrate an ability to move from descriptive observations about literary texts to larger claims about their meaning, context, and significance. We will also cultivate the ability to put our own ideas into writing and into conversation with others.\n\nAt the same time, we will also examine the roles literature has played in individuals’ lives and in society, with a focus on the function of literary works in the 20th and 21st centuries. Questions such as Why is literature produced? Why do we read literature? What effects can literary works have on our lives and contemporary society? will provide the larger framework for our discussion.",
    "goals": [
        "Learn key terms and concepts generally applied to the evaluation of literature",
        "Hone skills of close reading and critical thinking",
        "Develop curiosity about the world through context-specific analysis of literary works",
        "Improve sensitivity to the English language"
    ],
    "syllabus": "  \n \n\n**Approaches to Literature**\n\nNational Taiwan Normal University, Spring 2017\n\nWednesdays, 13:20-15:10\n\nDr. Justin Prystash                                                \n\nOffice:     720                \n\nOffice Hours: M 15:20-16:10; W 12:20-13:10; F 12:20-14:10\n\nEmail: jprystash@ntnu.edu.tw or jprystash@hotmail.com        \n\n**Course Description**\n\nThis course provides students with an introduction to the study and appreciation of fiction, poetry, and drama (fiction will be covered in the fall semester, poetry and drama in the spring). We will consider the basic elements of literature, such as plot, setting, and symbol, as well as the broader figurative meanings of literature. Students will also learn how to write academic responses to literature.\n\n**Attendance, Participation, and Group Assignments**\n\nStudents are expected to regularly attend and contribute to class discussions. Group assignments will consist of written responses that you will complete with other students in class. We will have 5 group response assignments this semester (they are marked **GA** on the schedule below). If you are absent for a group response assignment, you will receive a 0 on the assignment, but you may make it up by writing one during my office hours. If I notice that one group member does all the work while the rest of the group sleeps or plays video games, I will break the group up and reassign you. Groups that plagiarize their responses will receive a 0 and be asked to redo the assignment during my office hours.\n\n**Midterm and Final Exams**\n\nThe midterm and final exams will be a combination of multiple-choice questions and one long written response. The multiple-choice questions will be related to “basic elements” of literature (symbol, metaphor, etc.). The long response will be just like the ones you do in the group assignments, but you will be asked to write on a passage from one of the poems or plays that you did _not_ write about in groups.\n\n**Schedule**\n\nWeek 1, 2/22: Introduction and Syllabus Review\n\nWeek 2, 3/1: “Poetry: Reading, Responding, Writing” (670-691)\n\nWeek 3, 3/8: “Symbol” (813-819); How to Write a Response to Poetry\n\nWeek 4, 3/15: American Romantic Poetry: Walt Whitman, “Song of Myself” (721 and internet); **GA**\n\nWeek 5, 3/22: William Shakespeare: “Shall I compare thee to a summer’s day?” (810); “My mistress’ eyes are nothing like the sun” (891); “The lunatic, the lover, and the poet” (1352); “To be, or not to be” (1404)  \n\nWeek 6, 3/29: The Metaphysical Poets: John Donne, “The Flea” (738); Andrew Marvell, “To His Coy Mistress” (739-740); **GA**\n\nWeek 7, 4/5: **Holiday: No Class**\n\nWeek 8, 4/12: British Romantic Poetry: William Blake, “London” (772); William Wordsworth, “Nuns Fret Not” (893-894); Samuel Taylor Coleridge, “Frost at Midnight” (862-864); Midterm Review\n\nWeek 9, 4/19: Midterm Exam\n\nWeek 10, 4/26: “Visual Imagery and Figures of Speech” (802-810)\n\nWeek 11, 5/3: Victorian Poetry: Alfred, Lord Tennyson, “Ulysses” (990-991); **GA**\n\nWeek 12, 5/10: Victorian Poetry: Robert Browning, “Soliloquy of the Spanish Cloister” (709-711); Matthew Arnold, “Dover Beach” (740-741); Gerard Manley Hopkins, “God’s Grandeur” (1094)\n\nWeek 13, 5/17: Emily Dickinson (946-949); **GA**\n\nWeek 14, 5/24: Modernist Poetry: E. E. Cummings, “next to of course god america i” (718); William Carlos Williams, “The Red Wheelbarrow” (796); Ezra Pound, “In a Station of the Metro” (1102); Edna St. Vincent Millay, “What lips my lips have kissed, and where, and why” (895-896); William Butler Yeats, “The Second Coming” (961-962); Robert Frost, “The Road Not Taken” (1091)\n\nWeek 15, 5/31: Music Lyrics: Bob Dylan, “Mr. Tambourine Man” (853-854); Mos Def, “Hip Hop” (854-855); **GA**\n\nWeek 16, 6/7: “Drama: Reading, Responding, Writing” (1122-1125); Susan Glaspell, _Trifles_ (1125-1135)\n\nWeek 17, 6/14: Final Exam Review\n\nWeek 18, 6/21: Final Exam",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": "Assignments\n\nAttendance/Participation  10%\n\nGroup Assignments             30%\n\nMidterm Exam                      30%            \nFinal Exam                             30%"
        }
    ],
    "prerequisite": "",
    "general_core": []
}