{
    "year": 108,
    "term": 2,
    "name": "莎士比亞（二）",
    "teachers": [
        "林南"
    ],
    "department": "LU21",
    "code": "ENU0262",
    "credit": 2,
    "serial": 1733,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 1,
            "from": 9,
            "to": 10,
            "campus": "本部",
            "classroom": "正306"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "3",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "This course provides an introduction to the major plays of William Shakespeare. With this course, students will encounter and enjoy in each semester four major plays of the author. The four plays to be studied vary from year to year. They are usually decided in class at the beginning of each semester after orientation in the first week.\n\nStudents will encounter and enjoy in each semester four major plays of the author.  Along the way they will also have opportunities to become aquainted with the rich resources of Shakespeare studies.",
    "goals": [
        "To provide an introduction to the major plays of William Shakespeare",
        "Students will encounter and enjoy in each semester four major plays of the author."
    ],
    "syllabus": "本課程將介紹莎士比亞的戲劇。選修的學生將有機會賞析莎士比亞四個名劇。所選劇作每學期略偶有不同。通常都在開學前兩周一定會確定下來。This course provides an introduction to the major plays of William Shakespeare. With this course, students will encounter and enjoy in each semester four major plays of the author. The four plays to be studied vary from year to year. They will be announced in class at the beginning of each semester after orientation in the first week.\n\n  \n\nStudents will encounter and enjoy in each semester four major plays of the author.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": "指引同學善用網路上彈指可得的珍貴圖片與影音資源"
        },
        {
            "type": "其他",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 80,
            "note": "須是本學期所選劇本"
        },
        {
            "type": "出席",
            "weight": 20,
            "note": "出席是最起碼的參與。無法到課，請於隔周提交書面假條。請規律出席上課。"
        },
        {
            "type": "其他",
            "weight": 40,
            "note": "本學期選修同學可以選擇扮裝演出兩則完整獨白替代期中報告"
        }
    ],
    "prerequisite": "",
    "general_core": []
}