{
    "year": 108,
    "term": 2,
    "name": "英語聽講（二）",
    "teachers": [
        "陳秋梅"
    ],
    "department": "LU21",
    "code": "ENU0280",
    "credit": 2,
    "serial": 1701,
    "group": "",
    "quota": {
        "limit": 40,
        "additional": 16
    },
    "schedule": [
        {
            "day": 1,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "誠701A"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大一修習",
    "form_s": "1",
    "classes": "2",
    "dept_group": "",
    "hours": 2,
    "description": "This course aims to enhance students’ English listening and speaking competence. Main goals of the course include: (1). to build students’ academic listening skills and life situational listening proficiency, and (2). to develop students’ speaking skills and communication abilities. Through extensive listening practices and multi-media materials, students will learn to employ listening strategies and academic skills for better listening comprehension, and to engage in discussions centered on specific themes. Students are encouraged to take active participations in class works for a maximized learning experience.",
    "goals": [
        "1.　To build students’ academic listening skills and life situational listening proficiency",
        "2.　To develop students’ speaking skills and communication abilities."
    ],
    "syllabus": "Instructor: Chen Chiou-mei ( 陳秋梅 )\n\nE-mail and TEL: [t22040@ntnu.edu.tw](mailto:t22040@ntnu.edu.tw)   23655363\n\nOffice: 本部誠八樓29號研究室\n\n**_Basic Aural-Oral Training in English_**\n\nSpring, 2020\n\n**Focus of This Term**\n\n(1)   To push the students to understand **longer** dialogues, stories and speeches.\n\n(2)   To cultivate their ability to **summarize** a story, a talk, or a lecture\n\n(3)   To enhance students’ability to understand **news clips**\n\n(4)   To continue training students to **express their opinions in English**\n\n**Teaching Materials**\n\nTanka, Judith & Baker, Lida R. (2011). _Interactions 2: Listening/Speaking, silver edition._  McGraw-Hill Education. （文鶴：金山南路2段200號3樓 23934497）\n\n_Three’s Company_ (a video full of everyday situations and a great sense of humor)\n\n_Impact Listening 3_ (marked by a feature of real world listening with a variety of idioms)\n\n_Crossroads Café_ (a video presents a variety of accents -- authentic)\n\n**Course Requirements**\n\n**_1.      No_** **_Cheating on quizzes or exams._**  If someone is found cheating on an exam or a quiz, he/she will be flunked.\n\n**_2._**      **_Attendance and preparation_**: You are expected to attend the class well-prepared. For every unexcused absence, 5 points of your final grade will be deducted. Being late for over 30 minutes is treated as absence for the class that day. If you are absent in case of uncontrollable situations (e.g. illness, emergency, etc.), be sure to ask for leave **within two weeks** and make sure that I receive the e-mail. Besides, you cannot ask for more than **5** leaves for the whole semester according to the school regulations.\n\n**_3._**      **_No eating or drinking in the lab_**. To keep the lab clean, don’t bring any food or drink into the lab. If you really have to, please leave it on the shelf in front of the class.\n\n**_4._**      **_A notebook (or paper for writing) is a must._** You’re often required to take notes when you listen to a lecture/talk. Besides, quizzes will be given anytime in class to test your comprehension of the material.\n\n**_5._**      **_No laptop_**. You are not supposed to bring your laptop to class unless you need it for presentation. Ask for permission in advance.\n\n**_6._**      **_Class participation_**: Lesson conductions will engage you in a variety of tasks such as pair practices, group/class discussions, role plays). You’re supposed to take active participation to develop real-time communication skills. In every meeting, the first 10 minutes are used for group discussion. A topic is given for you to think about, and then you present your opinions to your group (4 people form a group). Each time, your talk should **not be shorter than 1 minute**. In your group, one is assigned to keep time, one to take notes, one to host further discussion after each presents their opinions, and the other to summarize the main ideas to the class. In order to be fair, you must take turns playing different roles. At the end of the semester, you must pick one from your group, who you think has contributed the most to the group discussion. He/she will get a higher score in the speaking part. And if any of your group members fails to contribute satisfactorily to the discussion, you may also write down his/her name to me. He/she will get a lower score. But this is optional. Everyone must try their best so that they can get the credit.\n\n**_7._**      **_Listening Activity_**\n\nEach student must find a listening passage that is interesting & educative from radio,  magazines, or the Internet and teach it to the class. The passage should be about 3 minutes long. Design a handout with an introduction (background knowledge), a list of difficult vocabulary, and to-the-point questions for the class. This activity will start from 3/04. Don’t forget to make copies of the handout for your classmates & me. Email me the handout with answers to the questions a week before your presentation. You may use the listening passage you transcribed last term if you think it’s interesting enough. The more interaction you can elicit from the audience, the better.\n\n**_8._**      **_Skit Performance_**\n\nGroup work of 4-6 people. About **8-15 minutes** for each group. The content of the skit can be as creative as you want it to be. The more popular the performance is, the more points the group get. The criteria for skit are the same as last semester. Half of the score is determined by me and the other half by the whole class.\n\n**_9._**      **Interview of Foreigners in Taiwan about Cultural Differences**\n\nThis is a follow-up activity of Chapter 6. About 4-6 students form a group and interview someone from a foreign country (e.g. the U.S., Malaysia, etc.) to find out more about cultural differences. Their job is to find something that bothers the person about living in Taiwan and something that they like about living here. Some useful things to find out:\n\n＊  What is it exactly that bothers them? Why does it bother them?\n\n＊  Is it something that is done differently in their home country? If so, how is different? Or is it something that isn’t done at all in their country?\n\n＊  Is it something that only **some** people or **most** people in Taiwan do?\n\n＊  Is there anything that they like about living in Taiwan?\n\nIf you have a chance, try to explain why it’s done the way it is done in Taiwan. See if you can help the other person to understand this aspect of living in our country. Come back in class and share what you’ve learned in the interview on 3/25. Make sure that the differences are **really cultural** rather than **individual**.\n\nHINT: How to Begin\n\nTry saying something like this: “I’m a student at \\_\\_\\_\\_\\_. We’re doing a research project about understanding cultural differences. If you don’t mind, I’d like to ask you some questions. It won’t take long…”\n\n**_10._**  **Group Presentation**\n\n      Four to Six people form a group. Each group chooses one topic and does some research or survey about the topic (e.g. the eating/studying habits of NTNU students, the most popular part-time jobs / leisure activities / sightseeing spots / sports / restaurants, etc. ) In the presentation, the group tells the whole class their motivation (i.e. why they choose the topic), study methods and the results of the study. The ways of presentation could be a live talk, a role-play, a panel discussion, a talk show or a drama, as long as the way is effective. Use multimedia to make your presentation attention-getting. Only the members who are involved and make their contribution throughout the study can get the credit. The presentation is scheduled on May 20th.\n\n**_11._**  **Final Exam**\n\nTo get good scores, students are encouraged to do as much outside listening practice (such as ABC news, CNN news, _ICRT_, etc.) as possible. Keep a record of your extra work (date and time, program, duration of the exercise, vocabulary, summary, comment etc.) if you fail to get a satisfactory score in the final exam and need some bonus points.\n\n**Grading Policies (subject to change, depending on the amount of quizzes)**\n\n1.       Attendance, Preparation, Participation and In-Class Quizzes  15%\n\n2.       Two Projects: (1) Report of Cultural Differences  (2) A Survey  20%\n\n3.       Listening Activity  10%\n\n4.       Skit Performance (evaluated by both instructor and peers)  20%\n\n5.       Final Exam ( listening test 30% + speaking test  5%)\n\n**Tentative Schedule**\n\n_Week      Content_                                                   \n======================================================================\n\n1                Introduction to the course\n\n2, 3            Chapter 5；_Three’s Company_ Episode 1, 2; LA1, 2\n\n4, 5            Chapter 6；_TC._ Episode 3, 4; LA 3--6\n\n6, 7            **Report of Cultural Differences**; Chapter 7; LA 7--10\n\n8                Chapter 8；_TC._ Episode 5; LA 11--14\n\n9                **Skit Performance**\n\n10               Chapter 8；_TC._ Episode 6; LA 15--18\n\n11, 12         Chapter 9；_TC._ Episode 7, 8; LA 19 -- 22\n\n13, 14         Chapter 10；_TC._ Episode 9, 10; LA 23 -- 24\n\n15               **Group Presentation -- Report of Your Survey**; LA\n\n16               _TC._ Episode 11, 12; LA27 -- 30\n\n17                **Final Exam ( listening + speaking tests )**\n\n18                Individual Conference",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "實地考察、參訪",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "期末考",
            "weight": 40,
            "note": "listening test 30%; speaking test 10%"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "participation in class"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "assignments and quizzes"
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "assignments and quizzes"
        },
        {
            "type": "其他",
            "weight": 20,
            "note": "Report of Cultural Differences 10%; Learning Portfolio 10%"
        }
    ],
    "prerequisite": "",
    "general_core": []
}