{
    "year": 108,
    "term": 2,
    "name": "後殖民文學",
    "teachers": [
        "梁一萍"
    ],
    "department": "LU21",
    "code": "ENU0157",
    "credit": 3,
    "serial": 1730,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 4,
            "from": 8,
            "to": 10,
            "campus": "本部",
            "classroom": "誠304"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大三大四修習",
    "form_s": "3",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course aims to give students a critical introduction to postcolonial literature by focusing on Malaysia, Singapore, and Taiwan. It is divided into two parts. In the first part, we will focus on the topic of “Decolonizing Malaya” to explore the post-WWII independence movement in Malaysia and Singapore. In the context of Southeast Asia, it is important to know that most countries in Southeast Asia became independent after World War II. We will focus on a selection of poems from various Singaporean and Malaysian poets, as well as chapters from Gungwu Wang’s biography Home Is Where We Are (2018) to examine the processes of decolonization in Malaya. In the second half of the semester, we will focus on Taiwan by reading Two Trees Make a Forest (2020), a family memoir of the migration from China, Taiwan, to Canada. We will examine how that process helps the writer, Jessica J. Lee, come to terms with the complicated colonial histories of Taiwan. By reflecting upon the decolonizing movements in Malaysia, Singapore, and Taiwan, we will investigate the legacies of colonization which still haunt these places. Students will also be required to attend lectures to substitute the sessions for Weeks 17 and 18.*",
    "goals": [
        "Providing a general survey of post-colonial theories and theories of urban studies, as well as the relevance of urban space to the body.",
        "Exploring how the concept of the body is used as a metaphor or motif in the urban representations of some post-colonial cities by reading a few literary works.",
        "Students will be encouraged to submit their final papers to relevant international conferences or apply for the NSC project for undergraduate students."
    ],
    "syllabus": "Descriptions: This course aims to give students a critical introduction to postcolonial literatures by focusing on condition of postcoloniality in the United States of America, New Zealand, and the Philippines. It is divided into two parts. In the first part, we will focus on the topic of “settler colonialism” with the US and New Zealand as examples: in the colonial period, European settlers established the US by dispossessing the homelands of Native Americans, which is defined by postcolonial scholars as “settler colonialism.” The same took place in New Zealand, where the British settlers took possession of native lands of the Maori people. We will read a selection of poems, short stories, videos, and films—literally instances of the “Third Worlds” in the “First Worlds” of the US and New Zealand. In the second part, we will study the history of Filipino American diasporas. The Philippines has survived a history of triple colonization, consisting of Spain (1521-1898), the US (1898-1945), and Japan (1942-1945), which has resulted in the Philippine diaspora—about 12% of the country’s population living overseas. By reflecting upon Filipino American diasporas, Native American and Native Maori dispossessions, we will examine the global neo-colonial situation where hegemonic powers continue to dominate the subaltern populations. There are two special events—the guest speech by Prof. David Leiwei Li (李磊偉; U of Oregon) and the master class by Prof. Shu-mei Shih (史書美; UCLA) as make-up activities.   \n\nSchedule (subject to change)\n\nWks\n\nDates\n\nReadings and Activities\n\nPresentations\n\nOthers\n\n1\n\n03/05\n\nIntroduction           \n\n2\n\n03/12\n\n“The Negro Speaks of Rivers” (1921), “Me, Too” (1925) by Langston Hughes\n\n“Recitatif” by Toni Morrison, 1983\n\n“In the Land of the Free” by Sui Sin Far, 1912\n\n“Persimmons” by Li-young Lee, 1986\n\n3\n\n03/19\n\n“Indian Camp” by Ernest Hemingway, 1924\n\n“Lullaby” by Leslie Marmon Silko, 1981\n\n“Dear John Wayne” by Louise Erdrich, 1984\n\n4\n\n03/26\n\n“Love in the City” by José Martí, 1883,\n\n“A View from the Mangrove,” by Antonio Benítez-Rojo, 1998\n\n5\n\n04/02\n\nFilm: _Crazy Rich Asians_, by Jon Chu, 2018 (novel by Kevin Kwan, 2013)\n\n6\n\n04/09\n\n“Be American,” “Life and Death of a Filipino in America,” “Homecoming,” by Carlos Bulosan, 1946\n\n7\n\n04/16\n\n“Into the First Cold” by Albert Wendt, 2017\n\n“The Glorious Pacific Way” by Epeli Hau’ofa, 1983\n\n\\*Guest Speaker: Prof. David Leiwei Li\n\n8\n\n04/23\n\nMidterm\n\n9\n\n04/30\n\n_America Is Not the Heart (AINH)_, by\n\nElaine Castillo, 2018 (pp. 1-70)\n\n10\n\n05/07\n\n_America Is Not the Heart_, by\n\nElaine Castillo, 2018 (pp. 71-140)\n\n11\n\n05/14\n\n_America Is Not the Heart_, by\n\nElaine Castillo, 2018 (pp. 141-210)\n\n12\n\n05/21\n\n_America Is Not the Heart_, by\n\nElaine Castillo, 2018 (pp. 211-280)\n\n13\n\n05/28\n\n_America Is Not the Heart_, by\n\nElaine Castillo, 2018 (pp. 281-350)\n\n14\n\n06/04\n\n_America Is Not the Heart_, by\n\nElaine Castillo, 2018 (pp. 351-416)\n\n\\*Master class by Shu-mei Shih\n\n15\n\n06/11\n\nFinal Group Presentations\n\n16\n\n06/18\n\nFinal Group Presentations\n\nGrading\n\n1.  Class Participation: 10% (attendance, punctuality, and discussions\n2.  Midterm Exam: 30%\n3.  _AINH_ Presentation: 20% (20 minutes with PPT; PPT due on Monday of the week)\n4.  Final Presentation: 30% (30 minutes with PPT; PPT due on Monday of the week)\n5.  \\*Make-up activities 10% (500-word reflection of each of the following events)\n\nDavid L. W. Li Lecture (Wednesday, 4/15, 12:30-14:00; venue: Conf. room, 8th F)\n\nShu-mei Shih Master Class (Wed., 6/3, 10-12:00; venue: B1, CLA)\n\n“Intersections and Relations” International Conference (Academia Sinica, 6/9-10)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "老師重點講授"
        },
        {
            "type": "討論法",
            "note": "師生共同討論"
        },
        {
            "type": "合作學習",
            "note": "同學之間合作學習"
        },
        {
            "type": "專題研究",
            "note": "期末小組專題報告"
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 30,
            "note": "期中考"
        },
        {
            "type": "課堂討論參與",
            "weight": 5,
            "note": "參與小組全班討論"
        },
        {
            "type": "出席",
            "weight": 5,
            "note": "每周固定出席"
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "小組口頭報告"
        },
        {
            "type": "專題",
            "weight": 30,
            "note": "期末小組專題報告"
        },
        {
            "type": "其他",
            "weight": 10,
            "note": "補課活動心得報告"
        }
    ],
    "prerequisite": "",
    "general_core": []
}