{
    "year": 108,
    "term": 2,
    "name": "美國文化研究",
    "teachers": [
        "路愷宜"
    ],
    "department": "LU21",
    "code": "ENU6013",
    "credit": 3,
    "serial": 1741,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 1,
            "from": 3,
            "to": 5,
            "campus": "本部",
            "classroom": "正306"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大三大四修習",
    "form_s": "3",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This interdisciplinary course examines the development of the United States in a global context, from colonial outpost to empire. Surveying events over the past 500 years, the course considers the changes in American values and lives in a historical context (as manifested in social institutions and social movements), the diverse cultures that have created the American social fabric, as well as some aspects of role the U.S. has played in the 20th century history and culture. Employing an American studies methodology the course draws from different disciplines (history, literature, sociology and media studies) and investigates the extraordinary sweep of US cultures through several units: discovery and conquest, slavery and capitalism, wars and imperialism, globalization and mass culture. The course uses social and analytical categories such as race, ethnicity, class, gender and sexuality in order to explore several contact zones, social spaces where ideologies and cultural values meet, clash, and negotiate their borders. It introduces students to various types of primary materials (such as political speeches, historical documents, newspaper articles, films, ads, songs) and to different American studies methods of reading and analyzing such material.",
    "goals": [
        "To familiarize students with major historical and political events in American culture",
        "To enable them to compare and contrast significant cultural paradigms which inform American culture and society today.",
        "To familiarize students with some critical concepts such as ideology, hegemony, multiculturalism, race, ethnicity, culture wars, panopticism, simulacra.",
        "To give students some familiarity with the representations in visual arts of the topics discussed."
    ],
    "syllabus": "**_Course requirements_**\n\nStudents are expected to be familiar with the required readings _prior to_ class discussions. Students will be graded on the basis of (1) their active participation in the class discussions/presentations _and_ on Moodle—25%, (2) midterm 30%, (3) a final take home exam—30% (4) week 17-18 Moodle assignments 15%. This is a written presentation about a theme connected to our topics. Guidelines for the project will be given in class. Failure to attend classes, post responses on Moodle _on time_, cover the readings _prior to_ class discussion, submit the final assignment/research project will result in the student’s inability to pass. \n\n3/2 Week 1 Introduction. We are the World?!\n\n3/9 Week 2 Discovery and Conquest. \n\n3/16 Week 3 The West/s in American Culture \n\n3/23-3/30 Week 4-5 The Native American Experience\n\n4/6 Week 6 University Day events, no classes\n\n4/13-4/20-Week 7-8 African-American History and Culture\n\n4/27 Week 9 midterm\n\n5/4-5/11 Week 10-11 Immigration and Ethnicity\n\n5/18 Week 12 US & WWII\n\n5/25 Week 13 From Manifest Destiny to Imperialism, Internationalism, Interventionism\n\n6/1 Week 14 Gender, Popular Culture & Advertising\n\n6/8-15 Week 15-16: American Heroism from Literature to Film (TBA this class might be rescheduled)\n\nTim O’Brien, “How to Tell a War Story”\n\nViet Thanh Nguyen, The Sympathizer, excerpts\n\nFilm _Apocalypse Now_\n\nWeek 17-18 Assignments on Moodle",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 15,
            "note": "week 17-18 Moodle assignments 15%"
        },
        {
            "type": "期中考",
            "weight": 30,
            "note": "midterm 30%"
        },
        {
            "type": "期末考",
            "weight": 30,
            "note": "final take home exam 30%"
        },
        {
            "type": "課堂討論參與",
            "weight": 25,
            "note": "active participation in the class discussions/presentations and on Moodle 25%"
        }
    ],
    "prerequisite": "",
    "general_core": []
}