{
    "year": 109,
    "term": 2,
    "name": "物理教學實習（二）（IB）",
    "teachers": [
        "陳育霖"
    ],
    "department": "EU",
    "code": "IBU0006",
    "credit": 1,
    "serial": 638,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 10,
            "to": 11,
            "campus": "公館",
            "classroom": "Ｓ407"
        }
    ],
    "programs": [
        "國際教師學程-物理"
    ],
    "comment": "",
    "restrict": "◎第一階段限 國際教師學程-物理◎限國際教師學程-物理選修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "Physics is an international enterprise, which plays a key role in the future progress of humankind. The support of physics education continue to drive the economic engines of the world. Physics is an essential part of the educational system and of an advanced society.\n\n\nScience stems from human curiosity or need around life. Humans study various phenomena and changes in nature via observation, and cleverly use science to solve problems, to adapt to the environment, and to live a better life. Science knowledge continues to accumulate in the process of civilization evolution. \n\n\nLiving in the modern age, our surroundings are full of innovative technological products, a wealth of information, and environmental and ecological issues derived from resource development. Our nationals also need to have scientific literacy, such as understanding the contribution and limitations of science, making good use of scientific knowledge and methods, being able to deal with all kinds of daily science-related problems in a rational and positive manner and with innovative thinking, comments, judgments and actions. At the same time, we need to cultivate future scientific personnel to lay a solid foundation for human civilization and social and economic development.\n\n\nThe core literacy of 12-year National Basic Education course in natural science includes: \n(1) Inquiry Skills, providing students with opportunities to explore learning and problem-solving and to develop relevant; \n(2) Scientific Attitude and Nature of Science, assisting students to understand the ways in which scientific knowledge is produced and developing scientific thinking and the habit of inquiry; \n(3) Core Concept, guiding students to learn scientific knowledge. \nBy practicing the above three connotations, cultivating students to achieve the goal of whole-person development.\n\n\nThe core literacy of natural sciences focuses on scientific process skills including observation, logical thinking, reasoning and judgment, and students can use them as their basis to gain knowledge and planning experiments in order to solve problems, which corresponds to TOK of IBDP. \n\n\nThe 3 phases and 9 items of the General Outline of 12-year National Basic Education are listed in the following.\n(1) Autonomous Action, (2) Communication and Interaction, (3) Social Participation\n\n\nThe scientific process skills acquired in the curriculum of studying natural science are the common needs of talents in various fields. Natural science such as physics and chemistry are required courses for secondary school students in Taiwan. Inheriting the tradition of natural sciences, teacher candidates  in related fields must be familiar with describing natural phenomena in scientific languages. \n\n\nThis course links pre-service teachers' learning and cognition from the viewpoint of the history and the nature of science. It mainly explores instructional strategies, laboratory investigation and the trend of physics education to help pre-service teachers conduct practical curriculum analysis and development. Cases of physics education in DP courses within the IB course system are introduced. The alignment of IB course system and 12-year National Basic Education in Taiwan are also introduced. The pedagogy of the course, Teaching Materials and Methods: Physics, is designed to demonstrate the pedagogy shown on the Syllabus. The 3 terms of core literacy, Inquiry Skills, Scientific Attitude and Nature of Science, and Core Concept are originated from the nature of science. \n\n\nThe strategy of Understanding by Design (UbD), backward design, is utilized to instruct pre-service teachers, prior to curriculum and courses design, to conduct literacy-oriented assessment corresponding to the core literacy of nature science and general outline of 12-year National Basic Education. Pre-service teachers need to take turns to teach in every class. Each UNIT design includes: \n(1) Essential idea\n(2) Nature of science\n(3) Theory of knowledge\n(4) Aims\n(5) Understandings\n(6) Applications and skills\n(7) Guidance\n(8) Data booklet reference\n\n\nWe provide case study, group discussion and presentation in class to experience authentic science research community operation. Pre-service teachers are asked to convince all their peers in a scientific manner corresponding to the symmetry of physical laws. In addition, Creativity, Action, and Service are emphasized in each classes, such as Social Participation course and brainstorming or design thinking curriculum design with high school teachers.",
    "goals": [
        "透過本課程的介紹，使學生認識哲學的基本概念及各種教育思想的特點。"
    ],
    "syllabus": "Physics is an international enterprise, which plays a key role in the future progress of humankind. The support of physics education in all countries continue to drive the economic engines of the world. Physics is an essential part of the educational system and of an advanced society.\n\nScience stems from human curiosity or need around life. Humans study various phenomena and changes in nature via observation, and cleverly use science to solve problems, to adapt to the environment, and to live a better life. Science continues to accumulate in the process of civilization evolution.\n\nLiving in the modern age, our surroundings are full of innovative technological products, a wealth of information, and environmental and ecological issues derived from resource development. Therefore, our nationals also need to have scientific literacy, such as being able to understand the contribution and limitations of science, making good use of scientific knowledge and methods, being able to deal with all kinds of science-related problems in daily life in a rational and positive manner and with innovative thinking, comments, judgments and actions. At the same time, we also need to cultivate future scientific personnel to lay a solid foundation for human civilization and social and economic development.\n\nThe core literacy of 12-year National Basic Education course in natural science in Taiwan includes:\n\n(1) Inquiry Skills, providing students with opportunities to explore learning and problem-solving and to develop relevant;\n\n(2) Scientific Attitude and Nature of Science, assisting students to understand the ways in which scientific knowledge is produced and developing scientific thinking and the habit of inquiry;\n\n(3) Core Concept, guiding students to learn scientific knowledge.\n\nBy practicing the above three connotations, cultivating students to achieve the goal of whole-person development.\n\nThe core literacy of natural sciences focuses on scientific process skills including observation, logical thinking, reasoning and judgment, and the students can use them as their basis to gain knowledge and planning experiments in order to solve problems, which corresponds to **TOK** of IBDP.\n\nWhile the 3 phases and 9 items of the General Outline of 12-year National Basic Education are listed in the table below\n\n1.  Autonomous Action, (2) Communication and Interaction, (3) Social Participation\n\nThe scientific process skills acquired in the curriculum of studying natural science are the common needs of talents in various fields. Natural science such as physics and chemistry are required courses for secondary school students in Taiwan. Inheriting the tradition of natural sciences, students in related fields must be familiar with describing natural phenomena in scientific languages.\n\nThis course links students’ learning and cognition from the viewpoint of the history and the nature of science. It mainly explores instructional strategies, laboratory investigation and the trend of physics education to help student to conduct practical curriculum analysis and development. The instructor will also introduce cases of physics education in DP courses within the IB course system. The alignment of IB course system and 12-year National Basic Education in Taiwan will be also introduced. The pedagogy of the course, Teaching Materials and Methods: Physics, is designed to demonstrate the pedagogy we show on the Syllabus. Since the 3 terms of core literacy, Inquiry Skills, Scientific Attitude and Nature of Science, and Core Concept are originated from the nature of science.\n\nThe strategy of Understanding by Design (UbD), backward design, is utilized to instruct teacher students to conduct literacy-oriented assessment prior to curriculum and courses design corresponding to the core literacy of nature science and general outline of 12-year National Basic Education. Students need to take turns to teach in every class. Each UNIT design includes\n\n1.  Essential idea\n2.  Nature of science\n3.  Theory of knowledge\n4.  Aims\n5.  Understandings\n6.  Applications and skills\n7.  Guidance\n8.  Data booklet reference\n\nWe provide cases study, group discussion and presentation in class to experience authentic science research community operation. Students are asked to convince all their peers in a scientific manner corresponding to the symmetry of physical laws. In addition, **Creativity**, **Action**, and **Service** are emphasized in each classes, such as Social Participation course and brain storming or design thinking curriculum design with high school teachers.\n\n**Learning Objectives**\n\nThe main purpose of the practicum to IBDP school is to confirm the theoretical knowledge in the process of cultivating and educating students so that the trainee teachers can construct the knowledge structure and system of themselves and accumulate the cognition and concept of the future careers at this stage. The main focus of the learning process is to understand the following sections,\n\n(1) The student part, the student's entry behavior, the collective culture, the extracurricular activities, the transfer of the learning concept, and school's daily routine.\n\n(2) The teacher part, course design and rationale, classroom management strategies, teaching reflection, interpersonal relationship, teacher community, parental communication.\n\n(3) The administrative part, the administrative organization structure, event planning, outine activities planning, the administrative support of teaching.\n\n(4) School teaching Facilities, campus building and planning, teaching equipment,\n\nlaboratory apparatus.\n\n(5) Parents association.\n\n(6) How to clarify to teacher’s own educational philosophy to the society, the new trend of education and popular trend of thought in the campus.\n\nThis course emphasizes students’ ability to cultivate practical teaching, including curriculum design skills, leading students to conduct scientific inquiry and practice/experiment, performance and presentation skills, communicate with groups and lead the team to focus discussion.\n\nTopics include instructional methodologies, textbook overview, IBDP course syllabus development, curriculum resources, and the selection and planning of appropriate inquiry-based lab experiments. Albert Einstein said that “If you can't explain it simply, you don't understand it well enough.” Richard P. Feynman also asked his students take three non-trivial examples to depict a physics concept. Teaching and presentation efficiently could be a good assessment task to perform. In addition, Inquiry-based curriculum design is a process for teachers to continuously rebuild the concept of knowledge to **create** innovative ideas. Through **activities** designed to **share** with peers, to achieve the scientific nature and contribution to the world, which is the concept of **IBDP CAS**, **Creativity, Activity, Service**.  \n  \n \n\nClass Meetings\n\n\\[1\\]Topic: Preservice Teachers’ Prior Beliefs  \nPre-service education often provides the first step in the professional development of teachers. Prospective teachers have well-developed beliefs about learning and teaching that can form obstacles to instruction. Pedagogical knowledge is linked closely to teacher belief in that there are factors that influence teachers’ attitudes and beliefs toward the implementation of a variety of instructional models and strategies \\[Gerges 2001\\], especially for our inquiry-based, problem-based and student-centered strategies. \n\n\\[2\\]Topic: Preparing IBDP Physics curriculum plan  \nBased on the high student's entry behavior and IBDP physics curriculum objectives, teachers need to have an overall consideration of the entire physics knowledge with TOK structure and logical order.\n\n\\[3\\]Topic: Preparing IBDP Physics curriculum plan of Additional higher level  \nBased on the high student's entry behavior and IBDP physics curriculum Additional higher level, teachers need to have an overall consideration of the entire physics knowledge with TOK structure and logical order.\n\n\\[4\\]Topic: Classroom Observation & Peer Review\n\n\\[5\\]Topic: Classroom Observation & Peer Review\n\n\\[6\\]Topic: Classroom Observation & Peer Review\n\n\\[7\\]Topic: Teaching Practicum & Peer Review\n\n\\[8\\]Topic: Teaching Practicum & Peer Review\n\n\\[9\\]Topic: Teaching Practicum & Peer Review\n\n\\[10\\]Topic: Teaching Practicum & Peer Review\n\n\\[11\\]Topic: Report Students' Own Teaching Practicum at IB school (I)\n\n\\[12\\]Topic: Report Students Own Teaching Practicum at IB school (II)\n\n\\[13\\]Topic: Report Students Own Teaching Practicum at IB school (III)\n\n\\[14\\]Topic: Preparing IBDP Physics curriculum plan of Option A: Relativity\n\n\\[15\\]Topic: Preparing IBDP Physics curriculum plan of Option B: Engineering physics, Core topics and Additional   \n\\[16\\]Topic: Preparing IBDP Physics curriculum plan of Option C: Imaging\n\n\\[17\\]Topic: Preparing IBDP Physics curriculum plan of Option D: Astrophysics \n\n\\[18\\]Topic: Reflections on the overall curriculum",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Direct instruction"
        },
        {
            "type": "討論法",
            "note": "Focused conversation method"
        },
        {
            "type": "問題解決教學",
            "note": "PBL"
        },
        {
            "type": "合作學習",
            "note": "Peer review"
        },
        {
            "type": "實驗/實作",
            "note": "Practical work"
        },
        {
            "type": "實地考察、參訪",
            "note": "Teaching practicum"
        },
        {
            "type": "媒體融入教學",
            "note": "ICT utilization"
        },
        {
            "type": "專題研究",
            "note": "TOK, Extented essay"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "Essay"
        },
        {
            "type": "課堂討論參與",
            "weight": 40,
            "note": "Moderator, focused conversation method, design thinking"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 10,
            "note": "Moderator, inquiry-based teaching"
        },
        {
            "type": "成果展覽",
            "weight": 10,
            "note": "Scientific community"
        },
        {
            "type": "專題",
            "weight": 10,
            "note": "Practical project"
        }
    ],
    "prerequisite": "",
    "general_core": []
}