{
    "year": 109,
    "term": 2,
    "name": "教師專業發展（IB）",
    "teachers": [
        "葉怡芬",
        "柯琦"
    ],
    "department": "EU",
    "code": "IBUE003",
    "credit": 3,
    "serial": 640,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "正204"
        }
    ],
    "programs": [
        "國際教師學程-國際"
    ],
    "comment": "本課程由葉怡芬老師、Keith M. Graham老師合開。",
    "restrict": "◎第一階段限 國際教師學程-國際◎限國際教師學程-國際選修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course aims at preparing students to do continuing professional development (CPD) as well as stimulating deeper understanding of the professionalism of being a teacher. The importance of CPD in contemporary educational practices is acknowledged globally. In order to equip students with abilities to achieve better in this fast-changing world, education professionals can no longer teach knowledge but have to infuse high order thinking skills such as critical thinking and systems thinking in their teaching. Education Professionals such as teachers, and school leaders are required to be life-long learners so that they can improve the quality of their teaching practices, engage students in various learning activities and demonstrate that they continuingly expand their capacity as an individual and a professional.",
    "goals": [
        "Observe classrooms and practice interdisciplinary teaching.",
        "Understand the need and importance of CPD; understand various approaches to CPD.",
        "Apply certain approach of CPD;　understand how professional learning community works in schools.",
        "Understand the need and importance of CPD.",
        "Experiencing and reflecting good practices of CPD in schools"
    ],
    "syllabus": "**Continuing Professional Development****教師專業發展**\n\n**Instructor**\n\n[葉怡芬yyf521@ntnu.edu.tw](mailto:%E8%91%89%E6%80%A1%E8%8A%ACyyf521@ntnu.edu.tw) | [Keith M. Graham kmgraham@ntnu.edu.tw](mailto:kmgraham@ntnu.edu.tw)\n\n**Class Time**\n\nTues. 13:20-16:20\n\n**Office Hour**\n\n13:30-17:00 (THUR)\n\n**Objectives**\n\nThis course aims at preparing students to do continuing professional development (CPD) as well as stimulating deeper understanding of the professionalism of being a teacher. In order to equip students with abilities to achieve better in this fast-changing world, education professionals can no longer teach knowledge but have to infuse high order thinking skills such as critical thinking and systems thinking in their teaching. Viewing the educational reforms, this course will guide students to achieve two major objectives. First, students will develop growth mindsets through experiencing the ways how teachers empower themselves with resources accessible. Second, students will build up their knowledge and capacity to design and teach subject content in English or bilingual modes.\n\n**Weekly Schedule**\n\nWeek\n\nTopic\n\nAssignment\n\n\\[1\\] 2/23\n\nYvonne\n\nDevelopment of CPD and PLC\n\n\\[2\\] 3/2\n\nKeith\n\nGlobal and Local Forces in Bilingual Education (BE)\n\n\\[3\\] 3/9\n\nKeith\n\nPrinciples and Arrangements of BE\n\n\\[4\\] 3/16\n\nKeith\n\nBE Lesson Planning\n\n\\[5\\] 3/23\n\nKeith\n\nBE Learners and Assessment\n\nBE Lesson Plan Due\n\n\\[6\\] 3/30\n\nYvonne\n\nTOK, group presentation\n\nBE Assessment Due\n\n\\[7\\] 4/6\n\nYvonne\n\nTOK, group presentation\n\n\\[8\\] 4/13\n\nYvonne\n\nTOK, group presentation\n\n\\[9\\] 4/20\n\nYvonne\n\nTOK, group presentation\n\n\\[10\\] 4/27\n\nKeith\n\nReading in BE\n\n\\[11\\] 5/4\n\nKeith\n\nWriting in BE\n\n\\[12\\] 5/11\n\nKeith\n\nListening in BE\n\n\\[13\\] 5/18\n\nKeith\n\nSpeaking in BE\n\nBE Materials Due\n\n\\[14\\] 5/25\n\nKeith\n\nReflection and Collaboration in BE\n\n\\[15\\] 6/1\n\nKeith\n\nBE Portfolio Showcase\n\nBE Portfolios Due\n\n\\[16\\] 6/8\n\nKeith\n\nBE Portfolio Showcase\n\n\\[17\\] & \\[18\\]\n\nClassroom Observations\n\n**Grade Distribution**\n\nCategory\n\nWeighting\n\nDescription\n\nClassroom Observation\n\n20%\n\nYou will need to observe at least 1 class session and write a reflective journal (800 words max.). Dates for the open classroom sessions will be offered.\n\nSharing a Book\n\n20%\n\nStudents of 3-4 ppl from different disciplines select a book from the reading list in below or after discussing with the instructor. Each group needs to lead a 1hr workshop, helping other teams to learn what is worth pursued in the future teaching and learning. That is, related learning activities including inquiry questions or some other learning materials need to be prepared. Your performance will be evaluated by other groups and the instructor\n\nTOK Performance\n\n10%\n\nYour performances in class and Moodle for TOK sessions are necessary.\n\nBE Lesson Plan\n\n10%\n\nStudents will create a lesson plan for a topic in their discipline. The lesson will exhibit principles of IB lesson planning learned in previous courses while incorporating principles of a flexible multiplicity BE arrangement learned in this course.  \n\nBE Assessment\n\n10%\n\nStudents will create a summative assessment to accompany their lesson plan. The assessment will contain items along the content–language continuum and be appropriate for a flexible multiplicity BE arrangement.\n\nBE Material Example\n\n5%\n\nStudents will create materials for supporting bilingual academic literacy development in their discipline. The materials should target both reading and writing for learners at various language proficiency levels.\n\nFinal BE Portfolio & Presentation\n\n25%\n\nStudents will create a final BE portfolio based on topics covered throughout the course. Students are encouraged to compile each section of the portfolio after each class. At the end of the semester, students will present their portfolios to the class.",
    "methodologies": [
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "Sharing a book：You need to read a book that is related to educational leadership, pedagogy inquiry, or professional development. The book list will be offered. You will need to 1) write a 500-word book introduction, 2) post the introduction to the Moodle, 3) initiates the discussion with 3 questions and respond to each peer’s discussion thread, and 4) 1500-word short essay explaining how it inspires you or how you will apply that to your future teaching."
        },
        {
            "type": "專題",
            "weight": 30,
            "note": "Case Study：Each group needs to choose at least one PLC as their case study. They need to participate 3 meetings of the case PLC and take necessary field notes. Students also need to interview the PLC members with self-designed interview questions. Findings of how the PLC operates and key factors for successful PD need to be presented and each group needs to design and lead related discussions."
        },
        {
            "type": "其他",
            "weight": 30,
            "note": "Personal CPD plan：Individual student needs to design their personal CPD plan."
        }
    ],
    "prerequisite": "",
    "general_core": []
}