{
    "year": 110,
    "term": 1,
    "name": "人資互動",
    "teachers": [
        "吳怡瑾"
    ],
    "department": "EM15",
    "code": "ISC8008",
    "credit": 3,
    "serial": 517,
    "group": "",
    "quota": {
        "limit": 32,
        "additional": 2
    },
    "schedule": [
        {
            "day": 3,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "教403"
        }
    ],
    "programs": [],
    "comment": "◎數位課程",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "This course is designed to survey and explore the human information interaction (HII) as a process, within which information needs, information seeking behavior, and information use by people in various roles, situations, environments, and contexts that go beyond traditional information services places like libraries. More specifically, this course not only examines the information behavior as a whole, but also covers the breakdown of the process, including information needs assessment, information seeking, and information use. The learning objectives in this course are including: A. To understand the key concepts of Information retrieval and human information interaction. B. To learn the theories and methodologies of HII deeper and border. C. To know how to apply the theories and methodologies of HII in the real context. D. To develop expertise and first-hand experience in a particular specialized topic of HII.",
    "goals": [
        "Explore the philosophical, theoretical, and methodological ground of Human Information Interaction research and practices",
        "Design and develop information services based on user study analysis and information design principles"
    ],
    "syllabus": "This course is designed to survey and explore the human information interaction (HII) as a process, within which information needs, information seeking behavior, and information use by people in various roles, situations, environments, and contexts that go beyond traditional information services places like libraries. More specifically, this course not only examines the information behavior as a whole, but also covers the breakdown of the process, including information needs assessment, information seeking, and information use. The learning objectives in this course are including: A. To understand the key concepts of Information retrieval and human information interaction. B. To learn the theories and methodologies of HII deeper and border. C. To know how to apply the theories and methodologies of HII in the real context. D. To develop expertise and first-hand experience in a particular specialized topic of HII.\n\n將依同學修課與特殊疫情狀況調整各週進度與授課形式, 會事先通知。\n\n詳細課綱請參考附檔PDF  \n \n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=d005fac92181459bb9cbd0a11f40ae16&fno=0eca9f53b9f341809a57453ba4849767)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "投影片, 影片與課程教材"
        },
        {
            "type": "討論法",
            "note": "課程相關議題討論"
        },
        {
            "type": "合作學習",
            "note": "專題與論文報告合作"
        },
        {
            "type": "實驗/實作",
            "note": "兩次實作演練"
        },
        {
            "type": "專題研究",
            "note": "期中企劃案與期末專題報告"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 35,
            "note": "二到三次實作演練(HII Tools)成績\n平台作業\n每週平台測驗與評量"
        },
        {
            "type": "出席",
            "weight": 20,
            "note": "線上討論區參與、上課(實體與線上)出席與討論 (20-25%)"
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "論文報告"
        },
        {
            "type": "專題",
            "weight": 25,
            "note": "期中企劃案與期末專題報告 (20-25%)"
        }
    ],
    "prerequisite": "",
    "general_core": []
}