{
    "year": 110,
    "term": 1,
    "name": "參考資源與服務",
    "teachers": [
        "吳美美"
    ],
    "department": "EM15",
    "code": "ISM0117",
    "credit": 3,
    "serial": 510,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "圖資所研討室B"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "Reference Service is one of the essential parts of library readers’ service. Professional reference librarian on one hand assists in question answering, and on the other hand instructs library patrons to utilize library resources. With the changing environment of information service, such as the influences by digital technology, web-based, mobile, social, and intelligent service, the context and content of library reference service has changed drastically for the last decade. This course introduces the basic concepts and applications of various types of reference tools and reference services. Meanwhile, it will also focus on topics related to the trend of library reference. Further, the curriculum emphasizes the capability of practical application, and students will learn by doing through various practicum-based assignments.",
    "goals": [
        "Understand the nature and functions of reference services.",
        "Familiarize types of reference sources both in Chinese and Western materials.",
        "Learn the skills of conducting a reference interview.",
        "Learn to prepare pathfinders to guide users to utilize topic-oriented sources in a library or on the web.",
        "Understand the managerial aspects of a library reference division.",
        "Grasp the important research topics and trends of reference services."
    ],
    "syllabus": "1.          參考資源概論與種類\n\n2.          參考資源選擇與利用\n\n3.          指引型參考資源--中西文書目、索引與摘要\n\n4.          資料型參考資源--中西文字、辭典、百科全書、類書\n\n5.          快速型參考資源\n\n6.          專題資訊\n\n7.          新聞資訊檢索與利用\n\n8.          人物資訊檢索\n\n9.          地理資訊檢索\n\n10.      健康科學資訊檢索\n\n11.      政府資訊檢索\n\n12.      工商資訊檢索、標準、專利、商標與技術報告檢索\n\n13.      參考服務概論、認識顧客與需求\n\n14.      數位參考服務、合作參考服務\n\n15.      參考服務之組織與管理、績效評估\n\n16.      參考館員的養成與發展\n\n17.    預行期末報告與綜合討論\n\n18.     期末報告與課程評鑑",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 50,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 40,
            "note": "期中報告、期末報告各20%"
        }
    ],
    "prerequisite": "",
    "general_core": []
}