{
    "year": 109,
    "term": 2,
    "name": "中文寫作與表達：自主學習",
    "teachers": [
        "謝秀卉"
    ],
    "department": "CU",
    "code": "00UA8B1",
    "credit": 2,
    "serial": 288,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 0
    },
    "schedule": [
        {
            "day": 0,
            "from": -1,
            "to": -1,
            "campus": "",
            "classroom": ""
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎第一階段需人工加選◎第二階段需人工加選◎加退選階段需人工加選",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "為推動自主學習風氣，培養學生跨域探索及終生學習能力，支持學生得依據不同學習狀態及需求，訂定「中文寫作與表達」課程自主學習方案，深化個別學習，自主學習課程規劃以專題寫作為主，內容應切合本校「中文寫作與表達」課程規劃宗旨，包含專題寫作三主題（應用寫作、評論寫作及自由寫作）；具備反思及知識縱深，融入深度討論（Quality Talk）；學習內容完整，應闡明自主學習之學習動機、目標、內容、實施方式、預定學習時程及預期成果等事項。",
    "goals": [
        "增進學生寫作各種文類的能力。",
        "能掌握理解應用寫作。",
        "提升學生分析、評論各類文本的能力。",
        "強化學生聆聽及口語表達的能力。",
        "促進學生思考、組織、想像與創造的能力。",
        "誘導學生閱讀的興趣、培養學生閱讀的習慣與品味。",
        "研讀經典，以充實知識涵養、拓展人生視野、啟發對人文及不同種族文化的關懷與理解。"
    ],
    "syllabus": "■ **自主學習計畫規劃要項**\n\n**一、由學生自訂「中文寫作與表達」課程自主學習方案，限以小組提出申請，小組人數以3～6人為限。**\n\n**二、自主學習內容具備條件**\n\n**（一）內容應切合本校「中文寫作與表達」課程規劃宗旨，包含專題寫作三主題（應用寫作、評論寫作及自由寫作）**\n\n**（二）具備反思及知識縱深，融入深度討論（Quality Talk）**\n\n**（三）學習內容完整，應闡明自主學習之學習動機、目標、內容、實施方式、預定學習時程及預期成果等事項**\n\n**三、執行要求**\n\n**（一）每月（3-5月）最後一週提交「自主學習月誌」，除上傳於Moodle平台，並向教師簡報執行情形，以利教師諮詢輔導。**\n\n**（二）期末繳交成果報告並完成成果展演。**\n\n■**「中文寫作與表達」課程說明**\n\n**第一單元  應用寫作**\n\n【主旨】\n\n    在現實生活裡，應用性的文書是無可避免的，升學、求職、陳情、請願……每一個場合都可能運用到文字來作訴求，過去中學讀的古文，很多都是「應用文」，也就是在特定場合底下，具有一定的現實功能所必須寫出來的文章，請同學不妨回顧這些作品，你認為這些「優質選文」，有沒有達到當初作者所預期的目的呢？其次，當我們也面對生活中的各種訴求，讀書計畫、研究計畫、轉系(輔系、雙修)動機說明、代擬推薦信、公文、書信、文案……等，大家也可以找機會實作練習，也許現實中真的能派上用場。\n\n【內容】\n\n一、教師可由學生實際寫作的成果加以分析討論，讓學生能由實作與修該中提升自己的寫作能力，並完成作品。\n\n二、建議也可有由分組的方式進行，由同學互評，建立提供意見、接納意見的學習情境。\n\n三、作業：應有上述相關文體的實際寫作和成品。\n\n**第二單元  評論寫作**\n\n【主旨】\n\n    無處不在的網路與媒體，即時發表意見的現代生活，在你的經驗中，是否曾經覺得一篇評論頭頭是道，無論文辭、語調、舉證和觀點，都深深擊中了你心底的感覺，增添了你對某一事務理解的深度。又或你有沒有讀過一些感覺很差的評論，觀念偏頗、語氣讓你不能忍受，舉證或邏輯推理更是亂七八糟，通篇讀完，心裡只有一個聲音：「我剛剛是在看XX」。我們隨時都在發表意見，評論別人也被別人評論，如何寫出具有自己觀點，又能完整動人的呈現，已經是現代公民的必備素養，這個課程，我們將嘗試做一個理性負責的意見發表者，嘗試從：文學、藝術、音樂、體育賽事評論、策展、影劇、新聞事件及公共議題等方面來寫出優質的評論。\n\n【內容】\n\n一、可由教師提供「正面」與「反面」的案例，藉由討論，讓同學體會評論寫作的重點和應避免的問題。\n\n二、有由同學自行報告他的閱讀經驗，透過集體討論來歸納出評列寫作的原則。\n\n三、可由教師指定寫作某一特定領域的評論(例如影評、書評或公共議題評論)，再透過討論來增進寫作較能。\n\n四、作業：應以上述領域，完成至少一篇完整的評論。\n\n**第三單元  自由寫作**\n\n【主旨】\n\n    文學對我們心靈的滋養與啟發式無限的，我們也深信，每個人的心中都有一篇動人的故事，或是一首感人的詩，或許，人與人之間的心靈交流，就是透過這些故事使感動。請不要覺得文學離你相當遙遠，發生在你生命中的點點滴滴，也許就是最感動人心的偉大文學作品；又或者你喜歡幻想，能夠虛構特殊的人物或曲折的劇情，搞笑或是嚴肅，浪漫或者充滿哲思，也許我們可以嘗試表現自己的風格，寫出自己的文學。這個世界需要「故事力」，為品牌或產品說一個故事；這個世界也需要詩，用簡單的一句話表達一切。希望在這個單元的嘗試後，在未來你能成為會說故事的老師，懂得詩歌的工程師，能夠設計角色、編纂劇本的企業主……。\n\n【內容】\n\n一、可由教師提供文本範例，討論文學寫作的基本原則。\n\n二、可有由同學自行分享他的閱讀經驗，提升同學的審美能力與文學興趣。\n\n三、對於文學寫作經驗較缺乏的同學，可以嘗試寫作自己的生命故事，或由全班進行某一特定主題的寫作，例如「生命中的老師」、「寵物經驗」、「自己的或別人的愛情故事」……等，彼此分享，增進學生的寫作信心。\n\n四、已經有一定寫作能力的學生，也可以請他分享自己的作品。\n\n五、作業：應以上述領域，完成至少一篇完整的作品。",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": "深度討論教學法"
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "實驗/實作",
            "note": ""
        },
        {
            "type": "實地考察、參訪",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": "一、小組自評60%\n二、授課教師40％"
        }
    ],
    "prerequisite": "",
    "general_core": []
}