{
    "year": 109,
    "term": 2,
    "name": "英美文學史選讀",
    "teachers": [
        "狄亞倫"
    ],
    "department": "LM21",
    "code": "ENC1117",
    "credit": 3,
    "serial": 1588,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "雲203"
        }
    ],
    "programs": [],
    "comment": "教室位於雲和街大樓2樓（地址：雲和街1號），外校學生需申請門禁權限。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "A",
    "hours": 3,
    "description": "This course is offered as a complement to the Theory/Cultural Studies course now required of incoming graduate students in Literature, and is intended as a review of English, British, and American literary history for graduate students. The course emphasizes the value of analyzing works of literature as the products of specific cultures in the past. This review is intended to serve as a foundation for future decisions about which aspect/era/genre/specialty students will focus on in their graduate work. The syllabus and readings will be determined by the individual instructor, and may include guest lecturers on each period; the readings will include highlights of English, British, and American literature and cover a range of periods and genres, from medieval times to modern, with an overview of pre-nineteenth-century periods and greater emphasis on the nineteenth century and after. As a complete survey of English and American literature in one semester is impractical, the course aims to introduce students to texts that highlight the most compelling issues of each period. Furthermore, so as to stimulate students into finding innovative topics and approaches in their own research, this course draws attention to recent historicist scholarship and, more specifically, scholarship emphasizing the ways in which the literature of the past has been mediated by or in some sense revisited in later periods. Thematic cohesion is also provided by the attention given throughout the course to changing representations of gender, sexuality, motherhood, marriage, race, and the idea of a national literature.",
    "goals": [
        "The course is designed to meet all of the Department’s core goals, in deepening the student’s knowledge in the field of literature in English, and in giving opportunities to students to communicate effectively in English as colleagues and researchers.",
        "This course aims to offer students exposure to multiple perspectives on history from an international viewpoint, and to develop critical thinking skills through reading, analysis and discussion. international concept, can integrate."
    ],
    "syllabus": "**Readings in British and American Literary History (ENC1117)**\n\n英美文學史選讀\n\nEmail: aaron.c.deveson@gmail.com\n\nHours per week: 3\n\nCredits: 3\n\n**Aims and methods**\n\nThis course is offered as a complement to the Theory/Cultural Studies course now required of incoming graduate students in Literature, and is intended as a review of English, British, and American literary history for graduate students. The course emphasizes the value of analyzing works of literature as the products of specific cultures in the past. This review is intended to serve as a foundation for future decisions about which aspect/era/genre/specialty students will focus on in their graduate work. The syllabus and readings will be determined by the individual instructor, and may include guest lecturers on each period; the readings will include highlights of English, British, and American literature and cover a range of periods and genres, from medieval times to modern, with an overview of pre-nineteenth-century periods and greater emphasis on the nineteenth century and after. As a complete survey of English and American literature in one semester is impractical, the course aims to introduce students to texts that highlight the most compelling issues of each period. Furthermore, so as to stimulate students into finding innovative topics and approaches in their own research, this course draws attention to recent historicist scholarship and, more specifically, scholarship emphasizing the ways in which the literature of the past has been mediated by or in some sense revisited in later periods. Thematic cohesion is also provided by the attention given throughout the course to changing representations of gender, sexuality, motherhood, marriage, race, and the idea of a national literature.      \n\n**Texts**\n\nStudents will find many of the primary texts studied in this course in the Norton anthologies of English and American literature, but in many cases these texts can also be found online. When that is not the case copies will be provided by the instructor. Secondary texts will be provided by the instructor in PDF form and must be brought to class by each student.\n\n**Grading** \n\n**Presentation (30%)**. Each student will give one (Powerpoint) presentation introducing a specified text in a historical context. The talk should last between 15 and 17 mins. The topics for presentations will be provided in class.\n\n**Essay (70%)**. The essay will discuss works by two of the authors studied on this course. These works by different authors should be related to each other through their respective cultural and/or political contexts. Length of written essays: c. 3000 words. (See attached page.)\n\n**Typical lesson structure**\n\n*   Student presentation introducing a primary text in a historical context\n*   Instructor leads class in discussion of primary text, providing additional historical and literary context along the way\n*   Instructor leads class in discussion of historicist secondary text(s)\n*   (Video used in one class; Powerpoint used throughout the course.)\n\n**Schedule**\n\n1.  **Introduction** \n2.  **Old English and afterwards**: “The Wanderer” (trans. E.T. Donaldson) and “The Wife’s Lament” (trans. Alfred David); Chris Jones, “Anglo-Saxon Anxieties: Auden and ‘the Barbaric Poetry of the North,’” from _Strange Likeness: The Use of Old English in Twentieth-Century Poetry_ (Oxford, 2006)\n3.  **Middle and early modern English**: William Shakespeare, _The Winter’s Tale_; Mary Beth Rose, “Maternal Abandonment, Maternal Deprivation: Tales of Griselda in Boccaccio, Petrarch, Chaucer, and Shakespeare,” from _Plotting Motherhood in Medieval, Early Modern, and Modern Literature_ (Palgrave, 2017); DVD of _The Winter’s Tale_ (dir. Jane Howell).\n4.  _The Winter’s Tale_ contd.\n5.  **Early modern elegy**: John Donne, “The First Anniversary”; Mary Carey, “Upon the Sight of my abortive Birth the 31st December 1657”; Andrea Brady, “Grief Without Measure,” from _English Funerary Elegy in the Seventeenth Century_ (Palgrave, 2006)\n6.  **Eighteenth-century satire**: Alexander Pope, _The Rape of the Lock_; Delarivier Manley, _The New Atalantis_; Melinda Alliker Rabb, “Satire and Secrecy: Rereading _The New Atalantis_, _Gulliver’s Travels_, _The Rape of the Lock_, and _The Dunciad_,” from _Satire and Secrecy in English Literature from 1650 to 1750_ (Palgrave, 2007)\n7.  **Material afterlives**: Paul Prescott, “An introduction to the night-watch constable,” from _Reviewing Shakespeare: Journalism from the Eighteenth Century to the Present_ (Cambridge, 2013)\n8.  **New England literature**: Nathaniel Hawthorne, “Young Goodman Brown” and other stories; John McWilliams, Introduction, “Race, war, and white magic: the neglected legacy of Salem,” from _New England’s Crises and Cultural Memory: Literature, Politics, History, Religion, 1620-1860_ (Cambridge, 2004)\n9.  **An American writer?** Emily Dickinson, selected poems; Mary Loeffelholz, “Her American materials,” _The Value of Emily Dickinson_ (Cambridge, 2016)\n10.  **Writing democracy**: Henry Thoreau, _Wild Fruits_; Lance Newman, “William Wordsworth, Henry David Thoreau, and the Poetry of Nature” and “_Wild Fruits_, Capitalism, and Community,” from _Our Common Dwelling: Henry Thoreau, Transcendentalism, and the Class Politics of Nature_ (Palgrave, 2005)\n11.  **Civil wars, civil scars #1**: Walt Whitman, “When Lilacs Last in the Dooryard Bloom’d”; Joanna Levin, “Preface,” from _Walt Whitman in Context_ (ed. Joanna Levin (Cambridge, 2018); Peter Coviello “Civil War,” from Levin\n12.  **Civil wars, civil scars #2**: Whitman, selected writings; Rachel Rubinstein, “Native American and Immigrant Cultures,” from Levin; Ivy G. Wilson, “Slavery and Abolition,” from Levin; Sascha Pöhlmann, “Inﬂuence in the United States,” from Levin\n13.  **Cold war literature**: Langston Hughes, selected writings; Vera M. Kutzinski, Introduction and “Back in the USSA: Joe McCarthy’s Mistranslations,” from _The Worlds of Langston Hughes_ (Cornell, 2012)\n14.  Selected shorter fiction by Edith Wharton and Katherine Mansfield; Gerri Kimber and Delia da Sousa Correa, _Katherine Mansfield and the (Post)colonial_ (Edinburgh, 2013)\n15.  GUEST LECTURE (TBA)\n16.  Consolidation\n17.  Self-supported study\n18.  Self-supported study (FINAL essay due date TBA)",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "報告",
            "weight": 30,
            "note": "Each student will give one (Powerpoint) presentation introducing a specified text in a historical context. The talk should last between 15 and 17 mins. The topics for presentations will be provided in class."
        },
        {
            "type": "專題",
            "weight": 70,
            "note": "The essay will discuss works by two of the authors studied on this course. These works by different authors should be related to each other through their respective cultural and/or political contexts. Length of written essays: c. 3000 words."
        }
    ],
    "prerequisite": "",
    "general_core": []
}