{
    "year": 109,
    "term": 2,
    "name": "十九世紀歐洲詩選",
    "teachers": [
        "狄亞倫"
    ],
    "department": "LM21",
    "code": "ENC1111",
    "credit": 3,
    "serial": 1587,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 8,
            "to": 10,
            "campus": "本部",
            "classroom": "雲203"
        }
    ],
    "programs": [],
    "comment": "教室位於雲和街大樓2樓（地址：雲和街1號），外校學生需申請門禁權限。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "A",
    "hours": 3,
    "description": "This course is designed to offer postgraduate students an introduction to the poetry and poetic culture of Europe during the nineteenth century. Although there is a bias on the course toward poetry written originally in English, we will be considering a great deal of poetry originally written in German, Italian and French through English translations from the nineteenth century and afterwards. The course is arranged in thematic units but in such a way that crucial developments in technique and subject matter can be appreciated from a chronological perspective. The course is not based on any single theoretical or methodological principle: biographical, historicist, materialist, philosophical, psychoanalytical, and (ultra-)close readings will undoubtedly all play a role in making sense of the poetry to hand.",
    "goals": [
        "To help students become independent readers of nineteenth-century poetry from different European cultures and traditions.",
        "To provide the opportunity for postgraduate students to present their work to fellow students and faculty.",
        "To help students make use of paratextual and literary critical theories and techniques in their writing—but in such a way that they never lose sight of the individual poems, collection or oeuvre."
    ],
    "syllabus": "**Course Description**\n\nThis course is designed to offer postgraduate students an introduction to the poetry and poetic culture of Europe during the nineteenth century. Although there is a bias on the course toward poetry written originally in English, we will be considering a great deal of poetry originally written in German, Italian and French through English translations from the nineteenth century and afterwards. The course is arranged in thematic units but in such a way that crucial developments in technique and subject matter can be appreciated from a chronological perspective. The course is not based on any single theoretical or methodological principle: biographical, historicist, materialist, philosophical, psychoanalytical, and (ultra-)close readings will undoubtedly all play a role in making sense of the poetry to hand.\n\n**Schedule**\n\nWeek 1 Politics: Blake and Hölderlin\n\nWeek 2 Idylls and alienation: Leopardi and John Clare\n\nWeek 3 Skeptics and cosmopolitans #1: Byron and Percy Bysshe Shelley\n\nWeek 4 Skeptics and cosmopolitans #2: Heine and Pushkin\n\nWeek 5 Lateness: Goethe and Wordsworth\n\nWeek 6 Modern lives: Elizabeth Barrett Browning and Robert Browning\n\nWeek 7 HOLIDAY\n\nWeek 8 Skeptics and cosmopolitans #3: Arthur Hugh Clough and Matthew Arnold\n\nWeek 9 Dreams and other fragments #1: Tennyson,\n\nWeek 10 Dreams and other fragments #2: Dante Gabriel Rossetti and Christina Rossetti\n\nWeek 11 In the realm of the senses: Baudelaire, Swinburne, Arthur Symons, Ernest Dowson\n\nWeek 12 Aestheticisms: William Morris, Augusta Webster, Louisa Bevington, “Michael Field,” Amy Levy, Mary Robinson\n\nWeek 13 _Voyants_ #1: Emily Brontë, Gerard Manley Hopkins\n\nWeek 14 _Voyants_ #2: Rimbaud\n\nWeek 15 _Jouissance_: Mallarmé\n\nWeek 16 Consolidation class\n\nWeeks 17 and 18 Self-supported study toward FINAL essay\n\nEssay (70%) (c. 3000 words)\n\nStudents will write an essay on the work of two to three poets studied in the course. Students are encouraged to write about poets who were not read together in the same week of the course. Students may devise their own essay title and are not required to cleave to any particular theoretical or methodological principle in their writing. The completed essay should be emailed to [aaron.c.deveson@gmail.com](mailto:aaron.c.deveson@gmail.com). In the case of late submissions, 5% will be deducted for every day by which the assignment is late. \n\nIndividual presentation (30%).\n\nThe presenting student will use but not simply read from Powerpoint slides. The presentation will typically introduce the life and work of a particular writer. It must refer in a general way to at least four poems and provide a detailed analysis of one of those poems. It must contain at least three images. It should last between 18 and 20 minutes.\n\nCourse dossier provided. This will include poems by authors listed above but also paratextual materials",
    "methodologies": [
        {
            "type": "講述法",
            "note": "I tend to weave questions and opportunities for close textual reading and discussion into the texture of my “lectures”"
        },
        {
            "type": "討論法",
            "note": "See above"
        },
        {
            "type": "媒體融入教學",
            "note": "Use of related artworks (e.g. paintings and music from the period)"
        }
    ],
    "grading": [
        {
            "type": "報告",
            "weight": 30,
            "note": "The presenting student will use but not simply read from Powerpoint slides. The presentation will typically introduce the life and work of a particular writer. It must refer in a general way to at least four poems and provide a detailed analysis of one of those poems. It must contain at least three images. It should last between 18 and 20 minutes."
        },
        {
            "type": "專題",
            "weight": 70,
            "note": "Students will write an essay on the work of two to three poets studied in the course. Students are encouraged to write about poets who were not read together in the same week of the course. Students may devise their own essay title and are not required to cleave to any particular theoretical or methodological principle in their writing. The completed essay should be emailed to aaron.c.deveson@gmail.com. In the case of late submissions, 5% will be deducted for every day by which the assignment is late."
        }
    ],
    "prerequisite": "",
    "general_core": []
}