{
    "year": 109,
    "term": 2,
    "name": "神經語言學",
    "teachers": [
        "詹曉蕙"
    ],
    "department": "LM21",
    "code": "ENC2047",
    "credit": 3,
    "serial": 1598,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "誠701B"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "B",
    "hours": 3,
    "description": "This is a reading-intensive course, intending to be a survey of current topics in neurolinguistics. It is divided into three parts. Part I is about foundational concepts and methods, and I’ll give lectures. Part II is about language representation and processing, which covers the important topics of this field. I`ll briefly introduce these topics and provide background knowledge at the beginning of the class, and the rest of the class will be student presentations on assigned readings (20-25 minutes each) and class discussion. The presenters will have to email me their question(s) for discussion by Monday midnight and give me their PowerPoint slides no later than Wednesday midnight so that I can upload them onto Moodle. Part III is group project presentations. Each group (2 people per group) will research a topic pertaining to neurolinguistics (topic submission by 5/4), which can be something not covered in class, and do a 45-minute PowerPoint presentation followed by a 15-minute Q & A session. The group has to assign an article for the class to read that can help them understand the presentation (assigned reading submission by 5/25—electronic file only). This article can be selected from a scientific journal, a popular magazine, or an academic/non-academic book. Each individual is required to turn in a term paper on the presented topic (i.e. short review article) by the end of the semester (6/22 term paper due). Everyone is welcome to review more literature in the term paper that is not presented in class. Maximum page limit for the paper is 10 pages (12 point font, double-spaced, one inch margins).",
    "goals": [
        "foundational concepts and methods of current topics in neurolinguistics"
    ],
    "syllabus": "  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=0e1d9cfd46544b5aad281060d38260b6&fno=0104c227ffd44a7ab31da815ab514565)",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 15,
            "note": "Oral Exam"
        },
        {
            "type": "課堂討論參與",
            "weight": 5,
            "note": "Class participation"
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "Presentations on readings"
        },
        {
            "type": "成果展覽",
            "weight": 15,
            "note": "Final project presentation"
        },
        {
            "type": "專題",
            "weight": 30,
            "note": "Term paper"
        },
        {
            "type": "其他",
            "weight": 15,
            "note": "Outside classroom activites"
        }
    ],
    "prerequisite": "",
    "general_core": []
}