{
    "year": 109,
    "term": 2,
    "name": "文化與英語教學",
    "teachers": [
        "孔繁偉"
    ],
    "department": "LM21",
    "code": "ENC3045",
    "credit": 3,
    "serial": 1605,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "雲203"
        }
    ],
    "programs": [],
    "comment": "教室位於雲和街大樓2樓（地址：雲和街1號），外校學生需申請門禁權限。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "C",
    "hours": 3,
    "description": "This graduate course provides an overview of current issues in English language education with a particular focus on issues in culture, the development of World Englishes and the roles of Non-native English speaking teachers (NNEST) in ELT.  The course will encourage students to reflect critically about the relations between language, power, social and cultural practices, and to explore topics of their own interest.",
    "goals": [
        "Gain knowledge about some of the main issues in culture and politics discussed in the field of English language education.",
        "Understand theories, perspectives, and arguments related to the above issues.",
        "Explore how the theories, perspectives, and arguments can be incorporated in a potential research study of one’s own interest.",
        "Develop deeper awareness of the roles of Non-native English speaking professional in the ELT field."
    ],
    "syllabus": "### COURSE DESCRIPTION:\n\nThis course examines the different theories and practices in teaching ELLs at beginning, intermediate and advanced levels within the framework of culture and ELT.  Given that culture and ELT are interrelated in many aspects, the focus of this class will be on Content and Language Integrated Learning (CLIL). Approaches to CLIL will be explored, using theories, research, and current methods for bilingual and biliteracy development.  We will also examine the role of cultural practices in the development of biliteracy and multiliteracy for CLIL to be implemented. Students will evaluate their practices in light of the course content, generate new approaches, and draft appropriate outcomes for literacy instruction for more critical awareness of CLIL before it is implemented fully. \n\n**COURSE OBJECTIVES:**\n\n1\\.   Students will be able to expand the understanding and awareness of biliteracy and multiliteracy development and practices, language and cultural issues critical to the effective methodology and instructional practices of CLIL.\n\n2\\.   Students will  be able to review and critically analyze the roles of L1 and L2  or L3 acquisition process for CLIL \n\n3\\.   Students will be able to become familiar with and critically examine current research and theories of CLIL to enhance future practice.\n\n4.   Students will be able to develop and implement process-oriented biliteracy and multileracy activities, and appropriate methods of assessment and evaluation of CLIL. \n\n5.  Students will be able to understand the sociocultural nature of language and its implication for the classroom within the framework of CLIL.\n\n COURSE REQUIREMENTS  \n\n**1****.  Demonstration of thoughtful completion of readings:**\n\nStudents are expected to complete the reading assignments prior to the class and should be prepared to discuss them in class (announced one week prior to the meeting). With partners, present and lead discussion in class to generate ideas.  \n\n**2\\.  Field visit and reflective report:**\n\nStudents are expected to observe one CLIL or EMI class and write an observation report.\n\n**3.  Research proposal:**\n\nThe final project will be a **research proposal** focusing on a literacy-related or CLIL area of interest from students. \n\nTopics may include, but are not limited to:\n\n\\-CLIL in the native/primary language or FL from a sociocultural framework\n\n\\-Taiwan's EFL education policy in regard to the framework of CLIL\n\n\\-biliteracy or multiliteracy in elementary grades or high school for CLIL \n\n\\-native language literacy in the content areas (Taiwan's CLIL or EMI policy in higher education)\n\nThe final project will demonstrate how students apply literacy strategies to his/her situation for CLIL. Topics are open to what's been included in this course within culture and ELT/ CLIL. This will showcase students' ability to plan and critically analyze empirical research at a small scale linking theory and practice.\n\nClass schedule  \n\nWeek 1.      Introduction\n\nWeek 2.      How language varies: everyday registers and academic registers \n\nWeek 3.      Analyzing academic texts\n\nWeek 4.      Disconnects in bilingual education settings and research traditions \n\nWeek 5.      Curriculum mapping and bridging pedagogies I\n\nWeek 6.      Spring break\n\nWeek 7.      Curriculum mapping and bridging pedagogies II\n\nWeek 8.      Midterm presentation \n\nWeek 9.      Assessment issues I  \n\nWeek 10.    Assessment issues II\n\nWeek 11.    Programming for CLIL\n\nWeek 12.    Critical perspectives\n\nWeek 13.    Directions for future research and the way forward\n\nWeek 14.    Directions for future research locally and internationally\n\nWeek 15.    Final presentation I\n\nWeek 16.    Final presentation II\n\nWeek 17.    Digital learning \n\nWeek 18.    Digital learning",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Weekly thematic lecture"
        },
        {
            "type": "討論法",
            "note": "Discussion-based learning among peers and teacher"
        },
        {
            "type": "合作學習",
            "note": "Collaborative learning for weekly thematic discussion"
        },
        {
            "type": "專題研究",
            "note": "Research proposal demonstrating critical perspectives"
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 30,
            "note": "Midterm presentation"
        },
        {
            "type": "期末考",
            "weight": 40,
            "note": "Final presentation and paper (15% & 25%)"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Attendance"
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "Observation report"
        }
    ],
    "prerequisite": "",
    "general_core": []
}