{
    "year": 109,
    "term": 2,
    "name": "高級語音學",
    "teachers": [
        "甯俐馨"
    ],
    "department": "LM21",
    "code": "ENM2001",
    "credit": 3,
    "serial": 1590,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "雲201"
        }
    ],
    "programs": [],
    "comment": "教室位於雲和街大樓2樓（地址：雲和街1號），外校學生需申請門禁權限。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "B",
    "hours": 3,
    "description": "The goal of this course is to help students (1) to have a firm grasp of general phonetics, (2) to be able to produce all types of speech sounds, (3) to be able to perceive all the differences between speech sounds, and (4) to be able to use the IPA transcription symbols to transcribe speech sound when they hear them spoken.",
    "goals": [
        "to have a firm grasp of general phonetics",
        "to be able to produce all types of speech sounds and to be able to perceive all the differences between speech sounds",
        "to be able to use the IPA transcription symbols to transcribe speech sound when they hear them spoken"
    ],
    "syllabus": "**I. COURSE OVERVIEW**  \nThis course explores advanced issues in phonetics. Basic acoustics, acoustic analysis of speech sounds, speech production theory, speech physiology, and speech perception will be substantially covered. There will be Praat tutorials in which the instructor will teach students how to analyze speech sounds in a scientific way. Quizzes and exams will be given to examine how well students understand the lectures. Each student will write a term project (10 pages) on a language system of his/her choice. At the end of the semester, students will make an oral presentation on their term project and submit an e-copy of the final paper to the instructor.  \n  \n**II. COURSE EXPECTATIONS**  \nStudents are expected to read assigned material, attend class, participate in class discussions, complete assignments, and make regular use of the online learning environment.  \n  \n**III. COURSE WEBSITE (Moodle 2.8)**  \nPlease register an account on https://moodle2.ntnu.edu.tw/.  \n  \n**IV. TEXTBOOK**  \nStudents are expected to do the assigned readings before the class for which they are listed.\n\nHenning Reetz, Allard Jongman, John Wiley & Sons. 2009. _Phonetics: Transcription, Production, Acoustics, and Perception_. Wiley-Blackwell. \\[Required\\]  \n  \n**V. COURSE REQUIREMENTS**  \n**1)   Attendance (10%)**  \nAttendance at every class is expected and is almost always correlated with better grades. A Notification of Absence Form has to be submitted online (學生請假系統) within 1 week. Late submission will not be accepted. If more than 2 absences occur, the final grade will be deducted by 5 points.  \n  \n**2)   Praat Assignments (10%)**  \nThere will be Praat tutorials. Homework will be assigned after the tutorials and should be submitted on Moodle 2.8, not emailed to the professor.  \n  \n**3)   Quizzes (20%)**  \nQuizzes will test your comprehension of material covered in class. There will be 4 quizzes during the course that will be worth 20% of your final grade in total. Each quiz will take less than 20 minutes to complete. The quizzes may be composed of multiple-choice questions OR true/false questions OR labeling a diagram – or other form selected by the instructor. The date of a quiz is scheduled and listed in Section VI. The quizzes will be administered during class.  \n  \n**4)   Exams (40%)**  \nThere will be a midterm exam (20%) and a final exam (20%). The exams will predominantly cover material presented in lectures but information from readings (textbook) may be included.  \n  \n**5)   Term Project (20%)**  \nEach student will write a term project on a language system of his/her choice, investigating the consonants, vowels, tones or stress (if any). Students will collect the sound samples from a native speaker of that language and analyze the acoustic characteristics of the speech sounds with use of Praat. Students will make an oral presentation on the findings at the end of the semester and submit a written term project (10 pages, electronically) on Moodle.  \n\n**VI. CLASS SCHEDULE**  \nYou are expected to do the readings before class on the day they are listed.  \n  \nWeek 1:     Course Overview; Articulatory Phonetics (Chapters 2&4); Lab tour  \nWeek 2:     Airstream Mechanisms and Phonation Types (Chapter 6)  \nWeek 3:     Basic Acoustics (Chapter 7)  \nWeek 4:     Analysis Methods for Speech Sounds (Chapter 8)  \nWeek 5:     The Acoustic Theory of Speech Production (Chapter 9)  \nWeek 6:     Acoustic Characteristics of Speech Sounds (Chapter 10)  \nWeek 7:     Praat Tutorial I  \nWeek 8:     Midterm Exam  \nWeek 9:     Praat Tutorial II  \nWeek 10:   Physiology of the Vocal Apparatus (Chapter 5)  \nWeek 11:   Syllables and Suprasegmentals (Chapter 11)  \nWeek 12:   Physiology and Psychophysics of Hearing (Chapter 12)  \nWeek 13:   Speech Perception (Chapter 13)  \nWeek 14:   Review\n\nWeek 15:   Term project presentation\n\nWeek 16:   Final exam\n\n  \nWeek 17:   Term project revision  \nWeek 18:   Praat coding",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "實驗/實作",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 10,
            "note": ""
        },
        {
            "type": "期中考",
            "weight": 20,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 20,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 20,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 20,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}