{
    "year": 111,
    "term": 1,
    "name": "誰是下個賈伯斯─大師創業發想與實踐（一）",
    "teachers": [
        "印永翔",
        "高文忠"
    ],
    "department": "ZU9V",
    "code": "PGU9002",
    "credit": 2,
    "serial": 3279,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 10,
            "to": 11,
            "campus": "本部",
            "classroom": "誠203"
        }
    ],
    "programs": [
        "大師創業學程"
    ],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "創客(Maker)為目前頂尖企業最搶手的人才類型，意旨能快速將想法有效實踐的人才，本門課將透過1+1的雙向教學模式(1小時課程+1小時商業工具實作)，藉由體驗創業的過程，讓你擁有「創客五力」- 包含「市場開發力」、「產品打造力」、「問題解決力」、「整合企劃力」與「創新思考力」。於整學期課程中，老師更會逐步引導學生完成一份商業企劃，傳授學生將點子展成價值連城的生意的方法，過程也會指導學生組隊參加競賽，直接從實務中學習，獲取實戰經驗。\n    本們課程講師為連續創業家Terry，擁有4次科技創業、撰寫超過100份的商業企畫、拿到超過40項全國性商業競賽獎項、於2個月就談下近1,800萬的訂單的豐富實務經驗。\n課程內容會以「創客五力」為核心，讓學生體驗從點子落地到產品服務的過程，首先會運用商業模式（BMC）的基礎，並以故事搭配實例的方式，引導學生從設計思考出發，找到一個點子，接著做出最小可型產品(MVP)並設計問卷，投入市場獲得回饋，最後完成一份企劃提案，模擬向客戶及投資人進銷售提案，並將成果投入參與全國創業競賽。\n課程更會直接提供3份由老師親自撰寫的金牌企劃書範本給學生參考，並以分組討論、實作的方式進行，讓學生能一步步紮實的學習，獲得寶貴的實戰技能，上學生未來在提案、銷售、企劃上都能無往不利。 想要打造自己的事業，卻不知道從何開始嗎？想做好一份動人提案，卻不知道有哪些內容架構嗎？想成為產業人見人愛的搶手人才，卻不知從何開始累積實務經驗嗎？ 我們課堂上見。\n【課程特色】\n以創業家的角度，來培養職場上的搶手人才。\n實作商業模式畫布、設計思考、產品原型、問卷設計與調查、商業簡報。能讓學生在半學期內直接模擬開一家新創公司的過程，並完成一份可展示成果，最後直接演示。結合便利貼、畫布、紙筆等新創常用的協作工具。直接帶你參加創業競賽，企劃完成後可連結創業補助與競賽 (如教育部大專院校模擬實戰平台、U-start、千里馬、戰國策競賽等)。",
    "goals": [
        "學生創新創業提案",
        "學生創新創業之實踐",
        "學生創業團隊合作模式"
    ],
    "syllabus": "第一週9/8： 創業家旅程簡介與五項創業家必備能力  \nWeek 1(09/08)：An Introduction to the Entrepreneur's Journey and Five Essential Skills for Entrepreneurs.\n\n第二週9/15： 將你的點子，發展成價值連城的生意 – 從點子到商業企劃書  \nWeek 2(09/15)：Ideation and Hypothesis Validation - Validate ideas with potential and create a prototype of lean canvas.\n\n第三週9/22： 史丹佛設計學院最熱門的創意課 - 設計思考  \nWeek 3(09/22)：Most Popular Creative Class at Stanford's School of Design - Design Thinking.\n\n第四週9/29： 新世代經理人都在用的商業工具 – 商業模式畫布  \nWeek 4(09/29)：Manager's Favorite Business Tool - Business Model Canvas.  \n  \n第五週10/06： 讓人人都能秒懂你的專案價值 - 顧客價值主張  \nWeek 5(10/06)：Customer-Problem Fit - analyze problem preconditions and their causal relationships\n\n第六週10/13： 用內褲的預算，打造鋼鐵人的裝備 - 最小可型產品  \nWeek 6(10/13)：Build Iron Man's Gear on a Underpants Budget - minimum viable product.  \n  \n第七週10/20： 抓住觀眾眼球的獨特藝術- 行銷短影片製作  \nWeek 7(10/20)：The Unique Art of Capturing Your Audience - Marketing Video Production.  \n  \n第八週10/27： 期中報告 - 最小可型產品展示  \nWeek 8(10/27)：Interim Report - minimum viable product display.\n\n第九週11/3： 讓眾人為你的夢想買單 - 群眾募資 / 實戰平台  \nWeek 9(11/03)：PGet the crowd to pay for your dreams - Crowdfunding.\n\n第十週11/10： 早期集中客的管道 - 數位行銷與社群經營  \nWeek 10(11/10)：Early Channels for Concentrating Customers - Digital Marketing and Community Management.  \n  \n第十一11/17：從零到一，打造你的產品 - 產品設計與開發  \nWeek 11(11/17)：Build your product from zero to one - Product Design and Development.\n\n第十二11/24：知己知彼，百戰百勝 - 市場分析  \nWeek 12(11/24)：Know yourself and the enemy, and win every battle - Market Analysis.\n\n第十三12/01：藏在細節中的魔鬼與寶藏 - 財務規劃 / 風險管理  \nWeek 13(12/01)：The Devil and the Treasure in the Details - Financial Planning / Risk Management.\n\n第十四12/08：用簡報說出一個好故事 - 投售簡報製作  \nWeek 14(12/08)：Tell a good story with a presentation - pitch deck making.\n\n第十五週12/15：把市場資訊變成源源不絕的金流 - 市場開拓 / 業務開發  \nWeek 15(12/15)：Turn market information into an endless stream of cash - Business Development\n\n第十六週12/22：期末報告  \nWeek 16(12/22)：Final report.",
    "methodologies": [
        {
            "type": "講述法",
            "note": "講述法"
        },
        {
            "type": "討論法",
            "note": "討論法"
        },
        {
            "type": "問題解決教學",
            "note": "問題解決教學"
        },
        {
            "type": "合作學習",
            "note": "合作學習"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "藉由商業畫布、產品原型、市場分析、財務規劃等實際操作，評估學生實踐力。\nEvaluate students' practical ability through the practical process of  business model canvas, product prototypes, market analysis, financial planning, etc."
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "藉由分組討論與課程活動參與，了解學團隊合作能與溝通能力。\nFrom group discussions and participation in course activities, assess the teamwork and communication skills of the group."
        },
        {
            "type": "出席",
            "weight": 20,
            "note": "經由出席狀況與討論情形，評估學生表達能力及學習積極度。\nFrom the status of students' attendance and the discussion in the classroom, evaluate the students' expression ability and learning enthusiasm."
        },
        {
            "type": "報告",
            "weight": 50,
            "note": "透過簡報呈現整體創業構想，依市場可行性、規劃完整性、構想實踐程度三大項，評估學生之問題解決能力與創業家精神。其中學生互評之成績將佔10%。\nPresenting business ideas through presentations.\nTo evaluate students' problem-solving ability and entrepreneurial spirit from three aspects: market feasibility, planning integrity, and degree of conception practice.\n10% of the grades will be graded by students."
        }
    ],
    "prerequisite": "",
    "general_core": []
}