{
    "year": 109,
    "term": 1,
    "name": "社群行銷研究",
    "teachers": [
        "林慧斐"
    ],
    "department": "IM88",
    "code": "MCM0118",
    "credit": 3,
    "serial": 1473,
    "group": "",
    "quota": {
        "limit": 25,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 3,
            "to": 5,
            "campus": "本部",
            "classroom": "正105"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course introduces students to theories, research, principles, and strategies of social media marketing which can be applied to Public Relations (PR), advertising and marketing. The topics of this course will cover social media market planning, social consumers, digital natives, social community, social networks, social commerce, social entertainment, and social medial measurement. In addition, current domestic and international cases will be used as examples. Students are expected to join the discussion. At the end of the semester, students are asked to complete one research paper related to social media.",
    "goals": [
        "Enhance a theoretical understanding of Social Media Marketing research",
        "Think critically and creatively",
        "Learn how to conduct and evaluate Social Media Marketing research"
    ],
    "syllabus": "第1週Class Introduction and weekly leader assignments 第2週Theories of social media marketing 第3週Social network theory 第4週Social network sites 第5週Social consumers 第6週Self-determination in social media 第7週Social capital 第8週Social network sites and impression management 第9週Social TV 第10週Research Proposal Presentation 第11週Social community 第12週Social network sites and personality 第13週Social entertainment 第14週Social network games and persuasion 第15週Social Media and Advertising 第16週Branding and Social Media 第17週Guest Speaker 第18週Presentations",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 45,
            "note": "Weekly leader assignments 20%\nWeekly group assignments 15%\nWeekly comment papers 10%"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 35,
            "note": "Final research paper"
        }
    ],
    "prerequisite": "",
    "general_core": []
}