{
    "year": 109,
    "term": 1,
    "name": "流行文化研究",
    "teachers": [
        "蔡如音"
    ],
    "department": "IM88",
    "code": "MCM0087",
    "credit": 3,
    "serial": 1469,
    "group": "",
    "quota": {
        "limit": 20,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 3,
            "to": 5,
            "campus": "本部",
            "classroom": "綜7樓大傳所大教室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course explores inter-Asian traffic and contact through movements of popular culture.",
    "goals": [
        "Become familiar with the scholarship, networks, disciplines, and practices of popular culture studies in the regional, global, and local contexts.",
        "Explore (new?) and meaningful ways of learning and generating knowledge through inter-Asian, trans-local connections.",
        "Discover your identities and agency(e.g., graduate student in economic recession and neoliberalism, etc.)",
        "Invent your communication style; use English reflexively and non-competitively for communicating regionally and globally."
    ],
    "syllabus": "課程說明 Course Description\n\n本課程意在提供一個可以探索當代文化的場域，以文化研究這個全球性、跨領域的學術資產作為後盾，亞際（Inter-Asia）的參照作為方法。課名中的「流行文化」對應popular culture，但不限影視音動漫網路媒體內容，涵蓋日常生活、「通俗」、「大眾」、「小眾」、特定圈子、產業機構、社會、歷史經驗、階級、性別、族群、種族位置等形成的實踐。透過「接觸、思辯、現場、提問、實踐」，課程參與者能認識文化研究在亞際的串連及觸點，並產生跨在地（trans-local）的意識。這一切都可從以下的兩個問題出發：別的在地（local）關切什麼？這干我何事？\n\n第一週9/18    課程介紹\n\n第二週9/26    本週上課時間調動（新任行政主管訓練行程）\n\nA香港的文化研究B情感政治C當代港亞跨地議題大亂鬥\n\n第三週10/2    中秋節連假，不上課\n\n第四週10/9    雙十節連假，不上課\n\n第五週10/16            A南韓的文化研究B邊境移動C當代韓亞跨地議題大亂鬥\n\n第六週10/23          A日本的文化研究B消費生產C當代日亞議題大亂鬥\n\n第七週10/30            A中國的文化研究B工作與勞動C當代中亞議題大亂鬥\n\n第八週11/6            A馬來西亞的文化研究B性別C當代馬亞議題大亂鬥\n\n第九週11/13            A泰國的文化研究B青年文化C當代泰亞議題大論鬥\n\n第十週11/20 運動會，不上課(確立搭檔、線上繳交問題意識、參照地與文獻）\n\n第十一週11/27搭檔報告（需事先公布問題意識、亞際參照地）；文獻任意門\n\n第十二週12/4 搭檔報告；文獻任意門（非報告同學）\n\n第十三週12/11搭檔報告；文獻任意門（非報告同學）\n\n第十四週12/18搭檔報告；文獻任意門（非報告同學）\n\n第十五週12/25搭檔報告：問題意識、亞際參照地（需事先公布）；文獻任意門\n\n第十六週1/1  元旦放假，不上課\n\n第十七週1/8          期末報告發表（形式請參考說明）\n\n第十八週1/15       期末報告發表\n\n作業規定與評量\n\n1.  出席與討論：第十週以前，每週三人擔任「ABC場子的主持人」\n2.  第十週以前的每週綜合回應作業（書寫）（weekly response），共六篇\n3.  搭檔報告（第十一週開始）：初步研究主題、問題意識、參照地\n4.  文獻任意門的參與：所有出現在這份課綱裡、但還沒有被討論過的文獻\n5.  期末小論文：成為一個有亞際思維的文化觀察者與研究者：妳來想可以怎麼實踐。雖然想就這麼打住，但這意味著：找到一個值得探討的文化現象，梳理「接觸、思辯、現場、提問、實踐」\n6.  論文格式請參考新聞學期刊、中華傳播學刊之體例（http://cjctaiwan.org/word/50417252019.pdf）",
    "methodologies": [
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "實地考察、參訪",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "“100 Words”(20%) During the first 7 weeks, please post short and well thought-out response to the readings on the class blog, Inter-Asia Pop Culture Club (http://iapopclub.wordpress.com). From Week 8-Week 15, please blog on the following topics in no necessary order: \ni.\tResponse to a lecture you attended outside the classroom (Multiple posts OK)\nii.\tJournal browsing and comparing. Go to the library and take a look at IACS along with one of the following journals: Cultural Studies, International Journal of Cultural Studies, and Positions. Compare and share your impression.\niii.\tResponse to any writing on your reference list. (Multiple posts OK)\niv.\tTranslocal @ Shida: Make a new friend on campus who is not a local. Write a profile of his/her cultural activities. Attend an activity with him/her. Find out his/her network and daily contact. Find out what s/he wants to learn about Taiwan. (Multiple posts OK)\nv.\tFree topics related to your own project\n To discuss—Is it okay to keep the blog public?\n Sign up for Wordpress account and let me know your email you used to register.\n All posts and responses should be in English. Please post no later than Wednesday noon."
        },
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": "Leading weekly discussion (Week 1-7). Team up with two classmates. Organize agenda and discussions based on the weekly readings and“Discussion Questions.”"
        },
        {
            "type": "其他",
            "weight": 50,
            "note": "Final Project (30%): From Week 8-17, we will organize the class around presentations and feedbacks on students’ final projects. All students are expected to do four presentations, which represent different stages in the process: (A) My/Our Final Project Plan, (B) My/Our Literature Review, and (C) Progress Report (D) Final Project. Check the Calendar for specific instructions. \n\n Read Guidelines at the end of the syllabus\n All presentations should be about 30 minutes plus some discussion time. Please \nkeep your total presentation time under one hour. Language: Mainly English\nFeedback for each other (20%). This includes blogging, in-class"
        }
    ],
    "prerequisite": "",
    "general_core": []
}