{
    "year": 109,
    "term": 1,
    "name": "網路文化與傳播",
    "teachers": [
        "胡綺珍"
    ],
    "department": "IM88",
    "code": "MCM0102",
    "credit": 3,
    "serial": 1471,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 3,
            "to": 5,
            "campus": "本部",
            "classroom": "綜7樓大傳所大教室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "網路作為一個新興崛起的媒體／科技，在成熟發展的第一世界國家與發展中國家，已經逐漸成為大部分人日常生活不可或缺的一部份。網路結合新媒體科技克服時間與空間，快速地強化全球與在地性的連結，促進跨國/跨界/跨文化/跨媒體的交流。 本課程的設計將分幾個面向來探討: 1.網路資本主義、熱情、民主 2. 網路消費與社會正義 2. 可散播性 (spreadability)、媒體與網絡文化 (networked culture) 3. 閱聽人與數位參與 4. 網路:後電視時代的生活? 5. 社交媒體 (social media): Facebook的運作機制與分享(sharing)  7.部落格: 情感的網絡連結 8. 數位經濟 (digital economy) 與免費勞動 (free labor) 9. 網路與性別:女性青少年的可愛文化、陽剛特質與交友網站10. 離散國族主義(diasporic nationalism)與網路國族主義(online nationalism) 11. 音樂、網路、文化地理/景觀與社會行動 12. 網路、族群與認同13. 網路、跨媒體、跨國家庭與科技使用 14. 網路與群眾: 流動性與曖昧性。         網路在你的日常生活扮演何種角色? 你觀察到的網路文化現象如何跟不同面向的議題結合? 你如何在一個在地與全球接軌的脈絡跟課堂與課外閱讀的網路文化相關文獻產生對話? 網路文化的研究並非有一個特定的流派或大量實力雄厚理論架構，因此研究網路文化，需要的是藉由培養對於網路觀察與發現新議題的能力，進而設定研究範圍，思考要如何進一步去融合多元領域的基礎概念或理論來幫助研究者做網路文化研究。這也是本科目希望訓練修課者累積實力，與學會做網路研究的主要原則。",
    "goals": [
        "1. 網路的歷史發展，從西方的觀點：商業化與個人化的掙扎。",
        "2. 網路、國家與政府的掌控，與市民社會。",
        "3. 網路商業、互動性與監控。"
    ],
    "syllabus": "[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=4e3a59705ea643968a33d3fabe23e763&fno=acf4459db92341688075618f8a3202e6)\n\n**課程目的與簡介**\n\n本研究主要將重點放在不僅是網路，而是以包含網路的新媒體文化與科技為主軸來架構課程。新媒體已經逐漸成為大部分人日常生活不可或缺的一部份。新媒體科技克服時間與空間，快速地強化全球與在地性的連結，促進跨國／跨界／跨文化／跨媒體／跨平台的交流。人類的主體性、自我認同、流動性、生活型態、生產／消費、閱聽接收文化、人際關係、媒體景觀、性別、監控、市場機制、資本累積／流通、自發性動員/網絡串聯等等多元面向，如何跟新媒體與科技會合，並且重新被形塑呢？而新媒體如何在不同的國家、政府、歷史、族群、性別、草根動員，數位資本主義／平台化／創業家精神的發展脈絡下被理解呢？\n\n新媒體與科技在你的日常實踐中扮演何種角色？你觀察到的新媒體文化與科技現象如何跟不同面向的議題結合？你如何在一個在地與全球接軌的脈絡跟課堂與新媒體相關文獻產生對話？新媒體文化與科技不斷的演變，研究取向也不斷更新。研究新媒體／科技文化與傳播相關議題，需要的是藉由培養對於新媒體觀察與發現新議題的能力，進而設定研究範圍，思考要如何進一步去融合多元領域的基礎概念或理論來進行新媒體文化研究。這也是本科目希望訓練修課者累積實力，與學會做新媒體文化研究的主要原則。\n\n本課程鼓勵同學培養自我負責、主動學習、展示學習決心，與獨立作業的精神與能力。學習瞭解自己與自己在這門課的位置、興趣，並自行設定學習進度與計畫。\n\n**課程要求與評分方式**\n\n  \n1\\. 出席率（20 %）：若整學期無缺席與遲到，20分全拿。  \n＊遲到時間與請假次數多寡會影響成績。  \n＊若整學期未出席3次（含）以上（不管是否有請假，除非有特殊原因），否則視同放棄本課程的學習。\n\n2.    課堂專注度／彼此尊重的態度／培養傾聽別人的能力／討論參與度（10%）：課堂請勿使用手機／電腦，也請勿閱讀跟課堂不相干資料。\n\n3.    小組導讀與課堂報告 + 課堂討論參與度（會視修課人數狀況彈性修正調整）（30%）：  \nA.    班上的每一位同學都必須分配到導讀，形式通常是小組合作導讀。建議小組裡的成員可以相互支持與一起討論，形成互動的良好關係。希望大家可以互助的原因是，閱讀英文或找資料時，可以腦力激盪。  \n導讀以提出閱讀重點與應用解讀為主，重質不重量，請控制報告時間，不要長篇大論過度冗長。每篇文章導讀報告時間控制在15–20分鐘之內。  \n\\*  先問自己讀完這篇文章後，有那些部分被打動，或是你有好像獲得新知的感覺。然後想一下：作者提到的重點是否也發生在台灣，或你的日常生活新媒體經驗。有哪些問題想提出討論  \n\\* 指出作者發問怎樣的問題與提出怎樣的論點、運用誰的理論或資料進行文獻對話、如何脈絡化，以及有哪些理論你認為重要，與你的看法（有哪些同意與不同意的地方、對你有怎樣的啟發。）  \n此外，導讀同學可提出所觀察到指定閱讀資料相關的關鍵字／主題／現象／文本／影像供課堂討論與延伸思考，或補充資料說明背景，並必需準備幾個問題對同學提問。  \n＊第10週：需要每個小組或每個人找一些吃播相關的內容，練習進行簡單的吃播分析，上台報告。  \nB.    每星期針對每篇閱讀文章的心得與提問（每篇字數300–500字以內，若兩篇心得合寫，則為600–1000字以內）。當週導讀同學可不用繳交心得。目的在於鼓勵同學們閱讀資料時能自主自發的找到你跟這個閱讀資料的連結/觀察或問題，在上課時融入與參與討論。於週二晚上10:00以前發電子檔至本課程臉書社團，由助教統一管理。若電子檔案遲交，可補交; 但以次數計算，遲交每次扣10分。若未繳交，當次以零分計算。\n\n4.    期末報告（40%）：針對本課程相關研究議題，選擇你有興趣研究跟本課程內容相關主題，書寫學術報告（約5000–6000字）。書寫格式自行主動參考正式論文格式，含文獻引用與書目整理。若無清楚標示，恕不接受論文繳交。  \n期末報告繳交會跟同學約定在某日某個時段請助教在教室收取列印紙本的報告，並請同學簽名確認已繳交。若未於大家同意約定的時間遲交1天（24小時以內）扣期末報告分數10分，2天（48小時）扣20分，以此類推。遲交同學需主動於繳交期限以前跟老師用email通報。若無通知，形同放棄。\n\n**課程安排**  \nWeek 1（9/16）課程介紹  \nWeek 2（9/23）科技中介的社會關係：連結性  \n洪世民譯（2017）。《在一起孤獨：科技拉近了彼此距離，卻讓我們害怕親密交流？》（原書Turkle S \\[2011\\]）  \n〈推薦序：從數位歡宴到異化牢籠〉，頁12–18。  \n〈推薦序：連結及其不滿，特克未雨綢繆式的第三部曲〉，頁19–22。  \n〈導讀：要如何「在一起」？我們這個時代人的矛盾處境〉，頁23–31。  \n〈序言：一起獨處〉，頁45–66。  \n第八章〈永不斷線〉，頁218–240。  \n第九章〈被束縛著長大〉，頁241–258。  \n第十二章〈真正的告解〉，頁306–319。  \n〈結論：必要的對話〉，頁362–384。\n\n  \nWeek 3（9/30）科技符擔性（能供性）technological affordance：科技／物／人的交會  \n蘇柔郡、吳筱玫（2018）。〈高中女生使用Instagram之日常美學：符擔性觀點〉，《新聞學研究》，135：139–191。  \nShaw A (2017) Encoding and decoding affordances: Stuart Hall and interactive media technologies. Media, Culture & Society 39(4): 592–602.\n\n  \nWeek 4（10/7）擴散式媒體 spreadable media & 草根中介grassroots media & 網絡文化  \nJenkins H, Ford S and Green J (2013) Introduction: Why Media Spreads. In: Jenkins H, Ford S and Green J (eds) Spreadable Media: Creating Value and Meaning in a Networked Culture.pp.1–46.\n\n  \nWeek 5（10/14）社群媒體與微名人micro-celebrity（1）: 自我品牌化／網紅social media influencer／飄零世代age of precarity  \nDuffy BE and Pooley J (2019) Idols of Promotion: The Triumph of Self-Branding in an Age of Precarity. Journal of Communication 69(1): 26–48  \nKhamis S, Ang L, and Welling R (2016) Self-branding, ‘micro-celebrity’ and the rise of Social Media Influencers. Celebrity Studies 8(2): 191–208.\n\n  \nWeek 6（10/21）社群媒體與微名人（2）：自我再現／格式／真實性（原真性）／數位親密  \nHou M (2019) Social media celebrity and the institutionalization of YouTube. Convergence: The International Journal of Research into New Media Technologies 25(3): 534–553.  \nReade J (2020) Keeping it raw on the ‘gram: Authenticity, relatability and digital intimacy in fitness cultures on Instagram. New Media & Society. Advance online publication.  https://doi.org/10.1177/1461444819891699\n\n  \nWeek 7（10/28）社群媒體與微名人（3）：數位時代下後女性主義的自我與女性特質的勞動  \nBanet-Weiser S (2012) Branding the postfeminist self: The labor of femininity, in Authentic™: The Politics of Ambivalence in a Brand Culture. pp. 51–90\n\nWeek 8（11/4）平台化意味著什麽？：平台經濟／直播／展演勞動  \nPoell T and Nieborg DB (2018) The platformization of cultural production: Theorizing the contingent cultural commodity. New Media & Society 20(11): 4275–4292.  \nWang S (2020) Chinese affective platform economies: Dating, live streaming, and performative labor on Blued. Media, Culture & Society 42(4): 502–520.\n\n  \nWeek 9（11/11）吃播／食慾視頻  \nKim Y (2020) Eating as a transgression multisensorial performativity in the carnal videos of mukbang (eating shows). International Journal of Cultural Studies. Advance online publication. https://doi.org/10.1177/1367877920903435  \n\\* 小組或個人作業: 找亞洲國家或歐美吃播影片來討論\n\n  \nWeek 10（11/18）演算法的品牌文化／演算法的電視  \nCarah N and Angus D (2018) Algorithmic brand culture: participatory labour, machine learning and branding on social media. Media, Culture & Society 40(2): 178–194.  \nShapiro S (2020) Algorithmic Television in the Age of Large-scale Customization. Television & New Media 21(6): 658–663.\n\n  \nWeek 11（11/25）  \n期中討論  \nWeek 12（12/2）  \n期中討論\n\n  \nWeek 13（12/9）迷因（meme）  \nWiggins BE and Bowers GB (2015) Memes as genre: A structurational analysis of the memescape. New Media & Society 17(11): 1886–1906.  \nKanai A (2016) Sociality and Classification: Reading Gender, Race, and Class in a Humorous Meme. Social Media + Society. https://doi.org/10.1177/2056305116672884\n\n  \nWeek 14（12/16）跨媒體／地方／攝影／後觀光  \nOh Y (2020) From concrete walls to digital walls: Transmedia construction of place myth in Ihwa Mural Village, South Korea. Media, Culture & Society. Advance online publication. https://doi.org/10.1177/0163443720916410  \nJansson A (2018) Rethinking post-tourism in the age of social media. Annals of Tourism Research 69: 101–110.\n\n  \nWeek 15（12/23）跨平台：在Youtube平台展演如何當Uber司機  \nChan NK (2019) “Becoming an expert in driving for Uber”: Uber driver/bloggers’ performance of expertise and self-presentation on YouTube. New Media & Society 21(9): 2048–2067.\n\n  \nWeek 16（12/30）  \n期末課堂報告  \nWeek 17（1/6）  \n期末課堂報告  \nWeek 18（1/13）  \n交報告\n\n推薦期刊: 新聞學研究、傳播研究與實踐、中華傳播學刊、傳播與社會、Media, Culture & Society, Television & New Media, New Media & Society, International Journal of Cultural Studies, Social Media + Society\n\n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=4e3a59705ea643968a33d3fabe23e763&fno=acf4459db92341688075618f8a3202e6)",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": "小組導讀與課堂報告（含課堂討論參與度）。當周未導讀的同學需繳交心得與提問，遲交每次扣10分。若未繳交，當次以零分計算。"
        },
        {
            "type": "出席",
            "weight": 20,
            "note": "若整學期未出席3次（含）以上（不管是否有請假，除非有特殊原因），否則視同放棄本課程的學習。"
        },
        {
            "type": "報告",
            "weight": 40,
            "note": "期末報告（5000-6000字），遲交1天（24小時以內）扣期末報告分數10分，2天（48小時）扣20分，以此類推。"
        },
        {
            "type": "其他",
            "weight": 10,
            "note": "課堂專注度、彼此尊重的態度、培養傾聽別人的能力、討論參與度。課堂請勿使用手機、電腦，也請勿閱讀跟課堂不相干資料。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}