{
    "year": 109,
    "term": 1,
    "name": "質性研究方法",
    "teachers": [
        "廖柏森"
    ],
    "department": "LM25",
    "code": "TIC0046",
    "credit": 3,
    "serial": 1739,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 5,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "正402A"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "Many research questions in the field of translation studies are best approached through qualitative research methods. In particular, research focused on insight, understanding, and discovery from the perspectives of those being studied may offer promise of making contribution to the theory and practice of translation. In this class, we are going to explore various research approaches such as interviewing, observations, grounded theory, ethnographic study, and other techniques which are central to qualitative inquiry. Qualitative studies commonly conducted in the area of translation and interpreting will also be discussed. After taking this course, you will be able to understand assumptions and characteristics held by qualitative research; to identify definitions, uses, strengths, and limitations of different types of qualitative methods; as well as to collect, analyze and interpret qualitative data concerning translation activities. Each student is also required to conduct a qualitative study in his or her chosen area of translation and interpretation.",
    "goals": [
        "培養對英美文學、語言、英語教學、口筆譯之專業知識與優良能力",
        "培養以理論為基礎，具有獨立思考與靈活應用、解決問題的能力",
        "培養學生從事原創性學術研究的能力",
        "培養以人文為核心基礎，跨領域結合、轉化、應用之能力"
    ],
    "syllabus": "Many research questions in the field of translation studies are best approached through qualitative research methods. In this class, we are going to explore various research approaches such as interviewing, focus groups, observations, think-aloud protocols, grounded theory, and other techniques which are central to qualitative inquiry. After taking this course, you will be able to understand assumptions and characteristics held by qualitative research; to identify definitions, uses, strengths, and limitations of different types of qualitative methods; as well as to collect, analyze and interpret qualitative data concerning translation activities. Also, each student is required to conduct a qualitative study in his or her chosen area of translation or interpreting.",
    "methodologies": [
        {
            "type": "講述法",
            "note": "teacher`s lectures"
        },
        {
            "type": "討論法",
            "note": "group and whole class discussion"
        },
        {
            "type": "實驗/實作",
            "note": "conduct a qualitative study on your own"
        },
        {
            "type": "其他",
            "note": "individual stuents` oral report"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 5,
            "note": "preparation and participation in class activities"
        },
        {
            "type": "出席",
            "weight": 5,
            "note": "attendance"
        },
        {
            "type": "報告",
            "weight": 70,
            "note": "term paper"
        },
        {
            "type": "其他",
            "weight": 20,
            "note": "oral presentation"
        }
    ],
    "prerequisite": "",
    "general_core": []
}