{
    "year": 107,
    "term": 2,
    "name": "新傳播科技與社會",
    "teachers": [
        "胡綺珍"
    ],
    "department": "ZU9E",
    "code": "PGU1010",
    "credit": 3,
    "serial": 3182,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 4,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "正403"
        }
    ],
    "programs": [
        "社會與傳播學程"
    ],
    "comment": "",
    "restrict": "◎第一階段限 社會與傳播學程",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "本課程結合新傳播資訊科技的文化、社會、政治與經濟分析、研究，協助同學理解新傳播科技的本質與社會產製，以及和其相關之社會、文化影響，修習完本課程，同學可對當代傳播資訊科技的各社會面向有一基礎與全面性之理解。",
    "goals": [
        "本課程旨在幫助同學瞭解當代新傳播資訊科技使用所帶來的社會轉變，課程將探討新傳播資訊科技之本質、其與社會文化之互動與相互作用，進而介紹新傳播資訊科技之各重要議題。"
    ],
    "syllabus": "教學目標： 新傳播科技是影響現代生活與現代社會最重要的媒介之一。電腦、網際網路、智慧手機、數位與網路電視、與電子書等，不但在現代生活中扮演越來越重要的角色，影響諸多層面之生活意義，對於社會、文化、政治、經濟以及全球化等，在傳播資訊科技的介入使用下，逐漸展現許多值得深思與探索之新面貌。 本課程旨在幫助同學瞭解當代新傳播資訊科技使用所帶來的社會轉變，課程將探討新傳播資訊科技之本質、其與社會文化之互動與相互作用，進而介紹新傳播資訊科技之各重要議題，包括資訊社會、傳播資訊科技與政治及民主、傳播資訊科技與資本主義、傳播資訊科技之文化與性別議題、網際網路的社會分析、手機的社會使用與意義等等。 綜合言之，本課程結合新傳播資訊科技的文化、社會、政治與經濟分析、研究，協助同學理解新傳播科技的本質與社會產製，以及和其相關之社會、文化影響，修習完本課程，同學可對當代傳播資訊科技的各社會面向有一基礎與全面性之理解。 課程內容： Week 1. 課程介紹 Week 2. 新傳播科技與社會概論 Week 3. 何謂科技與科學？ 「科技、理性與自由」，第一部份--科技文明：第一章至第四章 「現代社會中的科學」，第一章：科學與科學的社會功能 「現代社會中的科學」，第三章：科學與社會的關係網絡 Week 4. 新傳播資訊科技概論1：歷史、背景、與革命？ 「網絡社會之崛起」，第一章：資訊技術革命 「新媒介科技論」，第二章：傳播科技的演變 「新媒介科技論」，第四章：傳播科技領域 Week 5. 新傳播資訊科技概論 2：關鍵技術與未來發展 「新媒介科技論」，第五章：傳播關鍵技術 「新媒介科技論」，第六章：媒介科技的未來 Week 6. 網際網路 Week 7. 傳播資訊科技的新時代--「資訊社會」 「科技新城鎮」，第三章：資訊與傳播科技 Webster, F. (1995). Theories of the information society. (中譯本，資訊社會理論，遠流)，第一章：導論；第二章：資訊與資訊社會之說法。 Week 8. 傳播資訊科技與經濟 「新媒介科技手冊」，第十八章：新媒體與資訊經濟學 「網絡社會之崛起」，總導言：網絡與自我 「尋找資訊社會」，第二章：資訊科技、資訊社會與經濟發展 Week 9/10. 新傳播資訊科技、名人與自我品牌化/新媒體時代下的自我展現 Week 11. 新傳播資訊科技與政治/民主 「新媒介科技手冊」，第八章：權力與政治文化 「網路的哲學省思」，第四章：網際網路的民主 Week 12. 傳播資訊科技與性別 Week 13. Facebook、網際網路與新社群時代 「網路的哲學省思」，第七章：新社群 「網路的哲學省思」，第八章：虛擬真實—網際空間的未來 Week 14. 老師討論期末報告議題 Week 15. 網路時代的廣告與行銷 Week 16. 網路與社群媒體時代的新聞實踐 Week 17/18. 課堂期末報告",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": "針對每周課堂內容，老師給予討論題目，修課同學需要繳交作業"
        },
        {
            "type": "出席",
            "weight": 20,
            "note": "課堂會抽點名"
        },
        {
            "type": "報告",
            "weight": 50,
            "note": "期末小組報告"
        }
    ],
    "prerequisite": "",
    "general_core": []
}