{
    "year": 107,
    "term": 1,
    "name": "日治時期語言改革運動史論",
    "teachers": [
        "賀安娟"
    ],
    "department": "LM26",
    "code": "TCC2005",
    "credit": 3,
    "serial": 1671,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "雲和街教學大樓3樓教室",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "透過本課程讓學生認識各種語言在台灣歷史中的地位轉變。並藉由課堂的報告和討論，增進師生間的學術對話，教學相長。以當代台灣社會的角度來分析各種語言現象。",
    "goals": [
        "認識各種語言在台灣歷史中的地位轉變",
        "以當代台灣社會的角度來分析各種語言現象"
    ],
    "syllabus": "Hand out of the syllabus and explanation of the course\n\nThis introductory lesson situates the objectives of the course. Readings that will be dealt with in class are to illustrate the contemporary socio-linguistic situation in Taiwan with a focus on language planning, standardization and ideology during the Japanese colonial period (1895-1945). The socio-political and literary background will be given attention, as well as some of the more recent (comparative) topics that regard language and society in Taiwan.\n\nStudents can work in group or independently, materials will be selected in the English language, but for those interested Chinese (Japanese) materials can be provided as elective readings. Language of instruction is English. \n\n**週****2  9****月** **19****日**    **Language in Taiwan: What do we observe?**\n\nIn the first half of this class, students will be asked to write down what they know about language in Taiwan, how they feel about it, what they observe, how come they think it is like that. What are representative languages for Taiwan today? Distribution of a number of language related sayings. Collecting answers and discussion.\n\nThe second half will relate the discussion to the sociolinguistic situation in colonial Taiwan, as to make the link with the course focus.     \n\n**週****3  9** **月** **26****日**  **Language in Taiwan up to 1895**\n\nCompulsory Reading:  Ann Heylen (2012), _Japanese Models_ Chapter I, “Historio-linguistic setting”,\n\nDiscussion of the chapter, elaborated and illustrated with a number of relevant secondary readings and source materials.\n\n**週** **4  10****月****3****日**  **Background to the Japanese colonial period**\n\nCompulsory Reading:  Ann Heylen (2012), _Japanese Models_ Chapter II\n\nDiscussion of the chapter, elaborated and illustrated with a number of relevant secondary readings that address different research topics in studying the Japanese colonial period in Taiwan history. Chapters and articles from the following authors will be distributed: Chou Wan-yao, Murray Rubinstein, Peter Duus and Raymon Myers, Liao Ping-hui and David Der-wei Wang \n\n**週****5  10****月****10****日**   **No class Double Ten Day**\n\n**週****6  10****月** **17****日** **Models of Language Standardization and Planning (1)**\n\nThis class will introduce some of the theoretical concepts in 20th century language modernization, standardization and planning. Focus on East Asia (China and Japan, _yanwenyizhi_ /_genbunitchi_ movement) but also comparative with examples of language modernization in Europe.  \n\nPreparatory reading: Heylen, Ann “ Loading the matrix”  \n\n**週****7  10****月** **24****日** **Models of Language Standardization and Planning (2)**\n\nThis class will introduce some of the theoretical concepts in 20th century language modernization, standardization and planning. Focus on East Asia (China and Japan, _yanwenyizhi_ /_genbunitchi_ movement) but also comparative with examples of language modernization in Europe.   \n\n**週****8   10****月** **31****日** **Lecture on Language in Colonial Taiwan (TBC)**\n\n**週** **9   11****月** **7****日**  **Mid-term Exam**\n\n**週****10  11****月** **14****日**  **Language Reform Movement:  Romanization**\n\nCompulsory Reading:  Ann Heylen (2012), _Japanese Models_ Chapter III\n\nDiscussion of the chapter, elaborated and illustrated with a number of relevant secondary readings that contextualize the role of the Christian church in Taiwan society, and comparative with East Asia (China, Korea, Japan)\n\n**週****11 11****月****21** **日**  **Language Reform Movement:  Mandarin baihuawawen**\n\nCompulsory Reading:  Ann Heylen (2012), _Japanese Models_ Chapter IV\n\nDiscussion of the chapter, elaborated and illustrated with a number of relevant secondary readings that contextualize _Taiwan Minpao_, Japanese education and the aims of the assimilation policy vis–a-vis the tradition of Chinese classical education (_hanwen_).     \n\n**週****12  11** **月** **28****日****Language Reform Movement: Written Taiwanese**\n\nCompulsory Reading:  Ann Heylen (2012), _Japanese Models_ Chapter V\n\nDiscussion of the chapter, elaborated and illustrated with a number of relevant secondary readings that bring the other languages into the discussion orbit: Hakka, the indigenous languages and Esperanto.\n\n**週****13  12****月** **5****日**  **Authors in English on Taiwan Language Topics: colonial period**\n\nThis class will provide a selection of English language works that discuss the language reform movements from a different perspective: literature and sociology  \n\n**週****14  12****月** **12****日**  **Authors in English on Taiwan Language Topics: overview articles**\n\nThis class will focus on a number of general overview articles that deal with Taiwanese language planning and the transition from the colonial period into the postcolonial/war period. Ideological concepts will be discussed.   \n\n**週****15  12****月** **19****日** **Language in Colonial Taiwan: legacy today** \n\nThis class will look at current day language in Taiwan society and draw parallels with the Japanese colonial period. Topics of discussion will be advertising, literature, media and the attention to Japanese, English and languages of Southeast Asia.  \n\n**週****16  12****月** **26****日** Tools and databases\n\nPresentation of databases that store linguistic and language-related materials Taiwan.\n\n**週****17  1****月** **2** **日** **General Discussion**\n\nInstructions for the end-term exam paper\n\n**週18  1月 9 日 End-term Exam**",
    "methodologies": [
        {
            "type": "講述法",
            "note": "上課前幾週老師會先說明這學期的討論要點"
        },
        {
            "type": "討論法",
            "note": "同學準備課堂報告，並與其他人分享、討論"
        },
        {
            "type": "專題研究",
            "note": "可針對特定主題作深度討論"
        }
    ],
    "grading": [
        {
            "type": "期末考",
            "weight": 30,
            "note": "期末報告"
        },
        {
            "type": "課堂討論參與",
            "weight": 40,
            "note": "閱讀中/外語研究資料 簡介新出土研究資料 (中/外語)分析與討論"
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "課堂報告"
        }
    ],
    "prerequisite": "",
    "general_core": []
}