{
    "year": 110,
    "term": 1,
    "name": "日本美術鑑賞",
    "teachers": [
        "蔡家丘"
    ],
    "department": "GU",
    "code": "01UG027",
    "credit": 2,
    "serial": 931,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "誠109"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本課程將帶領同學鑑賞日本美術，按時代順序說明其歷史的發展。課程內容除了欣賞日本美術品，並將探討其形成的原因、與社會文化的關係，同時省思臺灣社會現今對日本美術的運用和態度。",
    "goals": [
        "認識日本美術的歷史與特色",
        "培養對日本美術的鑑賞能力",
        "促進對日本社會與文化的關懷",
        "反思目前台灣社會對日本美術文化的理解、吸收與運用"
    ],
    "syllabus": "\\* 本課程於選課人數已滿 (座位有限之時) 將不開放授權碼。請無須另寫信向老師索取。\n\n本學期依學校公告可能進行線上遠距教學，請同學務必登錄台師大moodle系統以利課程通知。\n\n授課方式：16+2週  ( 2週彈性教學內容將於課程中宣佈 )\n\n每週教學進度\n\n第一週：課程導論與分組\n\n  \n第二週：先史古墳時代 ―原來出土器物中暗藏有日本文明的「密碼」？！\n\n在缺乏文獻的情形下，要如何重建日本上古的歷史與文化呢？日本出土器物中，如繩文時代的土偶、彌生時代的鐵器、古墳時代的植輪等等，不但讓我們有欣賞上古文化的機會，事實上也提供了可解開文明起源的「密碼」。\n\n  \n第三週：飛鳥奈良時代(一) ―正倉院：天皇的藏寶庫\n\n你知道位於奈良，收藏了遠渡自亞洲大陸各式文物的正倉院，事實上是日本天皇的藏寶庫嗎？不但如此，隨著佛教傳入日本，佛教文化與美術也於奈良一帶展現。本週將與同學一同欣賞此時期佛教美術的代表，如法隆寺、中宮寺裡莊嚴優美的佛像。\n\n第四週：飛鳥奈良時代(二) ―佛寺好比博物館\n\n當同學們走入座落於奈良各處的佛寺，會發覺猶如參觀一間間的博物館。救治眾生的如來、守護佛法的天王等，均塑為一尊尊的造像，供人膜拜敬仰。佛寺本身亦是結合佛教信仰與工藝技術的結晶。\n\n  \n第五週：平安時代(一) ―千年繁華在京都\n\n日本熱門旅遊景點之一的京都，千年以前由日本僧人最澄與空海從中國傳回密教信仰，形成佛教文化與美術的中心。本單元將從美術的角度，與同學一同探索京都的千年繁華，下次若再旅行京都，可別只是走馬看花！\n\n第六週：平安時代(二) ―美術中的天長地久：佛畫與大和繪之美\n\n平安時代的佛畫呈現佛教天界永恆的宇宙觀，而配合日本文學如《源氏物語》等所發展出的大和繪，則傳達人間的纏綿哀愁或喜怒諧趣。佛畫與大和繪，可說正表現了日本美術追求在天上人間得以「天長地久」的想望。\n\n第七週：鎌倉時代―多采多姿的表現\n\n    鎌倉時代，日本美術延續大和繪的傳統創作繪卷，並誕生端整典雅的肖像畫。佛教美術方面，以淨土思想為主的繪畫出現不少優美精緻的作品。另外，由禪宗思想形成之頂相畫、水墨畫創作也不遑多讓。\n\n第八週：期中考試\n\n  \n第九週：室町時代― 一窺將軍家的室內設計和品味\n\n    你知道室町時代的美術品其實來自將軍家的室內設計和品味嗎？除既有的日本美術傳統繼續發展外，足利將軍家收藏的東山御物，如宋代花鳥畫、禪宗水墨畫、天目茶碗等等，都可讓人一窺這個時代的美術觀。\n\n第十週：桃山江戶時代(一) ―大城小事故事多\n\n桃山江戶的美術可說是以城廓為中心展現。為裝飾氣宇壯大的城廓，如狩野永德為豐臣秀吉所作，豪快莊嚴的金碧障壁畫於是誕生。不僅如此，描繪都市風俗或異國文化的屏風，也傳達出活絡躍動的歷史與社會風情。\n\n  \n第十一週：江戶時代(二) ―琳派、狩野派等派系盡出的時代\n\n你知道尾形光琳所繪裝飾與圖案化的風格，形成琳派延續至今，甚至是iphone外殼設計的熱銷款？！此時期出現的琳派與狩野派等，都將醞釀為日本美術中取之不盡的傳統養分。\n\n  \n第十二週：江戶時代(三) ―演員、美人，與文人：濃妝淡抹總相宜\n\n為什麼浮世繪可說是江戶時代的「電影海報」？其實浮世繪所捕捉歌舞伎演員的生動表情，與日本美人的濃妝面容，透露了大眾娛樂與風俗入世而縱情的一面。相對於此，江戶時代的文人畫，則描繪具恬淡與詩意的山水田園生活。\n\n  \n第十三週：近代(一) ―西洋畫3D視覺革命\n\n明治維新時日本積極西化，傳入西洋畫新鮮的視點與寫實感，使人猶如戴上3D眼鏡，產生視覺上的衝擊。畫家進而探求新的風景人物題材，使西洋畫漸落地生根。\n\n  \n第十四週：近代(二) ―日本畫以傳統為時尚\n\n「傳統為最流行的時尚」，為何這句話可說明近代日本畫的發展？近代日本的西洋畫與日本畫發展，正見證了大時代的轉變與內涵。\n\n  \n第十五週：期末報告與討論\n\n  \n第十六週：期末報告與討論",
    "methodologies": [
        {
            "type": "講述法",
            "note": "由教師講述各單元的歷史背景，配合多媒體圖像或影片，與參考書目中相關內容，使學生對日本美術有深入淺出的了解。"
        },
        {
            "type": "討論法",
            "note": "以課堂討論參與之方式，引發學生主動欣賞日本美術的興趣，使其獲得自身觀看的眼光與美感。"
        },
        {
            "type": "媒體融入教學",
            "note": "運用多媒體教材，協助學生認識並欣賞日本美術作品。目的並非要求學生去記憶美術品的作者、年代，而是經由對美術歷史文化的理解，對該主題能有深入的認識。"
        },
        {
            "type": "專題研究",
            "note": "期末分組選定一主題進行專題報告，培養學生間相互溝通合作之能力。報告時不限於使用powerpoint，可選擇製作影音檔案，提供學生多樣化與發揮創意的空間。"
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 30,
            "note": "以簡要的筆試作為重點複習"
        },
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": "就該週主題提出相關問題，引導同學觀察美術品，誘發對該主題的興趣與思考。"
        },
        {
            "type": "報告",
            "weight": 40,
            "note": "以小組報告與討論之方式，提供同學主動思考、解決問題的學習方式。"
        }
    ],
    "prerequisite": "",
    "general_core": [
        "人文藝術"
    ]
}