{
    "year": 110,
    "term": 1,
    "name": "宇宙中的生命與太空環境",
    "teachers": [
        "橋本康弘"
    ],
    "department": "GU",
    "code": "06UG021",
    "credit": 2,
    "serial": 1018,
    "group": "",
    "quota": {
        "limit": 157,
        "additional": 30
    },
    "schedule": [
        {
            "day": 3,
            "from": 6,
            "to": 7,
            "campus": "公館",
            "classroom": "Ｅ302"
        }
    ],
    "programs": [
        "天文重力學程"
    ],
    "comment": "◎數位課程",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "",
    "goals": [
        "The conditions for the life, and therefore the significance and fragility of our existence in the space and time can be only proved by investigating the alien world.",
        "Proactive approach to the information.",
        "Those knowledge and questions will not only broaden our knowledge about extraterrestrial world, but more importantly, our knowledge about ourselves.",
        "To research the life in the Universe will also have a deep impact on students’ knowledge and attitude towards the future technology and environmental problems on Earth, as well."
    ],
    "syllabus": "本課程數位課程\n\nThis course is the online course\n\n\\====================================================\n\nA. Online lectures:\n\n   Lecture materials and recordings will be distributed via Moodle once per week\n\n   on Wednesday. The rate at which the movie will be posted is roughly 2-4 movies a week.\n\n   You can watch movies anytime after the distribution.\n\nB. Updated Information:\n\n   Please keep checking the Moodle frequently for more detailed and updated post and information.\n\nC. Moodle:\n\n    .URL is  https://moodle.ntnu.edu.tw/\n\n    .For NTU or NTUST students, you need to access to NTNU moodle,\n\n     NOT to your university moodle.\n\n    .For NTU or NTUST students, you will get your username and password sent\n\n     to you via email within 1-2 weeks after your registration to the class (the computer synchronize slowly  between universities, so please be patient).\n\nC2. Temporary Moodle site:\n\n   For NTU and NTUST students who cannot access the NTNU moodle for the first 1-2 weeks, try accessing our temporary site at:\n\n    https://sites.google.com/gapps.ntnu.edu.tw/life-in-the-universe\n\n   (Note ... this site is only open for the first 2-3 weeks)\n\nD. Codes:\n\n   The code to those of you who wants to register to this class beyond the class limit will be distributed  \n   via internet. Here is how to do it:\n\n  1.  You need to contact to the instructor by the following method,  telling your full-name,  \n     student id, and your email address, before the first day of the course.  \n       \n       method:   fill the form at     https://forms.gle/Ab8gyp8EuBx6ZR5B8\n\n  2.  If the number of students who need the code exceeds the number of codes  \n     available, then we will pick students randomly from the entire list\n\n  3. The result will be notified  via EMAIL on the first day of the course.\n\n  4. If some codes are still left AFTER the first day, then the remaining codes  \n     will be distributed one by one on first-come first-take basis  \n     till no more code left. You need to send an email to the instructor  \n     asking for the code..\n\nHomeworks/Exams:  \n   The homeworks and exams will be delivered/conducted via  \n the Moodle system. More information will be provided via Moodle.  \n  \n \n\n\\============\n\nLecture topics\n\n\\=============\n\n**_Are their any Extra-Terrestrial Life out there in the Universe ?_** \n\n**1\\. Goal of the course:**\n\n    **Searching for the life in the Universe and investigating the necessary conditions about existence of the**  **life in the Universe is one of the most fundamental** **and outstanding astronomical questions human can ask.**\n\n    **Those questions will not only** **broaden our knowledge about extraterrestrial world,** **but more importantly, our knowledge about ourselves.** **The necessary conditions, and therefore the significance** **and fragility of our existence** **in the space and time can be only proved by** **investigating the alien world.**\n\n    **To research the life in the Universe will** **have a deep impact on students\\` knowledge and attitude** **towards the future technology and environmental problems** **on Earth, as well.**\n\n**2\\. Contents and Schedules:**\n\n    **◆Introduction**  \n\n                  **.What is human?  What is the life?**\n\n                  **.What defines the life on Earth?  Need red blood ?** \n\n                  **.Scientific and non-scientific bias: Must they be similar to life on Earth?**\n\n                  **.History of extra-terrestrial life search**\n\n                  **.Extreme Biology on Earth: Life in hostile environments**\n\n                      **.Earth bacteria can survive in space ?**\n\n                  **.Asteroids in Antarctic: Life from Mars?**\n\n    **◆Life in the Solar System: Life in the Neighborhood**\n\n                  **.Moon**\n\n                  **.Venus and global warming: Was Venus habitable before?**\n\n                  **.Mars: Do we have water ? Are Martians there ?**\n\n                  **.Jupiter atmosphere --Possible life floating in the air ?**\n\n                  **.Galileo moons around Jupiter -- Salt water ocean? Fish swimming?**\n\n                  **.Titan: A giant moon with thick atmosphere around Saturn. Methane lake ?**\n\n                  **.Enceladus: Saturn's moon with  liquid water.** \n\n                  **.Comets and Asteroids:  Water in comets ? DNA in comets ?**\n\n                  **.Interplanetary space**\n\n    **◆Astrobiology by Space Missions and Probes: Sending Robot Astronomers**\n\n                  **.Viking 1 and 2: First \"little Martian\" search**\n\n                  **.Path-Finder: First mobile robot- scientists**\n\n                  **.Spirit and Opportunity: Working 10 years on Mars**\n\n                  **.Phoenix: Landing on the Martian ice**\n\n                  **.Curiosity Rover: Modern robot biologist that discovered water on Mars**\n\n                  **.Stardust/Hayabusa: Bringing dusts back to Earth**\n\n                  **.Voyager I and II: Voyage to the outer planets**\n\n                  **.Galileo: Monitoring Galileo moons**\n\n                  **.Cassini and Huygens lander: Landing on methane ocean**\n\n                  **.Future Europa mission: First Ice-braker and Submarine to search for fish**\n\n    **◆Human Mission to Mars: Can we send people to Mars?**\n\n                  **.Oxygen, Water, Food supply  (Bringing food for 10 people for three years mission ?)**\n\n                  **.Current shortest duration plan**\n\n                  **.Current park-orbit plan**\n\n    **◆Search for Ingredients of Life:**\n\n                  **.Water, Methane, Oxygen, CO2, and Amino Acids**\n\n                  **.Sample return mission**\n\n                  **.Spectroscopic analysis of organic molecules**\n\n    **◆Exoplanets: Planets around other Suns**\n\n                  **.Binary stars and brown dwarfs: Twin Sun and Too small Sun.**\n\n                  **.Hot Jupiters: Easy-to-find planets, but is it too hot ?**\n\n                  **.Habitable Zones: Not too hot, not too cold**\n\n                  **.Direct method and corona graph: How to see planets, directly?**\n\n                  **.Eclipsing, transit, and  micro-lensing: Find a Sun 'blinking'**\n\n                  **.Pulsar decay:  Nobel prize winner**\n\n                  **.Radial velocity methods: Watch Sun to move**\n\n                  **.Gliese system (Gliese 581d): First good candidate**\n\n                  **.Future experiments: Find small planets around small stars**\n\n    **◆Technology of Space Travel (Let's go Interstellar space!)**\n\n                  **.Early rocket and liquid fuel rocket: Modern rockets**\n\n                  **.Solid motors: Old technology with new idea**\n\n                  **.Gravitational assist: How to accelerate without gasoline**\n\n                  **.Atmospheric brake: How to slow down**\n\n                  **.Ion engine: small but long push**\n\n                  **.Solar sailor: Catching 'solar wind\\`**\n\n                  **.Nuclear engine**\n\n                  **.Special relativity and time delay: Time machine**\n\n                  **.General relativity and singularity in the space-time continuum: Worm hole ? A Tunnel to travel through ?**\n\n   **◆Long Term Influence from Space Environments: Can human survive in the space?**\n\n                  **.Solar wind and Galactic cosmic rays: Risk for Cancer?**\n\n                  **.Calcium depletion and loss of the muscle**\n\n                  **.Oxygen, Water, and Food supplies: Need to bring 'a small Earth' ?**\n\n                  **.Mental effects: Home sick in space or new generation of 'space born' people ?**\n\n                  **.Evolutions.. Space station experiments: Can life adapt to the space environments**\n\n    **◆Probability of Extraterrestrial Life in the Universe: Are really someone there?**\n\n                  **.Minkowski space and light cone: The Universe  is too big to communicate?** \n\n                  **.Drake\\`s equation: Calculate the percentage of life**\n\n                  **.Can we communicate to the alien ?**\n\n    **◆Probing the edge of the solar system and sending message beyond**\n\n                  **.Pioneer 10 and 11: First messengers**\n\n                  **.Voyager I and II: Golden records**\n\n                  **.New Horizons: Mission beyond Kuiper Belt**\n\n    **◆SETI: Search for Extraterrestrial Intelligence**\n\n                  **.SETI**\n\n                  **.Communicating via Radio**\n\n                  **.\"Message from Earth\" and \"Hello from Earth\"**\n\n**▲****開課理由：**\n\n     **一方面課程從環境演化的角度來認識生命的演化，也透過人類科技的進步，來探討我們目前正在推行的探索任務，其進展與思考在未來可透過哪些科技的發展，可以加速我們的探索任務。**\n\n現在居住環境的擁擠與地球資源逐漸的耗竭，許多太空科學技術紛紛對於尋找新的居住環境的探索發展，而本課程將從生命的起源去了解我們維持生命的需要，以及尋找開發新的環境與資源而進一步能延續生命與社會發展。\n\n本課程透過科技的角度來讓學生能了解基本的科學素養，以致於在這資訊普及的時代，能去思考與討論所接收到的新聞事件或網路傳聞等，與有能力判斷其可信度與真偽。",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "Online  (please see English version of \"CourseDescription\" for more updated info about the online lecture)."
        },
        {
            "type": "Group discussion",
            "note": "課堂上學生可依學習之情形，對課程之瞭解程度，向教師提出問題與討論。"
        },
        {
            "type": "Problem base learning",
            "note": "在課堂上、作業中已包含問題解決教學"
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 30,
            "note": ""
        },
        {
            "type": "Midterm Exam",
            "weight": 35,
            "note": "知識部分與能力部分各佔50%"
        },
        {
            "type": "Final exam",
            "weight": 35,
            "note": "知識部分與能力部分各佔50%"
        }
    ],
    "prerequisite": "",
    "general_core": []
}