{
    "year": 110,
    "term": 1,
    "name": "星星月亮太陽－天文漫談",
    "teachers": [
        "橋本康弘"
    ],
    "department": "GU",
    "code": "06UG004",
    "type": "通",
    "grade": null,
    "credit": 2,
    "serial": 1007,
    "group": "B",
    "quota": {
        "limit": 107,
        "additional": 30
    },
    "schedule": [
        {
            "day": 3,
            "from": 3,
            "to": 4,
            "campus": "公館",
            "classroom": "Ｅ202"
        }
    ],
    "programs": [
        "天文重力學程"
    ],
    "comment": "",
    "restrict": "◎地科系（學）不得選修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "",
    "goals": [
        "This course will provide students a general understanding of modern astronomy and will introduce them to the most recent scientific developments. This course will help students to appreciate the importance of the modern science and its application to the daily life and to the entire Universe."
    ],
    "syllabus": "**\\[2021  Sep 3:  This class is now required to be 'online' class because of the covid prevention. For more information, please check the post here  or check NTNU moodle for students who can access it\\]**\n\n\\[2021 Sep 10:  If you need a **registration code**, fill the form\n\nhttps://forms.gle/k5fiDSf8Mw7qtXkQA\n\nStudents who fill the form before Sep 22 will have a priority. If the number exceeds the available codes, then we will conduct a random-drawing and the result will be emailed to you.\n\n\\[2021 Sep 10:  For NTU and NTUST students, you need to access to the NTNU moodle for the online course info and materials. It will take 1-2 weeks before you receive an email from NTNU moodle with username and password that enables you to access the NTNU moodle.\n\n\\[2021 Sep 13: For those students who cannot access the NTNU moodle for the first several weeks, use our 3 week temporary site at\n\nhttps://sites.google.com/gapps.ntnu.edu.tw/introduction-to-astronomy\n\n\\------------------\n\nAstronomy is an ancient science that crosses all borders and all culture through history. It is also in the world of today, one of the fastest growing topics of research.\n\nThe evolution of Astronomy is taking its sources from a cultural and historical knowledge from the past (Astrology, astronomical events calendar…)\n\nHowever Astronomy is now very much anchored in the twenty-first century. Discoveries in Astronomy make regularly the front page of the scientific newspapers. Observing the sky through telescopes can shed light on our understanding of astrophysics but also bring answers to the most fundamental questions: what are the origin of life and the Universe. Modern astronomy is a fascinating way for citizens to approach science in general. This course will provide students for a general understanding of Astronomy and introduce them to the most recent scientific developments. This course will bring the students to appreciate that the application of modern science are confined to the earth but also to the vastness of the Universe, and that the Universe is a great laboratory for our understanding of physics, chemistry and even a place to explore the origin of life.",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "Handouts will be distributed at the start of the semester. Each class of 2h is self-contained. Interactions between students and teacher are encouraged during the class. Recent discovery or events (eclipses, meteoroid showers, …) will be discussed in real time."
        },
        {
            "type": "Media, audio, visual materials",
            "note": "Professional astronomical pictures, movies and other hypermedia support will be used during the class."
        },
        {
            "type": "Other:",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 50,
            "note": "Five assignments will be given at a rate of one every three weeks in parallel of the lectures. Questions are related to the class and will help the students understanding the class. Some personal research will also be incorporated."
        },
        {
            "type": "Midterm Exam",
            "weight": 25,
            "note": "A closed-book exam will be based on the topics discussed in class, with an overlap with the questions developed in homework."
        },
        {
            "type": "Final exam",
            "weight": 25,
            "note": "A closed-book exam will be based on the topics discussed in class, with an overlap with the questions developed in homework."
        }
    ],
    "prerequisite": "◎Exclusive of students within Department of Earth",
    "general_core": []
}