{
    "year": 110,
    "term": 1,
    "name": "臺灣文化導覽",
    "teachers": [
        "許慧如",
        "莊佳穎",
        "林巾力",
        "陳玉箴",
        "劉承賢"
    ],
    "department": "GU",
    "code": "0HUG230",
    "credit": 2,
    "serial": 1046,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 1,
            "from": 8,
            "to": 9,
            "campus": "本部",
            "classroom": "誠202"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "",
    "goals": [
        "了解台灣文化，關心社會、土地",
        "觀察生活、社會、人群，尊重多元文化",
        "主動參與文化事務與了解文化內涵"
    ],
    "syllabus": "This is a lectured-based course while active class discussions or various forms will be required. Instead of pure lecturing, students will have opportunities to deeply reflect on what they experience in regard to different facets of Taiwan culture via participating in discussions and student-centered activities. In fact, many perspectives provided in this course are different from mainstream and critical of what students can hear and learn from ordinary people and public media. That is to say, the design and the viewpoints are both intended to make students think and analyze critically.\n\nThis course will lead the students to explore Taiwan from the perspectives of food, culture, popular culture, language and society, linguistics, and Taiwanese literature. This exploration will be guided by 5 teachers of the Department of Taiwan Culture, Language, and Literature, National Taiwan Normal University.\n\nThese topics are chosen because Taiwan culture is the patterns of learned and shared behavior and beliefs of Taiwan. The patterns can be observed in food and languages on a daily basis. In other word, nothing other than food and languages can be more representative when it comes to culture. On the other hand, due to industrialization and globalization, popular culture has taken the center stage of folk culture. Therefore, these topics, we believe, can help students see the true face of today’s Taiwan. In addition to the daily practice and folk aspects of culture, cinema and literature are employed to demonstrate the high culture of Taiwan for these two are still appreciated by most Taiwanese people today. By doing so, the introduction to Taiwan culture becomes comprehensive for it comprises not only the low and high but also the synchronic and diachronic angles from the development of literature and cinema.  In fact, food, cinema, literature and languages (especially the shift of languages) are reflections of the transformation of Taiwan society. Through these topics, students can also approach the society in depth from a sophisticated way.\n\nweek\n\ndate\n\n1\n\n0927\n\n**Introduction**/ lectured by Chuang, Yin C.\n\n2\n\n1004\n\n**Lecture 1 : Food Culture: Cuisine/ lectured by Chen, Yu-jen**\n\nWhat is \"Taiwanese cuisine\"? How is \"Taiwanese cuisine\" formed and transformed? We will learn the origin, history and important factors shaping Taiwanese food culture, particularly the changing notion of \"Taiwanese cuisine\".\n\n3\n\n1011\n\nDouble 10th Holiday long weekend\n\n4\n\n1018\n\n**Guest Lecture: Taiwanese Seafood Culture/ hosted by Chen, Yu-jen**\n\n5\n\n1025\n\n**Lecture 2: Food culture: drinks/ lectured by Chen, Yu-jen**\n\nFrom traditional herb tea, milk, bubble tea, cola, beer to various drink shops, we will explore the history, consumption culture and identity issue behind these colorful drinks in Taiwan.\n\n6\n\n1101\n\n**Lecture 3: Taiwan Popular Culture/ lectured by Chuang, Yin C.**\n\nTaiwan Popular Culture is going to develop our own critical understanding of (Taiwan’s) popular culture (in particular the production and consumption of popular culture as cultural, political, economic, social, and historical practices and processes). We will go through Taiwan’s rapid development of both consumer society and democracy, and hybrid cultural characteristics based on 400 years of hybrid colonial history. Multilingualism and\n\n7\n\n1108\n\n**Lecture 4: Taiwan Cinema/ lectured by Chuang, Yin C.**\n\nTaiwan Cinema is one of some representative examples in Taiwan popular culture. We will discuss the following questions: 1) What is Taiwaneseness? 2) How are Japaneseness and Taiwaneseness (re-)presented in Taiwan’s cinema? 3) How is Taiwaneseness (re-)produced, circulated, and consumed in Taiwan’s popular culture?\n\n8\n\n1115\n\n**Lecture 5: Multilingualism and Monolingualism in Taiwan/ lectured by Khoo, Hui-lu**\n\nIs Taiwan a multilingual or monolingual country? You may have learned about the “multilingualism” of Taiwan, the indigenous Formosan languages, Taiwanese, Hakka and even the existence of the Development of the National Languages Act and …etc. All these depict a linguistically colorful Taiwan. However, do you have any Taiwanese friends that consistently speak local language(s) other than Mandarin? If you do, what are their social backgrounds? If you don’t, then, why is the statement of multilingualism of Taiwan?\n\n9\n\n1122\n\n**Lecture 6: Language Identity in Taiwan/ lectured by Khoo, Hui-lu**\n\nThe language identity of Taiwanese people has been an intrigue and complicated issue. From “I am Chinese. I speak Chinese”, to “I am Taiwanese. I speak Chinese”, to “I am Taiwanese to I speak Mandarin”…\n\nHas the status of “I am Taiwanese. I speak Taiwanese.” ever been socially realized? If yes, when and what was the social context? If no, why not? \n\n10\n\n1129\n\n**Lecture 7 : Taiwan Literature****Ⅰ/ lectured by Nikky Lin**\n\nThe first part of this topic addresses the development of Taiwan literary history by exploring all the aspects of literature in Taiwan from chronological order and expanding the vision into various traditions of world literature.\n\n11\n\n1206\n\n**Lecture 8 : Taiwan Literature****Ⅱ/ lectured by Nikky Lin**\n\nThe second part of this topic will take a close look at the modern literature in East Asia, such as Japan and China. From the locus of history of literature, we will scrutinize the societal and cultural factors behind literature development this week. These factors will also be employed in considering the position of Taiwan in the global community through local perspectives.\n\n12\n\n1213\n\n**Lecture 9: Taiwan Literature III: the Indigenous Literature/ lectured by Nikky Lin**\n\nThe literature of Taiwan’s indigenous peoples was not recognized until the beginning of the 1980s. Following the rise of democratic movements in Taiwan, indigenous rights, and cultural-revival movements worldwide, more indigenous writers have devoted themselves to literary composition. This lecture will introduce the history of Taiwan indigenous literature and arrange for students to read the short stories written by Taiwan indigenous writers.\n\n13\n\n1220\n\n**Lecture 10 : A Brief History of the Language Taiwanese, Its Characteristics, and the Debated Name**/ lectured by Lau, Seng-hian\n\nWhen it comes to Taiwan culture, the language Taiwanese is definitely a significant factor and ingredient that cannot be ignored. This week, we’ll try to answer the following questions together: Where is the natural lingua franca of Taiwan from? How is it related to Amoy, Quanzhou and Zhangzhou spoken in China and Hokkien spoken in Southeastern Asia? Why do people dispute its name as Taiwanese? Discussing these questions will offer a glimpse of the complex relevant to language and culture in Taiwan.\n\n14\n\n1227\n\n**Lecture 11: Comparing Taiwanese with Mandarin Chinese**/ lectured by Lau, Seng-hian\n\nIs Taiwanese and Mandarin mutually intelligible? What are the same and the different between these two? By comparing the origin, phonology, lexicon, and the syntax of Taiwanese and Mandarin, we will have a glimpse of Taiwanese, the natural lingua franca and the treasure trove of culture and history of Taiwan.\n\n15\n\n0103\n\n**Lecture 12: Introduction to Formosan Languages**/lectured by Lau, Seng-hian\n\nFormosan languages are the Austronesian languages spoken in Taiwan. Most linguists assume that Taiwan is the starting point of the diaspora of the Austronesian people, because nowhere else is more linguistically diversified than Taiwan when it comes to Austronesian languages. This week, we’ll learn 101 of the Formosan languages and the characteristics of them, in contrast to other Austronesian languages.\n\n16\n\n0110\n\n**Wrapping up**/ lectured by Chuang, Yin C.\n\n17\n\n0117\n\nFinal Report Studies and Discussion (self-study. No in-class lecture)\n\n18\n\n0124\n\nFinal Report Studies and Discussion, Submission (self-study. No in-class teaching)",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": ""
        },
        {
            "type": "Group discussion",
            "note": ""
        },
        {
            "type": "Cooperative learning",
            "note": ""
        },
        {
            "type": "Media, audio, visual materials",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 20,
            "note": "The forms of homework are subject to the instructors. They can be the participation of a Moodle forum, assigned readings, and others."
        },
        {
            "type": "Class discussion involvement",
            "weight": 20,
            "note": "Students must actively participate in the in-class discussions, including the in-class discussions, comments, questioning ..etc."
        },
        {
            "type": "Attendances",
            "weight": 10,
            "note": ""
        },
        {
            "type": "Case study reports",
            "weight": 50,
            "note": "A list of 5 questions will be released in week 14. Each question pertains to every single teacher’s specific topic and materials (i.e. food, culture, popular culture, language and society, linguistics, and Taiwanese literature). You are required to answer all the questions in order to express your own critical understanding to each topic.\n\nThe recommended length of each question is about 600-800 words long. The answers must be in your own words. Do not provide copy and pasted text without citations and references."
        }
    ],
    "prerequisite": "",
    "general_core": []
}