{
    "year": 110,
    "term": 1,
    "name": "大學入門",
    "teachers": [
        "徐敏雄"
    ],
    "department": "GU",
    "code": "0SUG526",
    "credit": 2,
    "serial": 1083,
    "group": "C",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 8,
            "to": 9,
            "campus": "本部",
            "classroom": "誠102"
        }
    ],
    "programs": [],
    "comment": "非大一、非本系的學生請先取得授課教師同意，並以授權碼方式加選。",
    "restrict": "◎限大一修習◎限社教系（學）選修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "不同於高中以前的教育以升學考試主題主導學習內容，並且由教師傳遞標準答案，大學階段的知識探索強調打破時間和空間的界線，並著重由學習者自身的需求和問題出發，藉由體驗、反思、歸納和應用的持續學習，不斷檢視、更新和建構內在經驗與客觀知識的合理性。在持續學習的過程中，大學生一方面努力認識自己與所屬社會，也從中思考透過不同價值的社會行動，自身和環境將被帶往何處，進而確認自己存在的價值感。就像J. Krishnanmurti所說到的︰「教育的目的，在於免除人的恐懼。人越了解世界，越了解自己在這個世界中的位置，越能免於恐懼。」\n    但是，對剛踏入大學校園的學生來說，舉凡時間、壓力和情緒管理、多元學習策略的運用、弱勢關懷與社會實踐、生涯目標與實踐策略的擬定等議題，都是亟待他們一步步習得的重要知能。這時候如何跳脫以往高度控制與僵化的教與學框架，引導學生透過對真實生活現象的敏銳覺察，從中反思、歸納出各類重要人生道理，進而懂得在大學生涯中逐步習得、應用這些核心知能，乃是「大學入門」階段的重要課題。\n為此，本課程將以「認識環境、認識自己及規劃未來生涯」三大議題為主軸，帶領大家從認識師大周邊生活圈開始體察生活世界的重要議題，從群己動態關係中認識自己的價值觀、優缺點及長期累積的焦慮情緒。在自己及生活世界有基本了解後，再進一步運用社會教育系獨特的方案設計流程，從過往感興趣的事情中確立自己適合的生涯方向，並具體擬定可能實踐生涯目標的行動策略。\n    過程中，我們還會藉由邀請同學課堂成果展和期末學習計畫分享的方式，引導同學記錄成長軌跡和階段性成果，並透過課堂小組討論交流大家遭遇挫敗時的心情，彼此陪伴鼓勵。最後，為了讓同學們更清楚地認識社教系的專業實踐場域，我們也會相約大家都方便的時間，一同走訪侯硐礦工生態園區，希望藉此讓大家一次體驗社區營造、社會創新、成人教育、博物館、文化旅遊及故事行銷等等專業實踐的樣貌。\n    我們期盼透過上述多元議題的探討，可以燃起同學們對探索世界和問題解決的好奇心，形成持續發展自我與改善所屬社群生活的行動力，進而感受到「透過共學社群面對人生挑戰的美好」，而不用重蹈以往填鴨式和清談式教育的覆轍。甚至在未來大學生涯中如果遇到任何生涯困難，也都能勇於尋求周遭同儕的協力、連結並創造各類資源，一起將生涯危機轉化為成長的養分。具體而言，整套大學入門課程的參與，亦有助於社會教育系之成人創新學習規劃能力、社會文化事業推展能力及組織永續經營發展能力等核心能力的培養。",
    "goals": [
        "促使學生能夠確立大學目標並具備良好的學習動機與策略。",
        "讓同學們瞭解大學人際間交往、個人情緒管理等議題，協助其良好地適應大學生活。",
        "協助同學能在大學生活之初即能養成健康的生活態度。擁有希望的開始，才能讓大學的每一步都朝向自我實現的目標邁進。",
        "使同學瞭解大學之生涯規劃與就業準備方向，以便日後大學生涯目標之訂定與實踐。"
    ],
    "syllabus": "本課程為【16+2週】之形式，其中16為課堂實體互動課程，其餘2週彈性學習將根據修課學生需求，以校外參訪、線上學習、自主學習等多元方式進行。\n\n1\n\n**認識彼此、確認課程主題與教學方式**\n\n(1)與修課同學共同討論並確認課程與教學設計。\n\n(2)請同學5人一組，共分成4組。\n\n2\n\n**走讀師大生活圈（一）：龍泉里和古風里**\n\n參考資料：\n\n認識個人與社會的複雜關係（參考議題：商業發展與居住安寧的兩難）\n\n3\n\n**走讀師大生活圈（二）：溫羅汀書店商圈**\n\n參考資料：\n\n認識多元主題的獨立書店（參考議題：如何運用社區資源）\n\n4\n\n**走讀師大生活圈（三）：中萬華商圈**\n\n參考資料：\n\n認識階級與多元文化議題（參考議題：誰是弱勢族群？）\n\n5\n\n**走讀師大生活圈（四）：成果展**\n\n請各組根據前三週走讀心得，在社教系空間內進行主題策展，分享自己的所見所聞及從中發現的社會教育專業實踐想像。\n\n6\n\n**認識自己的價值觀與優缺點（一）：國中小生命故事敘說**\n\n參考資料：\n\n張大光、張皓維、黃慧真、簡麗姿（譯）（2018）。**生命抉擇與個人成長（中文第三版）**， G. Corey & M. S. Corey（合著）。台北市：雙葉。第2章。\n\n7\n\n**認識自己的價值觀與優缺點（二）：高中生命故事敘說**\n\n參考資料：\n\n張大光、張皓維、黃慧真、簡麗姿（譯）（2018）。**生命抉擇與個人成長（中文第三版）**， G. Corey & M. S. Corey（合著）。台北市：雙葉。第2章。\n\n8\n\n**認識自己被討厭的焦慮與勇氣**\n\n參考資料：\n\n周惠玲（譯）（2004）。**牧羊少年奇幻之旅**，P. Coelho（著）。台北市：時報。\n\n葉小燕（譯）（2014）。**被討厭的勇氣：自我啟發之父「阿德勒」的教導**，古賀史健、岸見一郎（著）。台北市：究竟。\n\n9\n\n**與同學籌組共學社群、體驗信任與關懷的力量**\n\n參考資料：\n\n陳正芬（譯）（2020）。**關懷的力量（經典改版）**，M. Mayeroff（著）。台北市：經濟新潮社。\n\n東華大學教學卓越中心社會參與教師社群（2012）。**教育小革命：大學生的十堂社會參與課**。臺北市：心靈工坊。\n\n10\n\n**釐清社會教育與其它專業的特色異同、職涯出路、所學為何？**\n\n核心議題：\n\n1.社教系的可能職場與職業在哪裡？\n\n2.雇主為何要聘我而非其他系畢業生？\n\n3.系上或大學所學如何培養前述特色核心能力？\n\n11\n\n**善用學習工具（一）：認識社會設計的原則與方案設計流程**\n\n參考資料：\n\n莊雅琇（譯）（2015）。**社區設計：重新思考「社區」定義，不只設計空間，更要設計「人與人之間的連結」**，山崎亮（著）。新北市：臉譜。第1、2章。\n\n陳東昇（2013）。**從設計到社計的社會學想像**。http://cdtl.nchu.edu.tw/epaper/data/15-3-2-1.pdf\n\n游萬來、楊敏英、李盈盈（譯）（2014）。**為社會而設計**，N. Whiteley（著）。台北市：聯經。\n\nBrown, T. & Wyatt, J. (2010). Design Thinking for Social Innovation. _Stanford Social Innovation Review_, 8(2):28-35.\n\n參考影片：\n\n日劇房仲女王第三集\n\n[https://www.94-tv.org/賣房子的女人-房仲女王-第3集/](https://www.94-tv.org/%E8%B3%A3%E6%88%BF%E5%AD%90%E7%9A%84%E5%A5%B3%E4%BA%BA-%E6%88%BF%E4%BB%B2%E5%A5%B3%E7%8E%8B-%E7%AC%AC3%E9%9B%86/)\n\n12\n\n**善用學習工具（二）：藉由自己最投入的五件事確立適合的生涯目標**\n\n參考資料：\n\n吳家綺（譯）（2017）。**與自己對話**，P. J. Palmer（著）。台北市：商周出版。\n\n13\n\n**善用學習工具（三）：從生涯目標延伸出短中長程目標及核心能力**\n\n參考資料：\n\n許恬寧（譯）（2016）。**做自己的生命設計師：史丹佛最夯的生涯規畫課，用「設計思考」重擬問題，打造全新生命藍圖**，B. Burnett與D. Evans（著）。台北市：大塊文化。\n\n14\n\n**善用學習工具（四）：以社會設計原則規劃達成生涯目標的學習策略**\n\n參考資料：\n\n李麗君（譯）（2007）。**做個成功學習的大學生：動機與學習自我管理，**M. H. Dembo（著）。臺北市：心理。第三、四篇。\n\n15\n\n**期末學習計畫分享（一）：交流彼此的生涯目標和行動策略**\n\n請每位同學為自己擬訂的生涯目標和具體可行的行動策略。\n\n16\n\n**期末學習計畫分享（二）：交流整學期的學習心得**\n\n請同學們分享整學期最大的收穫、對課程與教學設計的建議，以及自己未來怎樣站在這門課程的基礎上朝向生涯目標前進。\n\n彈性學習\n\n**社教專業現場一次體驗（一）：走讀猴硐礦工文化園區**\n\n**參考資料：**\n\n透過一起找個週末走讀猴硐礦工文化園區，一次體驗社教系的社區營造、社會創新、成人與高齡教育、博物館、故事行銷、文化觀光等等專業的真實樣貌。行程中，我們也會交流彼此在社教系的生活點滴、學習期待與當前遭遇到的挑戰，進而透過真誠的分享回饋，一起面對這些重要的挑戰。\n\n彈性學習\n\n**社教專業現場一次體驗（二）：走讀猴硐礦工文化園區**\n\n內容同上",
    "methodologies": [
        {
            "type": "講述法",
            "note": "教師將於課堂中根據各次主題進行講述。"
        },
        {
            "type": "討論法",
            "note": "本課程十分重視同學們課堂討論，並給予其他同學非批判、真誠的回饋。"
        },
        {
            "type": "問題解決教學",
            "note": "本課程將以分組方式進行，修課同學均須透過小組的形式，討論負責的報告或討論的議題，並於過程中培養問題解決的能力。"
        },
        {
            "type": "實驗/實作",
            "note": "本課程將邀請學生透過整理自己國中小及高中的重要生命事件，釐清自己重要的生命價值觀及優缺點，並撰寫成個人生命敘說報告。此外，期末時也將繼續邀請修課學生運用社會設計的原則，規劃適合自己的生涯目標及具體學習策略。"
        },
        {
            "type": "實地考察、參訪",
            "note": "本課程會透過走讀生活圈及成果展的方式，引導大一新生認識重要生活圈，並嘗試發現生活中的重要公共議題。"
        },
        {
            "type": "媒體融入教學",
            "note": "授課教師會根據不同主題使月媒體素材，增進修課學生對各議題的興趣、理解程度與討論深度。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 25,
            "note": "修課學生均須透過整理自己國中小及高中的重要生命事件，釐清自己重要的生命價值觀及優缺點，並撰寫成個人生命敘說報告。報告內容可以包含文字、照片、圖畫、音樂等多元媒材，文字說明至少需3000字。報告繳交期限為該次課程結束後兩週內，請直接寄送至授課老師的信箱mhhsu@ntnu.edu.tw。"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "本課程十分重視同學們課堂討論，並給予其他同學非批判、真誠的回饋。因此，課堂參與狀況將納入重要評分標準。"
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "修課學生均須運用社會設計的原則，規劃適合自己的生涯目標及具體學習策略，方案格式將於課堂上提供給大家參考，內容可以包含文字、照片、圖畫、音樂等多元媒材，文字說明至少需1000字。作業繳交期限為該次課程結束後兩週內，請將學習計畫直接張貼至moodle指定平台上，並於第15週課堂上與同學們交流。"
        },
        {
            "type": "成果展覽",
            "weight": 25,
            "note": "修課學生須5人為一組，以分組策展方式，運用照片、文字或其他創新藝術形式，從三次走讀師大生活圈的過程中發覺值得進一步探索的生活議題，及其延伸出來的社會教育專業實踐想像，並於教育學院七樓空間內分享心得。"
        }
    ],
    "prerequisite": "",
    "general_core": [
        "大學入門"
    ]
}