{
    "year": 110,
    "term": 1,
    "name": "國際環境傳播",
    "teachers": [
        "林冠慧"
    ],
    "department": "SM46",
    "code": "EEC8050",
    "credit": 3,
    "serial": 2759,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 2,
            "to": 4,
            "campus": "公館",
            "classroom": "行409"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "Enhancing students’ English speaking, listening, reading as well as writing ability",
        "Broadening environmental literacy and global understanding on the environmental issues",
        "Constructing students’ confidence on using English as media for communication in future careers"
    ],
    "syllabus": "Every week, we will select a scientific report or relevant environmental news as our weekly reading(s). In class, we will discuss those assigned reading(s), meanwhile, the teacher will provide further resources such as visual material or e-media (e.g. bbc, cnn, United Nation news, Reuters) to enhance other forms of English training and interpretation. We will also invite specialists working in international media, enterprises, or NGOs to give us talks or visit their working places.\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=b66a33ff1a4c4e678e1a1bbf967e96d9&fno=ab92a637197d4ef0aa6d6cb2866809a9)",
    "methodologies": [
        {
            "type": "Group discussion",
            "note": "Every student will discuss the weekly readings in the class"
        },
        {
            "type": "Cooperative learning",
            "note": "Students will form groups for project discussion"
        },
        {
            "type": "Media, audio, visual materials",
            "note": "Teacher will use visual materials or e-media in class"
        },
        {
            "type": "Case studies",
            "note": "Students will be organized into groups working on a certain topic of environmental issues as term project"
        }
    ],
    "grading": [
        {
            "type": "Class discussion involvement",
            "weight": 30,
            "note": "Every student has to actively participate in the class discussion"
        },
        {
            "type": "Attendances",
            "weight": 10,
            "note": "Students need to participate in every class"
        },
        {
            "type": "Shows/ Exhibitions",
            "weight": 20,
            "note": "Oral presentation of the term project"
        },
        {
            "type": "Case study reports",
            "weight": 40,
            "note": "Students will be organized into groups working on a certain topic of environmental issues and making a video to communicate their ideas as term project"
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}