{
    "year": 108,
    "term": 1,
    "name": "物理教學實習（一）（IB）",
    "teachers": [
        "陳育霖"
    ],
    "department": "EU",
    "code": "IBU0005",
    "credit": 1,
    "serial": 666,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 10,
            "to": 11,
            "campus": "公館",
            "classroom": "Ｓ306"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎第一階段限 國際教師學程-物理◎限國際教師學程-物理選修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "Physics is an international enterprise, which plays a key role in the future progress of humankind. The support of physics education continue to drive the economic engines of the world. Physics is an essential part of the educational system and of an advanced society.\nScience stems from human curiosity or need around life. Humans study various phenomena and changes in nature via observation, and cleverly use science to solve problems, to adapt to the environment, and to live a better life. Science knowledge continues to accumulate in the process of civilization evolution. \nLiving in the modern age, our surroundings are full of innovative technological products, a wealth of information, and environmental and ecological issues derived from resource development. Our nationals also need to have scientific literacy, such as understanding the contribution and limitations of science, making good use of scientific knowledge and methods, being able to deal with all kinds of daily science-related problems in a rational and positive manner and with innovative thinking, comments, judgments and actions. At the same time, we need to cultivate future scientific personnel to lay a solid foundation for human civilization and social and economic development.\nThe core literacy of 12-year National Basic Education course in natural science includes: \n(1) Inquiry Skills, providing students with opportunities to explore learning and problem-solving and to develop relevant; \n(2) Scientific Attitude and Nature of Science, assisting students to understand the ways in which scientific knowledge is produced and developing scientific thinking and the habit of inquiry; \n(3) Core Concept, guiding students to learn scientific knowledge. \nBy practicing the above three connotations, cultivating students to achieve the goal of whole-person development.\nThe core literacy of natural sciences focuses on scientific process skills including observation, logical thinking, reasoning and judgment, and students can use them as their basis to gain knowledge and planning experiments in order to solve problems, which corresponds to TOK of IBDP. \nThe 3 phases and 9 items of the General Outline of 12-year National Basic Education are listed in the table below.",
    "goals": [
        "透過本課程的介紹，使學生認識哲學的基本概念及各種教育思想的特點。"
    ],
    "syllabus": "This course links pre-service teachers' learning and cognition from the viewpoint of the history and the nature of science. It mainly explores instructional strategies, laboratory investigation and the trend of physics education to help pre-service teachers  conduct practical curriculum analysis and development. Cases of physics education in DP courses within the IB course system are introduced. The alignment of IB course system and 12-year National Basic Education in Taiwan are also introduced. The pedagogy of the course, Teaching Materials and Methods: Physics, is designed to demonstrate the pedagogy shown on the Syllabus. The 3 terms of core literacy, Inquiry Skills, Scientific Attitude and Nature of Science, and Core Concept are originated from the nature of science. \n\nThe strategy of Understanding by Design (UbD), backward design, is utilized to instruct pre-service teacher , prior to curriculum and courses design, to conduct literacy-oriented assessment corresponding to the core literacy of nature science and general outline of 12-year National Basic Education. Pre-service teachers need to take turns to teach in every class.\n\nWe provide case study, group discussion and presentation in class to experience authentic science research community operation. Pre-service teachers are asked to convince all their peers in a scientific manner corresponding to the symmetry of physical laws. In addition, Creativity, Action, and Service are emphasized in each classes, such as Social Participation course and brainstorming or design thinking curriculum design with high school teachers.\n\nCourse Structure  \nEach class is divided into two stages. In the first stage, pre-service teachers are guided to focus on discussing the design thinking of specific topic or experiment of physics. In the second stage, pre-service teachers take turns to teach pre-assigned units of physics in class and play moderator to help peers’ presentation, discussion, and review, aiming to reflect the process of the nature of science and student-centered pedagogy. Pre-service teachers put theory of Teaching Materials and Methods: Physics and IBDP into practice and prepare for practicing teaching in the classroom.  \nThis course requires pre-service teachers' participation and discussion extensively. In each stage, the instructor will present related approaches of physics teaching and pre-service teachers will in turn be engaged to formulate their own strategies to practice the concepts in different tasks. The approaches utilized for giving lectures are lecture method, student-centered recitation method, and demonstration method. Discussions and group works are also the major instructional method throughout the course. Due to the inquiry-based and practice-based format, this course will engage pre-service teachers to complete many in-class works and presentation with peer review reflecting the nature of science and TOK-oriented instruction of IBDP. \n\nClass Meetings  \n\\[1\\]  \nTopic: How do we design a inquiry-based science course ?  \nWhat is the first question you need to ask ? \n\n\\[2\\]  \nTopic: Is that a simple case to take the derivative of position function x(t) to get the velocity v(t) and acceleration a(t)?  \nHow do we get the position function x(t) = t2 + 3t + 6, v(t) and a(t) ? Is that reasonable to calculate v(t) and a(t) via taking the derivation of x(t) as we consider the authentic condition or experimental measurement, while the physics textbooks always depict the kinematics variables x, v, a in such mathematical/calculus way.\n\n\\[3\\]  \nTopic: Message you want to send written in chalk on the blackboard: writing phrase and equation on the blackboard or on the presentation slide.  \nArrangement of the context/equation and schematic on the presentation file or blackboard with inquiry-based science process corresponds to the nature of science.\n\n\\[4\\]  \nTopic: What are measured exact with estimated values?\n\n\\[5\\]  \nTopic: Newton’s 3rd law of motion and conservation of momentum  \nTo explore the epistemological view of the definition of momentum and Newton’s formula of F = ma.\n\n\\[6\\]  \nTopic: Students in IBDP classroom  \nIBDP practitioner’s talk  \nAuthentic experience of IBDP practitioner for pre-service teachers.\n\n\\[7\\]  \nTopic: Teacher's faith of student-centered IBDP class management  \nIBDP practitioner’s talk  \nInquiry-based instruction and the Focused Conversation Method (ORID) require teachers to have strong student-centered teaching beliefs. \n\n\\[8\\]  \nTopic: Assessments in IBDP classroom  \nIBDP practitioner’s talk  \nUnderstanding by Design and backward design require meaningful assessment with effective pedagogy in IBDP classroom, especially formative assessments.\n\n\\[9\\]  \nTopic: Newton’s 1st law of motion and inertial coordinate  \nTo explore the epistemological definition of inertia and inertial coordinate from historical views and the nature of science  \nGalileo Galilei’s demonstration of inertia to Newton’s 1st law of motion. Since there is Newton’s 2nd law of motion F = ma, we can take the net force F = 0 to get the condition of Newton’s 1st law of motion.\n\n\\[10\\]  \nTopic: Friction, Static Friction and Kinetic Friction, Friction coefficient  \nThe roles of Static & Kinetic Friction and Coulomb’s law of friction lie in our daily life and engineering design cases, which are all great topics for inquiry-based course design.\n\n\\[11\\]  \nTopic: Perception skills in performing arts  \nInstructor: Veronica Chang, Performing arts practitioner and instructor  \nThe use of student-centered strategies for inquiry and the practicing session  requires a great deal of team focus and discussion, and pre-service teachers student must be familiar to observing skills and guiding students.\n\n\\[12\\]  \nTopic: Performing arts in expression skills  \nInstructor: Veronica Chang, Performing arts practitioner and instructor  \nStudents perceive external messages to generate self-awareness and teacher's beliefs in class. The student-centered teaching requires to have strong teachers' beliefs in class management, interpersonal interaction and inquiry-based instruction.\n\n\\[13\\]  \nTopic: Inquiry-based experiment design  \nPre-service teachers explore and practice the entire experiment on their own, followed by an ORID process on discussing curriculum design strategies to redesign the curriculum.\n\n\\[14\\]  \nTopic: Inquiry and practice, civic participation, CAS  \nThe interdisciplinary nature of inquiry and practice courses comes from the real issues. In order to achieve citizen participation, we can choose to help others to serve our ambient environment all around the world (international-mindedness).\n\n\\[15\\]  \nTopic: Work-Kinetic Energy Theorem, Kinetic Energy  \nThe relationship between Kinetic Energy and Potential Energy is an extremely important topic in physics. The clear physical picture of connection of “work” and “kinetic energy” is a very difficult issue.  \nIn addition, we need to introduce the conservative force in order to define the potential energy for a conservative field. Conservation of Mechanical Energy (Kinetic Energy and Potential Energy) is an subtle model for describing nature.\n\n\\[16\\]  \nTopic: Work-Kinetic Energy Theorem, Potential Energy, and Conservation of Mechanical Energy  \nThe relationship between Kinetic Energy and Potential Energy is an extremely important topic in physics. The clear physical picture of connection of “work” and “kinetic energy” is a very difficult issue.  \nIn addition, we need to introduce the conservative force in order to define the potential energy for a conservative field. Conservation of Mechanical Energy (Kinetic Energy and Potential Energy) is a subtle model for describing nature.\n\n\\[17\\]  \nTopic: Electromagnetic interaction (Maxwell’s Equations) in Modern Life.  \nMaxwell’s Equations, together with the Lorentz force law, are widely applied in our daily life. Professional electromagnetism textbooks tend to use deductive logic to formulate Maxwell equations, while inquiry-based teaching methods tend to be inductive to help students explore additional science-process skills, that’s the core literacy of 12-year basic education in Taiwan and also TOK of IBDP.\n\n\\[18\\]  \nTopic: The Four Fundamental Interaction of the Universe, Cosmology  \nThe four basic interactions (forces) of the universe depict the spatial dimensions of the universe and the evolution of the universe over time, and are the interactions that do not appear to be reducible to more basic interactions. This is just a reflection of the nature of science known as Occam’s Razor, which means that the simplest explanation for a phenomenon is assumed until further evidence suggests that a more complicated explanation is needed. Glashow’s snake is also introduced to link the Four Fundamental Interaction of the Universe to the space and time scales.",
    "methodologies": [
        {
            "type": "講述法",
            "note": "自然科學發展歷史與發展本質、自然科學領域跨科特性、取樣、科學論證等重要概念內容。"
        },
        {
            "type": "討論法",
            "note": "團隊聚焦討討論法、透過課程問題設計思考、團隊共創方式，以小組討論及全班討論方式，發散、聚焦的過程來探究與實作，釐清跨科概念及探究與實作課程之相關議題。"
        },
        {
            "type": "問題解決教學",
            "note": "透過課程問題設計思考、團隊共創方式，以小組討論及全班討論方式，發散、聚焦的過程來探究與實作，釐清跨科概念及探究與實作課程之相關議題。"
        },
        {
            "type": "合作學習",
            "note": "呼應科學本質進行同儕評論與討論。"
        },
        {
            "type": "實驗/實作",
            "note": "學生實地進行探究或實作主題，並進一步進行課程設計。"
        },
        {
            "type": "實地考察、參訪",
            "note": "場域實地探究與實作。"
        },
        {
            "type": "媒體融入教學",
            "note": "輔以資訊平台引導學習及行動載具等資訊科技設備。"
        },
        {
            "type": "專題研究",
            "note": "問題與專題計畫導向設計實作與發表。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 10,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 20,
            "note": ""
        },
        {
            "type": "成果展覽",
            "weight": 20,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 20,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}