{
    "year": 108,
    "term": 2,
    "name": "認識東亞區域安全情勢",
    "teachers": [
        "林賢參"
    ],
    "department": "GU",
    "code": "03UG025",
    "credit": 2,
    "serial": 912,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 5
    },
    "schedule": [
        {
            "day": 2,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "正301"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本課程之主要目的，係為引領學生能夠以國際政治學安全理論的基本概念，解讀自身所處東亞區域所發生的國際安全議題，藉此培養學生對國際衝突產生之原因，以及我國所處的東亞區域國際社會環境、特別是關係到我國作為主權獨立國家生存空間之實際狀況有正確的認識，作為擴大學生之國際視野，並且學習能夠從戰略的角度思考我國參與國際活動與維護國家安全之基本學能。為此，本課程將從縱座標的時間軸為切入點，以歷史的分析角度探討為基礎，並且從橫座標的空間軸為輔助，以政治學與戰略研究的分析角度，針對東亞區域安全的特定議題進行深度的探討。",
    "goals": [
        "透過學習國際安全概念，以培養蒐集有關國際安全事務資訊的能力，以及客觀地思考國際衝突原因與解決衝突途徑的素養。",
        "增進對東亞區域各國間在政治、經濟、社會、文化等領域互動情形(衝突與合作)的了解，以擴充國際視野與增進對東亞國際社會多元文化之認識。",
        "透過對東亞區域國際衝突之事例研究，學習主動透討瞬息萬變的國際社會動態的變化，並且讓理解國際關係的變化，成為終身學習的課題",
        "透過正確理解東亞國際安全情勢、特別是我國所處國際環境現狀，可以激發學生對我國外交之關懷，將來投入外交官行列或從事國民外交之公民實踐。"
    ],
    "syllabus": "第一週:  課綱介紹\n\n第二週: 理解國際安全之概念(無政府狀態、冷戰、權力平衡、威脅平衡、相互保證毀滅、相互依存、圍堵、嚇阻/攻擊性嚇阻、強制外交、安全困境、同盟困境、避險) \n\n第三週: 國際危機處理典範:「驚爆十三天」DVD影片教學 \n\n第四週: 韓戰與美日安保體制的建構(理解亞洲冷戰起源:美蘇冷戰、美國在亞洲「失去中國」以及中蘇結盟的震撼、韓戰爆發、美國變更佔領日本政策—由民主化與非軍事化，轉變為要求日本重新武裝，並締結美日安保條約)\n\n第五週: 美國建構東亞同盟戰略(美國在東亞建構圍堵共產主義中共與蘇聯擴張的同盟網絡(_hub and spokes)__，__建構以美日安保條約為核心，並連結美韓相互防禦條約、美台相互防禦條約、美澳紐安全條約、東南亞公約機構__SEATO_；美日安保條約與美韓/美台條約之戰略連結—遠東條項) \n\n第六週: 冷戰期間的台灣海峽危機與對立:武力解放VS反攻大陸(韓戰停戰後，中共為反擊蔣介石政權海空軍對東南沿海之封鎖與襲擊、美國締結以中共為圍堵對象的SEATO以及美台相互防禦條約，挑起第一次台海危機；為測試美國在東亞戰略部署(在南韓、日本與台灣部署核武)之攻防屬性，以及為創造外部危機以利大躍進運動之推動，挑起第二次台海危機；兩岸處於蔣經國宣示的三不狀態、中共對台展開和平統一攻勢) \n\n第七週: 美中蘇三邊關係變化對東亞戰略環境之影響(中蘇關係交惡，特別是1969年的珍寶島國境武裝衝突，以及美國尼克森政府摸索與中共改善關係，以利美軍結束越戰，為美中聯手圍堵蘇聯創造條件，並因此而改變包括台海兩岸在內的東亞區域權力結構；日中建交/台日斷交、中共肯定美日安保體制之必要性、美中建交/台美斷交、中越戰爭；蘇聯強化遠東地區戰力、日本承諾承擔西太平洋一千海里航道之安全維護) \n\n第八週: 朝鮮半島的統一與對立(1953年韓戰停戰協定生效後，南北韓雙方各自摸索、協議和平統一路線，但由於雙方意識形態、政經與社會體制等差異過大，再加上週邊大國的利益考量，南北雙方持續對立狀態；1980年代中期以降，北韓摸索開發核武以及舊蘇聯瓦解、中共走上改革開放路線，陷入孤立的北韓更加依賴核武開發以強化安全，為後冷戰時代北韓核武危機種下禍根) \n\n第九週: 期中考週\n\n第十週: 第一次朝鮮半島核武危機與四方會談(冷戰末期延續下來的北韓核武開發，在1993年夏季~94年秋季期間陷入危機狀態，美國檢討對北韓核武設施進行外科手術式攻擊，最終在前總統卡特斡旋下，達成美國與北韓間的核子共識架構、成立支援北韓電力供應之朝鮮半島能源機構KEDO；召開美國、中共、以及南北韓參與的四方會談，摸索建構朝鮮島和平新機制，但因美韓與北韓間的互信與共識不足，在六次會議過後，即劃下休止符。) \n\n第十一週: 後冷戰時代的台灣海峽危機:統獨/維持現狀之爭(1990年代前半，在「江八點」與「李六條」互動良好下的臺海兩岸，由於中共江澤民政權認為李登輝政權的務實外交係為推動「兩個中國」或「一中一臺」，而美國則是始作俑者、幫助犯，遂在1995年7月~1996年3月間發動對台文攻武嚇，掀起第三次台海危機，讓台海繼朝鮮半島後，成為東亞區域爆發衝突的第二個熱點；民進黨執政八年，兩岸陷入緊張、美台互信動搖；國民黨再度執政，透過增強兩岸經濟關係與民間交流，穩定兩岸關係，民進黨的大陸政策主張，亦透過黨內辯論而日趨理性) \n\n第十二週: 美日安保(同盟)「再定義」(東亞區域安全並未受惠於美蘇冷戰結束之和平紅利，朝鮮半島與台灣海峽相繼出現危機，促成處於漂流狀態的美日同盟進行「再定義」，將美日安保朝向維護區域安全的國際公共財方向發展，日本即因此而朝向「世界中的美日同盟」發展；美日加強同盟合作，引發中共之不安，再加上美國介入第三次台海危機，加速中共軍事現代化腳步，惡化東亞區域的安全困境)\n\n第十三週: 第二次朝鮮半島核武危機與六方會談(2002年10月，北韓再度被美國發現祕密開發核武而掀起第二次核武危機，其後雖然召開美中日俄與南北韓之六方會談，但由於北韓採取膽小鬼遊戲的戰爭邊緣策略，陸續進行三次地下核武試爆，以及多次彈道飛彈試射，加劇東北亞區域之核武危機，並導致日本決定與美國共同研發飛彈防禦系統，檢討修改憲法第九條或其相關解釋以行使集體自衛權，並考慮部署足以摧毀敵國飛彈或軍事基地之攻擊性戰力) \n\n第十四週: 東海/釣魚台主權爭議(1970年代末期，擱置爭議的釣魚台主權爭議，因為聯合國海洋法公約簽署(1982年)、生效(1994年)，以及日本強化對釣魚台之實效支配(逮捕中共籍漁船船長、將釣魚台國有化)而再起紛爭，再加上東海專屬經濟海域劃界原則歧異，雙方對立尖銳化，美國再三強調，釣魚台係美日安保條約適用範圍，嚇阻中共以實力改變現狀；台灣與日本在釣魚台主權爭議上，在我方不與中共合作下，日本做出妥協而與我方締結漁業協定，為東海資源共享奠下基礎；由於釣魚台具有軍事利用價值，關係到美日同盟與中共間在西太平洋制海權之爭奪，讓問題難以解決；中共追求海洋強國的戰略目標，乃是東海與南海爭議升高的重要因素) \n\n第十五週: 南海爭議(臺海兩岸、越南、菲律賓、馬來西亞、汶萊等五國六方對南海島嶼全部或一部主張擁有主權，東協於1992年發布「1992年東協國家南海宣言」，與我國於1993年發布的「南海綱領」，均主張和平方法解決爭端；1995年2月，中共強佔菲律賓控制下的美濟礁島，為南海爭端投下不可預測的變數；2002年11月，中共與東協國家簽署「南海各方行為宣言」，重申尊重並承諾國際法原則，保障在南海的航行及飛越自由，以及以和平方式解決爭端；2009年以降，南海紛爭再起、衝突加劇，美日兩國協助東協建構海洋安全機構，並要求中共與東協簽訂具有國際法約束力的東海行動規範，以和平方式解決爭端，並保障航行自由與安全) \n\n第十六週:中共崛起與東亞權力轉移(中共在經濟上與軍事上的崛起，已是不可動搖的事實，問題在於崛起後的中共是否會挑戰美國在東亞區域的優勢地位?美中兩國間在東亞區域乃至於全球規模是否真的已出現權力轉移?如果出現，有無可能和平轉移?是否將激起衝突的危機、甚至爆發戰爭?美國在東亞的友好同盟國家，是選擇持續與美國合作，配合美國之避險戰略?或者是改「扈從」於中共而迫使美國必須交出支配優勢地位?針對各種想定進行檢討)\n\n第十七週: 在家撰寫期末報告\n\n第十八週: 在家撰寫期末報告",
    "methodologies": [
        {
            "type": "講述法",
            "note": "以哈佛大學Joseph Nye教授、日本青山學院大學土山實男教授之著作、以及授課教師之研究成果為教材，講解分析國際安全之概念性架構後，再與選課學生探討與了解美蘇冷戰(期中考前)與後冷戰時代(期中考後)的東亞區域安全情勢。"
        },
        {
            "type": "討論法",
            "note": "針對東亞區域安全的議題，要求學生參與討論並發表意見"
        },
        {
            "type": "媒體融入教學",
            "note": "以古巴危機為背景所拍攝的「驚爆十三天」，乃是描述決策者在面臨(核武)戰爭危機下，如何透過嚇阻、強制外交等心理戰措施進行討價還價之最佳影片，可以讓學生比較真實地理解國際危機發生與解決的過程，加深對國際安全概念—冷戰、安全困境、嚇阻、以及強制外交之理解。"
        }
    ],
    "grading": [
        {
            "type": "期末考",
            "weight": 40,
            "note": "擇一東亞區域安全專題撰寫2000字報告"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 40,
            "note": "無故曠課超過三次者，本項以零分計算"
        }
    ],
    "prerequisite": "",
    "general_core": []
}