{
    "year": 108,
    "term": 2,
    "name": "臺灣文史與城市發展",
    "teachers": [
        "黃玫瑄"
    ],
    "department": "GU",
    "code": "04UG024",
    "credit": 2,
    "serial": 928,
    "group": "B",
    "quota": {
        "limit": 65,
        "additional": 1
    },
    "schedule": [
        {
            "day": 2,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "誠301"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "臺灣特殊的地理位置及環境，使臺灣在航海技術發達後，不斷吸引世人的目光，欲一窺究竟。本課程規畫社會參與式的歷史學習，引導學生在空間中發現歷史精神，擬突破傳統的課堂板書教學與紙筆測驗方式，由教師帶領修課學生解讀影音圖文史料，或走讀歷史現場，運用不同的素材，探索臺灣文化史蹟，使修課學生身處歷史情境，對於歷史發展有較為直接而深刻的感受，同時亦啟發、引導學生反思；並以繪製文化史蹟地圖及導覽解說方式來檢視學生的學習成效，促使修課學生將課程知識觀點適度運用。因此本課程之特色有四： 一、有別於傳統的教學方法，重視學生經驗學習：突破過往以文獻為主要材料，以官方或主流史觀解釋歷史的傳統，由教師帶領學生將生命經驗融入歷史，期盼學生除了追求卓越，並能關照切身的歷史文化。 二、以多元教材及跨領域教學方式，精進學習成效：藉由臺灣影音圖文史料與臺灣文化史蹟導覽的解讀過程，增進學生對過去的認知，挖掘豐富有趣的臺灣歷史與文化，提供學生認識臺灣文史的另一扇窗。 三、以學習者為重心，藉由團隊合作的學習模式，主動學習：鼓勵學生以「專題研究、團隊合作、實地探查、調查訪問，併用文獻史料、影音圖文史料」等方式，探索臺灣歷史與文化，引發對於相關議題的思考與反省，並試著運用科技 / 媒體作為表達溝通的工具。 四、培養學生體察、鑑賞、反思、實踐：培養學生能夠體察環境，除了鑑賞臺灣文化史蹟之美學外，亦檢視臺灣文化史蹟所面臨的困境，提出問題與看法，反思如何讓臺灣文化史蹟「再生」（例如以博物館或文化創意產業等方式「再生」），如何重新賦予新的文化價值，如何建立特色、永續發展等，進而將知識理論轉化為行動。",
    "goals": [
        "增進學生對臺灣歷史與文化的瞭解，及學習興趣，期使學生能掌握住臺灣歷史與文化的發展脈絡。",
        "引導學生關懷臺灣社會及文化發展，體認到自己肩負的社會責任，進而參與社會改造。",
        "引導學生接觸公共議題，從中識讀不同的價值觀，深化學習，培養學生具有獨立思考及判斷之能力。",
        "訓練學生能用自己的觀點詮釋相關議題。"
    ],
    "syllabus": "本課程內容一方面按臺灣歷史發展的脈絡教學，以縱向承先啟後的銜接，逐漸加深加廣的學習進程，讓學生對臺灣歷史與文化有更進一步的認識；另一方面藉由小組活動、作業之進行，引導學生與生活經驗、社會議題統整，循序漸進地探索城市發展的軌跡，及其對文化史蹟所產生的衝擊與影響。\n\n第1週 課程說明暨學習資源簡介\n\n第2週 臺灣歷史與文化導論\n\n第3週 海洋臺灣：福爾摩沙(Formosa)的發現與探索\n\n第4週 殖民臺灣：探討具有殖民主義觀點的臺灣影音史料\n\n第5週 移民臺灣：探討遷徙與逃離以及人民記憶\n\n第6週 政治案件與臺灣發展\n\n第7週 如何採社會參與方式探索臺灣歷史與文化\n\n第8週 期中評量\n\n第9週 臺灣城市發展\n\n第10週 穿越時空看臺北\n\n第11-15週 史蹟考察、探勘\n\n第16-17週 學習成果發表\n\n第18週 課程總結",
    "methodologies": [
        {
            "type": "講述法",
            "note": "教師講授"
        },
        {
            "type": "討論法",
            "note": "師生討論、學生小組討論，促進學生的互動及腦力激盪，引發對於相關議題的思考與反省。"
        },
        {
            "type": "問題解決教學",
            "note": "議題設定，啟發學生分析問題、解決問題。"
        },
        {
            "type": "合作學習",
            "note": "學生分組專題報告，培養學生溝通與團隊合作的精神。"
        },
        {
            "type": "實地考察、參訪",
            "note": "依主題進行校外教學活動，透過考察、探索、反思，啟發學生積極參與學習。"
        },
        {
            "type": "媒體融入教學",
            "note": "多媒體教材教學"
        },
        {
            "type": "專題研究",
            "note": "學生製作分組專題報告，促使修課學生將課程知識觀點適度運用。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": "（1）閱讀筆記及心得 -10% （2）校外考察活動隨筆紀錄 (發表在Moodle)  -10% （3）我與文化史蹟的互動經驗及學習反思 -10%"
        },
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 40,
            "note": "（1）文化史蹟搜查 （2）文化史蹟導覽解說"
        }
    ],
    "prerequisite": "",
    "general_core": []
}