{
    "year": 108,
    "term": 2,
    "name": "宇宙中的生命與太空環境",
    "teachers": [
        "橋本康弘"
    ],
    "department": "GU",
    "code": "06UG021",
    "credit": 2,
    "serial": 975,
    "group": "",
    "quota": {
        "limit": 112,
        "additional": 15
    },
    "schedule": [
        {
            "day": 3,
            "from": 6,
            "to": 7,
            "campus": "公館",
            "classroom": "Ｅ102"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本通識課程主要是讓學生們可以知道目前人類對於宇宙中具有生命跡象的瞭解以及現今和未來人類環境技術的發展。",
    "goals": [
        "讓學生認識地球生命環境的限制，然後再加以推廣到搜尋外太空適合生命存在的環境。培養學生能夠分辨所得到資訊的真實性。",
        "讓學生能夠主動的尋找資訊。",
        "讓學生學瞭解目前人類航天技術的發展以及限制。學生在瞭解航天技術的基本知識後，再深入地討論人類怎麼去解決現有的技術限制。透過這些介紹讓學生可以擁有創新以及解決問題的能力。",
        "讓學生能夠瞭解生命的起源以及生命起源所需要的環境。透過目前的觀測讓學生瞭解地球環境的重要性與資源的分配與善用。思考如何讓社會在土地，環境和資源上都能共享並且發揮最大貢獻。"
    ],
    "syllabus": "一、 教學目標\n\n因為現在地球居住環境的擁擠與資源環境的耗竭，許多國家紛紛發展太空科學技術以尋求太空殖民的可能性，本課程將從生命的起源開始，讓學生了解維持生命所需的環境要素，之後進一步地介紹目前人類所發展出來的太空科學技術，以及探測的成果，希望能藉由這堂課程，讓學生對於他們所生存的地球、太空中的環境，與未來人類文明發展的方向有進一步的認識；希望能藉由這門課拓展學生的國際觀與世界觀；並且希望學生在修完這學期的課程之後，在接收到來自網路、電視媒體的資訊時，有能力判斷真偽，並做出評論。\n\n二、 每週教學進度\n\n教學方法：主要以自製投影片進行講述，輔以影片等多媒體資料進行教學，課堂中鼓勵學生參與討論，讓學生學習在課堂中發言，並從不同方向思考問題。\n\n進度規劃：\n\n第1週 03/04\n\nIntroduction\n\nWhat is human?  What is the life?\n\nWhat defines the life on Earth?  Need red blood?\n\nScientific and non-scientific bias: Must they be similar to life on Earth?\n\nHistory of extra-terrestrial life search\n\nExtreme Biology on Earth: Life in hostile environments\n\nEarth bacteria can survive in space?\n\nAsteroids in Antarctic: Life from Mars?\n\n第2週 03/11\n\nLife in the Solar System: Life in the Neighborhood (I)\n\n第3週 03/18\n\nLife in the Solar System: Life in the Neighborhood (II)\n\nMoon\n\nVenus and global warming: Was Venus habitable before?\n\nMars: Do we have water? Are Martians there?\n\nJupiter atmosphere --Possible life floating in the air?\n\nGalileo moons around Jupiter -- Salt water ocean? Fish swimming?\n\nTitan: A giant moon with thick atmosphere around Saturn. Methane lake?\n\nEnceladus: Saturn's moon with liquid water.\n\nComets and Asteroids:  Water in comets? DNA in comets?\n\nInterplanetary space\n\n第4週 03/25\n\nAstrobiology by Space Missions and Probes: Sending Robot Astronomers (I)\n\n第5週 04/01\n\nAstrobiology by Space Missions and Probes: Sending Robot Astronomers (II)\n\nViking 1 and 2: First \"little Martian\" search\n\nPath-Finder: First mobile robot-scientists\n\nSpirit and Opportunity: Working 10 years on Mars\n\nPhoenix: Landing on the Martian ice\n\nCuriosity Rover: Modern robot biologist that discovered water on Mars\n\nStardust/Hayabusa: Bringing dusts back to Earth\n\nVoyager I and II: Voyage to the outer planets\n\nGalileo: Monitoring Galileo moons\n\nCassini and Huygens lander: Landing on methane ocean\n\nFuture Europa mission: First Ice-braker and Submarine to search for fish\n\n第6週 04/08\n\nHuman Mission to Mars: Can we send people to Mars?\n\nOxygen, Water, Food supply (Bringing food for 10 people for three years mission?)\n\nCurrent shortest duration plan\n\nCurrent park-orbit plan\n\n第7週 04/15\n\nSearch for Ingredients of Life:\n\nWater, Methane, Oxygen, CO2, and Amino Acids\n\nSample return mission\n\nSpectroscopic analysis of organic molecules\n\n第8週 04/22\n\nMidterm\n\n第9週 04/29\n\nExoplanets: Planets around other Suns (I)\n\n第10週 05/06\n\nExoplanets: Planets around other Suns (II)\n\nBinary stars and brown dwarfs: Twin Sun and Too small Sun.\n\nHot Jupiters: Easy-to-find planets, but is it too hot?\n\nHabitable Zones: Not too hot, not too cold\n\nDirect method and corona graph: How to see planets, directly?\n\nEclipsing, transit, and micro-lensing: Find a Sun “blinking”\n\nPulsar decay:  Nobel prize winner\n\nRadial velocity methods: Watch Sun to move\n\nGliese system (Gliese 581d): First good candidate\n\nFuture experiments: Find small planets around small stars\n\n第11週 05/13\n\nTechnology of Space Travel (Let's go Interstellar space!) (I)\n\n第12週 05/20\n\nTechnology of Space Travel (Let's go Interstellar space!) (II)\n\nEarly rocket and liquid fuel rocket: Modern rockets\n\nSolid motors: Old technology with new idea\n\nGravitational assist: How to accelerate without gasoline\n\nAtmospheric brake: How to slow down\n\nIon engine: small but long push\n\nSolar sailor: Catching “solar wind”\n\nNuclear engine\n\nSpecial relativity and time delay: Time machine\n\nGeneral relativity and singularity in the space-time continuum: Worm hole? A Tunnel to travel through?\n\n第13週 05/27\n\nLong Term Influence from Space Environments: Can human survive in the space?\n\nSolar wind and Galactic cosmic rays: Risk for Cancer?\n\nCalcium depletion and loss of the muscle\n\nOxygen, Water, and Food supplies: Need to bring “a small Earth”?\n\nMental effects: Home sick in space or new generation of “space born” people?\n\nEvolutions, Space station experiments: Can life adapt to the space environments?\n\n第14週 06/03\n\nProbability of Extraterrestrial Life in the Universe: Are really someone there?\n\nMinkowski space and light cone: The Universe is too big to communicate?\n\nDrake\\`s equation: Calculate the percentage of life\n\nCan we communicate to the alien?\n\n第15週 06/10\n\nProbing the edge of the solar system and sending message beyond\n\nPioneer 10 and 11: First messengers\n\nVoyager I and II: Golden records\n\nNew Horizons: Mission beyond Kuiper Belt\n\nFermi’s Paradox\n\n第16週 06/17\n\nFinal exam\n\n第17週 06/24\n\nSelf-learning\n\nSETI: Search for Extraterrestrial Intelligence\n\n第18週 07/01\n\nSelf-learning\n\nSETI\n\nCommunicating via Radio\n\n\"Message from Earth\" and \"Hello from Earth\"\n\n三、 作業規劃\n\n第5週 04/01 HW1 out\n\n第6週 04/08 HW1 due\n\n第7週 04/15 HW1 return\n\n第13週 05/27 HW2\n\n第14週 06/03 HW2 due\n\n第15週 06/10 HW2 return\n\n四、 書目資料\n\nLife in the Universe\n\nJ. O. Bennett and S. Shostak\n\nAddison-Wesley 2012\n\nThe Search for Life in the Universe\n\nD. Goldsmith and Tobias Owen\n\nUniversity Science Books 2001\n\nLife in the Universe\n\nJ. N. Pierce\n\nBrown Walker 2008\n\nCosmos\n\nCarl Sagan\n\nRandom House, New York 1980\n\n五、 教學方法\n\n講述法\n\nHandouts will be distributed at the start of the semester. Online materials will be distributed over Moodle system. Recent discovery or events (eclipses, meteoroid showers, …) will be discussed in real time.\n\n媒體融入教學\n\nProfessional astronomical pictures, movies and other hypermedia support will be provided\n\n六、 評分方式\n\n作業 40 %\n\nTwo assignments will be given  in parallel of the lectures. Questions are related to the class and will help the students understanding the class.\n\n期中考 30 %\n\nMid-term exam will be based on the topics discussed in class, with an overlap with the questions developed in homework.\n\n期末考 30 %\n\nFinal exam will be based on the topics discussed in class, with an overlap with the questions developed in homework.\n\n七、 其他\n\nOnline lectures (including the extra two week lectures will be provided on the Moodle systems and will be incorporated into the exam. Homeworks and exams will be distributed/conducted through the Moodle system for 108-2.",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Handouts will be distributed at the start of the semester. Online materials will be distributed over Moodle system. Recent discovery or events (eclipses, meteoroid showers, …) will be discussed in real time."
        },
        {
            "type": "媒體融入教學",
            "note": "Professional astronomical pictures, movies and other hypermedia support will be provided"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 40,
            "note": "Two assignments will be given  in parallel of the lectures. Questions are related to the class and will help the students understanding the class."
        },
        {
            "type": "期中考",
            "weight": 30,
            "note": "Mid-term exam will be based on the topics discussed in class, with an overlap with the questions developed in homework."
        },
        {
            "type": "期末考",
            "weight": 30,
            "note": "Final exam will be based on the topics discussed in class, with an overlap with the questions developed in homework."
        }
    ],
    "prerequisite": "",
    "general_core": []
}