{
    "year": 108,
    "term": 2,
    "name": "自主學習（二）",
    "teachers": [
        "胡衍南"
    ],
    "department": "GU",
    "code": "0SUG530",
    "credit": 1,
    "serial": 4470,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 0
    },
    "schedule": [
        {
            "day": 0,
            "from": -1,
            "to": -1,
            "campus": "",
            "classroom": ""
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎第一階段需人工加選◎第二階段需人工加選◎加退選階段需人工加選",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 1,
    "description": "為鼓勵學生自主學習，培養跨域探索及終生學習之精神，學生得依據不同學習狀態及需求自主規劃學習方案，由團隊自主規劃至少18小時之自主學習課程並提出學習計畫書，經審核通過後實施。本課程期許透過學生自行規劃與實踐學習方案的過程，激發學生自主、多元的學習能力。",
    "goals": [
        "促使學生能確立大學目標並培養良好的主動學習動機與方法。",
        "使同學探究大學之生涯規劃，以便日後大學生涯目標之訂定與實踐。"
    ],
    "syllabus": "第一週：進度審視與學期學習目標訂定（兩小時）\n\n（延續上學期以及在寒假時期的階段性成果，檢視現有進度後，共同討論未來課程。另外，希望成員能在此次課程中寫下自己未來一學期想在此課程完成的「學習目標」，給自己在未來一學期的學習中立定目標、方向）\n\n第二週：基礎上色技術與經驗分享（兩小時）\n\n（由成員中針對上色技巧有所研究者擔任討論帶領者，讓成員間可以互相學習關於上色的相關知識、技巧，以大家針對彼此以往作品互相討論，以及練習實作為主要進行方式，藉由練習及交流發現自身的問題後，期待成員間能主動提問討論）\n\n第三週：中間幀與腳本製作知識分享（兩小時）\n\n（由成員中針對動畫中間幀概念以及畫面腳本製作有所研究者擔任討論帶領者，讓成員間可以互相學習關於上述在動畫成形過程中的重要相關知識、技巧，以討論及實作練習為主要進行方式，藉由練習及交流發現自身的問題後，期待成員間能主動提問討論）\n\n第四週：圖層與圖釘變形技巧分享（兩小時）\n\n（由成員中針對圖層與圖釘變形技巧有所研究者擔任討論帶領者，讓成員間可以互相學習關於上述與動畫美術素材製作的重要相關知識、技巧，以討論以及利用素材實際練習為主要進行方式，藉由練習及交流發現自身的問題後，期待成員間能主動提問討論）\n\n第五週：成果製作與討論交流（兩小時）\n\n     （讓成員可以整合前幾週所交流吸收到的知識，共同針對期末成果進行討論與實際製作。期待成員可以應用自身所學，並可以從實際製作與他人討論中發現問題，主動提問討論）\n\n第六週：現階段成果檢視及自我評量（兩小時）\n\n（本週為期中前的成果檢核，檢視成員課堂及課間的學習成果是否有符合成員共同討論的進度，以及讓成員之間彼此交流針對目前成果的感想、建議。在本週課程中，成員將會進行第一次的自我學習成果評量，檢視自身目前現有的學習成果，紀錄目前的學習歷程與想法）\n\n第九週：配音技巧交流分享（兩小時）\n\n（由成員中針對配音有所研究者擔任討論帶領者，讓成員間可以互相學習關於配音的重要相關知識、技巧，以自由練習討論為主要進行方式，藉由練習及交流發現自身的問題後，期待成員間能主動提問討論）\n\n第十週：動畫配音及音樂素材製作（兩小時）\n\n（本週將讓成員實際前往錄音室進行動畫配音的素材製作，藉由實際操作讓成員再次加深以及應用自身的學習成果）\n\n第十一週：動畫特效製作技巧分享交流（兩小時）\n\n（由成員中針對動畫特效製作有所研究者擔任討論帶領者，讓成員間可以互相學習關於上述與動畫製作的重要相關知識、技巧，以討論以及利用素材實際練習為主要進行方式，藉由練習及交流發現自身的問題後，期待成員間能主動提問討論，同時亦可為期末成果所需進行實際製作）\n\n第十二週：現階段成果檢視及自我評量（兩小時）\n\n（本週為期末發表前的成果檢核，檢視成員課堂及課間的學習成果是否有符合成員共同討論的進度，以及讓成員之間彼此交流針對目前成果的感想、建議。在本週課程中，成員將會進行第二次的自我學習成果評量，檢視自身目前現有的學習成果，紀錄目前的學習歷程與想法）\n\n第十四週：成果製作與討論交流（兩小時）\n\n     （讓成員可以整合先前課堂所交流吸收到的知識，共同針對期末成果進行討論與實際製作。期待成員可以應用自身所學，並可以從實際製作與他人討論中發現問題，主動提問討論。每週的前一個半小時，成員須針對大家共同討論出來的進度進行實際成果製作，最後半小時，成員間需要針對現階段的成果進行想法交流，討論未來製作的方向與現有問題）\n\n第十六週：成果製作與討論交流（兩小時）\n\n     （讓成員可以整合先前課堂所交流吸收到的知識，共同針對期末成果進行討論與實際製作。期待成員可以應用自身所學，並可以從實際製作與他人討論中發現問題，主動提問討論。每週的前一個半小時，成員須針對大家共同討論出來的進度進行實際成果製作，最後半小時，成員間需要針對現階段的成果進行想法交流，討論未來製作的方向與現有問題）\n\n第十八週：成果製作與討論交流（兩小時）\n\n     （讓成員可以整合先前課堂所交流吸收到的知識，共同針對期末成果進行討論與實際製作。期待成員可以應用自身所學，並可以從實際製作與他人討論中發現問題，主動提問討論。每週的前一個半小時，成員須針對大家共同討論出來的進度進行實際成果製作，最後半小時，成員間需要針對現階段的成果進行想法交流，討論未來製作的方向與現有問題）\n\n第十九週：課程成果與自我學習成果評量（兩小時）\n\n              （讓成員共同檢視課程的最終實際成果，發表評論與心得。同時檢視自身在課程中的學校目標是否完成，方法與成效是否有   符合期望，最終交流彼此針對課程的心得感想。）",
    "methodologies": [
        {
            "type": "其他",
            "note": "自主學習"
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": "自我評量：以數個指標進行針對自身學習成果的評論及反思\n1.一次自評（30%）\n2.二次自評（30%）\n3.期末自評（40%）\n自我評量的指標包含以下項目：\n1.自我學習目標完成度檢視\n2.學習方法優缺點分析\n3.實際課堂成果評論\n4.未來學習目標立定\n5.未來學習方法訂定"
        }
    ],
    "prerequisite": "",
    "general_core": []
}