{
    "year": 107,
    "term": 1,
    "name": "書報討論（一）",
    "teachers": [
        "張雯"
    ],
    "department": "IM86",
    "code": "IWM0072",
    "credit": 1,
    "serial": 1395,
    "group": "",
    "quota": {
        "limit": 36,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 7,
            "to": 8,
            "campus": "本部",
            "classroom": "誠104"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "This course aims to develop students’ knowledge and skills regarding workforce training, human resource development, and management. This course provides a platform for students to discuss issues and research related to learning in workplace. Through lectures, speeches, group discussion, field trips, and case studies, this course helps enhance student competence in human resource development.",
    "goals": [
        "Students will be able to describe new trends of HRD",
        "Students will be able to describe the competence of an HRD professional",
        "Students will be able to exhibit a proactive attitude toward learning and service",
        "Students will be able to improve HRD research skills",
        "Students will be able to improve HRD professional skills"
    ],
    "syllabus": "This course aims to develop students\\` knowledge and skills regarding workforce training, human resource development, and management. This course provides a platform for students to discuss issues related to learning in workplace. Through lecture, group discussion, field trips, and case study, this course helps enhance students competence in human resource development.\n\n**Course Description**\n\nThis course is designed for all students to learn together by doing projects related to IHRD instructional goals. The goals are:\n\n1\\. To cultivate the professionals of human resource development and management.\n\n2\\. To cultivate the professionals of international and cross-cultural management. \n\nThis course combines these two goals. Participants would learn **intercultural competence**, and at the same time conduct mini **training program development**.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "實地考察、參訪",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 15,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 15,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 30,
            "note": ""
        },
        {
            "type": "成果展覽",
            "weight": 40,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}