{
    "year": 107,
    "term": 1,
    "name": "國際人力資源管理研究",
    "teachers": [
        "鄭道有"
    ],
    "department": "IM86",
    "code": "IWM0055",
    "credit": 3,
    "serial": 1394,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "誠104"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "I. The course illustrates how successful human resource management must function in a competitive world. In particular, International Human Resource Management (IHRM) activities are placed in a global context, known differently from those conducted locally. It can be seen such as:\n1. The composition of multi-cultural management teams, human resource policies and practices are globally operated; \n2. Organizations utilizing their operations into social contexts with which they are unfamiliar or new; \n3. Employees from different cultural backgrounds working together;\n4. Managing expatriates with an emphasis on staff recruitment for international assignments, expat-preparation, re-entry training, and development are more complex than local businesses.\n\nII. Packed with current examples that reflect the vibrancy of the international business field, this course offers a managerial approach that keeps an emphasis on international employment, compensation and benefits, talent management and repatriation from multi-cultural perspective. Among them, a critical evaluation of the effectiveness of international deployment as well as current trends in IHRM will be addressed. After completion of this course, students shall be able: \n1. To recognize the complexity & challenges of managing in multicultural and international contexts. \n2. To understand the impact of culture on work and human resource management.\n3. To communicate effectively on international human resource management issues. \n4. To address and apply conceptual issues related to implementation of international human resource management.",
    "goals": [
        "Understand the implications of changes in the global organization of firms and the international workforce for HRM policy-making.",
        "Have a detailed understanding of the key analytical concepts and models in international HRM.",
        "Articulate the principal comparisons of the business and human resource systems in local and global contexts.in local and global contexts.",
        "Assess the different approaches to and strategies for HRM in international business activities, and their impact on employees."
    ],
    "syllabus": "Course Description: The course illustrates how successful human resource management must function in a competitive world. In particular, International Human Resource Management (IHRM) activities are placed in a global context, known differently from those conducted locally. It can be seen such as: 1. The composition of multi-cultural management teams, human resource policies and practices are globally operated; 2. Organizations utilizing their operations into social contexts with which they are unfamiliar or new; 3. Employees from different cultural backgrounds working together; 4. Managing expatriates with an emphasis on staff recruitment for international assignments, expat-preparation, re-entry training, and development are more complex than local businesses. Packed with current examples that reflect the vibrancy of the international business field, this course offers a managerial approach that keeps an emphasis on international employment, compensation and benefits, talent management and repatriation from multi-cultural perspective. Among them, a critical evaluation of the effectiveness of international deployment as well as current trends in IHRM will be addressed. After completion of this course, students shall be able: 1. To recognize the complexity & challenges of managing in multicultural and international contexts. 2. To understand the impact of culture on work and human resource management. 3. To communicate effectively on international human resource management issues. 4. To address and apply conceptual issues related to implementation of international human resource management. Schedule: Week 1 Introduction to: 1.Curriculum framework, progress, and score assessment 2.What is the function of international Human Resource Management (IHRM) Week 2 The Internationalization of Human Resource Management (IHRM\\_#1) Week 3 Strategic International Human Resource Management (IHRM\\_#2) Week 4 Design and Structure of the Multinational Enterprise (IHRM\\_#3) Week 5 1.International Mergers and Acquisition, International Joint Ventures, and Alliances (IHRM\\_#4) 2.Country and Company Culture and International Human Resource Management (IHRM\\_#5\\_Part 1) Week 6 1.Country and Company Culture and International Human Resource Management (IHRM\\_#5\\_Part 2) 2.Case 1: Yarn Paradise: World’s biggest Online Yarn Store (Turkey)/P33#1 Week 7 1.International Employment Law, Labor Standards, and Ethics (IHRM\\_#6) 2.Case 2: The Early Evolution of Manufacturing Firms: Ford Motor Company Goes International (USA)/P61#2 Week 8 1.International Employee Relations (IHRM\\_#7) 2.Case 3: Capgemini: A Transnational Organization (France)/P87#3 Week 9 1.International Workforce Planning and Staffing (IHRM\\_#8\\_Part 1) 2. Case 4: BCE’s Acquisition of Teleglobe International (Canada)/P113#4 Week 10 1. International Workforce Planning and Staffing (IHRM\\_#8\\_Part 1) 2. Case 5: Internationalization and Cross-cultural Expansion of a Local Manufacturer: Barden (US) and FAG (Germany)/P147 Week 11 1.International Recruitment, International Selection, and Repatriation(IHRM\\_#9) Case 6: Non-Compete Agreements and Intellectual property: Value Partners SA (Italy and Bain & Company (USA) Conflict in Brazil/P191 Week 12 1.International Training and Management Development (IHRM\\_#10) 2.Case 7: Global Industrial Relations and Ford Motor Company (USA/Global)/P216 Week 13 1.International Compensation, Benefits, and Taxes (IHRM\\_#11) 2.Case 8: Firms Woo Executives from Third Countries (Global)/P241 Week 14 1.International Employee Performance Management (IHRM\\_#12) 2.Mid-term paper Week 15 Well-being of the International Workforce, and International HRIS (IHRM\\_#13) Week 16 Comparative IHRM: Operating in Other Regions and Countries (IHRM\\_#14) Week 17 The IHRM Department, Professionalism, and Future Trends(IHRM\\_#15) Week 18 1.Final turn-in assignment 2.Wrap-up",
    "methodologies": [
        {
            "type": "講述法",
            "note": "1. The course is designed to be both theoretical and experiential.\n2. Important issues and trends in IHRM will be introduced."
        },
        {
            "type": "討論法",
            "note": "Students will discuss related issues and trends introduced by the instructor and research topics presented by fellow students."
        },
        {
            "type": "合作學習",
            "note": "Small teams will be established at the start of the semester to help facilitate case study and experience team work dynamics."
        },
        {
            "type": "專題研究",
            "note": "Students will carry out a research project relating to a current problem or implication in IHRM."
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 20,
            "note": "1. Students are required to take the written test in-class.\n2. The mid-term exam will cover material for the first half of the class in details and important concepts from the first half of the class."
        },
        {
            "type": "期末考",
            "weight": 30,
            "note": "Students are required to present the project orally in class and submit the completed written research report at the end of semester."
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "Students are encouraged to actively participate in class discussions to enrich the learning."
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Attendance is required."
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "Students are required to introduce and present assigned cases in class."
        }
    ],
    "prerequisite": "",
    "general_core": []
}