{
    "year": 111,
    "term": 1,
    "name": "科技與工程教育比較專題研究",
    "teachers": [
        "林坤誼"
    ],
    "department": "HD71",
    "code": "ITD0044",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 1107,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 5
    },
    "schedule": [
        {
            "day": 2,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "科技系TB312"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限本系(含雙主修)修習 ◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "本課程著重在學習從事比較教育的方法，並探討當代從事比較教育所應關切的重要趨勢與課題。此外，本課程也將針對世界各國的科技與工程教育進行探究，包含澳洲、紐西蘭、加拿大、瑞典等不同國家的發展現況，並透過前述習得的比較教育研究方法，實際針對臺灣與世界各國的科技與工程教育進行比較，據此研提建議以供臺灣科技教育之重要參考依據。",
    "goals": [
        "探究比較教育的相關理論與方法。",
        "探討當代比較教育相關研究的重要趨勢與課題。",
        "探究澳洲、紐西蘭、加拿大、瑞典等不同先進國家的科技與工程教育之發展現況。",
        "培養從事比較教育研究之學術能力。",
        "培養透過從事比較研究以洞悉國際科技與工程教育發展脈絡與趨勢之能力。"
    ],
    "syllabus": "第一週：F. Schneider的比較教育理論\n\n第二週：A. M. Kazamias比較教育方法論之研究\n\n第三週：G. P. Kelly：為弱勢國家與女性發聲的先行者\n\n第四週：R. G. Paulston的社會地圖學與比較教育研究\n\n第五週：R. Cowen比較教育方法論之研究\n\n第六週：M. Carnoy：致力實踐研究的比較教育學者\n\n第七週：超越質化與量化研究之爭：M. Crossley與P. M. Broadfoot的比較與國際教育方法論\n\n第八週：當比較教育遇見發展研究：K. King與A. Little的「全民教育」觀點與行動\n\n第九週：期中成果報告\n\n第十週：國際比較教育的趨勢與課題（I）：國際期刊\n\n第十一週：國際比較教育的趨勢與課題（II）：國際專書\n\n第十二週：澳洲與臺灣科技教育之比較研究\n\n第十三週：紐西蘭與臺灣科技教育之比較研究\n\n第十四週：加拿大與臺灣科技教育之比較研究\n\n第十五週：瑞典與臺灣科技教育之比較研究\n\n第十六週：期末報告發表",
    "methodologies": [
        {
            "type": "講述法",
            "note": "To explain the important concepts of each topic."
        },
        {
            "type": "討論法",
            "note": "Students must read the data, then have to publish their comment and discuss with teacher and classmates."
        },
        {
            "type": "問題解決教學",
            "note": "Students must conduct small studies and try to solve problems."
        },
        {
            "type": "合作學習",
            "note": "Students conduct a small research project through the team-based cooperative learning approach."
        },
        {
            "type": "媒體融入教學",
            "note": "To use network multimedia resources to improve students' learning outcome."
        },
        {
            "type": "專題研究",
            "note": "To improve students' understanding of the actual situation through knowledge sharing and case discussions."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "Students must read the data, then try to guild and discuss with teacher and classmates."
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "To discuss the topics of each week."
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "To assess students’ attendance and attitudes toward learning."
        },
        {
            "type": "報告",
            "weight": 50,
            "note": "(1) Journal paper (25%) Each student must write an article about technology and engineering teacher education. Then have to publish in international journals or seminars with censorship system before mid-term exam week. (2) Research Project (25%) Each student writes a research project of the Ministry of Science and Technology about technology and engineering teacher education. The project must be published during final exam week."
        }
    ],
    "prerequisite": "",
    "general_core": []
}