{
    "year": 110,
    "term": 1,
    "name": "高科技人力資源專題研究",
    "teachers": [
        "葉俶禎"
    ],
    "department": "IM86",
    "code": "IWM0058",
    "credit": 3,
    "serial": 1444,
    "group": "",
    "quota": {
        "limit": 36,
        "additional": 15
    },
    "schedule": [
        {
            "day": 2,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "人資所會議室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "整合人力資源相關知識應用於高科技產業人力資源議題研究與專案之開發。This course is designed to train students in research and project development related to human resource issues in hitech industries. Relevant HR problems, issues and research methods will be introduced and discussed. Students will then practice how to develop and complete a research project. This course will be taught using a combination of instructional methods including group discussions, student presentations, and independent study.",
    "goals": [
        "Describe current research that is being done in the field of human resource development and management in hi-tech industries.",
        "Explain the important issues and trends in managing and developing human resources in hi-tech companies",
        "Develop a research topic that pertains to current and important human resource problems in the hi-tech industries.",
        "Critically review extant literature related to the research topic.",
        "Carry out the appropriate research procedure to help solve human resource problems in the hi-tech industries."
    ],
    "syllabus": "Week 1  \nCourse introduction, syllabus review  \nWeek 2  \nThe nature of hi-tech companies  \nWeek 3- 5  \nHuman resource issues in hi-tech industries  \nWeek 6- 8  \nResearch issues in OB/HR in hi-tech industries  \nWeek 9-10  \nResearch methods to study OB/HR in hi-tech companies  \nWeek 11-12  \nQualitative analysis in OB/HR research  \nWeek 13-15  \nStatistical analysis in OB/HR research  \nWeek 16-18  \nReporting of HR research in hi-tech companies",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Important issues and trends in managing and developing human resources in hi-tech companies will be introduced"
        },
        {
            "type": "討論法",
            "note": "Students will discuss related issues and trends introduced by the instructor and research topics presented by fellow students"
        },
        {
            "type": "專題研究",
            "note": "Students will carry out a research project to study a current problem in human resources"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 15,
            "note": "Students are encouraged to actively participate in class discussions to enrich the learning."
        },
        {
            "type": "出席",
            "weight": 15,
            "note": "Attendance is required"
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "Students are required to introduce and present assigned readings in class."
        },
        {
            "type": "專題",
            "weight": 40,
            "note": "Students will carry out a research project to study a current problem in human resources. Students are required to present the project orally in class and submit the completed written research report at the end of semester."
        }
    ],
    "prerequisite": "",
    "general_core": []
}