{
    "year": 110,
    "term": 1,
    "name": "國際企業管理研究",
    "teachers": [
        "盧承杰"
    ],
    "department": "IM86",
    "code": "IWM0030",
    "credit": 3,
    "serial": 1436,
    "group": "",
    "quota": {
        "limit": 40,
        "additional": 2
    },
    "schedule": [
        {
            "day": 3,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "誠106"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "Learn the fundamental theories and practices of international business management",
        "Understand how culture and diversity influence international business management",
        "Understand the various issues, opportunities, and challenges of international business management in global environment",
        "Understand the importance of social and ethical responsibility of international businesses",
        "Understand strategic planning and implementation on human resource management for international businesses"
    ],
    "syllabus": "Week 1\n\nCourse Introduction, Syllabus Review\n\nWeek 2\n\nGlobalization and IM\n\nWeek 3\n\nNational differences and IM\n\nWeek 4\n\nInstitutional context of IM\n\nWeek 5\n\nEthical and social responsibility challenges\n\nWeek 6\n\nStrategic management content & formulation\n\nWeek 7\n\nMultinational and participation strategies\n\nWeek 8\n\nIM for small business and entrepreneurship\n\nWeek 9\n\nIHRD Conference\n\nWeek 10\n\nOrganizational design and strategic alliances of MNCs\n\nWeek 11\n\nTechnology, knowledge management and new business models for MNCs\n\nWeek 12\n\nInternational HRM\n\nWeek 13\n\nHRM and localization issues\n\nWeek 14\n\nMultinational Management Project Presentation\n\nWeek 15\n\nInternational negotiation and communication\n\nWeek 16\n\nMotivation in MNCs\n\nWeek 17\n\nLeadership and management in MNCs\n\nWeek 18\n\nFinal Exam",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "Text book, PowerPoint slides and video clips will be used to introduce the topics relevant to international business management"
        },
        {
            "type": "Group discussion",
            "note": "Students will be divided into groups. Each group will discuss assigned cases derived from textbook and present their answers to the whole class for class discussion."
        },
        {
            "type": "Cooperative learning",
            "note": "Students will collaborate on a group project to analyze the feasibility of an international business venture."
        },
        {
            "type": "Case studies",
            "note": "Students will complete a group project report to analyze the feasibility of an international business venture."
        }
    ],
    "grading": [
        {
            "type": "Final exam",
            "weight": 20,
            "note": "At the end of the semester, a final exam will be given to evaluate students’ comprehension of the course materials. The test format will include multiple choice and short essay questions."
        },
        {
            "type": "Class discussion involvement",
            "weight": 10,
            "note": "Students are expected to attend each class, prepare discussed readings and assignments and actively participate in class discussions."
        },
        {
            "type": "Attendances",
            "weight": 10,
            "note": "Class attendance is required. Please come to the class on time and notify the instructor ahead of time if you will be late or absent for a class."
        },
        {
            "type": "Presentation",
            "weight": 30,
            "note": "Case analysis report for integrating cases will be assigned as a group project. Each group will present an integrating case and their answers to case questions in class."
        },
        {
            "type": "Case study reports",
            "weight": 30,
            "note": "Students will complete a group project report to analyze the feasibility of a multinational venture project. The outcome of this project will be a comparative management paper, which thoroughly analyzes and discusses cultural, organizational, and management characteristics of another country. The paper must include a comparison of these characteristics to those of Taiwan. The grade for this project depends on the in class presentation and the written report."
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}