{
    "year": 109,
    "term": 2,
    "name": "地體動力學",
    "teachers": [
        "李通藝"
    ],
    "department": "SU44",
    "code": "ESC0023",
    "credit": 3,
    "serial": 2941,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 7,
            "to": 9,
            "campus": "公館",
            "classroom": "Ｃ401"
        }
    ],
    "programs": [],
    "comment": "中階以上課程，適合大三以上學生修習，以作為探究研究所之先修課程，同時也開放碩士班無此課程基礎之學生選修。",
    "restrict": "",
    "form_s": "",
    "classes": "9",
    "dept_group": "",
    "hours": 3,
    "description": "This course will present an introductory overview of plate tectonics and paleomagnetism.  It is meant for both geophysics and geology students (and anybody who wants to know a little bit more about how the earth dynamic system works).  The course stresses physical concepts and does not require an extensive background in mathematics.  The necessary math will be introduced in the lectures.  This semester the following topics will be covered:\n\n(a) The theory of plate tectonics and the observations, principally from the oceans, that are explained by the theory.\n(b) Paleomagnetism, magnetostratigraphy, reversals and sea floor magnetic anomalies.\n(c) Thermal models for the oceans and continents (also some interesting problems concerning the issue of \"global warming\" through heat flow measurement).\n(d) The application of these models to continental margins and sedimentary basin subsidence.\n(e) Current concept in the tectonic scenario of Taiwan.",
    "goals": [
        "This course will present an introductory overview of plate tectonics and paleomagnetism."
    ],
    "syllabus": "This course will present an introductory overview of plate tectonics and paleomagnetism.  It is meant for both geophysics and geology students (and anybody who wants to know a little bit more about how the earth dynamic system works).  The course stresses physical concepts and _does not_ require an extensive background in mathematics.  The necessary math will be introduced in the lectures.  This semester the following topics will be covered:\n\n   \nPart I:  \n(a) The **theory of plate tectonics** and the observations, principally from the oceans, that are explained by the theory.  \n(b) **Paleomagnetism**, magnetostratigraphy, reversals and sea floor magnetic anomalies.  \nPart II:  \n(c) **Thermal models** for the **oceans** and **continents** (also some interesting problems concerning the issue of \"**global warming**\" through heat flow measurement).  \nPart III:  \n(d) The application of these models to **continental margins** and **sedimentary basin subsidence**.  \nPart IV:  \n(e) Current concept in the **tectonic scenario of Taiwan**.",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Lecturing (most of the course)"
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "實地考察、參訪",
            "note": "One field trip"
        },
        {
            "type": "其他",
            "note": "Reading assignment: 5 papers cover: lava lake, Kelvin's estimation of Earth's age (2 papers), global warming, and plate tectonic theory"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 60,
            "note": "Three to four problem sets to be completed during the semester. (Students may discuss homework, but all homework should be prepared independently.) Late homework does not exist!!!"
        },
        {
            "type": "期中考",
            "weight": 30,
            "note": "One quiz"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}