{
    "year": 108,
    "term": 1,
    "name": "數位人文學",
    "teachers": [
        "邵軒磊"
    ],
    "department": "IU83",
    "code": "EAC9011",
    "credit": 3,
    "serial": 1459,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 2,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "1.文化與應用領域，大一與大二不可上修。    2.上課教室為校本部誠大樓9樓，或綜合大樓7樓。（請參考本系所網頁公告之課表）",
    "restrict": "◎限大三大四 ◎限碩一碩二碩三以上修習",
    "form_s": "",
    "classes": "9",
    "dept_group": "",
    "hours": 3,
    "description": "人文研究正面臨典範轉型的過程。數位科技與資訊革命帶給人文學科巨大的衝擊，一方面是傳統的研究方法、工具有其侷限性，致使研究發問受到影響，一方面則是日常生活、行為模式、社會文化正因為數位科技的普及而發生改變。\n    數位人文學之目的在於利用數位科技與數位內容進行人文研究，以及探索數位科技的社會衝擊與因應之道。數位人文學源自於各種人文學科的資料計算（humanities computing），並廣泛地運用新科技，整合了傳統人文學與社會科學的方法論；同時，結合電腦運算所提供的工具，如數位媒體、資料視覺化、資訊檢索、統計學、文本探勘、數位製圖與數位出版等，成為理解社會文化現象的一種路徑。但必須說明的是，數位人文學仍為一個動態的、發展中的學科，隨著新技術的出現而更迭其發展模式。\n    因此，從資料的收集、分析到呈現，數位文獻與電腦網路的應用已是不可或缺的一環。數位技術的應用，能夠更有效率地收集與整合研究材料；用新的方法切入既有的研究問題、發現新的現象、開展新的研究方向；或是促進跨領域研究、同儕交流、以及研究成果的呈現與擴散。因此，以「運用資訊科技提昇人文研究」為核心關懷的「數位人文學」日趨重要，如何更有系統、更有效率地運用數位技術於人文研究領域，並評估其衝擊與影響，需要人文學者積極地探索與回應。本課程引介數位人文學的發展現況，並說明其方法及運用的可能性。",
    "goals": [
        "通過新工具、新科技認識人文研究的新可能性。",
        "整合性、前瞻性的研究能力之培養"
    ],
    "syllabus": "本課程將搭配期末成果發表會（暫定12月初），因此，請修課同學必須有心理準備安排時間參與。本課程並不廣泛的通論每一種數位人文方法，或簡介其他數位人文學發展概況，或對「數位人文學」提出觀點。而專注於使大碩同學有能力從一定的資料基礎上，「完整」操作一個專案，因此，需要投入相當的自學時間與自己解決問題。課程關鍵字為「R語言、決策樹、文字探勘、文本分類」。\n\n使用各種數位工具對人文經典或現今社會現象做研究，將幫助於研究者能理解大量典籍之意義，並為未來更進一步之深入理解打下基礎。因此本課程將教導修課學員使用決策樹分析法（decision tree），對已有或特定未領域之文獻做出分析。本課程將直接使用數位工具，將作為補充教學時使用R語言，但同學亦可使用自身熟悉之程式語言。課程要求方面，使用「問題解決教學」（Problem-Solving Teaching）、做中學（doing by learning）鼓勵學員就既有熟悉資料以數位方式做出輔助分析，再配合自身專業學養做出解釋。",
    "methodologies": [
        {
            "type": "講述法",
            "note": "由授課教師依照課本，對課程相關內容做出講述。"
        },
        {
            "type": "討論法",
            "note": "在講述的同時，要求學生發表感想、就相關議題辯論討論、提出挑戰，用以調和上課氣氛，集中注意力。"
        },
        {
            "type": "問題解決教學",
            "note": "在講述過程中，穿插影片與使用線上教學群組，用以強化學生記憶與回答學生問題。"
        },
        {
            "type": "實驗/實作",
            "note": "上課中將使用實機（公用電腦或學員自身筆電）具體實做"
        },
        {
            "type": "媒體融入教學",
            "note": "使用軟體與媒體輔助教學。"
        },
        {
            "type": "專題研究",
            "note": "製作專題"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": "課程隨堂小考"
        },
        {
            "type": "成果展覽",
            "weight": 50,
            "note": "成果展覽（預定為12月初）。"
        },
        {
            "type": "其他",
            "weight": 20,
            "note": "教師綜合評量學員表現。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}