{
    "year": 108,
    "term": 1,
    "name": "東亞政經模擬理論",
    "teachers": [
        "邵軒磊"
    ],
    "department": "IU83",
    "code": "EAU0213",
    "credit": 3,
    "serial": 1488,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "樸402"
        }
    ],
    "programs": [],
    "comment": "政經與區域發展領域，大一不可上修。",
    "restrict": "◎限大二大三大四修習",
    "form_s": "3",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "本課程試圖使用「總整式課程」(capstone course)觀念，切合東亞系所學之「政治學」、「中國大陸政治與經濟」、「經濟學」等課程，訓練同學之國際關係、政治學、亞太政經等知識要素，用以設計各種模擬情境，融會成為一門「整合式/混成學習」課程，讓同學應用所學知識，互相討論，解答問題。並切合決策理論。讓教師有機會評估學生整體的學習成果，提出對學習總體檢的總結性評量(summative evaluation)。\n課程要求即將畢業的學生，在最後的一、兩學期修習該門課程，整合過去所有的學習經驗，以確保系所及教師設定的教育目標能夠達成。優點有：一、讓畢業生回首過去在大學期間學到了什麼；二、前瞻未來對就業的準備；三、學校亦能回顧投入資源之成效。\n本課程較為靜態，以閱讀文獻與思辯為主，主要核心為總整式教育賽局理論、決策理論與東亞總體戰略思考。修習本課程後，鼓勵結合「東亞戰略模擬實務」用以實務演練。",
    "goals": [
        "使學員能結合以前所學，用以瞭解東亞各區域的地緣政治重要性。",
        "學員需要綜合以往學習經驗來，綜合跨領域跨文化知識。",
        "學員必須學習團隊溝通。",
        "在學習之後，能更有參與公共事務能力。"
    ],
    "syllabus": "_（給108-1修課同學的須知：本學期使用2019/10/6與11/2將進行政經模擬實務操作，學員將有義務參與。）_\n\n本課程基於學員專業基礎（國際觀/社會科學）上，強調結合實做，引進「總整式課程」觀念，並以近年新穎之混成學習法（包括翻轉教室、數位學習），用以讓學生學以致用，提高興趣。學員需統合所學課程及學習經驗，表現學生整體的學習成果。準此，本計畫之中長程目標為結合東亞系之課程，談判模擬、國際關係、政治學、亞太政經等知識要素，以各種模擬情境，融會成為一門「整合式/混成學習」課程，讓同學應用所學知識，互相討論，解答問題，因此開設此一課程。本課試圖提出「模擬」情境，配合東亞學系核心關懷，請參與學員扮演國家決策者，因應當時的情境，與其餘國家合作或對抗，同時做出外交與軍事的指令與對應。模擬教學法通常是要再現模仿體系各要素和變量之間的互相作用的過程。是動態的，注重的是變化、發展或過程。因此，本課程以「實做與扮演方式進行」，結合東亞歷史地理方式，以某種真正互動的方式實踐，更能在做中學習。",
    "methodologies": [
        {
            "type": "講述法",
            "note": "以教授講述課程相關理論、觀念與技巧為主。"
        },
        {
            "type": "討論法",
            "note": "講述之餘，讓同學討論，能更激勵腦力激盪。"
        },
        {
            "type": "實驗/實作",
            "note": "本課程\\設計課堂成員扮演國家，彼此談判互動，可以相當程度達到國際關係/政治學的實驗可能。其次，本計畫開設於東亞學系，使本系學生能所學結合東亞歷史地理方式，以某種真正互動的方式實踐，更能在做中學習。"
        },
        {
            "type": "媒體融入教學",
            "note": "本課程將科技融入教學，使同學學習有效率。最後，課程的目標是以「實踐方式」，將知識融入真正實踐當中，寓教於樂，能夠成為學生之長期記憶。"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 50,
            "note": "模擬"
        },
        {
            "type": "報告",
            "weight": 50,
            "note": "數次報告"
        }
    ],
    "prerequisite": "",
    "general_core": []
}