{
    "year": 111,
    "term": 1,
    "name": "社會資源開發與利用",
    "teachers": [
        "巫彥德"
    ],
    "department": "EU02",
    "code": "SOU0059",
    "credit": 2,
    "serial": 731,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "教103"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限本系(含雙主修)修習",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "當下我們所面對的「變遷」是自過去大力鼓吹消費成長的社會轉變至發展成熟的、負成長的、邁向可持續性的未來社會。上一個世代，透過追求以土地消耗、快速生產的方式，催化成為扮演經濟發展龍頭的使命，如此一來，人類在其中扮演的角色便像是機械生產下的螺絲釘，對於宏觀的世界、鉅型結構的社會可能的改變，毫無緣份置喙。1980年代起，台灣社會興起各式社會抗爭型的運動，由下而上的社會改變力量在諸多領域的實踐案例中，看到了不一樣的發展可能。過往國家治理與社會的改變，整體思維多以仰賴西方國家、單靠大政府、專家和大型企業主導；如今，必須每個市民主動肩負責任，透過日常生活各界合作來實現。\n\n變遷社會下重要的關鍵在於處理奇特問題。所謂奇特問題（Wicked Problems）意旨這樣的問題具複雜性，改變一處，其他環節也會隨即變化，無法以直線思考的方式解決。身處充滿變遷的時代，目標集結起更多人的力量，更進一步朝可持續的未來發展，是建構具有承擔變遷環境與社會風險能力的不二法門。可持續性涉及社會、經濟、政治、自然環境等不同面向課題，這些課題環環相扣，也因此考驗著我們，積極建立指認社會整體問題的能力，把握既有的可被運用或連結的資源（物資、人際網絡、知識、資訊或設計企劃等能力），在一定給定的時間節奏條件下，去促進把生活品質變得更好的機會。透過這樣的過程達到更可持續的未來。\n\n為了讓同學們對人類社會文化與經濟發展進程中，勞動分工、結社合作、資源掠奪與價值對立關係產生可能原因有更清楚的瞭解，進而構思出能引發社會大眾或不同部門資源分享、創新行動，共同面對生活中複雜問題的各類資源開發與利用機制。本課程將從介紹變遷社會下的挑戰，並探究各類社會資源的內涵、屬性、運作模式。之後，再透過教師講授實際的社會資源開發與利用的專案計畫脈絡、利用方式，提供同學們理解不同具體情境可以爬梳的行動思路。此外，搭配兩堂跨領域的專題演講介紹資源開發案例，提供同學們跨域思考的範疇；輔佐實地參訪等多元教與學的方式，反思國內外各種社會資源開發與利用策略的優缺點，期能增添同學們未來從事成人教育、終身學習、社會文化方案時所需之專業素養。本課堂要求針對具有觀點的社會課題，進行社會資源開發與利用的提案演練，此為期中、期末報告的檢視點。至於本課程對應本系之核心能力，包含成人創新學習規劃能力，以及社會文化事業推展能力。",
    "goals": [
        "分析社會資源的相關理論，讓學生瞭解社會資源的結構。",
        "探討社會資源的現況與類型，使學生瞭解社會資源的價值。",
        "介紹與參訪社會資源，透過個案瞭解社會資源的可用性。"
    ],
    "syllabus": "",
    "methodologies": [
        {
            "type": "",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "",
            "weight": null,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}