{
    "year": 111,
    "term": 1,
    "name": "都市地理",
    "teachers": [
        "莫家俊"
    ],
    "department": "LU23",
    "code": "GEU0057",
    "credit": 3,
    "serial": 1956,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 5
    },
    "schedule": [
        {
            "day": 1,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "正205"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "2",
    "classes": "2",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "To be familiar with the  theories and concepts of urban geography.",
        "To apply and comprehend approaches in urban geography to real-life examples.",
        "To critically analyze topics related to urban geography using concepts and methods from the course, and be able to articulate this in the form of a presentation and report."
    ],
    "syllabus": "【授課方式：16+2週】\n\nHuman civilization is increasingly becoming urban. Currently, a majority of the world’s population is living in urban areas. This trend will continue to increase. Urbanization and urban growth bring a lot of benefits. People living in urban areas generally have a higher quality of life and access to various opportunities to better their lives. However, urbanization also brings a lot of challenges: overcrowding, uncontrollable growth, socio-economic inequalities, pollution, and land issues.\n\nThis course is an introduction to the discipline of urban geography. This course is divided into four parts: The first part deals with key theories and approaches to urban geography. We learn how we define urban areas, and some of the key aspects related to cities, such as centrality, mobility and location. The second part of the course deals with themes in urban geography, such as urban politics, economies, planning and policy, and culture and architecture. The third part of the course concerns various topics related to cities, such as housing and segregation, gentrification, transportation, urban ecosystem services, and sustainability. The fourth part of the course will be a field-trip to an urban area in Taipei. This field trip is important as it highlights real-life examples from the course.\n\nAt the end of the course, you will be able to understand the fundamentals and basics of urban geography, and you will have knowledge on the various sub-themes and topics related to urban geography. Urban geography is a very important discipline in field of geography. Therefore, we will make use of a lot of case studies, in-class media, and discussions. We will look at examples both in Taiwan as well as in other parts of the world, including Asia, Europe and Northern America.\n\n**教學進度與主題**（可說明每週進度）**Schedule** 【授課方式：16+2週】\n\n第1週：Introduction to the course\n\n第2週：Fundamentals of urban geography: What are cities?\n\n第3週：Theories and approaches in urban geography I: How do cities function?\n\n第4週：Theories and approaches in urban geography II: Urban form and structure\n\n第5週：City economies\n\n第6週：Urban planning and policy\n\n第7週：World cities and globalization\n\n第8週：Urban tourism and culture\n\n第9週：Urban politics\n\n第10週：Preparation week and mock presentations\n\n第11週：Fieldtrip to Shezidao (社子島), Taipei City or another urban area (TBC)\n\n第12週：Images of the city & Experiencing the city\n\n第13週：Housing and residential segregation\n\n第14週：Transport, mobility and the city\n\n第15週：Ecosystem services and the city + Urban futures and sustainability\n\n第16週：Final Exam\n\n第17週：Flexible schedule + time for feedback\n\n第18週：Flexible schedule + time for feedback",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "Each week we will have a lecture of 90 minutes. In the lecture we will also discuss the readings for each week."
        },
        {
            "type": "Group discussion",
            "note": "Each week we will have a tutorial for 90 minutes. In this tutorial we will either have a group discussion, class activity, or student presentations."
        },
        {
            "type": "Field work",
            "note": "This course plans to have a field trip to Shezidao (社子島), Taipei or any other urban area in Taipei (date time, and location to be confirmed)"
        },
        {
            "type": "Media, audio, visual materials",
            "note": "Throughout the lectures, group discussions and field trip, we make use of various multi-media and visual materials."
        },
        {
            "type": "Case studies",
            "note": "Throughout the lectures, group discussions and field trip, we will make use of various real-life examples."
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 25,
            "note": "Fieldtrip report. This report will be written as a group and can be completed during our fieldtrip."
        },
        {
            "type": "Final exam",
            "weight": 40,
            "note": "Final exam counts covers all the required readings, lectures and group activities."
        },
        {
            "type": "Attendances",
            "weight": 10,
            "note": "Attendance is compulsory, unless you have a valid reason not to come."
        },
        {
            "type": "Presentation",
            "weight": 25,
            "note": "Students will be divided in groups to present on a world city of choice."
        }
    ],
    "prerequisite": "",
    "general_core": []
}