{
    "year": 110,
    "term": 2,
    "name": "體育師資培育研究",
    "teachers": [
        "掌慶維"
    ],
    "department": "AM30",
    "code": "PEM0108",
    "credit": 3,
    "serial": 16,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "體001"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "To analyze the challenges and relevant issues in terms of PETE with a wide range of knowledge",
        "To understand the policy and systems in PETE",
        "To know the trends and research directions in PETE"
    ],
    "syllabus": "**Course Description**  \nThe quality of physical education teacher education (PETE) is critical to the quality of students' learning in physical education. The implementation of physical education curriculum changes and transformative teaching rely on the quality of PETE as well. Therefore, PETE plays a key role among the aspects of learning, curriculum and teaching in physical education. This course provides a comprehensive overview of the research on PETE for students who are interested in pursuing the relevant studies.  \n  \n**Course Objectives**\n\nAfter taking this course, I will be able to:\n\n1.analyze the challenges and relevant issues in terms of PETE with a wide range of knowledge\n\n2.understand the policy and systems in PETE\n\n3.know the trends and research directions in PETE  \n  \n**Course Outline**\n\n1\\. Course Introduction: Studies in physical education teacher education (PETE)\n\n2\\. The framework of research on PETE and relevant issues\n\n3\\. Five trends in physical education teacher education\n\n4\\. The challenges of initial physical education teacher education (PETE) (1)\n\n5\\. The challenges of initial physical education teacher education (PETE) (2)\n\n6\\. The challenges of initial physical education teacher education (PETE) (2)\n\n7\\. The challenges of initial physical education teacher education (PETE) (3)\n\n8\\. The challenges of initial physical education teacher education (PETE) (3)\n\n9\\. Effective mentoring: Critical to the professional development of first year physical educators\n\n10\\. Helping pre-service and beginning teachers examine and reframe assumptions about themselves as teachers and change agents\n\n11\\. Transformative aspirations and realities in physical education teacher education (PETE)(1)\n\n12\\. Transformative aspirations and realities in physical education teacher education (PETE)(2)\n\n13\\. Effective continuing professional development for physical education teachers\n\n14.The alignment and coherence challenge: Developing university‒school partnerships\n\n15\\. Term paper / oral presentation(1)\n\n16\\. Term paper /oral presentation(2)\n\n+\n\n17\\. Field study\n\n18\\. Field study",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "To know the main challenges and context of PETE"
        },
        {
            "type": "Group discussion",
            "note": "To understand the problematics and strategies for improving the quality of PETE"
        },
        {
            "type": "Cooperative learning",
            "note": "To read selected papers in the reference"
        },
        {
            "type": "Field work",
            "note": "To conduct interviews with PE teacher educators, pre-service PE teaches, PE teachers"
        },
        {
            "type": "Case studies",
            "note": "To select elective PETE topics for writing term paper"
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 40,
            "note": "selected reference papers reading"
        },
        {
            "type": "Class discussion involvement",
            "weight": 20,
            "note": "selected reference papers discussion in class"
        },
        {
            "type": "Attendances",
            "weight": 20,
            "note": "class attendance"
        },
        {
            "type": "Presentation",
            "weight": 20,
            "note": "term paper"
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}