{
    "year": 110,
    "term": 2,
    "name": "書報討論（二）",
    "teachers": [
        "簡敦誠"
    ],
    "department": "SM42",
    "code": "CMM0002",
    "credit": 2,
    "serial": 2631,
    "group": "A",
    "quota": {
        "limit": 40,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 3,
            "to": 4,
            "campus": "公館",
            "classroom": "Ｓ401"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "允許重複修 ◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "1.To train stusents with the skills in presentation. 2.To help students understand the methodology and presentation presented by the authors in the most rently reserach papers. 3.To train students how to evaluate and appreciate the research papers. 4. To train students to do the effective oral presentation in the public.",
    "goals": [
        "To train students with the skills in presentation.",
        "To help students understand the methodology and presentation presented by the authors in the most rently reserach papers",
        "To train students how to evaluate and appreciate the research papers.",
        "To train students to do the effective oral presentation in the public."
    ],
    "syllabus": "Objective:\n\nGraduate students must become familiar with the skills of seminar preparation and presentation. These skills will help the student learn how to organize scientific data for effective public presentation.\n\nPreparation:\n\nAll students in this section will be scheduled to present one seminar in the semester. The seminar topic will be selected by the student with the approval by the section supervisor 2 weeks before the presentation.\n\nPresentation:\n\nThe speaker is responsible for reserving, securing, and setting up the computer/projection system to operate properly. The presentation should be 30-35 minutes in length, with 10-15 minutes left at the end for questions and discussion.\n\nAttendance & Class Participation:\n\nUnexcused absences will lead to a reduction of your final grade by 10 points.\n\nSeminar Topics:\n\nSeminar topics must meet the following criteria:\n\nThe seminar topics have to be the original research work published in the year. The seminar topic must be related to the natural product total synthesis from the following journals:\n\n1\\. Science (Multidisciplinary)  \n2\\. Nature (Multidisciplinary)  \n3\\. J. Am. Chem. Soc. (Multidisciplinary)  \n4\\. Angew. Chem. Int. Ed. (Multidisciplinary)  \n5\\. Proc. Natl. Acad. Sci. U. S. A. (Multidisciplinary)",
    "methodologies": [
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 5,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 85,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}