{
    "year": 110,
    "term": 1,
    "name": "英美文學史選讀",
    "teachers": [
        "貝格泰"
    ],
    "department": "LM21",
    "code": "ENC1117",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 1654,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 8,
            "to": 10,
            "campus": "本部",
            "classroom": "雲202"
        }
    ],
    "programs": [],
    "comment": "教室位於雲和街大樓2樓（地址：雲和街1號），外系及外校學生需申請門禁權限。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "The course is designed to meet all of the Department’s core goals, in deepening the student’s knowledge in the field of literature in English, and in giving opportunities to students to communicate effectively in English as colleagues and researchers.",
        "This course aims to offer students exposure to multiple perspectives on history from an international viewpoint, and to develop critical thinking skills through reading, analysis and discussion. international concept, can integrate."
    ],
    "syllabus": "Readings in British and American Literary History (ENC1117)  \n英美文學史選讀  \nEmail: hannes.bergthaller@gmail.com  \nHours per week: 3  \nCredits: 3\n\n  \nAims and methods  \nThis course is offered as a complement to the Theory/Cultural Studies course now required of incoming graduate students in Literature, and is intended as a review of English, British, and American literary history for graduate students. The course emphasizes the value of analyzing works of literature as the products of specific cultures in the past. This review is intended to serve as a foundation for future decisions about which aspect/era/genre/specialty students will focus on in their graduate work. The syllabus and readings will be determined by the individual instructor, and may include guest lecturers on each period; the readings will include highlights of English, British, and American literature and cover a range of periods and genres, from medieval times to modern, with an overview of pre-nineteenth-century periods and greater emphasis on the nineteenth century and after. As a complete survey of English and American literature in one semester is impractical, the course aims to introduce students to texts that highlight the most compelling issues of each period. Furthermore, so as to stimulate students into finding innovative topics and approaches in their own research, this course draws attention to recent historicist scholarship and, more specifically, scholarship emphasizing the ways in which the literature of the past has been mediated by or in some sense revisited in later periods. Thematic cohesion is also provided by the attention given throughout the course to changing representations of gender, sexuality, death, race, and the idea of a national literature.  \n\n     \nTexts  \nStudents will find many of the primary texts studied in this course in the Norton anthologies of English and American literature, but in many cases these texts can also be found online. When that is not the case copies will be provided by the instructor. Secondary texts will be provided by the instructor in PDF form and must be brought to class by each student.\n\nGrading   \nPresentation (30%). Each student will give one (Powerpoint) presentation introducing a specified text in a historical context. The talk should last between 15 and 17 mins. The topics for presentations will be provided in class.  \nEssay (70%). The essay will discuss works by two of the authors studied on this course. These works by different authors should be related to each other through their respective cultural and/or political contexts. Length of written essays: c. 3000 words. (See attached page.)\n\nTypical lesson structure  \n•    Student presentation introducing a primary text in a historical context  \n•    Instructor leads class in discussion of primary text, providing additional historical and literary context along the way  \n•    Instructor leads class in discussion of historicist secondary text(s) \n\nSchedule  \n1.    Introduction   \n2.    What is Literary History? Stephen Greenblatt, “What is Literary History?”   \n3.    Late Medieval Literature: Geoffrey Chaucer, “The Wife of Bath’s Tale” (ca. 1400)  \n4.    Elizabethan Literature: William Shakespeare, selections from Sonnets (1609)  \n5.    Augustan Literature: Alexander Pope, An Essay on Man (1734)  \n6.    Romanticism I: William Wordsworth and Samuel Taylor Coleridge, “Preface” to Lyrical Ballads (1801); “Tintern Abbey” (1798)  \n7.    American Renaissance: Ralph Waldo Emerson, “The Poet” (1844)  \n8.    American Renaissance: Walt Whitman, selections from Leaves of Grass (1855)  \n9.    American Renaissance: Walt Whitman, Democratic Vistas (1871)  \n10.    Romanticism II: Walter Scott: “Wandering Willie’s Tale” (1824)  \n11.    Victorian Literature: selections from The Pickwick Papers (1836)  \n12.    Realism: Henry James, “The Altar of the Dead” (1895)  \n13.    Modernism I: Virginia Woolf, “Kew Gardens” (1919)  \n14.    Modernism II: Gertrude Stein, selections from Tender Buttons (1914)  \n15.    Post-war Fiction: James Baldwin, “Previous Condition” (1948); “Everybody’s Protest Novel” (1955)  \n16.    Postmodernism: Octavia Butler, “Blood Child” (1995)  \n17.    Consolidation  \n18.    Self-supported study (FINAL essay due date TBA)\n\nSecondary readings for most sessions will be announced at the start of the semester.",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": ""
        },
        {
            "type": "Group discussion",
            "note": ""
        },
        {
            "type": "Cooperative learning",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "Presentation",
            "weight": 30,
            "note": "Each student will give one (Powerpoint) presentation introducing a specified text in its historical context. The talk should last between 15 and 17 mins. The topics for presentations will be provided in class."
        },
        {
            "type": "Case study reports",
            "weight": 70,
            "note": "The essay will discuss at least one of the authors studied in this course. Length of written essays: ca. 3000 words."
        }
    ],
    "prerequisite": "◎Unavailable for M.A. program students (M.A. program courses excepted) and B.A. program students.",
    "general_core": []
}