{
    "year": 110,
    "term": 1,
    "name": "臺灣研究",
    "teachers": [
        "林芳玫"
    ],
    "department": "LM26",
    "code": "TCC0010",
    "type": "必",
    "grade": null,
    "credit": 3,
    "serial": 1724,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "雲306會議室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "本課程討論台灣的文化、文學、語言發展，並將關切主題置於不同歷史時期的社會與政治脈絡。本課程介紹從事台灣研究所需的跨領域方法，並提供各種理論視野。本課程視台灣的文化、文學、語言發展為不同之論述形構的交織而非固定的本質。學生在此門課必須熟悉台灣研究的重要議題以及如何選取適當的研究方法來處理這些議題",
    "goals": [
        "*以跨國的比較方法認識台灣的文化、文學、語言。*了解國際學者對台灣的研究狀況。* 以殖民及移民的觀點認識人口流動所帶來的文化、文學、語言變遷。",
        "運用中文與英文數位資料庫查詢資料並加以應用，撰寫成研究報告",
        "* 了解台灣性別、族群、階級、語言、文化之多元面向。* 反思漢人中心主義，探討原住民歷史對了解台灣史的關鍵性。"
    ],
    "syllabus": "**Taiwan Studies**\n\n（2021 Fall）\n\nFang-mei Lin, professor, Department of TCLL\n\nfmlin@ntnu.edu.tw\n\n Course Description: This course will introduce students to various aspects of Taiwan, including history, culture, society, gender and ethnic relations, and the formation and development of Taiwan nationalism and national identity. We will use a comparative method to look at Taiwan in terms of its role in transnational and transcultural interactions. This course will see each topic as in a dynamic process of formation, development and transformation. By the end of the semester, students are expected to learn the important issues in Taiwan and how these issues have emerged under specific social and historical contexts.\n\n Time: Thu 14:20-15:20\n\n Room: YunHe Building Room 306\n\nKey words and core issues:\n\n1.  Chinese nationalism vs. Taiwanese nationalism\n\nSino-centrism vs. Taiwanese consciousness\n\n1.  Serial colonialisms and settler colonialism\n2.  Authoritarian rules in Taiwan: 228 incident, White Terror, Martial laws\n3.  ROC constitution: Chinese mainland and other parts are the legitimate territories of ROC\n4.  Constitutional revisions in the 1990s: direct election for the president; the rights of indigenous people; promotion of cultural pluralism\n5.  Social movements： indigenous people, women’s rights, same-sex marriage\n6.  Cross-strait relations: unification, status quo, independence\n\nWeek\n\nDate\n\nWeekly Themes\n\nNotes\n\n**1**\n\n**9/23**\n\n  **Introduction**\n\n**2**\n\n**9/30**\n\n**Millennial Generation**\n\n*   Brading, Ryan, “Taiwan’s Millennial Generation: Interests in Polity and Party Politics”, _Journal of Current Chinese Affairs_ 46.1.\n\nUnderstand two issues: sunflower movement and rights to same sex marriage\n\n**3**\n\n**10/7**\n\n**Democracy and National Identity**\n\n*   Muyard, Frank, “The Role of Democracy in the Rise of the Taiwanese National Identity”, Sullivan, Jonathan and Lee, Chun-Yi eds., _A New Era in Democratic Taiwan_ (London: Routledge, 2018)\n\nUnderstand two issues: the relationship between democracy and national identity, and longterm opinion pulls regarding decreasing Chinese identity and increasing Taiwanese identity\n\n**4**\n\n**10/14**\n\n**Nationalism in Comparative Perspectives**\n\n*   Wang, Horng-luen, “Exploring the Structures of Feeling in East Asia: Taiwanese Nationalism in a Comparative Perspective” The 1st World Congress Of Taiwan Studies, April 26-28, 2012. Academia Sinica, Taipei, Taiwan.\n\nPlease pay attention to the role of sadness in constructing nationalism. We will compare Taiwan, Chine and Japan.\n\n**5**\n\n**10/21**\n\n**The Emergence of Taiwan Consciousness_: Orphan of Asia_**\n\n*   Wu, Zhuoliu, _Orphan of Asia_ (New York: Columbia University Press, 2008)\n*   Lin, Fang-mei, “The Fantasy of Love and Crisis of Identity: (De)Colonizing Desire and Nationality”\n\nPlease understand the relationship between gender and national identity. In what ways national consciousness arises not in public sphere but on the contrary in private sphere, when romantic desire plays a role in stimulating personal consciousness.\n\n**6**\n\n**10/28**\n\n  **National Opera**\n\n*   Chang, Bi-yu, “What’s in a Name? The Nationalisation of Traditional Opera in Taiwan”, _Studies in Ethnicity and Nationalism_ 6.2.\n*   Takenori Nogami, “Ceramic Trade Network around Taiwan Straits and the Galleon Trade.” The 1st World Congress Of Taiwan Studies, April 26-28, 2012. Academia Sinica, Taipei, Taiwan. (optional, not required)\n\nIn your own country, do you have national opera, national theater, national language, national history museum, and other things that are entitled “national.”\n\nWhat are the pros and cons of the deep involvement of the state in cultural and educational matters?\n\n**7**\n\n**11/4**\n\n  **Transnational Culture and Nativism**\n\n*   Taylor, Jeremy, “From Transnationalism to Nativism: The Rise, Decline and Reinvention of a Regional Hokkien Entertainment Industry”, _ARI Working Paper_ 81.\n*   Chang, Huei-Yuan Belinda, “A Theatre of Taiwaneseness: Politics, Ideologies, and Gezaixi”, _TDR_ 41.2. (optional, not required)\n\nPlease find a map of south-east Asia. What are these countries? Since when and by what ways Chinese immigrated to these countries and still kept their original language—some sort of dialect such as Fu-kian.\n\n**8**\n\n**11/11**\n\n**Visiting Museums**\n\n*   陽明山中山樓 Yangmingshan ChungShan Hall\n\n**9**\n\n**11/18**\n\n**Mid-term Exam**\n\n**10**\n\n**11/25**\n\n**Ethnic Relations in Taiwan**\n\n*   Wang, Fu-chang, “Ethnic Politics and Democratic Transition in Taiwan.”, _Oriental Institute Journal_ 22.2.\n\n**11**\n\n**12/2**\n\n**Indigenous Movement**\n\n*   Ku, Kun-hui, “Rights to Recognition: Minority/Indigenous Politics in the Emerging Taiwanese Nationalism”, _Social Analysis_ 49.2.\n\n**12**\n\n**12/9**\n\n  **Film: _1895_**\n\n**13**\n\n**12/16**\n\n**Ethnic Representation and National Imagination**\n\n*   Lin, Fang-mei, “Two Historical Discourse Paradigms: Han People’s Resistance against Japan and Indigenous People’s Collaboration with Japan”, Shih, Shu-mei and Tsai, Lin-chin eds., _Indigenous Knowledge, Taiwan and Beyond_ (Singapore: Springer, 2021)\n\n**14**\n\n**12/23**\n\n  **Diaspora Studies**\n\n*   Han, Enze, “Bifurcated Homeland and Diaspora Politics in China and Taiwan Towards the Overseas Chinese in Southeast Asia”, _Journal of Ethnic and Migration Studies_ 2017\n\n**15**\n\n**12/30**\n\n  **Sinophone Studies**\n\n*   Shih, Shu-mei, “Against Diaspora: The Sinophone as Places of Cultural Production”, Shih, Shu-mei, Bernards, Brian and Tsai, Chein-Hsin eds., _Sinophone Studies: A Critical Reader_. (New York: Columbia University Press, 2013)\n*   Shih, Shu-mei, “The Concept of Sinophone”, _PMLA_ 126.3\n*   Lee, Xian Jie, “War of Words: Mandarin and Chineseness in Taiwan and Singapore” (optiional, not required)\n\n**16**\n\n**1/6**\n\n**Colonialism and Nationalism**\n\n*   Dirlik, Arif, “Taiwan: The Land Colonialisms Made”, _Boundary2_ 45.3.\n*   Dirlik, Arif, “Rethinking Colonialism: Globalization, Postcolonialism, And the Nation”, _Interventions_ 4.3. (optional, not required)\n\n**17**\n\n**1/13**\n\n**18**\n\n**1/20**\n\n  **Term paper presentation**",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Lecture"
        },
        {
            "type": "討論法",
            "note": "Seminar"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "reading notes for every week, please write 300 words in Chinese or 300 words in English."
        },
        {
            "type": "期中考",
            "weight": 30,
            "note": "open-book exam or take-home exam"
        },
        {
            "type": "期末考",
            "weight": 30,
            "note": "term paper written in Chinese or English, 2000 words."
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "attending classes and joining discussions"
        }
    ],
    "prerequisite": "",
    "general_core": []
}