{
    "year": 110,
    "term": 1,
    "name": "臺灣二十世紀歷史學研究中的個人文獻",
    "teachers": [
        "賀安娟"
    ],
    "department": "LM26",
    "code": "TCC1016",
    "credit": 3,
    "serial": 1726,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "雲306會議室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "認識台灣歷史學",
        "認識在台灣歷史中如何應用個人文獻",
        "認知台灣歷史學的趨勢與走向",
        "了解臺灣歷史文獻中的個人經驗"
    ],
    "syllabus": " 臺灣二十世紀歷史學研究中的個人文獻\n\nPersonal Documents as Source for 20th Century Taiwan Historiography\n\nThis course will introduce a variety of personal or ego-documents such as memoirs, biographies, autobiographies, diaries, as well as recollections of oral histories, written and/ or compiled, edited, published and unpublished works. The majority of these materials will be written in Chinese, however, the secondary research articles and theoretical grounding of the course will be provided and conducted in the English language. C.W. Watson _Of Self and Nation_ (1999) will serve as the basic work, and taken as an illustration in reading Taiwanese memoirs. For students whose Chinese language ability is limited, text materials of personal documents in more suitable languages (Japanese, English etc) will be recommended.\n\nOptional 1: This course will be complemented with practical lectures on the introduction of digital humanities (electronic text analysis) as a tool for searching personal documents (corpus linguistics or ctext).\n\nOptional 2: This course will be complemented with practical lectures on oral interview and discourse analysis.\n\nTeaching method:\n\n1.  Overview in English of Taiwan-based research on memoirs and diary studies. This will help students select a memoir or diary and provide the societal and academic background.\n2.  Discussion of _Of Self and Nation_ (1999) individual chapters as illustrations how to read a Taiwanese memoir.\n3.  Introductory materials on digital humanities method, discourse analysis or oral interview method.\n\n**週****1**  9月 24日 Introduction ONLINE\n\nHand out of the syllabus and explanation of the course & endterm paper\n\n**週****2**  10月 1日  Documentary The Lost Youth: Women and Industrial Work in Taiwan    ONLINE\n\n1.  Students watch the documentary online (66min) (uploaded via moodle or google drive)\n\nAssignment: prepare a 1 page discussion of the content in which you address some of the themes that drew your attention.\n\n1.  Select one of the chapters read by Hill Gates on Chinese working women (approx. 30 min). The text is also provided.\n\nAssignment: Write a brief commentary how this chapter resonates with the documentary (300 words)       \n\nNote: We will come back to the documentary & audio-reading and the topic of working women in present day Taiwan as ethnographic study later on (Week 7).    \n\n**Additional readings:**\n\nHu, Tai-li (1984). “Marriage and Women’s Status.” In Tai-li Hu _My mother-in-law’s village. Rural industrialization and change in Taiwan_ (pp. 121-160). Nankang: Academia Sinica.\n\nKung, Lydia (1983/1978). “The Decision to Work: Where and Why” (pp. 51-68) & “Self-Perceptions: ‘A Frog in a Well’” (pp. 153-170). In Lydia Kung _Factory Women in Taiwan_. Ann Arbor, Michigan: UMI Research Press.\n\nKung, Lydia (1981) \"Perceptions of Work among Factory Women.\" In Emily Ahern & Hill Gates (eds) _The anthropology of Taiwanese society_ , Taipei: SMC reprint, (pp. 184-211)  \n\n**週****3**   10月 8日 _Of Self and Nation_, Introductory chapter  ONLINE\n\nPowerpoint presentation of the Introductory Chapter of _Of Self and Nation_ & chapter outline.\n\nStudents select among themselves the chapter that they will present in class during the semester.  \n\nPreparation (advance reading for next week) article Ann  \n\nHeylen, Ann (2020) “Diaries and Oral Histories as Ego-Documents in the Representations of the Taiwanese Nation” _European Journal of East Asian Studies_ (EJEAS), 19 (June), pp. 48-73\n\n**週** **4**  10月 15日  Diaries and Taiwan Studies\n\nDiaries and Taiwan Studies: overview of Taiwanese scholars engaging with diary research, major institutions, and accessibility. Focus will be on the diaries published and made accessible by the Institute of Taiwan History at Academia Sinica, the Wu Sanlian Foundation and other private initiatives.  \n\nStudents select one researcher whose expertise is personal documents for follow up work during the course. For example, Sean Tzeng  \n\nDiscussion Heylen, Ann (2020) “Diaries and Oral Histories as Ego-Documents in the Representations of the Taiwanese Nation” _European Journal of East Asian Studies_ (EJEAS), 19 (June), pp. 48-73\n\n**週****5**  10 月 22 日 Discussion _Of Self and Nation_: Chapter 1\n\n_Of Self and Nation_, Chapter 1 The Construction of an Autobiographical Self in the Letters of Kartini \n\nContextualisation of the chapter: reaching out to private letters and their inclusion in volumes _Selected Works_ (全集)  & Introducing research on private letters in Chinese history. \n\nKey terms: language and education\n\n**週****6**  10 月 29 日Discussion _Of Self and Nation_: Chapter 2 & 3\n\n_Of Self and Nation_, Chapter 2 The Metamorphosis of a Javanese Aristocrat: The Memoirs of Pangeran Achmad Djajadiningrat & Chapter 3, The Representation of History and the Presentation of Self: Tan Malaka’s _Dari Pendjarake Pendjara_  \n\nContextualisation of the chapters: _Memoirs and Taiwan Studies._ The publication of Recollections or Memoirs (回憶錄) is fairly extensive, especially in relation to the memoirs of Taiwanese elite who lived through the Japanese colonial period and whose works were published afterwards within the context of the liberalization of Taiwanese politics and society.\n\nKey terms: political events and social awareness, career \n\n**週****7**  11 月 5 日 Methodology: Oral Interview & Ethnographic Literature\n\nSimon, Scott (2003) _Sweet and Sour. Life-Worlds of Taipei Women Entrepreneurs_. Lanham, Oxford: Rowman & Littlefield.\n\nChapter 1. Introduction (pp. 1-13) & Chapter 2 Social Context of female Entrepreneurship (pp.14-26)\n\nChapter 6. A Hairdresser (pp.48-56) & Chapter 7. A Café Owner (pp.57-69)  \n\nChapter 13. A Breakfast Café (pp.157-173) & Chapter 14. An Aboriginal Crafts Dealer (pp. 174-189).\n\n**週****8**   11月 12日 Academic Activity (TBC)\n\n**週****9**   11月 19日  Discussion _Of Self and Nation_: Chapter 4, 5, 8\n\n_Of Self and Nation_, Chapter 4, Religion, Nationalism, and the Individual in Modern Indonesian Autobiography: Hamka’s _Kenang-Kenangan Hidup_ & Chapter 5, Islam in Java – Refractions through an Autobiographical Prism: Saifuddin Zuhri’s  _Guruku Orang-Orang dari Pesantren_ & Chapter 8, Reconversion Narratives among Islamic Youth in Indonesia.\n\nContextualisation of the chapters: Autobiography and Taiwan Studies. The research angle in the _Of Self and Nation_ chapters is religion (Islam). In this class we are concerned with the role of religion, folk belief, Confucian values and the manner in which they surface in ego-document research and publications in Taiwan.  \n\nOptional: Indigenous Life Writing\n\n**週****10**  11 月 26日Discussion _Of Self and Nation_: Chapter 6\n\n_Of Self and Nation_, Chapter 6 “A World Full of Ambivalence”: Sitor Situmorang’s Autobiographical Reflections on Postcolonial Indonesia \n\nContextualisation of the chapter: This chapter deals with a poet, but if we bring it to the Taiwan context, we can also look at ego-documents written by foreigners and visitors. What is the perspective that they bring?\n\n**週****11**  12月 3 日Discussion _Of Self and Nation_: Chapter 7\n\n_Of Self and Nation_, Chapter 7 Revealing and resisting the Construction of Gender: Nh Dini’s Autobiography of a Javanese Childhood \n\nKey terms: Gender in Personal Documents & Interview with Gender Diversity\n\n**週****12**  12 月 10 日 Reading Language in Ego-Documents\n\nContextualisation: This class will elaborate perspectives on how to read and understand the use of language in personal documents.\n\n**週****13**  12 月 17 日  Student Presentations/ Discussions on Selected Personal Documents\n\n**週****14**  12 月 24日  Student Presentations/Discussions on Selected Personal Documents\n\n**週****15**  12月 31 日  Student Presentations/Discussions on Selected Personal Documents\n\n**週****16**  1 月 7 日 Explanation and preparation end-term paper \n\n**週****17**  1月 14 日 Make up Class /Optional\n\n**週****18**  1月  21 日  Make up Class /Optional",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "介紹與分析個人文獻"
        },
        {
            "type": "Group discussion",
            "note": "討論其歷史與社會的定位，貢獻　（演講）"
        },
        {
            "type": "Lab/Studio",
            "note": "數位人文 (DH)"
        },
        {
            "type": "Case studies",
            "note": "students select a personal document"
        }
    ],
    "grading": [
        {
            "type": "Class discussion involvement",
            "weight": 30,
            "note": "discussion of the book chapter and Taiwan-related materials & & participation in DH workshop or related academic activity"
        },
        {
            "type": "Presentation",
            "weight": 30,
            "note": "book chapter presentation with ppt or handout & participation in DH workshop  or related academic activity"
        },
        {
            "type": "Case study reports",
            "weight": 40,
            "note": "students select a personal document"
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}