{
    "year": 107,
    "term": 2,
    "name": "餐旅財務管理",
    "teachers": [
        "方進義"
    ],
    "department": "AM31",
    "code": "SRM0080",
    "credit": 3,
    "serial": 39,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "綜604"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "1.\tIdentify similarities and differences between accounting and finance and their roles in the hospitality industry. 2.\tReview the importance of accounting as the language of business, the principles of accounting and the various systems of accounts used in the hospitality industry, and the three basic financial statements and their usefulness to management: balance sheet, income statement and statement of cash flow and ratio analysis. 3.\tDetermine the correct level of working capital a business should maintain and explain the need for cash controls and cash management. Understand the concept of risk and return and how to measure it. 4.\tUnderstand how to finance the growth of a company: debt versus equity and financial leverage, the weighted cost of capital – WACC, CAPM and  hotel financing schemes.",
    "goals": [
        "Identify similarities and differences between accounting and finance and their roles in the hospitality industry.",
        "Review the importance of accounting as the language of business, the principles of accounting and the various systems of accounts used in the hospitality industry, and the three basic financial statements and their usefulness to management: balance sheet, income statement and statement of cash flow and ratio analysis.",
        "Determine the correct level of working capital a business should maintain and explain the need for cash controls and cash management. Understand the concept of risk and return and how to measure it.",
        "Understand how to finance the growth of a company: debt versus equity and financial leverage, the weighted cost of capital – WACC, CAPM and  hotel financing schemes."
    ],
    "syllabus": "**課程目標**\n\n1.  Collaborate with Courtyard Marriott hotelto implement projects.\n    \n    與國際觀光旅館合作進行實務專案作為期末報告。\n    \n2.  Practice how to run a small hospitalitybusiness through the simulation game.\n    \n    透過公司經營模擬遊戲軟體，實際以財務報表與財務比率及經營策略，如何經營一家餐飲商業公司\n    \n3.  Understand the concept of risk andreturn and how to measure it.\n    \n    學習風險與投資報酬率之關係，了解貨幣的時間價值，並透過現金流遊戲，了解投資之重要性。\n    \n4.  Identify similarities anddifferences between accounting and finance and their roles in the hospitalityindustry.\n    \n    本門課是融合財務管理與投資學之課程，讓運動休閒與餐旅管理領域之同學們辨識會計與財務之不同，並進一步了解投資學與財務管理之不同。\n    \n5.  Review the importance of accountingas the language of business, the principles of accounting and the varioussystems of accounts used in the hospitality industry, and the three basicfinancial statements and their usefulness to management: Balance Sheet, Profit& Loss statement and Statement of Cash Flow and ratio analysis.\n    \n    善用公開資訊與資料庫，閱讀至少三大報表: 資產負債表、綜合損益表與現金流量表，以基本分析判讀上市櫃公司之財務狀況。\n    \n6.  Understand how to finance the growthof a company: debt versus equity and financial leverage, the weighted cost ofcapital – WACC, CAPM and hotel financing schemes.\n    \n    透過財務理論了解股權融資與貸款，透過加權平均資金成本法，資本資產定價模式法了解公司理財之資金折現率。\n    \n\n**課程進度**\n\n1.  Week 1  / Orientation throughsyllabus; Team Grouping (4 Teams); 說明期中、期末報告進行方式。說明中文必備教科書：第一次領薪水就該懂的理財方法，報告分組方式 財務管理與投資學之用處與投資銀行報告解讀\n    \n2.  Week 2  / 09:10-09:50 Time value of money (貨幣的時間價值) 介紹present value, future value (Fred 自製投影片)\n    \n\n1.  Week 3 09:10-09:50分組完成，Time value of money (貨幣的時間價值) 介紹compound interest, discount factor, annuities; Risk and Return (報酬與風險)\n    \n2.  Week 4 09:10-09:50請準備好中文教科書/中文教材第一章淺談基本理財觀念 第一節至第四節 (Fred Presentation)\n    \n3.  Week 5 09:10-09:50中文教材第一章淺談基本理財觀念第五節至第八節 (Fred 簡報)\n    \n4.  Week 6  09:10-09:50 中文教材第二章 (Team 1 Presentation)\n    \n5.  Week 7  Introductionof financial statement – Balance sheet & P& L statement, Financialreporting and ratio analysis/ generally accepted accounting principle (GAAP)& 國際財務報告準則 (International Financial Report Standards, IFRS, issued by 國際會計準則委員會 (International Accounting Standards Board, IASB ). 共同比財務報表/餐旅產業財務報表分析(垂直分析/水平分析/趨勢分析) Research for Secondary Data The introduction of TEJ (Taiwan EconomicJournals, 台灣經濟新報資料庫) database and 公開資訊觀測站 (for the listed hotel and restaurants), 財報狗, 台灣旅宿網 [http://taiwanstay.net.tw/](http://taiwanstay.net.tw/) (Fred 簡報)\n    \n6.  Week 8 參訪\n    \n7.  Week 9 期末報告各組初步分析與可能做法\n    \n    杜邦分析法，CapitalAsset Pricing Model (CAPM)，Weighted Average Cost ofCapital (WACC), 股票與債券介紹, 股票技術分析介紹\n    \n    期中報告範例介紹\n    \n8.  Week 10  0910-1000中文第三章 **Chap 3** **投資工具不必多** **做對就靈**(Team 2 Presentation)\n    \n    10:10-12:00現金流遊戲與現實生活中之投資理財概念 (中國人壽 倪慈棻襄理團隊)\n    \n    Week 11  0910-1000 中文第四章**中文教材** **Chap 4** 資產配置 (Team 3 Presentation)\n    \n    10:10-12:00 InvestmentAnalysis for simple payback, discounted payback, internal rate of return (IRR),net present value (NPV), and modified internal rate of return (MIRR)\n    \n9.  Week 12  參訪\n    \n10.  Week 13  特波企業經營軟體模擬競賽- 演講+競賽 BOSS模擬企業經營http://www.top-boss.com/joomla3/index.php/menu-product-3/menu-boss\n    \n11.  Week 14 股票技術分析進階介紹與各種投資工具 (Fred 自備教材) 談財務如何寫論文(I) 中文期刊論文，10:30-12:00 房地產投資與操作演講\n    \n12.  Week 15  期中報告-國際觀光旅館專案成果或是上市櫃運動休閒餐旅產業之財務報表與股價技術分析 (分成四組報告, 每組 35分鐘, 09:10 開始)\n    \n13.  Week 16 0910-1000中文教材 Chap 5 房地產算盤怎麼打\n    \n    10:10-12:00談財務如何寫論文 (II)，國際期刊英文論文，Paper : Kucukusta, D., Mak, A., & Chan, X. (2013). Corporate socialresponsibility practices in four and five-star hotels: Perspectives from HongKong visitors. International Journal of Hospitality Management, 34(0), 19-30. Evaluatethe hotel & restaurant performance: Data envelopment analysis (DEA)\n    \n14.  Week 17  預報期末專題\n    \n15.  Week 18  TermProject\n    \n\nMidterm Reports\n\n20 %\n\n期中實作訓練學生具備餐旅財務長之角色以評量 2-2 具備餐旅產業所需經濟之管理、開發、財務、社會分析、專案企劃的相關能力。\n\nClass discussion involvement\n\n10 %\n\nCase study and discussion以評量 2-2 具備餐旅產業所需經濟之管理、開發、財務、社會分析、專案企劃的相關能力。\n\nAttendances\n\n10 %\n\nThe attendance rate and participation rate以評量4-2具備藉由運動、休閒和餐旅活動增進和維持自己與家人生理、心理和社會健康的知能，全方位發展。\n\n中文章節Presentation\n\n20 %\n\nUtilize the journal paper to motivate students more discussion in class以評量 1-4具備以國際視野分析運動休閒與餐旅產業之現\n\nTerm Projects\n\n40 %\n\nTerm project presentation以評量 4-2具備藉由運動、休閒和餐旅活動增進和維持自己與家人生理、心理和社會健康的知能，全方位發展。\n\n**Required and Recommended Texts/Readings with References**\n\n1.        必備參考書籍:  \n蕭世斌(2011)，第一次領薪水就該懂的理財方法－買股票、基金、房地產，這樣算才會賺，台北市：大樂文化有限公司。\n\n[http://www.masterhsiao.com.tw/Books/978-986-86651-2-5/index.php](http://www.masterhsiao.com.tw/Books/978-986-86651-2-5/index.php)\n\n[http://www.masterhsiao.com.tw/index.html](http://www.masterhsiao.com.tw/index.html) 怪老子理財\n\n參考書籍 :\n\n2.        石野雄一著，高信鐽譯(2010) 。公司不教, 但要你懂的財務知識。大是文化。\n\n3.        DeFranco, A. L. & Lattin, T. W. (2009), Hospitality Financial Management (ISBN: 0-471-69216-6)\n\n4.        Chatfield, R. E. & Dalbor, M. C. (2006), Hospitality Financial Management, Pearson Prentice Hall\n\n5.        太田忠、易起宇譯 (2015)。漲跌，我都要賺：大師教你永不套牢的20條投資金律。大樂文化 (ISBN: 978-986-91050-9-5)\n\n6.        麥克．路易士、洪慧芳譯 (2012)。大賣空：預見史上最大金融浩劫之投資英雄傳 (The Big Short: Inside the Doomsday Machine) 財信出版 (ISBN: 978-986-6165-14-6)\n\n7.        許啟智編著（2009)。財務報表一日通，早安財經文化。\n\n8.        杜麗娟、許秉翔 (2009) 。休閒產業的財務管理 ，智勝文化。\n\nSelected Papers presented by each student will be offered in the first class including Restaurant Topic, Hotel Topic, Forecasting Topic, CSR Topic, Financial Ratio Topic, and M&A Topic,\n\n**Paper** : Melih Madanoglu, Kyuho Lee and Francis A. Kwansa, (2008). Risk-Return Analysis of Fast-Food Versus Casual-Dining Restaurants: Who Moved My Cheeseburger? _Journal of Hospitality & Tourism Research_, 32, 327-341.\n\n**Paper :** Tsai, H., Pan, S., & Lee, J. (2011). Recent research in hospitality financial management. International Journal of Contemporary Hospitality Management, 23(7), 941-971.\n\nTopic: Financial statement\n\nSohn, J., Tang, C.-H., & Jang, S. (2013). Does the asset-light and fee-oriented strategy create value? _International Journal of Hospitality Management, 32_(0), 270-277\n\n \n\n \n\n \n\n \n\n \n\nKeynote speech 負責組別: Subsidy (費用申請), gift (禮物準備), Welcome and reception (接待), Poster (海報), 停車證申請, Drink (茶水), Photo (照相), Video (攝影), Report forsubsidy (心得報告)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "採用論文常用方法引導教學，藉講授課本，模擬軟體與期刊論文搭配，引起同學研究動機。"
        },
        {
            "type": "討論法",
            "note": "採用模擬軟體競賽引導同學討論"
        },
        {
            "type": "問題解決教學",
            "note": "與產學合作廠商以模擬軟體競賽引導學生學習興趣"
        },
        {
            "type": "合作學習",
            "note": "藉由模擬系統軟體廠商合作，使同學能在虛擬實境之軟體中學習解決問題能力"
        },
        {
            "type": "實驗/實作",
            "note": "期中實作訓練學生具備料理長與財務長之跨領域角色 期末報告訓練學生思考專案企劃能力"
        },
        {
            "type": "實地考察、參訪",
            "note": "藉由實際參訪餐旅產業達到與實務結合之目的"
        },
        {
            "type": "專題研究",
            "note": "Term project presentation"
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 20,
            "note": "期中實作訓練學生具備餐旅財務長之角色以評量 2-2\t具備餐旅產業所需經濟之管理、開發、財務、社會分析、專案企劃的相關能力。"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "Case study and discussion以評量 2-2\t具備餐旅產業所需經濟之管理、開發、財務、社會分析、專案企劃的相關能力。"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "The attendance rate and participation rate以評量4-2具備藉由運動、休閒和餐旅活動增進和維持自己與家人生理、心理和社會健康的知能，全方位發展。"
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "中文章節Presentation, Utilize the journal paper to motivate students more discussion in class以評量 1-4具備以國際視野分析運動休閒與餐旅產業之現"
        },
        {
            "type": "專題",
            "weight": 40,
            "note": "Term project presentation以評量 4-2具備藉由運動、休閒和餐旅活動增進和維持自己與家人生理、心理和社會健康的知能，全方位發展。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}