{
    "year": 107,
    "term": 2,
    "name": "社區環境教育",
    "teachers": [
        "王順美"
    ],
    "department": "SM46",
    "code": "EEC0017",
    "credit": 3,
    "serial": 2679,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 1,
            "from": 2,
            "to": 4,
            "campus": "公館",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "上課地點：環教所304會議室。要求具備相關基礎課程",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "本課程透過導讀、討論、案例探討及實作，介紹社區環境教育的內涵及作法。認識參與、培力賦權、批判思考、協商及夥伴關係對社區運作的重要，以及這些要素如何藉由社區營造、利害關係人互動及問題解決模式的策略實踐，以培養認識地方、與地方建立關係的能力，環境關懷及行動力，能以社區或社群為本位合作式的永續發展相關的學習。",
    "goals": [
        "對社區及社區發展的認識（定義、組成、過程），以及對於社會變遷，社區議題的產生與解決途徑的認識",
        "對於成人教育的理論、社區問題解決教學模式、社會學習理論、自願學習的認識",
        "培養學生成為具備環境行動力及環境素養的公民"
    ],
    "syllabus": "9/13\n\n課程介紹\n\n＊ Earth Force (2008) _A curriculum for community action and problem solving_. Staples Foundation for Learning. （碩博）\n\n9/20\n\n環境公民、環境問題解決模式\n\n＊Stapp, W. B. and Wals, A. E. (1994) An action research approach to environmental problem solving. In: L. A. Bardwell, M. C. Monroe, and Tudor, M. T. _Environmental Problem Solving: Theory, Practice, and Possibility in Environmental Education_ Troy: North American Association for Environmental Education.（碩博）\n\n9/27-10/18\n\n認識社區、社區調查實做\n\n＊    蔡蔡宏進  (1991)。   **社區原理** （修訂三版）。 第1、4-8章。 台北市：三民。（碩博）\n\n10/25\n\n議題、挑選議題\n\nDonella Meadows , Jorgen Randers & Dennis Meadows (2007) Limits to Growth. 高一中譯，成長的極限。台北市：臉譜出版社。\n\n11/1-22\n\n議題分析、利害關係人\n\n＊Hungerford, H. R., Litherland, R. A., Peyton, R. B., Ramsey, J. M. & Volk, T. L. (1985) _Investigating and Evaluating Environmental Issues and Actions: Skill Development Modules._ Champaign, IL: Stripe Publishing Company. （碩博）\n\n＊    Nicholas C. Burbules and Rupert Berk Department of Educational Policy Studies.  Critical Thinking and Critical Pedagogy：Relations, Differences, and Limits. Published in Critical Theories in Education, Thomas S. Popkewitz and Lynn Fendler, eds. (NY: Routledge, 1999. （博）\n\n11/29\n\n訂目標、行動策略\n\n＊Arnstein, S. R. (1969) A ladder of citizen participation. Journal of American Institute of Planners. 35:216-224. （博）\n\n＊賀純佩等（譯） （2000）。 R. A. Hart著。兒童參與\\-社區環保中兒童的角色與活動方式 北京：科學出版社（碩博）\n\n12/6-13\n\n規劃、採取行動\n\n＊    Wals, Arjen E. J. & Noorduyn, Leonore 2008. Social learning in action: a reconstruction of an urban community moving towards sustainability. Stevenson, R. and Dillon, J. ed.（博）\n\n＊    古巴影片：永續農業、從搖籃到搖籃、綠色建築生態共生、綠色生活、\n\n12/20-1/4\n\n反思、公開慶祝、再規劃\n\n＊ Hogan, C. (2000) Facilitating Empowerment: A Handbook for Facilitators, Trainers and Individuals. London: Kogan Page. Chapter 1. 1-18.（博）\n\nPande, L. Our land, our life: an innovative approach to environmental education in the central Himalayas. ?? Education and sustainable development: responding to the global challenge. Chapter 7. （碩博）",
    "methodologies": [
        {
            "type": "講述法",
            "note": "講述社區社區發展、成人學習等重要理論"
        },
        {
            "type": "討論法",
            "note": "社區行動方案分組討論"
        },
        {
            "type": "實驗/實作",
            "note": "搭配社區工作參與社區發展行動"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 60,
            "note": "每週按上課主題繳交相關作業"
        },
        {
            "type": "課堂討論參與",
            "weight": 40,
            "note": "出席參與討論情形"
        }
    ],
    "prerequisite": "",
    "general_core": []
}