{
    "year": 107,
    "term": 2,
    "name": "自然生態保育專題研究",
    "teachers": [
        "方偉達"
    ],
    "department": "SM46",
    "code": "EEC0020",
    "credit": 2,
    "serial": 2681,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 1,
            "from": 3,
            "to": 4,
            "campus": "公館",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "要求具備相關基礎課程",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 2,
    "description": "透過東西方哲學中的生態思維導論培養學生的基礎生態素養、環境倫理與深層生態學。輔以各國生態保育之案例、方法與理論，加強學生的學術研究能力。協助同學以深層生態學角度演練自然保育環境、環境保護與文化襲產場域，進行環境教育系統規劃能力。",
    "goals": [
        "協助學生了解自然保育之涵意及其關連的生態理念與生態原理，並配合生態學相關知識，培養學生邏輯思考及推理能力。",
        "協助學生了解生態學與哲學之關係透過批判性思考，深入瞭解生態的意涵。以深層生態學角度演練自然保育環境、環境保護與文化襲產場域，進行環境教育系統規劃能力。",
        "理解各種文明與傳統文化相對於生態保育之間的關係，並協助學生練習以學術研究觀點論述、比較與歸納。參訪國家公園，體驗自然環境與台灣原住民文化之關聯。",
        "透過東西方哲學中的生態思維導論，詳細闡明其對生態學理的影響與發展，以培養學生的基礎生態素養、環境倫理與深層生態學；同時經由課堂導引與學習，強化學生思考、判斷與表達的能力。"
    ],
    "syllabus": "課程介紹：說明課程大綱內容、瞭解學生背景與需求，協調及調整教學方式與內容\n\n第一週  自然生態保育緒論\n\n一、什麼是自然生態保育？\n\n1、自然史介紹2、自然生態保育的本質\n\n3、現代自然生態保育的範疇\n\n第二週  一、什麼是自然生態保育？（二）\n\n4、生物圈與生態系統（土壤、水文及其養分循環及分解）5、干擾與生物多樣性（演替、穩定性及相關機制）6、人類干擾\n\n第三週  二、個體自然生態保育\n\n1、物種介紹（脊椎動物、無脊椎動物、植物、其他等）2、物種結構、功能及變化3、生物與溫度的關係4、生物與水的關係5、生物競爭（棲位與同功群）\n\n6、植物生態現象介紹（形態變化、生理變化反應和環境的關係）7、動物生態現象介紹（適應性、互利共生、耐受性、覓食、寄生、遷移、繁殖、外來種引入）。\n\n第四週  三、族群自然生態保育\n\n1、族群組成與結構2、族群內部增長、死亡與遷移（族群動態學、成長模型）3、族群取樣方法介紹4、族群密度估計法介紹5、族群空間分布與數量變化6、族群動態與地理性變化\n\n第五週  期中考（一）\n\n第六週 校園動植物觀察及紀錄報告準備週\n\n第七週  四、群落自然生態保育\n\n1、群落的組成與結構2、群落的動態3、生態群落形成與演替\n\n4、群落多樣性5、群落多樣性測量方法6、受脅物種與棲地關係\n\n第八週  五、景觀自然生態保育\n\n1、島嶼生物地理學概論2、景觀結構、功能、時間序列、連接度和滲透理論3、景觀複雜性4、景觀資訊科技分析方法\n\n第九週  六、生態系統\n\n1、生態系統的組成與結構2、生態系統的功能（關鍵物種、食物鏈、生態金字塔、能量流動）3、生態系統分類（水生生態系統、陸地生態系統）4、人文自然生態保育與城市生態系統5、地理自然生態保育與全球自然生態保育\n\n第十週  期中考（二）\n\n第十一週  七、自然生態保育應用概論\n\n1、自然生態保育應用、管理與工程技術2、生態工程介紹（濕地、溪流、森林、海岸、島嶼生態及自然災害、生物敏感地區的生態管理、規劃、設計、工程與棲地營造）3、生態管理（環境影響評估、生態調查、生態補償、永續生態）\n\n第十二週  校園動植物觀察及紀錄期末報告（一）\n\n第十三週 校園動植物觀察及紀錄期末報告（二）\n\n第十四週 校園動植物觀察及紀錄期末報告（三）\n\n第十五週 期末考\n\n第十六週 期末報告",
    "methodologies": [
        {
            "type": "專題研究",
            "note": "碩博士論文專題研究"
        }
    ],
    "grading": [
        {
            "type": "報告",
            "weight": 50,
            "note": "碩博士論文專題研究"
        },
        {
            "type": "專題",
            "weight": 50,
            "note": "碩博士論文專題研究"
        }
    ],
    "prerequisite": "",
    "general_core": []
}