{
    "year": 108,
    "term": 1,
    "name": "圖書資訊學研究趨勢",
    "teachers": [
        "吳美美"
    ],
    "department": "ED15",
    "code": "ISD0110",
    "credit": 3,
    "serial": 407,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 2,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "圖資所博士班研討室",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course will offer Ph.D. students with the understanding of the major problems, trends and developments in information science and librarianship. Further critical survey and discussion of current and classic research findings will be focused in the seminar.",
    "goals": [
        "To understand and to familiarize the evolution structure, nature and environment of information science and librarianship",
        "To be able to critically analyze works and trends in information science and librarianship",
        "To facilitate and generalize a ground for choosing and/or evaluating their own future research"
    ],
    "syllabus": "I.  Course Description\n\nThis course is designed with an intention to prepare Ph.D. students with a broad understanding and insight of the major problems, developments and trends in library and information studies. Further skills for critical thinking, research approaches of the classic as well as the current research issues will be covered in the seminar. \n\nII.  Objectives\n\nThe objectives of the course are to equip Ph.D. students with:\n\n1.  An understanding and familiarizing the evolution, structure, nature and environment of information science and librarianship.\n2.  Being able to critically analyze works and trends in information science and librarianship.\n3.  Facilitating and generalizing a ground for choosing and/or evaluating own future research.\n\nIII. Contents\n\nThe course will cover the issues:\n\n1.  A historical overview of information science and librarianship, and the social, political and technological factors and critical events that affected their evolution; \n2.  A perspective on the phenomena and processes of interest to information science and librarianship;\n3.  The problems and issues addressed over time and contemporarily in research, stressing the approaches, theoretical frameworks and models, and methods used;\n4.  The contemporary structures, and identify disciplinary and interdisciplinary relationships of information science and librarianship; and\n5.  Seminal works and authors within information science, librarianship and related fields that had a significant impact on research and professional practice.\n\n(\\*每周教學進度如[syllabus](https://paper.dropbox.com/doc/2019-Fall-Trends-in-Library-and-Information-Research-syllabus--AfWXZNlyTqPphZ_pwTiwfi2AAg-k7DPGgShrtppgQOCmsf10)課程進度表)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "教師講授"
        },
        {
            "type": "討論法",
            "note": "主題討論"
        },
        {
            "type": "問題解決教學",
            "note": "情境設計教學"
        },
        {
            "type": "合作學習",
            "note": "同學彼此討論完成主題學習"
        },
        {
            "type": "媒體融入教學",
            "note": "數位教材、同步視訊平台、社會媒體"
        },
        {
            "type": "專題研究",
            "note": "專題研究做為期末報告"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": "本學期共有五個作業"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "上課參與討論之表現"
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "上課報告之表現"
        },
        {
            "type": "專題",
            "weight": 30,
            "note": "期末專題"
        }
    ],
    "prerequisite": "",
    "general_core": []
}