{
    "year": 107,
    "term": 1,
    "name": "地理教學實習（一）（教）",
    "teachers": [
        "韋煙灶"
    ],
    "department": "LU23",
    "code": "GEUE110",
    "credit": 2,
    "serial": 1978,
    "group": "",
    "quota": {
        "limit": 40,
        "additional": 3
    },
    "schedule": [
        {
            "day": 4,
            "from": 6,
            "to": 9,
            "campus": "本部",
            "classroom": "樸201"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎必須先修過【GEUE001  地理教材教法（教）】",
    "form_s": "4",
    "classes": "",
    "dept_group": "",
    "hours": 4,
    "description": "本課程含實地學習時數36小時。體認中學地理教師的責任，培養中學地理教師的風範。熟練中學地理教師的專業知能，包括熟悉中學地理的教學方法、教學技術，如分析單元地理教材、編纂單元地理教學目標、設計單元地理教學活動、以及根據單元地理教學活動製作各種地理教具、根據單元地理教學目標編製各種教學評量的技能。",
    "goals": [
        "體認中學地理教師的責任，培養中學地理教師的風範",
        "熟練中學地理教師的專業知能，包括熟悉中學地理的教學方法、教學技術，如分析單元地理教材、編纂單元地理教學目標、設計單元地理教學活動、以及根據單元地理教學活動製作各種地理教具、根據單元地理教學目標編製各種教學評量的技能。",
        "驗證並實驗中學地理教學的理論與原理原則"
    ],
    "syllabus": "(一)時間安排：除可能安排3-5次中學地理教學參觀外，其餘時間安排如下：  \n1.前半段配合實際趨勢，訓練即席演講、培養教師精神及講授中學地理教學方法的理論與應用。  \n2.後半段開始預習試教，每位同學試教時間一節，試教後由同學、教師分別講評（同學講評以3-5分鐘為原則，講評同學於該節試教完成後臨時抽籤決定）。預習試教不因國定假日、寒假或其他因素縮減，全班每位同學至少要試教一節，至少要講評一次。  \n3.除非特殊情況，學期中不得任意請假。  \n4.講授內容涉及最新研究成果，或和教師甄選有關的特殊技術時，合班上課。  \n  \n(二)預習試教：  \n1.預習試教的材料包括：高中地理、國中社會學習領域。2\\. 預習試教的準備與實施，採分組方式；每5至8人為一組（依試教區域的單元數而定），舉凡試教前須事先撰寫的單元教學目標、單元教學活動設計、以及將所有單 元教學目標項下的具體教學目標轉換成試題，以及試教前的以我訓練、試教後的自我檢討等，均需透過組員共同討論、互相激發。同學排定的預習試教時間，不得任 意更動。  \n3.同學須於正式上台試教的前一週，將事先準備的單元教學目標、單元教學活動設計影印一份，繳交任課教師；試教時，需將上述材料印發給每一位同學，試教過程中，一切步驟均須按照單元教學活動設計的規劃進行。  \n4.同學於正式上台試教時，需派一位組員全程錄影。錄影的目的有二：其一是作為試教者自我檢討的依據；其二是訓練操作攝影機的技巧。在整個學期中，每一位同學至少必須全程操作錄影一次。  \n5.預習試教時，同學除自製的教具外，不得攜帶或使用課本、文件、小抄及掛圖、投影機、幻燈機等現成教具上台。教學時，同學需於適當時機繪製板圖。  \n6.預習試教時，同學如在教學過程中被要求下台，將於學期末全部試教過後，再給一次試教機會，第二次試教視同補考。  \n7.期末需將所有單元教學目標項下的具體教學目標轉換成試題。  \n＊被要求下台的情況包括：  \n1.教學主題不明確，教學內容無系統。  \n2.未根據單元教學目標，設計出單元教學活動。  \n3.教學活動不順暢，如單元（或具體）目標的講述或活動內容之間，無法順暢連接。  \n4.板圖繪製太差。  \n5.教學音量不足，教學態度不佳或精神散漫。  \n6.教學時間控制不良。  \n7.試教過程中，讓老師沒有耐心想聽下去的慾望。  \n＊錄影機的借用與保養：每班一部，向系上借用；借用期間，須妥為維護，如有損傷故障，所有修護費用，均由同學共同負責。  \n  \n(三)教學參觀：  \n1.教學參觀時，不得任意請假。  \n2.教學參觀時，需著完整校服，並規定團體活動所應有的一切規範。",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "實驗/實作",
            "note": ""
        },
        {
            "type": "實地考察、參訪",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": "預習試教的表現50% 預習試教後的講評10% 與預習試教者的配合程度10% 臨時給予題目即席演講30%（口語順暢幽默、肢體語言恰如其分、時控制良好10%，主題明確、理路清晰、系統分明、邏輯結構嚴謹20%）"
        }
    ],
    "prerequisite": "◎必須先修過【GEUE001  地理教材教法（教）】",
    "general_core": []
}