{
    "year": 110,
    "term": 1,
    "name": "地球科學產學實務與實習（二）",
    "teachers": [
        "葉恩肇",
        "葉庭光"
    ],
    "department": "SU44",
    "code": "ESC9038",
    "credit": 3,
    "serial": 3024,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 16,
            "to": 11,
            "campus": "公館",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "S801-2",
    "restrict": "◎必須先修過【ESU0219  地球科學產學實務與實習（一）】",
    "form_s": "",
    "classes": "9",
    "dept_group": "",
    "hours": 3,
    "description": "本課程以講座與實務實習為主。提供地球科學相關產學領域的實習計畫。課程實施分為2個階段：第一階段為講座與見習課程，每周課程時數為3小時(地球科學產學實務與實習（一）)；第二階段為於暑期進行產學實習。本課程為第二階段，學生於暑假期間，依自己的志願，前往實習單位實習4至6週，實習結束後，以成果發表會形式發表成果。",
    "goals": [
        "統整/深化大學所學，應用於解決業界實務。",
        "透過問題解決任務，反思所學。",
        "透過實習工作，培養問題解決、積極態度、合作能力、人際關係。",
        "獲取業界相關的新知"
    ],
    "syllabus": "授課方式：16+2週  \n彈性授課方式：學生自主學習。學生於實習地點學習地球科學職涯技能，並收集實習過程相關資料，於實習結束後，撰寫實習報告書並進行成果分享與反思。  \n學生依其志願前往實習地點，實習時間至少為6週，計240小時。  \n實習過程中，授課教師至少會前往實習地點1次，了解實習狀況。  \n實習完畢之後，將召開反思與成果說明會(6小時)  \nStudents intern in a host organization or agency for a 6 to 8 week period.  \nStudents present and share reflections or results. (6 hours)",
    "methodologies": [
        {
            "type": "實地考察、參訪",
            "note": "(中文)暑假進行實地工作\n(English)conduct intern work in the summer time"
        },
        {
            "type": "其他",
            "note": "(中文) 實地實習:學習者依據實習單位的工作特性，實際參與該單位之相關業務、會議、課程。\n(English) Intern learning: based on work aspects of intern places, students attend the jobs, meetings, programs."
        }
    ],
    "grading": [
        {
            "type": "報告",
            "weight": 20,
            "note": "實習報告：透過報告評估學習者的表達能力、邏輯與實習經驗。\nAssess learner’s ability and logic of their thoughts and experiences during presentation."
        },
        {
            "type": "成果展覽",
            "weight": 20,
            "note": "透過成果展評估學習者的成果展，評估學習者的成果精緻度、反思與回饋。\nEvaluate learner’s reflections, feedbacks, and results shared in an exhibition."
        },
        {
            "type": "其他",
            "weight": 60,
            "note": "實習單位考評：實習單位主管考評學習者在實習期間之表現。\nLearner’s performance in a host organization will be evaluated by the on-site internship supervisors."
        }
    ],
    "prerequisite": "◎必須先修過【ESU0219  地球科學產學實務與實習（一）】",
    "general_core": []
}