{
    "year": 110,
    "term": 1,
    "name": "宇宙觀的進展",
    "teachers": [
        "陳林文"
    ],
    "department": "SU44",
    "code": "ESU0047",
    "credit": 3,
    "serial": 3030,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 5
    },
    "schedule": [
        {
            "day": 1,
            "from": 7,
            "to": 9,
            "campus": "公館",
            "classroom": "Ｓ407"
        }
    ],
    "programs": [
        "天文重力學程"
    ],
    "comment": "",
    "restrict": "◎必須先修過【ESU0178  天文學（含實習）】",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "The aim of this course is to introduce the students to the concepts of modern cosmology (General Relativity, Hubble Law, Primordial Nucleosynthesis, Cosmic Microwave Background, Dark matter and Dark Energy, Structure formation), and help them answer these questions: \n•What are the basic components of the universe? \n•What are the basic physical laws that govern the universe? \n•What is the size and age of the universe? \n•What’s the current theory on origin and evolution of the universe (big bang!), and what are the evidences that support that theory? \n•What is the nature of space/time/matter/energy? \n•What about the “dark side” of the universe: black holes, cosmic dark ages, dark matter, dark energy? \n•How galaxies were formed? \n•What is a black-hole and what influence it has on galaxies? \nThe first part of the course will be dedicated to introduce the students to these concepts via series of lecture, and in a second parts the student will practice their knowledge through research projects.",
    "goals": [
        "The aim of this course is to introduce the students to the concepts of modern cosmology."
    ],
    "syllabus": "1.  Introduction – astronomy and cosmology\n2.  Overview: from ‘world model’ to cosmology as a science / Measure the universe through astronomical methods\n3.  國慶日遇例假日補假1日\n4.  darkness of night – from star count to deep field cosmology\n5.  The great Debate: size of our galaxy and distance to extragalactic objects\n6.  expanding universe – redshift, distance, standard candles, age (crisis) of the universe\n7.  from radio stars to radio galaxies: quasars and supermassive black holes\n8.  期中考\n9.  Review of midterm exam / big bang cosmology vs steady state cosmology\n10.  cosmological redshift\n11.  Matter in the universe: galaxy distribution, void, intergalactic medium. Dark matter\n12.  microwave background – relics of big bang, 3K, CMB spatial fluctuation\n13.  nucleaosynthesis, light elements, early universe\n14.  The Cosmological Constant, dark energy\n15.  Cosmic dark age, reionization, large scale structure, and galaxy evolution\n16.  期末考\n17.  Term project Presentations / Review of final exam  part I\n18.  Term project Presentations / Review of final exam  part II",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": "期中考＋期末考＋（書面╱口頭）報告＋作業＋課堂參與及討論"
        }
    ],
    "prerequisite": "◎必須先修過【ESU0178  天文學（含實習）】",
    "general_core": []
}