{
    "year": 109,
    "term": 2,
    "name": "誰是下個賈伯斯─大師創業發想與實踐（二）",
    "teachers": [
        "洪翊軒"
    ],
    "department": "ZU9V",
    "code": "PGU9005",
    "credit": 2,
    "serial": 3248,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 10,
            "to": 11,
            "campus": "本部",
            "classroom": "誠302"
        }
    ],
    "programs": [
        "大師創業學程"
    ],
    "comment": "",
    "restrict": "◎第一階段限 大師創業學程",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本系列課程作為『大師創業學分學程』實務訓練之基本課程，主要規劃是由學生分組執行創業實務專題。經由創業實務專題的執行過程，使學生熟練在創業實踐過程當中各種環節與經驗累積。這個過程將分別透過「誰是下個賈伯斯-大師創業發想與實踐（一）」與「誰是下個賈伯斯-大師創業發想與實踐（二）」來進行。其中，「誰是下個賈伯斯-大師創業發想與實踐（一）」主要的目的是藉由創業團隊分組並確認創業主軸，進行創業發想與構思；「誰是下個賈伯斯-大師創業發想與實踐（二）」則為創新創業實務真正落實的階段，藉由創業產品開發過程，進行創業實務模擬與執行，並完成實際專案內容開發。\n本課程結合創業理論與實作的模式，讓學生能在多元的討論環境中，引導思考創新創業模式，實踐創業產品投入創業實務，並導入業師參與，提供學生創業構想與建設性的評論。",
    "goals": [
        "訓練學生從產品設計、開發、實作等方面的能力。",
        "培養學生創業團隊合作模式、產品開發流程、創業提案與呈現。"
    ],
    "syllabus": "本門課將透過1+1的雙向教學模式，讓學生直接體驗創業的過程(1小時課程+1小時實作)，培養學生的問題解決力、企劃力、創新思考力及市場實踐力，讓學生能有帶著走的知識與技能。於整學期課程中，老師更會逐步引導學生完成一份商業企劃，傳授學生將點子展成價值連城的生意的方法。過程也會指導學生組隊參加競賽，直接從實務中學習，獲取實戰經驗。\n\n    本們課程講師為連續創業家Terry，擁有4次科技創業、撰寫超過100份的商業企畫、拿到超過40項全國性商業競賽獎項、於2個月就談下近1,800萬的訂單的豐富實務經驗。\n\n課程內容包含「商業企畫書撰寫」、「打造產品原型」、「銷售簡報」三大核心。首先會教學生運用商業模式（BMC）的基礎，並以故事搭配實例的方式，引導學生從設計思考出發，找到一個點子，接著做出最小可型產品(MVP)並設計問卷，投入市場獲得回饋，最後完成一份企劃提案，模擬向客戶及投資人進銷售提案，並將成果投入參與全國創業競賽。\n\n課程更會直接提供3份由老師親自撰寫的金牌企劃書範本給學生參考，並以分組討論、實作的方式進行，讓學生能一步步紮實的學習，獲得寶貴的實戰技能，上學生未來在提案、銷售、企劃上都能無往不利。\n\n    想要打造自己的事業，卻不知道從何開始嗎？想做好一份動人提案，卻不知道有哪些內容架構嗎？想了解管理與企劃該怎麼做，卻不知從何開始累積實務經驗嗎？ 我們課堂上見。\n\n【課程特色】\n\n1.  實作商業模式畫布、設計思考、問卷設計與調查、商業簡報。\n2.  能讓學生在半學期內直接模擬開一家新創公司的過程，並完成一份可展\n\n示成果，最後直接演示。\n\n1.  著重實驗精神，從實作的過程學習解決問題的方法。\n2.  企劃完成後可連結創業補助與競賽 (如教育部大專院校模擬實戰平、U-start、尤努斯社企競賽等)。\n\n【課程適合對象】\n\n1.  未來想自己啟動創業或開立小店的準老闆們。\n2.  零概念，對商管性質工作有興趣的企畫新手。\n3.  想提升企劃提案能力，成功拿下客戶訂單的商業開發人才。\n4.  想培養自己職場硬實力，在實務中學習的學生。\n\n*   **教學大綱**\n\n**教學進度與主題****：**\n\n第一週： 當前科技產業趨勢與創新商機 \n\n第二週： 將你的點子，發展成價值連城的生意 – 從點子到商業企劃書\n\n第三週： 史丹佛設計學院最熱門的創意課 - 設計思考\n\n第四週： 新世代經理人都在用的商業工具 – 商業模式畫布\n\n第五週： 讓人人都能秒懂你的專案價值 - 顧客價值主張\n\n第六週： 校際活動日，放假一天\n\n第七週： 用內褲的預算，打造鋼鐵人的裝備 - 最小可型產品\n\n第八週： 期中報告\n\n第九週： 知己知彼，百戰百勝 - 市場分析\n\n第十週： 把市場資訊變成源源不絕的金流 - 市場開拓 / 行銷策略\n\n第十一週：拿出證據，讓你的企劃更有說服力 -  問卷設計/市場驗證法\n\n第十二週：產學教師案例分享週\n\n第十三週：藏在細節中的魔鬼與寶藏 - 財務規劃 / 風險管理\n\n第十四週：運籌帷幄之中，決勝千里之外 - 新創專案管理術\n\n第十五週：概念早期驗證的熱門管道 - 群眾募資\n\n第十六週：用簡報說出一個好故事 - 投售簡報製作\n\n第十七週：期末報告 (一)\n\n第十八週：期末報告 (二)",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "實驗/實作",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "藉由商業畫布、產品原型、市場分析、財務規劃等實際操作，評估學生實踐力。"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "藉由分組討論與課程活動參與，了解學團隊合作能與溝通能力。"
        },
        {
            "type": "出席",
            "weight": 20,
            "note": "經由出席狀況與討論情形，評估學生表達能力及學習積極度。"
        },
        {
            "type": "報告",
            "weight": 50,
            "note": "透過簡報呈現整體創業構想，依市場可行性、規劃完整性、構想實踐程度三大項，評估學生之問題解決能力與創業家精神。其中學生互評之成績將佔10%。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}