{
    "year": 108,
    "term": 2,
    "name": "亞洲管理實務專題",
    "teachers": [
        "鄭名道"
    ],
    "department": "O",
    "code": "O5M0006",
    "credit": 3,
    "serial": 2329,
    "group": "",
    "quota": {
        "limit": 35,
        "additional": 7
    },
    "schedule": [
        {
            "day": 1,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "雲508"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course is designed to provide an overview of various aspects of doing business and operational management in China, Taiwan, Japan and Vietnam. The course is broadly divided into three parts. \n1.\tThe first part of the course defining globalization and international business.\n2.\tThe second parts deals with business context and business management. These two parts provide the overview the macro environment economies of China, Taiwan, Japan and Vietnam, including the economy and culture, that affect business and management practices in each country. \nSuch overview equips students with a firm basis to be able to analyze the key environmental factors that directly affect how business is conducted in those economies. \n3.\tThe third part emphasizes on the practical aspects of doing business in each country - China, Taiwan, Japan and Vietnam. Those business opportunities and challenges facing foreign companies and business and management practices so students will gain an in-depth understanding of how to do business in those countries. \nIn addition to broad knowledge of the region, assignments and projects will give students opportunities to further develop expertise in a selected country of his/her choice",
    "goals": [
        "know the key trends shaping the business environment of the Asia-Pacific region",
        "basic brief knowledge of the economic history and current economic situation in China, Taiwan, Japan and Vietnam",
        "know the conceptual issues related to the Asia-Pacific marketing perspective",
        "To become familiar with many of the major industries and companies in China, Taiwan , Vietnam and Japan",
        "know regulatory business instruments and practices in selected Asia-Pacific states",
        "To understanding of the business environment in China, Taiwan, Vietnam and Japan",
        "know USA’s positions in the Asia-Pacific region from the business perspective",
        "To recognize how management and cross cultural differences affect and impact on the ways of doing business in China, Taiwan, Vietnam and Japan",
        "know critical questions raised and discussed during the course and relevant to building a successful business strategy in the Asia-Pacific region",
        "10.　To gain a working level of competence for engaging in international business activities in China, Taiwan, Vietnam and Japan with business people from these countries"
    ],
    "syllabus": "**Session****/date**\n\n**Subject**\n\n**1**\n\nPart I : Environmental Foundation - Globalization and international linkage\n\n**2**\n\nThe country political and technological environment, country competitiveness index (Asia focus)\n\n**3**\n\nEthics and social responsibility (Asia focus)\n\n**4**\n\nPart II: Role of culture - the meanings of cultural dimensions\n\n**5**\n\nBusiness consulting skill training\n\n**6**\n\nCase discussion and business  case presentation\n\n**7**\n\nIntroduction of Taiwan business and industry landscape\n\n**8**\n\nMid-term exam and extra speaker topic\n\n**9**\n\nTopic about tele-medical, virtual classroom\n\n**10**\n\nPart III: International strategy management - Strategy setting and implementation\n\n**11**\n\nEntry strategy and organizational structures\n\n**12**\n\nRisk and government issues\n\n**13**\n\nPart IV: Organizational behavior and human resource management - employee motivation\n\n**14**\n\nLeadership across cultures\n\n**15**\n\nHiring and employee development across cultures\n\n**16**\n\nPre-visiting topic and preparation\n\n**17**\n\nCompany visiting\n\n**18**\n\nFinal report presentation",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": "Individual Case Study Write-up & Team Assignment  : (30 %) \n-\tIndividual student will be assigned 2 business cases study and answer the questions attached for the case , Each one needs to submit case study write up before that case class discussion session starts. ( 20%)\n-\tEach team will be assigned to complete B2C Solution Proposal and need to submit the proposal at session #14.( 10% )"
        },
        {
            "type": "期中考",
            "weight": 20,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "Active participate class discussion and provide insightful observation and contribution to the class sharing."
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Students will fail this class if he/she has 2 or more serious late attendance (10 mins) or absence."
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "Group Presentation Assignment: (60%)   \n-\t5 Students will be formed as one group and complete one group assignment.\n-\tEach team will present their proposal of Asia Pacific globalization plan\n-\tGroup presentation evaluation criteria will be divided into 3 parts: \n\tContent Value (20%), \n\tTeam Work Spirit (20%) \n\tand Presentation Skill (20%)"
        }
    ],
    "prerequisite": "",
    "general_core": []
}