{
    "year": 107,
    "term": 2,
    "name": "科技史專題研究",
    "teachers": [
        "游光昭"
    ],
    "department": "HD71",
    "code": "ITD0034",
    "credit": 3,
    "serial": 1099,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 5
    },
    "schedule": [
        {
            "day": 2,
            "from": 16,
            "to": 11,
            "campus": "本部",
            "classroom": "科313"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "Using intensive readings and seminar discussions, we will explore the mutual shaping understanding of philosophy and history of technology and their relationships with technology education. This course will consider the way in which technology has contributed to the building of world-wide civilization. Meanwhile, reading and discussions will focus on how to teach history of technology into the program of technology education at K-12 levels.",
    "goals": [
        "To become knowledgeable about the impact of technology and its influences on world civilization.",
        "To provide an open, neutral forum for the discussion of history of technology in technology education",
        "To increase the knowledge about the literature in history of science and technology",
        "To improve the oral and written communication skills of the learner, including logical, factual based argumentation"
    ],
    "syllabus": "Week\n\n###### Tentative Schedule\n\n1\n\n Course Overview & Introduction\n\n2\n\nTopic: Philosophy of Technology\n\n3\n\nTopic: Philosophy of Technology\n\n4\n\nTopic: History of Technology Education\n\n###### 5\n\nTopic: History of Technology Education\n\n###### 6\n\nTopic: The STS Movement\n\n###### 7\n\nTopic: The STS Movement\n\n8\n\nTopic: System of Technology\n\n9\n\nTopic: System of Technology\n\n10\n\nTopic: History of Technology\n\n11\n\nTopic: History of Technology\n\n12\n\nTopic: Content of Technology\n\n13\n\nTopic: Content of Technology\n\n###### 14\n\nManuscript Report and Discussion\n\n15\n\nManuscript Report and Discussion\n\n16\n\nManuscript Report and Discussion\n\n17\n\nManuscript Report and Discussion\n\n18\n\nFinal Exam.",
    "methodologies": [
        {
            "type": "講述法",
            "note": "講述科技發展歷程"
        },
        {
            "type": "討論法",
            "note": "討論科技發展與社會發展的關係"
        },
        {
            "type": "專題研究",
            "note": "科技技術的專題研究"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 35,
            "note": "A journal article manuscript will be prepared and submitted to a journal. The article may focus on the relationship between history of technology and technology education. The manuscript should be between 10,000 to 15,000 words. Each student needs to make a 50-minute presentation with an appropriate visual aid in class at the scheduled time."
        },
        {
            "type": "課堂討論參與",
            "weight": 35,
            "note": "The class will depend upon and require active participation in discussions. Periodically, you will be responsible for giving a report on the weekly reading and the relevant literature."
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "Students will write book/paper reports for the reading in class. A book report should accomplish three things: first, it should summarize the author`s main argument and narrative structure; second, it should place this work within the literature on this subject; and third, it should offer some critical assessment of the book`s strengths and weaknesses."
        }
    ],
    "prerequisite": "",
    "general_core": []
}