{
    "year": 107,
    "term": 2,
    "name": "體育（有氧舞蹈）",
    "teachers": [
        "于文蕙"
    ],
    "department": "PE",
    "code": "00UP024",
    "credit": 1,
    "serial": 2440,
    "group": "C",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "大韻律教室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "一、培養基本體能、身體律動及協調性，以促進良好體適能。  二、從身體活動中獲得運動的樂趣，進而培養運動興趣。  三、培養同儕之間的友誼，拓展良好人際關係。  四、藉由動、靜態的身體活動，能深入感受身體狀態及放鬆身心。",
    "goals": [
        "培養基本體能、身體律動及協調性，以促進良好體適能。",
        "從身體活動中獲得運動的樂趣，進而培養運動興趣。",
        "培養同儕之間的友誼，拓展良好人際關係。",
        "藉由動、靜態的身體活動，能深入感受身體狀態及放鬆身心。"
    ],
    "syllabus": "**●有氧舞蹈●**\n\n**※ 教學目標：**\n\n一、培養基本體能、身體律動與協調性，促進良好的體適能，並從身體活動中獲得運動的樂趣，進而培養運動興趣。  \n二、透過老師動作示範解說及參考DVD教學帶學習有氧基本舞步，術語和簡易編排，提升學生自信心，體會舞蹈的樂趣，藉由動、靜態結合的身體活動，能深入感受身體狀態及放鬆身心。  \n三、透過彼此分享生活百態，促進彼此交流互動，同時訓練同學的舞台魅力，面對人群時表現自我的能力，凝聚班上同學情感，學會更加珍惜身邊的人事物，遠離冷漠社會，投入溫馨懷抱。  \n四、培養同儕之間的友誼，拓展良好人際關係，希望學生在學習基本舞步後，能在期末自行發揮創意排列組合自創出4個8拍的舞步，並以合作拍成MV的方式作為期末檢核與分享。  \n五、結合現代的科技，讓學生思考如何與有氧舞蹈做結合，並將運動、健康以及歡樂持續傳遞、永續經營。  \n六、培養學生的責任心，從學校開始養成負責敬業的精神與態度。\n\n**※ 每週教學進度：**\n\n一、每週將有不同的主題，將有氧舞蹈與各種舞風融合，依學生的進度，帶給同學不只是有氧舞蹈，而是多元的認識舞蹈，以此開發肢體、培養運動樂趣。  \n二、複習前一週的組合動作，並與當週新的進度融合。  \n三、每週開放自願或抽點的方式讓同學上台分享生活中的喜怒哀樂，從中學習、得到感動。  \n四、學期中將有兩次的考試或隨堂的即興考試，包括個人上台示範教學呈現，特殊才藝表演等。  \n五、每週會請同學自編創意動作呈現。  \n\n**※ 教學方法：**\n\n一、講解有氧舞蹈基本動作步伐，術語和注意事項，以多元化混合式有氧舞蹈帶領同學學習有氧舞蹈。  \n二、透過分組的方式，使同學通過討論的過程中彼此交流，達到腦力激盪的效果。  \n三、結合科技使有氧舞蹈能有更多元化的形式呈現。  \n四、以嚴格規定請假規則的方式培養學生敬業的態度。  \n五、結合情境式的戲劇表演拓展學生舞台魅力。 \n\n**※ 作業規劃：**\n\n一、每週會有小組作業，以當週上課內容為基準，將舞蹈動作重新排列組合，並加入自編新動作，於下週上課時輪流上台表演。\n\n二、為了讓同學能打開自己的身心靈，將於期中做出一份報告，需在戶外拍攝結合舞蹈動作的三張照片，並寫下當下的感受，拓展學生感知上的敏銳度。  \n三、期末則以分組拍攝MV的方式向大家分享本學期所學，結合舞蹈、音樂及多媒體的藝術呈現。\n\n**※評量方法與標準**  \n◆出缺席率 50 ％  \n◆心得作業報告 10 ％  \n◆課堂個人練習呈現 20 ％  \n◆期末MV團隊呈現 20 ％  \n◆無故缺席3次以上，該科目不及格  \n◆請準時繳交作業，逾期則不收件  \n**※** **注意事項**  \n1\\. 上課請穿乾淨的運動鞋，務必穿著輕便運動服裝、攜帶毛巾與水。  \n2\\. 請準時出席，避免因遲到而影響其它同學。  \n3\\. 請假請以學校規定之正常程序辦理，假單請於請假日後一星期內繳交。  \n4\\. 課程內容會依學生實際狀況進行彈性調整。  \n5\\. 分組練習和呈現請發揮團隊精神及創意巧思。  \n**※****參考書目：于文蕙老師的書籍和DVD教學**",
    "methodologies": [
        {
            "type": "講述法",
            "note": "有氧舞蹈基本步伐動作，術語和注意事項"
        },
        {
            "type": "討論法",
            "note": "分組討論再一一呈現"
        },
        {
            "type": "實驗/實作",
            "note": "錄影教學"
        },
        {
            "type": "其他",
            "note": "戶外舞蹈肢體動作作業及心得呈現"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 10,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "課堂個人呈現"
        },
        {
            "type": "出席",
            "weight": 50,
            "note": ""
        },
        {
            "type": "成果展覽",
            "weight": 20,
            "note": "期末MV分組呈現"
        }
    ],
    "prerequisite": "",
    "general_core": []
}