{
    "year": 108,
    "term": 1,
    "name": "運動與媒體",
    "teachers": [
        "宮泰順"
    ],
    "department": "AU32",
    "code": "FPU0050",
    "credit": 2,
    "serial": 129,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 4,
            "from": 1,
            "to": 2,
            "campus": "公館",
            "classroom": "Ｅ101"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "運動與媒體新聞是每個人每天、甚至每小時、每分鐘都接觸到的東西，與日常生活息息相關，本課程在於協助同學了解運動與媒體的關係，進而將運動與媒體互動、運動新聞與媒體傳播結合，透過理論與實際教學過程，讓同學能學習到運動傳播的理論，並熟悉運動新聞之寫作和閱讀、鑑賞之能力及與媒體的運作關係，期能將來投身運動媒體工作。\n\n1-2 討論課程內容，講授運動與媒體傳播概念\n\n3-4 運動新聞、媒體傳播與生活的關係、互動情形及發展\n\n5-6 運動與媒體在生活的重要性，對體育發展的影響性\n\n7-8 運動媒體的種類、型態及其運作、功能。\n\n9-10 運動新聞在各種媒體的展現與風貌，運動組織與媒體發展\n\n11-12 各媒體的運動新聞製播觀念和技巧\n\n13-14 田徑、游泳、舉重、射擊、射箭有客觀運動成績標準競賽之媒體呈現及製作\n\n15-16 球類運動與媒體節目製播\n\n17-18 綜合討論",
    "goals": [
        "透過課程教學，協助同學了解運動與媒體的關係，進而將運動與媒體互動、運動新聞與媒體結合",
        "以實際教學過程，配合理論，讓同學學習到運動傳播理論，並熟悉運動新聞之寫作和閱讀",
        "每週配合時事、新聞，加強同學對運動與媒體發展的了解，加強鑑賞之能力和學養，培養未來投身媒體工作的興趣與能力",
        "期望透過學習，同學能實際增強運動新聞採訪之技巧，除了運動的天賦外，培養能成為運動與媒體界的尖兵，從事運動傳播工作"
    ],
    "syllabus": "**1-2 討論課程內容，講授運動與媒體傳播概念  \n  \n3-4 運動新聞、媒體傳播與生活的關係、互動情形及發展  \n  \n5-6 運動與媒體在生活的重要性，對體育發展的影響性  \n  \n7-8 運動媒體的種類、型態及其運作、功能。  \n  \n9-10 運動新聞在各種媒體的展現與風貌，運動組織與媒體發展  \n  \n11-12 各媒體的運動新聞製播觀念和技巧  \n  \n13-14 田徑、游泳、舉重、射擊、射箭有客觀運動成績標準競賽之媒體呈現及製作  \n  \n15-16 球類運動與媒體節目製播  \n  \n17-18 綜合討論  \n**",
    "methodologies": [
        {
            "type": "講述法",
            "note": "講述運動媒體傳播學術理論、概念，並透過每週發生運動媒體相關新聞及事件和學生討論，以增強學生對運動與媒體的互動的認識，並透過運動媒體新聞的寫作、閱讀，熟悉運動與媒體的運用和技巧"
        },
        {
            "type": "討論法",
            "note": "每週和學生討論最新發生的運動媒體新聞，印證和運用課堂所學的理論和技巧，透過討論加深學生的學習和認識，以期將來能活用上課所學之理論和技巧"
        },
        {
            "type": "問題解決教學",
            "note": "每次上課和學生適時溝通該週內所發生的重大運動新聞、事件之認識，並對學生所提出疑問和問題討論和解決"
        },
        {
            "type": "合作學習",
            "note": "透過學生實地操作媒體如寫新聞、製作媒體節目，瞭解運動媒體的運作及相輔相成之依附關係"
        },
        {
            "type": "實驗/實作",
            "note": "課堂適時請同學就所學課程進行習作，並透過考試寫新聞或製作節目達到教學目的及目標"
        },
        {
            "type": "實地考察、參訪",
            "note": "配合時事，利用學生上課空檔參觀運動比賽，或以報章、雜誌、電視報導為題材進行閱聽討論"
        },
        {
            "type": "媒體融入教學",
            "note": "提供媒體報導及事例，融入教學，以加深學生認識，採機會教育方式教導學生學以致用，靈活運用平日所學習之理論及技巧"
        },
        {
            "type": "專題研究",
            "note": "提出專題和學生討論，交換意見和觀念交流，以達教學目標"
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 30,
            "note": "依照學校規定學期一半時，以考試了解學生上課學習和接受程度，以作為往後教學改進之參考"
        },
        {
            "type": "期末考",
            "weight": 30,
            "note": "學期總測驗學生整個學期所學，以作為學生評量成績之依據，並作為下學期教學改進之參考"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "重視課堂與學生之討論，以充分瞭解學生對課程了解和學習接受之程度，並作為評分之參考"
        },
        {
            "type": "出席",
            "weight": 20,
            "note": "每週上課點名，以鼓勵和提升學生勤學，並確保出席同學之權益和評分之公平性，並 由點名可了解缺席學生沒有聽到該週課程內容，以作教學補強"
        }
    ],
    "prerequisite": "",
    "general_core": []
}