{
    "year": 111,
    "term": 1,
    "name": "公民專題實作",
    "teachers": [
        "曾冠球"
    ],
    "department": "EU07",
    "code": "CEU0489",
    "type": "選",
    "grade": 4,
    "credit": 3,
    "serial": 851,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 0,
            "to": 0,
            "campus": "本部",
            "classroom": "教室自排"
        },
        {
            "day": 5,
            "from": 0,
            "to": 0,
            "campus": "本部",
            "classroom": "教室自排"
        },
        {
            "day": 6,
            "from": 0,
            "to": 0,
            "campus": "本部",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限本系(含雙主修)修習◎限大三大四修習◎第一階段需人工加選◎第二階段需人工加選◎加退選階段需人工加選",
    "form_s": "4",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "本課程名稱為「公民專題實作」，預定開設於大四上學期。\n本課程開設目標被視為達成Capstone Course「總整課程」之目的，讓學生在就業或升學前整合各門課程所學，將過去的所學累積，藉由實作一個專題或小論文，或發起公民行動方案實作，或進行產業實習等方式，將歷來所學應用在實務操作中，作一具體而完整的呈現。並且從做中了解自身的專長加以發揮，同時檢視自己從中獲得的核心能力，以及反思自我的不足而予以補強，作為邁向下一個階段的準備。\n因此，本課程目標旨在讓學生掌握大學所學基礎課程，以自我主動學習及解決問題為導向進行整合，而非單純教導學生最新的專業知識，或基本應具備的專業技能。強調培養學生從專題、行動方案或實習等過程中獲得「公民專業知能與社會及產業結合」的跨界力養成，以作為未來就業及升學的重要基礎。故此課程的設計規劃，必須能讓學生習得符合職場所需之技能與態度，強化學生未來投入職場之高度優勢。",
    "goals": [
        "磨練問題與解決能力：教導學生能善用科學管理之知識發掘並定義問題，整合有效資源並能有效運用知識與工具以解決問題。",
        "培育創新與實踐能力：激勵學生勇於創新並多方嘗試與驗證，完成作品並公開展示，累積成功經驗與自信心。",
        "建立永續學習之習性：教導學生依實務需求，主動尋求知識與解決途徑，自我學習並嘗試具體實踐。",
        "鍛鍊溝通與表達能力：藉分組討論與書面報告、口頭報告的練習，養成學生有效溝通與表達之能力。",
        "養成團隊與合作能力：培養學生於專業團隊中積極貢獻、相互信賴並發現自我角色與價值。"
    ],
    "syllabus": "本課程名稱為「公民專題實作」，預定開設於大四上學期。 本課程開設目標被視為達成Capstone Course「總整課程」之目的。「總整課程」係指依據本系核心能力之規劃，提供大學部高年級學生整合與深化大學所學，以接軌未來研究或職涯發展之課程。換言之，本課程試圖讓學生在就業或升學前整合各門課程所學，將過去的所學累積，藉由進行產業實習、公民行動方案、或科技部大專生專題實作 等方式，將歷來所學和生活經驗應用在實務操作中，作一具體呈現。並且從實作中了解自身的專長加以發揮，同時檢視自己從 中獲得的核心能力，以及反思自我的不足而予以補強，作為邁向下一個階段的準備。 因此，本課程目標旨在讓學生掌握大學所 學基礎課程，以自我主動學習及解決問題為導向進行整合，而非單純教導學生最新的專業知識或技能。強調培養學生從專題、 行動方案或實習等過程中獲得「公民專業知能與社會及產業結合」的跨界力養成，以作為未來就業及升學的重要基礎。本課程的目的，希望能讓學生體驗符合職場所需之技能與態度，強化學生未來投入職場之高度優勢。\n\n授課內容可能包含但不限於以下主題\n\n1.  師生認識與課程簡介\n2.  何謂專題：專題的定義及規範 講授、分組活動\n3.  專題製作步驟和選題說明：講授、媒體教學、實作\n4.  專題製作方向擬定：個別或小組指導\n5.  專題演講：跨界力公民專題演講、討論\n6.  研究方法：研究方法簡介/了解選擇適合的研究方法 講授、個別或小組指導\n7.  資料收集：資料蒐集及分析/熟悉各種資料蒐集方法及分析 講授、個別或小組指導\n8.  專題寫作要點：專題寫作的注意事項/了解寫作專題的規則 講授、媒體教學、個別或小組指導\n9.  小論文/實務專題計畫初稿討論修正：初稿修正 討論、個別或小組指導\n10.  小論文/實務專題計畫呈現(一)： 各組專題呈現/分享各組專題並評析他組專題 討論、小組報告、心得發表\n11.  小論文/實務專題計畫呈現(二)： 各組專題呈現/分享各組專題並評析他組專題 討論、小組報告、心得發表\n12.  小論文/實務專題計畫初稿討論修正(一) 討論、個別或小組指導\n13.  小論文/實務專題計畫初稿討論修正(二) 討論、個別或小組指導\n14.  小論文/實務專題計畫報告(一) 小組報告、討論\n15.  小論文/實務專題計畫報告(二) 小組報告、討論\n16.  小論文/實務專題計畫成果展示：各小組報告、成果展示活動",
    "methodologies": [
        {
            "type": "實驗/實作",
            "note": "產業實習"
        },
        {
            "type": "實地考察、參訪",
            "note": "產業實習"
        },
        {
            "type": "專題研究",
            "note": "小論文撰寫發表"
        }
    ],
    "grading": [
        {
            "type": "出席",
            "weight": 30,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 70,
            "note": "將實習結果做一期末報告；執行大專生專題計畫者分享計畫申請心得與執行成果內容"
        }
    ],
    "prerequisite": "",
    "general_core": []
}