{
    "year": 109,
    "term": 1,
    "name": "健康教育（健康與護理）課程設計",
    "teachers": [
        "高松景"
    ],
    "department": "EU05",
    "code": "HEU0176",
    "credit": 2,
    "serial": 788,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 2,
            "from": 8,
            "to": 9,
            "campus": "本部",
            "classroom": "正103"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "3",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本科目在引導學習者認識課程設計的原理與方法、了解我國健康教育課程的發展、分析健康教育（健康與護理）課程的目標、教學與評鑑，進而增進九年一貫「健康與體育學習領域」和高中職「健康與護理」課程設計能力，並培養專業的課程素養與態度。",
    "goals": [
        "學生能探究與理解國內外健康教育（健康與護理）課程的演變過程，以建立清晰的健康教育課程設計理念",
        "學生能瞭解十二年國教健康教育課綱的理念，進而能理解素養導向健康教育課程與單元教學設計",
        "學生能認識十二年國教課綱強調跨領域統整性主題探究課程，進而能理解跨領域健康教育課程設計",
        "透過典範學習及實作發表等共同備課模式，提昇學生能運用所學健康教育課程設計理念與知能，創新健康課程設計與健康教學。"
    ],
    "syllabus": "一、課程名稱：健康教育（健康與護理）課程設計\n\n二、課程簡介\n\n課程（curriculum）原意是跑道，引申為學習經驗。國內中小學課程的演變：從民57年國民義務教育「知識本位」的課程標準，演變到九年一貫「能力本位」的課綱，再深化到十二年國教「素養導向」的課綱。「健康教育」是一門跨領域的生活課程，目前是在108新課綱「健康與體育領域」中的一個科目，在國小及國中階段科目名稱是「健康教育」，在高中階段科目名稱是「健康與教護理」。\n\n健康教育課程是在學校的場域透過教育的方法，將促進健康的知能給學生，讓他們能培養出健康的態度，進而建立個人與社會所需要的健康行為，成為一個具有「健康素養」的人，來增進自己的健康。從健康教育學科本質而言，為達成培養學生健康行為，健康教育課程與教學的理論基礎除了「教育專業知識」（例如：課程設計、教學原理..）及「健康教育學科專門知識」（例如：性教育、藥物教育..）外，也需要運用到「健康行為科學」、「健康促進學校模式」及「健康生活技能」等健康教育共同專業知識，更需要將建立於理論並結合教學實務焠煉所獲得的「健康教育學科教學知識」（Practical Content Knowledge,簡稱PCK）（例如：健康教育課程設計、健康教育教材教法、健康教育教學實習..等）\n\n本課程之目的，在幫助學生瞭解十二年國教課綱的內涵與精神，以及理解十二年國教健康教育新課綱之系統架構。延伸師培「課程發展與設計」教育專業知識，聚焦如何整合運用健康教育課程理論基礎（健康行為科學、健康素養、健康促進學校模式及健康生活技能）到健康教育課程設計，讓學生能夠充份瞭解與精熟整體國中三年及高中三年的健康教育課程設計，以及大單元與小單元的教學設計，並探討養導向的健康教育（健康與護理）的課程與教學設計有哪些要領呢？十二年國教強調跨領域課程設計，健康教育如何與各科進行跨領域課程設計呢？期能激發學生對成為一位專業健教老師的熱忱與使命。\n\n本課程教學法係以學習者為中心，在探究、發表、論證、與實作中淬練學生成為協作性的學習者；在理論與教室教學實務之間，引導學生後設性思考，期望學生成為具備知識、理解、實作能力與反思能力的未來師表。\n\n**三****、****教學進度與主題**\n\n1.09月15日：相見歡、課程簡介、作業與評量說明\n\n2.09月22日：健康教育課程設計基本概念（一）課程的意義、課程設計理論與模式、課程設計的四個要素、「逆向式課程設計」（UbD）\n\n3.09月29日：健康教育課程設計基本概念（二）我國健康教育課程的演變（邀請現場老師分享）\n\n4.10月06日：健康教育課程設計基本概念（三）十二年國民教育課程綱要核心素養的意義與實踐：總綱與健康與體育領綱的解讀\n\n5.10月13日：健康教育課程設計基本概念（四）健康教育領綱的解讀與運用\n\n6.10月20日：健康教育課程設計基本概念（四）健康教育領綱的解讀與運用\n\n7.10月27日：素養導向健康教育課程與教學設計（一）：核心概念與提問設計（分組導讀與實作）\n\n8.11月03日：素養導向健康教育課程與教學設計（二）：情境脈絡化的設計（分組導讀與實作）\n\n9.11月10日：素養導向健康教育課程與教學設計（三）：以生活技能為本位的課程與教學設計（分組導讀與實作）\n\n10.11月17日：素養導向健康教育課程與教學設計（四）：運用健康行為科學的課程與教學設計（分組導讀與實作）\n\n11.11月24日：素養導向健康教育課程設計小組實作：健康教育課程設計思考架構表\n\n12.12月01日：實地學習：健康教育雙語教學（到台北市誠正國中進行觀課與議課,瞭解如何用英語教學, 觀課與議課以及如何自編健康教育課程）\n\n13.12月08日：分享素養導向健康教育課程設計：設計理念、課程架構、課程重點（邀請現場老師來課堂分享）\n\n14.12月15日：素養導向健康教育課程設計小組實作：設計理念、課程架構、課程重點\n\n15.12月22日：校本與跨領域健康教育課程設計\n\n16.12月29日：健康教育（健康與護理）課程設計發表與討論\n\n17.01月05日：健康教育（健康與護理）課程設計發表與討論\n\n18.01月12日： 課程結束",
    "methodologies": [
        {
            "type": "講述法",
            "note": "學生配合講述，研讀指定閱讀資料"
        },
        {
            "type": "討論法",
            "note": "學生針對小組和全班討論題目踴躍參與並發表"
        },
        {
            "type": "問題解決教學",
            "note": "學生針對不同議題健康教育教學的重要核心概念和技能提出疑慮，思考和選擇可能解決方式，進而檢討與確認"
        },
        {
            "type": "合作學習",
            "note": "學生分組合作學習進行分組導讀與實作"
        },
        {
            "type": "實驗/實作",
            "note": "學生分組就選擇的健康教育議題，在教師引導下，進行課程設計實作與發表"
        },
        {
            "type": "實地考察、參訪",
            "note": "到學校進行觀課"
        },
        {
            "type": "其他",
            "note": "學生閱讀教育專書及撰述心得、蒐集現職教師之實務經驗"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "課堂作業是配合課堂主題探討時,有重要課程設計主題，學生撰寫課堂\n   心得與摘要，課堂參與討論,以及到校外進行觀課的觀課記錄與反思作\n   業。小考是配合重要上課主題所進行的紙筆測驗（會有1-2次）"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "積極參與和發表個人看法"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "分組導讀與實作【分組任務一】（20%）口頭報告PPT\n配合實地學習時數認證，負責導讀該素養導向健康教育課程與教學設\n計主題，需到學校去訪談健康教育現場教師如何進行。"
        },
        {
            "type": "專題",
            "weight": 30,
            "note": "健康教育（健康與護理）課程設計【分組任務二】（30%）（自評與互評）\n   各組先分析整理現行教科書及十二年國教健康與體育課綱，選訂某健\n   康議題，並選訂學生年齡層進行課程設計。期末進行口頭報告（採說\n    課方式），並繳交課程設計書面報告（詳細格式會再提供）。"
        },
        {
            "type": "其他",
            "weight": 10,
            "note": "期末整體學習心得（詳細格式會再提供）"
        }
    ],
    "prerequisite": "",
    "general_core": []
}