{
    "year": 109,
    "term": 1,
    "name": "性教育",
    "teachers": [
        "高松景"
    ],
    "department": "EU05",
    "code": "HEU0014",
    "credit": 3,
    "serial": 777,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 8,
            "to": 10,
            "campus": "本部",
            "classroom": "誠305"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎必須先修過(也可以同時修)【HEU0156  健康促進與衛生教育導論】",
    "form_s": "3",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "本課程之目的，在幫助學生瞭解性教育的概略內涵，養成學生對性教育應有正確認識與興趣，進而成功地扮演一位可教導青少年「性問題」的老師。",
    "goals": [
        "能正確地認識自己及青少年在性心理、生理、社會各方面成熟的過程。",
        "能養成正確地觀念，逐漸消除社會上因「性」所產生的病態行為",
        "能自由地交換彼此的心得、意見和解決問題的方法"
    ],
    "syllabus": "一、課程名稱：性教育\n\n二、課程簡介：\n\n 「全人性教育」（sexuality education）是我國當前108「健康與體育領域課綱」中「性教育」主題的課程理念,其強調性教育是一種「愛的教育」，係在教導「健康親密關係」；也是一種「品格教育」，係要支持美滿家庭生活，教導為自己性行為負責的教育，其教導重點不只是「性知識」，而是與性有關的「價值」，以及實踐價值所需要的「能力」：更是一種「生命教育, 是要發揚「人性」, 教人成「人」。\n\n    性教育的理論基礎主要來自「人類性學」與「教育學」，性教育的實務依實施對象來分為「家庭性教育」、「學校性教育」與「社會性教育」。人類性學sexology的發展帶動人類三次「性革命」，性革命/性開放對社會帶來了正反兩面的衝擊，而性教育的實施也愈來愈受到各國重視。人類性學對性的概念已從Sex擴大為Sexuality，性教育的實施也從原本消極的預防少女懷孕、預防性病（含愛滋病）、預防性侵害性騷擾，到追求「性健康促進」Sexual Health Promotion，1999年世界性學會倡議：接受性教育是基本人權。\n\n    本課程之目的，在幫助學生能瞭解性教育的發展脈絡，以建立清晰的學科概念, 進而探究當前國內性教育重要的議題；來解讀108性教育的課綱內容, 培養學生生有能力教導青少年性教育議題的優質教師。\n\n    本課程教法係以「學習者為中心」的教學策略，強調「探究與對話」、「體驗與反思」，教學方法多元。此外,為配合108素養導向教學強調教學應與學習者生活經驗連結, 整個課程與教學設計主要是運用「問題導向學習」（problem-based learning, PBL），並結合四類探究教學（結構式探究、控制式探究、引導式探究、開放式探究）來設計「情境化脈絡化」問題, 以循序漸進以引發學習者主動探究。本課程教材內容選擇上將聚焦於大學生成長任務的「愛情」課題, 期能同時也培養學生具有經營健康親密關係所需要之「愛的能力」，並產生學習遷移，將來到中學教學現場能加以活用。\n\n三、教學進度與主題\n\n1.9/16課程介紹-探究性教育的意涵、重要性及當前國內實施困境\n\n2.9/23性教育基本觀念（一）：婚姻制度會消失嗎？「性」是什麼？從人類性學談「性革命」（金賽性學教室影片賞析）（配合閱讀第一章性、兩性關係與性教育）\n\n3.9/30性教育基本觀念（二）：人類性學的發展--從「Sex」到「Sexuality」（配合閱讀第一章性、兩性關係與性教育）（期中小組導讀主題的分配）\n\n4.10/7性教育基本觀念（三）：為何需要實施性教育呢？從性教育的發展談「全人性教育」（配合閱讀第十二章學校性教育）（參訪財團法人杏陵醫學基金會）\n\n5.10/14性教育基本觀念（四）：我們需要怎樣的性別意識呢？從國內近年與性相關教育議題談「全人發展」的性別平等教育（導入PBL）\n\n6.10/21性的生理層面：我們需要具備哪些性知識呢？探究男、女性生理、懷孕、避孕、人類性反應、性功能障礙（配合閱讀第二章男、女性生理與懷孕、避孕）\n\n7.10/28如何引導青少年的性好奇與性探索（風月俏佳人影片賞析）\n\n8.11/4探討當前青少年性困擾、性問題與性教育需求 （開放空間會議+世界咖啡館）（期末PBL小組討論所要探討的性教育主題及設計問題陳述）（介紹素養導向教學）\n\n9.11/11性教育議題：臺灣是愛滋共合國？愛滋病及其他性病【小組導讀第四章愛滋病及其他性病」】（邀請愛滋病帶原者來課堂對話）\n\n10.11/18性的心理層面：以人數多寡來判斷性行為是否正常, 適切？性心理、同性戀、性偏差行為、性少數、性侵害（配合閱讀第五章性心理、同性戀與性偏差行為）（怒燄狂花影片賞析）\n\n11.11/25性的社會層面：性別角色、與「性」相關的法律、媒體與性（探討色情媒體）、性與社會文化【小組導讀第六章性別角色】（各組進行PBL第二階段「分析問題」報告）\n\n12.12/2性的心靈層面：人為何要結婚？探討「愛情學」【小組導讀第九章「婚姻與家庭」及第十章「婚姻的變相」】（即席辯論賽）\n\n13.12/9.愛情學議題（一）如何開始一段關係呢？當情人或朋友的做決定、情感表達與拒絕的生活技能【小組導讀第七章「兩性交往--約會、戀愛、擇偶】（PBL、以生活技能為主的教學法）\n\n14.12/16愛情學議題（二）愛情是怎麼發生的呢？為何要談戀愛呢？從親密關係發展歷程探討「愛情設計原理」【分組合作學習--拼圖法】\n\n15.12/23愛情學議題（三）為何對方總是不瞭解我？戀愛的溝通課題（「協商」分手與情感失落的「自我調適」）【互動式遊戲教學+桌遊】\n\n16.12/30愛情學議題（四）愛情選擇題--性行為的抉擇（以「品格」為導向的性教育教學法）（辯論）（小組導讀第八章「婚前親密關係」）\n\n17.1/6學校性教育—性健康促進學校（邀請健康教師分享性教育課程設計與創新教學）\n\n18.1/13期末成果分享：小組PBL結案口頭報告",
    "methodologies": [
        {
            "type": "講述法",
            "note": "配合學習單並ppt簡報，有系統論述性教育的核心概念、次概念及性教育主題重要內容"
        },
        {
            "type": "討論法",
            "note": "依教學目標，適切採取六六討論法、小組討論等方法，以促進學生間互動、對話，交流觀點"
        },
        {
            "type": "合作學習",
            "note": "採學習共同體的小組協同學習及分組合作學習PBL，針對爭議性的性教育議題進行觀點交流與觀點取替，來促進學生對話與學習。"
        },
        {
            "type": "實驗/實作",
            "note": "採問題導向學習PBL提供學生探究性教育議題,採小組自\n主學習,找到適當解決策略"
        },
        {
            "type": "實地考察、參訪",
            "note": "到教育現場採訪教師性教育教學議題"
        },
        {
            "type": "媒體融入教學",
            "note": "播放DVD、影片、自製PPT等輔助媒體"
        },
        {
            "type": "其他",
            "note": "邀請性教育議題相關的各領域專家擔任資源人物，來到課堂與學生做面對面對話。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 25,
            "note": "配合課堂進行學習單撰寫、影片觀後心得（共有三次），以及1-2次課堂小考。\n模擬約會—踏出大學生感情生活的第一步（詳見附件、11/25前繳交）"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "學習的產生來自於彼此聆聽、對話與分享，因此課堂的參與討論是課堂美麗風景的呈現"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "期中小組導讀報告"
        },
        {
            "type": "專題",
            "weight": 20,
            "note": "採小組進行3-4位一組，透過問題導向學習（PBL）選擇有興趣想深入探究的性教育問題探究（ex.中學性教育課程設計、社會爭議的性教育議題探究、大學生感情問題與感情教育需求），運用所本學期的性教育理念與實務（請同學回歸性教育是一種「愛的教育」，教導健康親密關係，也是一種「品格教育」），詳細規劃與格式另討論。"
        },
        {
            "type": "其他",
            "weight": 15,
            "note": "期末個人整體學習心得15%（報告格式老師提供、7/5前繳交）"
        }
    ],
    "prerequisite": "◎必須先修過(也可以同時修)【HEU0156  健康促進與衛生教育導論】",
    "general_core": []
}