{
    "year": 109,
    "term": 2,
    "name": "分子營養學",
    "teachers": [
        "蘇純立"
    ],
    "department": "SU51",
    "code": "NSC9002",
    "credit": 2,
    "serial": 2994,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 1,
            "to": 2,
            "campus": "本部",
            "classroom": "誠101"
        },
        {
            "day": 4,
            "from": 1,
            "to": 2,
            "campus": "本部",
            "classroom": "誠101"
        }
    ],
    "programs": [],
    "comment": "◎數位課程 密集授課。",
    "restrict": "",
    "form_s": "",
    "classes": "9",
    "dept_group": "",
    "hours": 2,
    "description": "This is a co-taught course among Mississippi State University (MSU), National Taiwan University (NTU), National Pingtung University of Science and Technology (NPUST), and National Taiwan Normal University (NTNU). Faculty and students in these universities will participate in the course via videoconferencing. The emerging discipline of molecular nutrition encompasses nutritional biochemistry, nutritional genomics, nutritional metabolomics, and epigenetics. The course focuses on the effects of diet and nutrients on an individual’s genome and metabolism, and how the molecular events affect human health. This course is a lecture course designed to acquaint senior undergraduate and graduate students with current concepts, knowledge and strategies for understanding molecular nutrition.",
    "goals": [
        "The student will know the areas of molecular nutrition.",
        "The student will learn the mechanisms by which nutrients and dietary components regulate gene expression at genomic, transcriptional, and translational levels",
        "The student will be familiar with the nutritional control on optimal human health",
        "The student will be aware of the impact of nutrients and dietary components on human genetic diseases"
    ],
    "syllabus": "**_COURSE DESCRIPTION_**\n\nSpring 2021: This is a co-taught course among Mississippi State University (MSU), National Taiwan Normal University (NTNU), and National Taiwan University (NTU). Faculty and students in these universities will participate in the course via videoconferencing. The emerging discipline of molecular nutrition encompasses nutritional biochemistry, nutritional genomics, nutritional metabolomics, and epigenetics. The course focuses on the effects of diet and nutrients on an individual’s genome and metabolism, and how the molecular events affect human health. This course is a lecture course designed to acquaint senior undergraduate and graduate students with current concepts, knowledge and strategies for understanding molecular nutrition.\n\nSpring 2021: February 23 to April 22; Tuesday and Thursday 8:00 AM-10:00 AM.\n\nClassroom: Room 101, Cheng Building, main campus of NTNU 校本部（和平東路一段162號） 誠101教室\n\n**_LECTURE TOPICS_** \n\n1.  2/23 Introduction (knowing each other and course introduction);   Molecular biology of selenium\n2.  2/25 Molecular nutrition and aging\n3.  3/2 Maternal nutrition\n4.  3/4 Nutrition programming and microbiota\n5.  3/9 Folate nutrition in cancer prevention and prognosis: from basic research to clinical application\n6.  3/11 Molecular anticancer mechanisms of nutraceutical compounds\n7.  3/16 **Group discussion-1** \n8.  3/18 **Group discussion-2** \n9.  3/23 Signaling transduction in cancer cell death by nutraceutical compounds\n10.  3/25 Amino acid metabolism\n11.  3/30 Nutrient excess and diabetes\n12.  4/1 **Group discussion-3** (Spring break of NTNU and NTU)\n13.  4/6 **Group discussion-4** (Spring break of NTNU and NTU)\n14.  4/8 Foodomics\n15.  4/13 Obesity and colon cancer\n16.  4/15 **Oral presentation-1**\n17.  4/20 **Oral presentation-2**\n18.  4/22 **Exam**",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "期末考",
            "weight": 50,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "Papers pertaining to the discussion will be distributed prior to the discussion. Reading the articles and participating in discussion are mandatory."
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "1. Each team will give a presentation. A team must be composed of students from both universities. A Facebook group site is generated for facilitating the international interactions. 2. Presentation: Background, methods, results, conclusion."
        },
        {
            "type": "其他",
            "weight": 20,
            "note": "1. The term paper can be based on the same subject of the presentation. Although the presentation is team-work, the term paper is written individually. 2. Due date: May 31, 11:59 PM. 3. Page limit: 10-12 pages of main text using the numerical style of references (e.g. 1-3, 4), figures included but references excluded. 4. Font: use Arial, Helvetica, Palatino Linotype, or Times New Roman, size 11 or larger 5. Type density: no more than 15 characters per inch, and no more than six lines per inch 6. Margin: one-half inch margins for all pages. 7. References: at least 10. At least 8 of them must be original research papers. 8. The paper should follow the style of the Nature Review series, containing abstract, main text with subtitles and conclusion remarks. “Boxes” and glossaries are not required. Figures and tables are not required but encouraged. An example to follow: http://www.nature.com/nrm/journal/v8/n5/pdf/nrm2161.pdf 9. Direct copy-and-paste from the World Wide Web in any forms is prohibited. 10. Based on a 100 point, deduction will be made should the followings occur: - Page numbers do not meet the guidance (2 points/page). - Font, type density, margin and reference requirements do not meet (2 points/item). - Less than 10 references cited (1 point/ reference) - Wrong citations (2 points/citation) - Typos, grammatical errors and nomenclature (up to 5 points total). - Lack of 1) clarity, 2) in-depth analysis and up-to-the-minute knowledge, and 3) future directions/perspectives (up to 5 points for each item)"
        }
    ],
    "prerequisite": "",
    "general_core": []
}