{
    "year": 107,
    "term": 2,
    "name": "逐步口譯（中譯英）（二）",
    "teachers": [
        "范大龍"
    ],
    "department": "LM25",
    "code": "TIM2004",
    "credit": 3,
    "serial": 1641,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 5,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "譯506"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限本系(含雙主修)修習 ◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "Consecutive interpreting (CI) is an important mode of interpreting commonly practiced by interpreters in Taiwan.  During CI, the interpreter sits at the same table with the delegates or at the speaker`s platform and interprets a speech into the target language after the speaker speaks.  The length of the speeches varies.  For this purpose the interpreter may take notes (see note-taking).  Therefore, the course focuses on improving the basic CI skills established in the previous semester.  Emphasis will be placed on improving note-taking skills and reformulating the ideas into appropriate target language.",
    "goals": [
        "Increase comprehension accuracy, especially in deciphering the often blurry Chinese messages.",
        "Improve note-taking skills and increase automaticity.",
        "Improve delivery and presentation."
    ],
    "syllabus": "一、課程簡介(Course Introduction)\n\n本課程目的在於訓練學生的中英文口譯能力。課程涵蓋廣泛內容。\n\nThis course is designed to provide students with training in aspects of Chinese-English interpretation. Course content will cover a wide range of subject matter.\n\n二、課程目標(Course Objectives)\n\n課程重點是幫助學生中英雙語運用自如，並糾正文法、發音上不良習慣，進而讓學習學生道地英文。\n\nEmphasis will be placed on issues unique to linguistic transfer between Mandarin Chinese and English, “unlearning” bad habits (grammatical, pronunciation, etc.), and learning natural spoken English.\n\n三、教材或參考書目(Teaching and Reference Materials)\n\n本課程使用的教材為演講以及報章雜誌等文章，不採用固定教科書。\n\nTeaching materials used in this course include speeches and newspaper and magazine articles. No book is required for this course.\n\n四、課程要求或評量方式(Course Requirements and Grading Method)\n\n成績核算標準為學生出席率、作業表現以及課堂參與程度。\n\nStudent grades will be based on attendance, homework, and class participation.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 40,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}