{
    "year": 107,
    "term": 2,
    "name": "書報討論（二）",
    "teachers": [
        "張雯"
    ],
    "department": "IM86",
    "code": "IWM0073",
    "credit": 1,
    "serial": 1405,
    "group": "",
    "quota": {
        "limit": 35,
        "additional": 19
    },
    "schedule": [
        {
            "day": 2,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "誠104"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎必須先修過【IWM0072  書報討論（一）】 ◎課程不開放上修",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "This course aims to develop students’ knowledge and skills regarding the field of human resource development and management. It provides a platform for students to discuss issues and research related to workplace. This course is delivered through an overview of past and current research that has being done in the related fields, and a series of activities such as speeches, student presentations, classroom activities, and group discussion.",
    "goals": [
        "describe new trends related to HR",
        "describe the competence of an HR professional",
        "exhibit a proactive attitude toward learning and service",
        "improve HR research skills",
        "improve HR professional skills"
    ],
    "syllabus": "This course prepares students for:  \n1\\. an overview of current research that is being done in the fields of workforce training, human resource development, and management, and 2\\. learning the ability or skill to:  \n\\-keep student update all the time  \n\\-observe the learning attitude of other people  \n\\-develop oral communication skills which will assist in future professional presentations  \n\\-evaluate different trends -react to different approaches -search the necessary information about study field  \n\\-summarize the essence of an article -summarize the development of a topic  \n\\-research and write a thesis proposal.\n\nThis course aims to develop students\\` knowledge and skills regarding workforce training, human resource development, and management. This course provides a platform for students to discuss issues related to learning in workplace. Through lecture, group discussion, field trips, and case study, this course helps enhance students competence in human resource development.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "實地考察、參訪",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        },
        {
            "type": "其他",
            "note": "Guest speech"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 25,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 25,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 20,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 30,
            "note": ""
        }
    ],
    "prerequisite": "◎必須先修過【IWM0072  書報討論（一）】",
    "general_core": []
}