{
    "year": 107,
    "term": 2,
    "name": "職涯管理與諮詢研究",
    "teachers": [
        "林怡君"
    ],
    "department": "IM86",
    "code": "IWM0048",
    "credit": 3,
    "serial": 1400,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 20
    },
    "schedule": [
        {
            "day": 2,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "誠104"
        }
    ],
    "programs": [],
    "comment": "如果本校大三大四學生想修此全英語授課課程，請找任課教師拿授權碼。",
    "restrict": "◎課程不開放上修",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "The purpose of this course is to provide students with the tools to be an effective career counselor, with the knowledge of the types and sources of occupational and educational information available, and how those resources can be used in the career counseling and decision making process. In that context, the dynamics of the changing labor market and its impact on personal, social, economic, occupational, and educational aspects of individuals and society will be studied. In addition, the importance of the needs of culturally diverse and special populations, the electronic delivery of occupational and educational information, and various career decision making theories will be discussed.",
    "goals": [
        "Understanding history, philosophy, and trends in career counseling",
        "Obtaining skills in career counseling processes, techniques and resources including those applicable to specific populations",
        "Learning the knowledge of career, vocational, educational, and labor market information resources, visual and print media, and computer-based career information systems",
        "Understanding career development program planning, organization, implementation, administration, and evaluation",
        "Understanding career development theories and decision-making models",
        "Learning roles, functions, and credentials of career counselors in a variety of settings and in relation to other professionals",
        "Understanding interrelationships among work, family, and other life roles and factors including multicultural and gender issues as related to career development",
        "Acknowledging the implications of sociocultural, demographic, and lifestyle diversity relevant to career counseling",
        "Applying assessment instruments, techniques, and intervention strategies relevant to career development, career planning and decision-making, and career counseling programs",
        "10.　Obtaining skills in computer based career development applications and strategies, including computer-assisted career guidance systems",
        "11.　Understanding current ethical and legal issues which affect the practice of career counseling"
    ],
    "syllabus": " \n\nWeek 1: 9.14 Overview and Introduction to Career Development Interventions\n\nWeek 2: 9.21 CD- HRD function\n\nWeek 3: 9.28 IHRD Conference- No class\n\nWeek 4: 10.5 Career Development Theories I e.g. Theory of John L. Holland/Theory of Donald E. Super/Theory of John Krumboltz\n\nWeek 5: 10.12 Career Development Theories II e.g. Theory of Lent, Brown, &Hackett (SCCT) (CIP) /Brown’s value based model\n\nWeek 6: 10.19 No class Chang Gung University speech on 10/22 13:30-16:30 Dr. Tang-Philosophy of Business Management\n\nWeek 7: 10.26 Applications of the Career Management Model\n\nWeek 8: 11.2 The Early Career Stage\n\nWeek 9: 11.9 Mid-term- No Class\n\nWeek 10: 11.16 Using Website in Support of Career Counseling\n\nWeek 11: 11.23 Speaker invitation\n\nWeek 12: 11.30 Career Assessment\n\nWeek 13: 12.7 Resume writing\n\nWeek 14: 12.14 Biography\n\nWeek 15: 12.21 Cover letter\n\nWeek 16: 12.28 Job Interview tips\n\nWeek 17: 1.4 Job Interview\n\nWeek 18: 1.11 Final exam: Resume/Cover letter/Biography",
    "methodologies": [
        {
            "type": "講述法",
            "note": "由老師針對課程內容進行授課並與學生互動。"
        },
        {
            "type": "討論法",
            "note": "將學生進行分組，上課時跟劇組別讓學生討論課堂內容。"
        },
        {
            "type": "合作學習",
            "note": "將學生進行分組，共同完成作業及報告，學生們相互合作從中學習。"
        },
        {
            "type": "媒體融入教學",
            "note": "利用與課程內容相關之影片媒體輔助教學。"
        },
        {
            "type": "專題研究",
            "note": "利用課本內的案例讓學生進行分組討論。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "Critically review and critique 2 different websites that could be useful in facilitating the career decision process. The purpose of this assignment is to get students to identify different career-oriented websites and to learn how to evaluate the overall quality of information on the websites. All website reviews should include the following: website name, website address, name of the website sponsor/developer, overview of the website, summary of strengthens and weaknesses of websites, and a brief description of the most appropriate setting for using this website."
        },
        {
            "type": "期末考",
            "weight": 20,
            "note": "You will submit your cover letter, resume and biography as your final exam."
        },
        {
            "type": "出席",
            "weight": 20,
            "note": "Attendance will be taken at the beginning of each class. Being ten minutes late to class more than three times will count as an absence. So, for example, if you are late 6 times, then this will count as two absences. If you will not be present or late, please inform the instructor of this before the class."
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "Each student is asked to select one chapter of the textbook for presentation and discussion in class. A 40 minute in-class oral report in the scheduled week is required. Please prepare PowerPoint as the course material to present in the class. The content of PowerPoint should be written in English; the slides of PowerPoint should be less than 20. Please make the copies to your classmates when you are a facilitator in the scheduled week. Please make the copies to your classmates when you are a facilitator in the scheduled week and email to our course mailbox."
        },
        {
            "type": "專題",
            "weight": 20,
            "note": "You will be required to analyze a career counseling case based on two theories. Upon completing lectures about career counseling theory, the instructor will provide you with a career counseling case. You will choose two theories among the theories we cover in classes, and write a 5-8 page typed case analysis. You will include the following contents in your analysis."
        }
    ],
    "prerequisite": "",
    "general_core": []
}