{
    "year": 111,
    "term": 1,
    "name": "非虛構：紀實創作",
    "teachers": [
        "蔡如音"
    ],
    "department": "IM88",
    "code": "MCM0120",
    "credit": 3,
    "serial": 1419,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 3,
            "to": 5,
            "campus": "本部",
            "classroom": "綜7樓大傳所大教室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "Creative nonfiction are true stories that employ literary and creative techniques for storytelling. It is a genre found in print and radio/audio journalism, sometimes under other names such as feature reporting, narrative nonfiction, long form, investigative reporting, science writing, cultural criticism (reviews), personal essays, profiles, documentary feature, etc. You may have encountered them in your daily consumption of “content” and “information.” Yet, creative nonfiction is a form that aims to convey vivid human experiences and knowledge with a viewpoint.",
    "goals": [
        "To raise awareness of the progressive potential of media forms and technologies in globally connected societies.",
        "To become a critical media commentator and agenda initiator of contemporary issues and causes.",
        "Give the students hands-on experience to develop and report their own story in either print or audio form."
    ],
    "syllabus": "I am teaching this course—ona trial basis—partly because storytelling/writing is what got me intojournalism and communication in the first place. Training in qualitativeresearch further allowed me to work creatively with research material so thatthe human experience and interpretations can be told in an accessible way.Though it may be a luxury, composing compelling stories and making researchmaterial accessible to non-specialized audiences were the driving forces behindthis course.\n\n**Course Requirement and Grading Policy**\n\n  \n\nWe learn in this class by reading nonfictionstories, listening to podcasts, reading and listening to writers and producerssharing tips on writing and reporting, and analyzing the crafts ofstorytelling. Please be noted that all discussion and writing exercises will bein English. The final story output can be in Chinese or English.\n\n**Where to Get the Readings and Podcasts?**\n\n  \n\nConsult the Resource List (end of thissyllabus) for assignments that require you to select your own stories to readand listen. I highly recommend getting the app, Podcasts, and subscribeto/search some of the shows for easy listening. I chose stories and podcastshows from contemporary magazines, public radio and other long-form, literaryjournalism. Other required readings, which will be placed in a folder for thisclass, are drawn from the following books:\n\n_Now Write! Nonfiction: Memoir, Journalism, andCreative Nonfiction—Exercises from Today’s Best Writers and Teachers_ (Ed. Sherry Ellis, 2009, Penguin).\n\n_True Stories, Well Told—from the first 20 years ofcreative nonfiction magazine._ (Ed.Lee Gutkind and Hattie Fletcher, 2014).\n\n_Telling True Stories: A nonfiction writer’s guidefrom the Nieman Foundation at_\n\n_Harvard University_ (Ed. Mark Kramer and Wendy Call, 2007, Plume).\n\n**Schedule and Activities**\n\nWK 1  Introduction\n\nExperiences with storytelling; Creative Nonfiction\n\nWK 2  Craft1: Place, Scene, Settings\n\n→WritingExercise A: Nature-writing exercise (Natalia Rachel Singer); Writing ExerciseB: Place and memory (David Gessner). Choose one of the writing exercises andcomplete one page before bringing it to class.\n\nWK 3  Sound Walk with Our Guest: Dr. Wendy Hsu\n\n→Listeningassignment: “A Sound Walk Through the Changing Street Economies of BoyleHeights”(http://www.lalistens.org/a-sound-walk-through-the-changing-street-economy-of-boyle-heights/)\n\n→Reference: _Acoustic Territories: Sound Culture andEveryday Life_ (Brandon Labelle)\n\nWK 4  Craft2: Character building\n\n→Writingexercise: Character motivation and “windows” (Gwendolyn Bounds, in _Now Write! Nonfiction: Memoir, Journalism,and Creative Nonfiction_, ed. Sherry Ellis)\n\nWK 5  Placeand Character Analysis\n\n→Listen to astory from audio podcast programs like _ThisAmerican Life, Longform, Strangers, Radiolabs_. following shows; Read acreative nonfiction\n\n→piece frommagazines like _The New Yorker, Esquire,Harper’s Magazine, Creative Nonfiction_ (including the anthology, _True Stories, Well Told: From the First 20Years of Creative Nonfiction Magazine_). Did you notice any usefulstrategies to create a sense of place and character?\n\nWK 6  Craft3: Dialogue and voice\n\n→Exercise A:“Hanging around Time?” (Michael McGregor, _NowWrite! Nonfiction: Memoir, Journalism, and Creative Nonfiction_, ed. SherryEllis);\n\n→Exercise B:“Starting with dialogues” (Ned Stuckey-French). Choose one of the writingexercises and complete it before bringing it to class.\n\nWK 7  Craftsparticular to audio storytelling\n\n→Listen toone story each from the following two programs:\n\nRadiorookies (http://www.wnyc.org/shows/rookies/) and (2) How sound(http://transom.org/topics/howsound/). Share your findings in class.\n\nWK 8  MulticulturalStorytelling: Politics, Sensibilities and Examples\n\n→El-Gawley,Nadyat and Penny O’Donnell, “Listening, journalism and community voices—NadyatEl-Gawley in conversation with Penny O’Donnell.” _Continuum: Journal of Media & Cultural Studies_ 23.4 (2009):519-523.\n\n→Read: Alpine,Megan. “Crafting feel-good multiculturalism in This American Life.” _Berkeley Journal of Sociology_ 59 (2015)(http://berkeleyjournal.org/2015/11/crafting-feel-good-multiculturalism-in-this-american-life/)\n\nWK 9  De-colonizingand non-nationalistic Storytelling\n\n→S. MitraKalkita, “Reporting on Your Own” (_TellingTrue Stories: A Nonfiction_\n\n_Writers’ Guide_, ed. Mark Kramer and Wendy Call)\n\nWK 10  PitchingWorkshop\n\n→Bring anidea (or two) for storytelling in print or on audio. Name the subject, thesubgenre (e.g., profile, first-person, investigative writing, reviews, humor),the material (e.g., memories, research, interviews). Write a short blurb thatsummarizes your story from the audience’s viewpoint.\n\n→Listen to:http://www.sciencewritingradio.com/swr-27-the-why-and-how-of-elevator-pitches-in-science/\n\nWK 11  Interviewswith Experts in Culture and Science\n\n→Read orlisten to one profile or interview-driven story in the resource list. Shareyour findings in class.\n\nWK 12  SubjectiveStories on Bodies\n\n→Recommendedstory: “The Path to Primary Care” (http://transom.org/2015/the-path-to-primary-care/)\n\nWK 13  Science,medicine, life\n\n→Listen to _How Sound_ episode: “Producing ScienceStories with a Scientist” (http://transom.org/2015/producing-science-stories-with-a-scientist/)\n\n→Read andlisten to a few stories in the area of science and medicine (See list of audioand print stories for ideas). What formats and subjects are you attracted to?What storytelling techniques did you learn?\n\nWK 14  CulturalCriticism and Cultural Reporting\n\n→Consult the Resourcelist and find cultural stories that match your interest. Notice thesubject, subgenre, the voice, and the style. What kind of cultural subjects doyou think you would be interested to write about? Give some details and rationale.\n\nWK 15  Structuringyour story\n\n→Share howyou plan to organize your story.\n\nWK 16    Structuringyour story\n\nWK 17    ListeningParty/Reading Party\n\nWK 18    ListeningParty/Reading Party",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "實驗/實作",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 10,
            "note": "Writing Exercises: WK 2, 4, and 6."
        },
        {
            "type": "課堂討論參與",
            "weight": 60,
            "note": "Weekly conversations: Consists of your summarization and analysis of the reading and listening assignments."
        },
        {
            "type": "專題",
            "weight": 30,
            "note": "Storytelling Development: Pitching a story (WK 10), structuring a story (WK 15), reading/playing your story (WK 17, 18), with a short, reflective note on your storytelling in relation to “creative nonfiction.”"
        }
    ],
    "prerequisite": "",
    "general_core": []
}