{
    "year": 107,
    "term": 1,
    "name": "英語新聞編譯",
    "teachers": [
        "鄭永康"
    ],
    "department": "L",
    "code": "L0M0001",
    "credit": 2,
    "serial": 1533,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 0
    },
    "schedule": [
        {
            "day": 1,
            "from": 9,
            "to": 10,
            "campus": "本部",
            "classroom": "正401"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "The translation of news and editorials require a specialized format, register and tone. This course will familiarize students with the techniques of translating news into English. Exercises will focus on news articles centering on social, business and political topics, as well as editorials. In the last few weeks of the course, students will learn how to rewrite/summarize news articles based on several Chinese sources.\n\nCourse Objectives \nTo help students learn the techniques for translating Chinese-language news into English.\n\nClasses will be conducted as follows:\n(1) A weekly translation exercise of about 500-1000 characters long. At least 15 exercises during the term. \n(2) Source-language texts will include news articles/editorials centering on social, political and business topics. Handouts or relevant online links will be given to students for prior reading before doing their translation assignments.\n(3) Weekly translation projects submitted by students will be discussed in class, including analysis of mistranslations, omissions, corrections and improvements. \n(4) Emphasis of student-work analysis: accuracy, grammar, diction, vocabulary, tone, language register, style and format. \n(5) Students will be regularly assigned to study and comment on the work of their classmates as a means to learn others’ adopted techniques, as well as consider their pros and cons, in comparison with their own work. \n(6) As a way to develop speed, students will at times be required to do translation of short passages on-site, to be followed by a review of their work. \n(8) Students will sit for their mid-term and final exams. \n(9) Students will be required to compile a glossary of terms based on the assigned exercises, to be submitted by the end of the semester.",
    "goals": [
        "Learning how to translate Chinese news articles and editorials into English",
        "Understanding how language register, tone, format and style affect the readability of translated article."
    ],
    "syllabus": "英文新聞編譯這一門中翻英單向課程將凸顯中英新聞寫作風格的差異 。新聞英文翻譯往往必須重寫，力求付合英文新聞正確風格與語言層次要求。新聞編譯和其他的翻譯工作有所不同，為了付合英文新聞風格，譯者必須將原文的架構拆解並重新撰寫，並且大搬動原文各段落甚至拆開或合併。 英文新聞以金字塔式的方式鋪陳，語言要求順暢精簡易懂 。不同於中文新聞往往將所有重要細節大雜燴式的隨意呈現在第一段，英文新聞首段具有導言功能，採重點式報導，報導重點在於who, what, when and where簡略的敘述； 內文句子則簡單扼要， 並交代清楚事件的因果脈絡。敘述部分以第三者角度講故事，若有引述別人，譯者應力求凸顯口說層次，與敘述句子明顯區分。 本課程將讓同學學習到如何翻譯各種新聞內容，如社會，政治，經濟，國際事務等導向的短篇新聞，並安排學期末練習翻譯數篇社論。 英文新聞編譯課程是特別為研究所同學或同等語言能力者量身定制，學習重點不在被動的聆聽教師講習，而是透過每週中進英翻譯作業的課堂討論來進行。除了實務筆譯練習以外，將指定每位同學至少兩次Powerpoint英語口頭報告。 英文新聞編譯為全英文課程，因此嚴格要求學生英文「聽讀說寫」技巧純熟，未達標請勿試，以免影響個人成績。有修過基本中英翻譯為佳，以便達到預定學習目標。＊＊＊＊ 本課程非英語加強課程。本課程僅限研究所同學選修。＊＊＊＊ ＊＊＊ 第一天打算不來上課，麻煩請退選。Only those who show up on Day 1 will be admitted to the class. ＊＊＊ The translation of news from Chinese into English often requires rewriting owing to different stylistic and format requirements between the two languages. Different from the usual translation setup, the translator of news into English is required to re-organize the original by breaking the text apart, transposing paragraphs here and there, changing the structure, and even, parsing or combining different sections. Unlike Chinese news headings in which too many details are often lumped up in the lead paragraph, the English news article heading is required to be concise, merely stating the who, what, when, and where of the reported events, while at the same time emphasizing the clarity and causal linkages of the event details. News writing is practically story-telling. While the reporting language in the third person voice maintains a relatively higher register, direct quotations must be reported in a colloquial, conversational tone. This course has been designed to help students learn how to translate news focusing on social events, politics, economics and international events, among others. Towards the latter part of the term, students will learn how to translate newspaper editorials as well. This translation course has been designed for students in the graduate level and undergraduates who are at par. Students will not listen passively to a teacher’s lecture but instead participate through weekly translation exercises, in-class discussion/commentaries and assigned reporting. Each student will be required to make an oral Powerpoint presentation in English twice during the term. As this is an English-only instruction course, students must be highly proficient in English speaking, listening, reading and writing, and preferably, must have taken a basic Chinese-English translation course before. If you are not proficient in English, please do not enroll in this course to avoid a low final rating. \\*\\*\\*\\*This course is not designed for English proficiency improvement purposes. \\*\\*\\*\\* Week 1 Introduction; preliminary exercises 2 Translating Short News Articles: Social News 1 3 Translating Short News Articles: Social News 2 4 Translating Short News Articles: Social News 3 5 Translating Short News Articles: Political News 1 6 Translating Short News Articles: Political News 2 7 Translating Short News Articles: Economics News 1 8 Translating Short News Articles: Economic News 2 9 Midterm exam 10 Translating Editorials 1 11 Translating Editorials 2 12 Translating Editorials 2 13 Summary Translation 1 14 Summary Translation 2 15 Summary Translation 3 16 Translating Special Reports 1 17 Translating Special Reports 2 18 Final Exam",
    "methodologies": [
        {
            "type": "討論法",
            "note": "Discussion of student translations in class; ENGLISH ORAL REPORTS"
        },
        {
            "type": "專題研究",
            "note": ""
        },
        {
            "type": "其他",
            "note": "Students will be required to submit a bilingual glossary of terms, at least 300 entries by the end of the semester."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 25,
            "note": "Weekly translation assignments"
        },
        {
            "type": "期末考",
            "weight": 20,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 25,
            "note": "Student participation/commitment in class discussion; oral reports"
        },
        {
            "type": "出席",
            "weight": 30,
            "note": "Punctuality, attendance and attentiveness"
        }
    ],
    "prerequisite": "",
    "general_core": []
}