{
    "year": 107,
    "term": 1,
    "name": "臺灣文獻導讀與研究",
    "teachers": [
        "賀安娟"
    ],
    "department": "L",
    "code": "L0M0002",
    "credit": 3,
    "serial": 1534,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 0
    },
    "schedule": [
        {
            "day": 4,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "雲和街教學大樓3樓會議室",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "The purpose of this course is to nurture an understanding of the major intellectual debates, standard works, and primary source materials concerning the topics and themes that are significant to the historical narrative and narrative history of contemporary Taiwan society. The bilingual textbook The Concise History of Taiwan, Chinese-English Bilingual Edition  will serve as overview guideline, but its general content will be illustrated with supplementary readings. In the discussion of the supplementary readings, specific attention will be paid to the bibliographic references, and to the introduction of primary and seminal source materials. The exam will be a reading of a short story and students will write a brief essay that situate the story in its historical/ contemporary context based on the readings and text materials provided throughout the course. This course invites students from other departments and programs taught in the English language at NTNU or other universities with which NTNU has signed an exchange agreement with student credits. All materials will be made available through moodle (or google drive for external students) and in textbook format (to be returned at the end of the semester).",
    "goals": [
        "The purpose of this course is to nurture an understanding of the major intellectual debates and standard works.",
        "The purpose of this course is to nurture an understanding of primary source materials in contemporary Taiwan society."
    ],
    "syllabus": "**週**1  **9****月 13****日** Introduction \n\nExplanation and handout of the Syllabus. The purpose of this course is to nurture an understanding of the major intellectual debates, standard works, and primary source materials concerning the topics and themes that are significant to the historical narrative, and narrative history of contemporary Taiwan society. The bilingual textbook _The Concise History of Taiwan, Chinese-English Bilingual Edition_戴寶村著 《簡明臺灣史》will serve as overview guideline, but its general content will be illustrated with supplementary readings. In the discussion of the supplementary readings, specific attention will be paid to the bibliographic references, and to the introduction of primary and seminal source materials. The exam will be a reading of a short story and students will write a brief essay that **situates the story in its historical/ contemporary context based on the readings and text materials provided throughout the course.**\n\nThis class introduces relevant materials that discuss retrospect and prospects of Taiwan Studies in monographs, edited volumes and journals:\n\n_Routledge Handbook of Contemporary Taiwan_, edited by Gunter Schubert, 2016\n\n_International Journal of Taiwan Studies_ (IJTS), published by Brill, 2017\n\nStudents prepare: “Introduction” in Heylen, Ann and Sommers, Scott (eds.) _Becoming Taiwan. From Colonialism to Democracy_, Wiesbaden: Harrassowitz Verlag, (2010) pp. 3-10.\n\n**週**2 **9****月 20****日** Introducing Taiwan Studies Materials\n\nDiscussion: “Introduction” in Heylen, Ann and Sommers, Scott (eds.) _Becoming Taiwan. From Colonialism to Democracy_. The discussion will relate this text to the updated publications based on _Routledge Handbook of Contemporary Taiwan_ and _International Journal of Taiwan Studies_ (IJTS).\n\n**週**3  **9****月 27****日 Invited Lecture Astrid Lipinsky. Discussant: Dusica Ristivojevic and Coraline Jortay**\n\n**Topic: Women’s studies, feminist literature and Taiwan society**   \n\n**週**4  **10****月 4****日**  **Indigenous, Aboriginal, Formosan, Native Taiwan?** \n\nGeneral reading _The Concise History of Taiwan, Chinese-English Bilingual Edition_ (chapter 1), pp. 31-74\n\nThis general reading will be illustrated with a number of overview articles that look at Austronesian Taiwan from an archeological, anthropological and linguistic perspective.\n\nRelevant authors: Scott Simon, David Blundell, Elizabeth Zeitoun-Lin, Fred Chiu, Pan Yin-hang, Liu Yi-Chang, Hu Tai-Li, Paul Li.\n\nCruz Berrocal, Maria et al. “Summary of Excavations in Hoping Dao, Keelung, Taiwan 基隆和平島考古挖掘紀要” Monumenta Taiwanica 台灣學誌10, 2014.\n\nCruz Berrocal, Maria and Tsang, Cheng-hwa (eds.) _Historical Archaeology of Early Modern Colonialism_ _in Asia-Pacific: The Asia-Pacific Region_, Gainesville: University of Florida Press, 2017.\n\n_\\------ Historical Archaeology of Early Modern Colonialism_ _in Asia-Pacific : The Southwest Pacific and Oceanian Regions_. Gainesville: University of Florida Press, 2017.\n\n**週**5  **10****月 11****日Selected Readings on Dutch Formosa and Spanish Hermosa**  \n\nGeneral reading _The Concise History of Taiwan, Chinese-English Bilingual Edition_ (chapter 3), pp. 117-129.\n\nDiscussion of the supplementary reading materials: selected chapters from Blussé, Leonard (ed.) _Around and About Formosa. Essays in Honor of Professor Ts’ao Yung-ho_, Taipei: Ts’ao Yung-ho Foundation for Culture and Education, 2003.\n\n**週**6  **10****月 18****日   The Japanese Colonial Period (1895-1945) (1)**\n\nGeneral reading _The Concise History of Taiwan, Chinese-English Bilingual Edition_ (chapter 3), pp. 130-158. This class will give an overview of research articles that deal with specific topics in Taiwan Studies on the Japanese colonial period.\n\nEdited volumes by Liao Ping-hui and David Wang, Murray Rubinstein, Peter Duus, Mark Peattie and Raymond Myers.  \n\nRelevant authors and monographs: Chou Wan-yao, Patricia Tsurumi, Wu Ruei-Ren, Leo Ching, Ke Chih-Ming, Wang Tay-shen, Caroline Hui-yu Tsai.\n\n**週**7  **10****月 25****日The Japanese Colonial Period (1895-1945) (2)**\n\n**Invited lecture TBC**\n\n**週**8  **11****月 1****日**   **Academic Activity : Conference attendance**\n\n**週**9 **11****月 8****日**    **期中考 Mid-term Exam**\n\n**Students select one of the given topics (Austronesian Taiwan, Dutch/Spanish or Japanese colonial period) and prepare a brief essay.**     \n\n**週**10 **11****月 15****日** **Mid-term Exam Discussion: Databases and Visual Materials**\n\n**Discussion and deepening of the essays with additional materials: databases and visual materials.**\n\n**週**11 **11****月 22****日** **Taiwan seen from the perspective as an Immigrant Society** : **Taiwan in the 18th century and 19th Century**\n\nGeneral reading _The Concise History of Taiwan, Chinese-English Bilingual Edition_ (chapter 2), pp. 75-97.\n\nSupplementary readings for this class will highlight topics in the discussion of the historical-geography, visual arts, architecture and socio-economic history. Attention will be paid to the transition from Ming to Manchu-Qing, the opening of Taiwan to the West from the mid-19th century onwards and the cultural encounter between the differing ethnic groups according to their migration patterns since the 17th century.      \n\n**週**12  **11****月 29****日Taiwan seen from the perspective as an Immigrant Society** : **New Immigrants and Globalization**\n\nGeneral reading _The Concise History of Taiwan, Chinese-English Bilingual Edition_ (chapter 2), pp. 98-116. Supplementary readings for this class feature the Taiwan ethnicity and identity issue, and its representation in Taiwanese literature. Attention will be paid to **an introduction of writers and their literary works.**\n\nA selection of chapters from the following edited volumes:\n\nMark Mancall, (ed.) _Formosa Today_, New York: Frederick A. Praeger, 1964.   \n\nStevan Harrell and Huang Chün-chieh (eds.) _Cultural Change in Postwar Taiwan__,_ Taipei: SMC reprint, 1994.\n\nMurray A. Rubinstein (ed.) _The Other Taiwan, 1945 to the present__,_ New York: Sharpe, 1994.\n\nMurray A. Rubinstein (ed.) _Taiwan. A New History__,_ New York: Sharpe, 1999.\n\n**Introduction of Taiwanese Literature: writers, literary works, sources and databases.**\n\n**週**13  **12****月 6****日**  Understanding Taiwan as a postwar/colonial society\n\nGeneral reading _The Concise History of Taiwan, Chinese-English Bilingual Edition_ (chapter 4), pp. 130-158. The focus is debates regarding the interpretation of major events and the narrativization of historical personalities in Taiwan history. Supplementary readings will provide overview articles on Taiwan historiography.\n\nInvited lecture: Chang Lung-chih (TBC) \n\n**週**14  **12****月 13****日**  Taiwan since martial law : society, culture, and media\n\nGeneral reading _The Concise History of Taiwan, Chinese-English Bilingual Edition_ (chapter 4), pp. 130-158. This class will select chapters from the edited volume by David Blundell (ed.) _Taiwan Since Martial Law; Society, Culture, Politics, Economy_, Taipei: Shung-Ye, NTU/ Berkeley, 2012. Supplementary readings will focus on topics in Taiwan media research and Taiwan cinema (film studies).\n\n**週**15  **12****月 20****日**  Language and Identity in Retrospect\n\nThis class will introduce a number of articles that focus on the language debate in Taiwan society.\n\nCompulsory reading: Hsiau, A-chin “Language Ideology in Taiwan: The KMT’s Language Policy, the Taiyu Movement, and Ethnic Politics,” _Journal of Multilingual and Multicultural Development_ 18:4, 1997, pp. 302-315.\n\n**週**16  **12****月 27****日**  **Taiwanese and World Citizens**\n\nGeneral reading _The Concise History of Taiwan, Chinese-English Bilingual Edition_ (chapter 5), pp. 203-233. A selection of articles _Routledge Handbook of Contemporary Taiwan_ that focus on Taiwan’s economic development, domestic politics and international relations.\n\n**週**17  **1****月 3****日**  **Explanation of the Exam**\n\nSelection of the material: **Series: Taiwan literature English translation** series (1996-) Santa Barbara, California: Forum for Study of World Literature.\n\n**週**18  **1****月 10****日**  End-term Exam",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Concept based and nuance specific"
        },
        {
            "type": "討論法",
            "note": "Concept based and nuance specific"
        },
        {
            "type": "問題解決教學",
            "note": "Vocabulary study and acquisition"
        },
        {
            "type": "合作學習",
            "note": "Individual or group work"
        },
        {
            "type": "實地考察、參訪",
            "note": "Participating in an academic activity: conference attendance., museum or foundation visit, cultural heritage"
        },
        {
            "type": "專題研究",
            "note": "Students select a topic of interest in Taiwan Studies"
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 20,
            "note": "topic based, essay writing"
        },
        {
            "type": "期末考",
            "weight": 40,
            "note": "topic based = short story reading and essay writing"
        },
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": "presentation and discussion of the compulsory and elective readings"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "alertness to the method of instruction"
        }
    ],
    "prerequisite": "",
    "general_core": []
}