{
    "year": 109,
    "term": 2,
    "name": "島嶼環境與發展",
    "teachers": [
        "蔡慧敏"
    ],
    "department": "SM46",
    "code": "EEC8039",
    "credit": 3,
    "serial": 2720,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 6,
            "to": 8,
            "campus": "公館",
            "classroom": "行409"
        }
    ],
    "programs": [],
    "comment": "要求具備相關基礎課程。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "本課程之目標在於提供學生以「島嶼觀點」思考台灣島及周遭島嶼之環境與發展議題。課程之進行將使學生能了解島嶼生態基本原理、全球島嶼分布與環境特性、島嶼文化差異性、島嶼自然與文化之共同演化、島嶼永續發展議題等相關知識，並能探討台灣本島及離島之環境保育與發展議題，進而省思環境教育者之角色。全球環境有70%為海洋，台灣本島四周環海並擁有121座以上小島，更深受海洋流動及其所帶來的文明與文化之影響。為了增進對全球海島環境與社會文化之瞭解，進而檢視台灣島嶼的特色與永續發展之契機。本課程由歷史的深度及全球地理的廣度，探討全球各大洋的島嶼環境與社會狀況；探討的課題，包括認識海洋歷史與島嶼環境政經結構、島嶼社會面對海洋的挑戰與因應（氣候變遷、資源政策、區域政治、生態殖民、環境倫理、能力建構、發展議題等），並比較世界各區域島嶼發展、探討台灣相對議題。探討全球各區域島嶼社會面對海洋的挑戰與因應 ，包括：氣候變遷、資源政策、區域政治、環境殖民、環境倫理、能力建構、發展策略等議題。",
    "goals": [
        "了解島嶼生態基本原理、全球島嶼分布與環境特性、島嶼文化差異性",
        "瞭解全球海洋區域、島嶼生物文化地理及發展歷史",
        "探討全球各大洋的島嶼環境與社會狀況；探討的課題，包括認識海洋歷史與島嶼環境政經結構、島嶼社會面對海洋的挑戰與因應",
        "探討島嶼永續發展議題，並能探討台灣本島及離島之環境保育與發展議題",
        "檢視台灣島嶼的特色與永續發展之契機，進行「島嶼環境教育」內涵架構及以「島嶼核心關懷」（Island-in -mind）之學習方案習作"
    ],
    "syllabus": "**一、教學目標：**\n\n本課程之目標在於提供學生以「島嶼觀點」思考台灣島及周遭島嶼之環境與發展議題。課程之進行將使學生能了解島嶼生態基本原理、全球島嶼分布與環境特性、島嶼文化差異性、島嶼自然與文化之共同演化、島嶼永續發展議題等相關知識，並能探討台灣本島及離島之環境保育與發展議題，進而省思環境教育者之角色。\n\n全球環境有70%為海洋，台灣本島四周環海並擁有121座以上小島，更深受海洋流動及其所帶來的文明與文化之影響。為了增進對全球海島環境與社會文化之瞭解，進而檢視台灣島嶼的特色與永續發展之契機，本課程由歷史的深度及全球地理的廣度，探討全球各大洋的島嶼環境與社會狀況；探討的課題，包括認識海洋歷史與島嶼環境政經結構、島嶼社會面對海洋的挑戰與因應（氣候變遷、資源政策、區域政治、生態殖民、環境倫理、能力建構、發展議題等），並比較世界各區域島嶼發展、探討台灣相對議題。探討全球各區域島嶼社會面對海洋的挑戰與因應 ，包括：氣候變遷、資源政策、區域政治、環境殖民、環境倫理、能力建構、發展策略等議題。\n\n**二、课程內容：**\n\n*   **島嶼生態原理探討**：介紹島嶼定義及類別、島嶼生物地理學理論、影響島嶼生態系組成因素、島嶼生態系特徵及生態危機等。\n*   **島嶼文化多元性**：討論影響島嶼文化發展之自然環境因素、人類遷徙對島嶼文化之影響及其多元性與差異性、外來民族對原住島民之影響、島嶼文化與環境態度、自然與文化共同演化（co-evolution）關係、島嶼的生物文化多樣性（Biocultural Diversity）等。\n*   **島嶼發展問題**：介紹島嶼發展相關研究、全球幾大島嶼區之發展；討論島嶼之生態及經濟脆弱性、自然災害、能源、水資源、島嶼觀光、外來干擾及依賴、物質流、生態限制或高度發展等議題。\n*   **台灣島與全球島嶼**：比較台灣島與世界主要大島／島群間環境發展議題之相似及相異性。台灣離島多樣性：比較台灣各離島區間之環境特質與發展差異。\n*   **認識全球海洋歷史與區域島嶼環境政經結構**: (1) 歷史回顧：海洋、島嶼、強權、殖民地 (2) 後殖民地海洋區域：文化、生態、資源、不對稱發展分析。\n*   **探討全球各大海洋區島嶼國際社會**，及其自然、文化、區域環境、與社會互動關係。\n*   **探討全球各區域島嶼社會面對海洋的挑戰與因應**：(1) 氣候變遷、資源政策、區域發展、環境殖民、環境倫理、能力建構、當前發展議題等比較研究 (2) 比較世界各區域海洋政策。\n*   **島嶼環境教育**：個案探討台灣島嶼群之生態脆弱性、發展與極限、文化多元與差異、島民與外來者、公民環境素養、如何加強永續發展之覺知及行動等。",
    "methodologies": [
        {
            "type": "講述法",
            "note": "學生在每週課程後，針對課程內容及討論主題，挑選一討論議題，深度評論；於期中繳交一篇短篇評論"
        },
        {
            "type": "討論法",
            "note": "學期中，學生需分組進行相關主題之資料收集，並於課程中參與討論"
        },
        {
            "type": "專題研究",
            "note": "由研究專題或討論議題中則一主題，深入探討；於學期末發表學生研究心得"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": "學期中，學生需分組進行相關主題之資料收集，並於課程中參與討論"
        },
        {
            "type": "課堂討論參與",
            "weight": 15,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 15,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 40,
            "note": "由研究專題或討論議題中則一主題，深入探討；於學期末發表學生研究心得"
        }
    ],
    "prerequisite": "",
    "general_core": []
}