{
    "year": 109,
    "term": 2,
    "name": "環境行為學",
    "teachers": [
        "王順美"
    ],
    "department": "SM46",
    "code": "EEC8005",
    "credit": 3,
    "serial": 2716,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 7,
            "to": 9,
            "campus": "公館",
            "classroom": "行304"
        }
    ],
    "programs": [],
    "comment": "要求具備相關基礎課程。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "人類在環境中的各種行為都可能對環境產生好或壞的改變，而人類的行為又是可能透過倫理、訊息、誘因、社區去改變的，因此了解環境行為對於推廣環境教育是重要的。本堂課將探討環境行為相關的理論，幫助同學認識環境行為、影響環境行為的因素及策略。",
    "goals": [
        "學生能夠瞭解人的環境態度及行為",
        "學生能夠瞭解改善環境行為的五個大的策略",
        "學生能夠運用所學於環境行為管理中"
    ],
    "syllabus": "**環境行為學（****110****）**\n\n一、目標(objectives)\n\n學生能夠瞭解人的環境態度、價值及改變行為的策略\n\n(environmental attitudes, value and change)\n\n學生能夠瞭解社會公義、集體行動及社群合作\n\n(social justice, collective action and community cooperation)\n\n學生能夠瞭解人類對於自然、災害環境的反應\n\n(relationship with nature) (response to disaster)\n\n二、教學方法 (pedagogy)：理論文章及案例研究閱讀、個人行為實踐、生活經驗、影片欣賞 (Reading, reporting and leading discussion, sharing life experience, outdoor activity, sustainable lifestyle building, and mini-report)\n\n三、課程內容及閱讀資料\n\n2/24  課程介紹，信念-態度價值、環境教育與保育心理學(Hines)( 1-10)\n\n(introduction) (environmental education and conservation psychology)\n\nHungerford, H. R. and T. L. Volk. “Changing Learner Behavior through Environmental Education.\n\n3/3永續行為的建立(作業一說明)\n\n(sustainable behavior building) (Assignment 1)\n\n**Mohr, Doug Mckenzie 1999 Fostering Sustainable Behavior. Gabriola Island B.C.: New Society Publishers.**\n\nCommunity-based social marketing, uncovering barriers and benefits, tools for change\n\n3/10環境行為學研究方法(作業一構想)\n\n(research methods for environmental behavior)\n\n林新沛（2014）。環境知識與環境行為的測得相關為何偏低？如何從測量上改善？「環境教育研究」，10(2), 1-26。\n\n**(Why are the observed correlations between environmental knowledge and environmental behavior so low? And how to increase them?)**\n\n古國廷(2011)。台北市國小高男及學童環境行為影響因子之探討。台北市: 台北大學碩士論文。\n\n(Exploring the variables of environmental behaviors)\n\n3/17  3/24**提倡正面的環境行為**\n\n**Clayton, S. D. 2012. The Oxford Handbook of Environmental and Conservation Psychology Oxford University Press.**\n\n **(promoting pro-environmental behavior) Oxford (2012), chapter29**\n\nAndrew Darnton and Jackie Horn (2013) Influencing behaviors moving beyond the individual: a guide to the ISM (individual, social & material) tool. Scottish government\n\n3/31共有財、社區治理**(**作業二說明)\n\n(common ground) (community management of the commons)\n\nGardner, G. T. & Stern, P. C. 1996. Environmental Problems and Human Behavior. Boston: Allyn and Bacon. Chapter 6.\n\n李懿潔(2013)。共有資源的民主治理: 以東港櫻花蝦產銷班為例。高雄市: 中山大學。(Demoratic governance of the commons: a case study of Wergestid Shrimp Fishery in Tongkang)\n\n\\*\\* From conflict to cooperation: an incredible example of Sweden's East Flyton\n\n4/7  4/14**生態系統管理的合作過程**\n\n**(Collaborative process in ecosystem management) Oxford (2012, chapter31)712-745**\n\n4/21  4/28**保育行為在兒童及青少年的發展**\n\n(共讀) 理查、洛夫 (2014) 失去山林的孩子：拯救「大自然缺失症」兒童。台北: 野人出版社。(Richard Louve (2008) Last child in the woods: saving our children from natural deficit disorder.)\n\n **(The development of conservation behaviors in childhood and youth) Oxford (2012, chapter28)**\n\n5/5\n\n作業一報告 (Assignment 1 oral report, poster)\n\n作業二 環境或保育議題計畫書 (Assignment 2, proposal for issue investigation)\n\n5/12地方依附\n\n(Place attachment) Oxford (2012, chapter 9) 148-163\n\n5/19生態認同\n\n生態認同—走入人與環境關係的新視野\n\n5/26**對於環境災難的反應**\n\n**(Response to environmental disaster )Oxford (2012, chapter21)** 391-413\n\n6/2張宜君和林宗弘(2012) 不平等的災難: 921地震下的受災風險與社會階層化。人文及社會科學集刊，24(2): 193-231。\n\n(unequal disaster: hazard and social stratification in an earthquake)\n\n6/9 Resilience :荷蘭防災教育\n\nAdwin Bosschaart, Joop van der Schee & Wilmad Kuiper (2016) Designing a\n\nflood-risk education program in the Netherlands, The Journal of Environmental Education, 47(4)； 271-286\n\n6/16 作業一(書面報告)+作業二報告(口頭及書面報告)\n\n  Reporting assignment 1 and assignment 2\n\n五、評量：導讀、課程討論、作業執行與報告\n\n(一)上課導讀及課程討論50%\n\n每位同學導讀所抽到的上課閱讀資料，在指定的日期提出該文章的簡報檔，並且提出問題，引導討論。\n\n每位同學提供簡報檔進行導讀，英文文章於上課前兩天(或前一週)跟老師討論。\n\n(二) 作業一: 個人行為改變計畫25%\n\n這是個人的作業，目的在於幫助你去經驗永續行為，包括運用多種的獎勵、支持的機制和消除阻礙個人行為改變的策略。這個練習包括設定目標、撰寫日記、每週的週記放在網站上、在班上討論、數據統計分析、與理論的對話以及最後的短文。\n\nThis is an individual assignment to encourage you having direct experience on a new daily sustainable behavior. You need to select and implement it with some incentive strategies or understanding its social or personal meanings.\n\nTwo tables are attached. One is a brief record for your action plan. You can complete your comprehensive action first, then fill this form. Table 2, you can use it to record your new sustainable behavior daily, including your behaviors, thoughts and feeling about the behavior. You may not succeed in conducting behavior in one day. It is ok, you just need to write the situation you face, your feeling and thoughts. Every week, you can make a reflection on the result in this week.\n\n**Oral presentation of action plan on the March 10th.**\n\n**Oral presentation by a poster to show the final result on the May 5th.**\n\n**Written report will be handed on the June 16th.**\n\nTable 1.  brief action plan (3/10)\n\n欲改變的行為\n\nNew sustainable behvior\n\nEX:每天關手機至少六小時以上、每天親近自然20分鐘….\n\nFor example: turn off mobile phone for six hours every day or close to nature at least 20 minutes every day.\n\n選擇此行為的原因、目的The goals and reasons to choose the behavior\n\n改變此行為的對永續的利與弊(連接到SDG)\n\nEffects of the new behavior in terms of sustainability\n\n**Positive effects**\n\n**1.**\n\n**2.**\n\n**Negative effects**\n\n**1.**\n\n激勵自己改變此行為的方法與策略Strategies used to encourage your action\n\n**1.**\n\n**2.**\n\n**3.**\n\n評估指標及記錄方式Indicator and recording methods\n\n \n\nTable 2 daily record\n\nNew sustainable behavior\n\nEX:每天關手機至少六小時以上、每天親近自然20分鐘….\n\n行為日期\n\nDate\n\n目標達成狀況(個數、百分比或描述情形)\n\nDescription (times, number, amount, ….)\n\n3/11\n\n3/12\n\n \n\n本週印象深刻之事或反思(如困難、改變誘因、心情、、)\n\nReflection for the weekly result (difficulty, emotion,..)\n\n作業報告要點: 個人日常的行為改變(資源使用、活動自然地方連結)/日常生活行為的環境及社會的影響(比較前後對人或社區的影響)/日常生活行為的紀錄(日誌: 心理、物理結果)\n\n (三) 作業二: 環境議題、保育議題或災害議題的探討25%\n\n*   探究動機 (問題意識)，文獻探討，來分析議題的特質 (議題的原因，對生活、社會、經濟、、、影響，解決策略或政策)，探究的方式(觀察採訪重點及受訪者的觀點、行為)，撰寫一個議題探討企畫書 (5/5)。\n*   進行實地調查研究，兩人一組或個人實際訪談、觀察。(選擇情境、訪談人們的感受及看法。或政策機制的引導、民眾的反應、產生的效果)\n*   各自口頭和書面的報告(包括你對議題的看法及建議) (6/16)\n\nFor the second assignment, you need collect information through literature review and interview to explore the viewpoints and behavior of other people  or policy of the government or corporation about the issue you concern.   \n\n    In the assignment two, you may answer the questions listed below and discuss the issue with the theories (collective actions, natural connection.....) and write a proposal by May 5th . You can invite one classmate to work with you for collecting information and interview together. You need to give oral report on June 16th.\n\n*   _What is the palm oil issue? Is it relative to daily life, economy, society, bio-physical environment, aesthetic, psychology, history?_\n*   _Is there conflict among the people or agencies due to the palm oil issue?_\n*   _Do people know their life and economy relative to the issue? Do they want to make a change to save society or the environment?_\n*   _In some countries or cooperations, are there successful cases to reduce the Palm oil use or manage the conflict?_\n\n**.**\n\n*   _塑膠袋對環境的具體傷害有哪些（學術方面，從生物化學角度）?_\n*   _Is the plastic bag harmful or beneficial for the society and environment?_\n*   _塑膠袋減量政策對整個環境的幫助有多大?_\n*   _If the society reduces the use of plastic bag, what and how impact toward the society?_\n*   _除了限制塑膠袋外還有哪些新材料可以代替舊有的不環保材料（生物化學資訊）?_\n*   _Is there alternative material replacing the plastic bag?_\n*   _國內外政策的比較，是否有值得我們參考的案例? 例如那些?或者台灣現行環保政策還有哪部分待改進?_\n*   _In other countries, is there successful cases which we can learn to make progress for current status?_\n*   _除了以上問題之外，還有哪些減少垃圾汙染的舉措?_\n*   _建議民眾平常該如何做起，能幫助降低垃圾汙染?_\n*   _Please give suggestions for general people to reduce the impact of the plastic bag._",
    "methodologies": [
        {
            "type": "講述法",
            "note": "每週由老師及同學分就各週主題進行導讀講述"
        },
        {
            "type": "討論法",
            "note": "根據每週的主題進行全班或分組討論"
        },
        {
            "type": "實驗/實作",
            "note": "設定永續行為目標，個人實作1.5月，作業一"
        },
        {
            "type": "實地考察、參訪",
            "note": "觀察或訪談當地居民及外來者的行為及看法"
        },
        {
            "type": "媒體融入教學",
            "note": "課程中撥放能源危機錄影帶"
        },
        {
            "type": "專題研究",
            "note": "作業二"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 25,
            "note": "每週導讀作業"
        },
        {
            "type": "課堂討論參與",
            "weight": 25,
            "note": "出席並參與討論狀況"
        },
        {
            "type": "報告",
            "weight": 50,
            "note": "建立永續行為及其計畫、成果報告； 針對議題進行各不同利害關係人訪談"
        }
    ],
    "prerequisite": "",
    "general_core": []
}