{
    "year": 110,
    "term": 2,
    "name": "融合教育專題研究",
    "teachers": [
        "邱春瑜"
    ],
    "department": "EM09",
    "code": "SPC8014",
    "credit": 3,
    "serial": 478,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "特230"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "To describe basic elements of inclusion with rigorous research evidence 描述融合的基本元素，並提出實徵研究做為佐證",
        "To identify inclusive/exclusive activities in educational settings 指出在教育場域的融合/排除活動",
        "To provide an overview of educational legislation in Taiwan and identify key international legislations 介紹台灣有關於融合教育的政策以及說明國際相關政策",
        "To provide an overview of historical and contemporary issues, concepts and values in the international field of inclusive education 介紹國際上融合教育在歷史與現今的議題、概念、價值觀演變趨勢。",
        "To apply research strategies in identifying issues and proposing solutions for inclusion 針對融合使用研究策略發現問題、並提出可能的解決方案"
    ],
    "syllabus": "**1.**        **Introduction to Course****課程介紹**\n\n**2.**        **Legal, historical, and philosophical basis ofinclusive education****融合教育基礎**\n\nUNESCO (1994). _TheSalamanca Statement and Framework for Action on Special Needs Education_.Paris: UNESCO.\n\nUN Committee on the Rights of Persons withDisabilities (CRPD), _General comment No.4_ (2016), Article 24: Right to inclusive education, 2 September2016, CRPD/C/GC/4, available at:https://www.refworld.org/docid/57c977e34.html \n\nAinscow, M., & César, M. (2006). Inclusiveeducation ten years after Salamanca: Setting the agenda. _European Journal of Psychology of Education, 21(_3), 231-238.\n\nInclusive education in the United States (Dr.Samantha Goldman, Assumption College, USA)\n\n**3.**        **Inclusion or Exclusion? Have we gone too far?****融合或是排除？我們做過頭了嗎？**\n\nLindsay, G. (2003). Inclusive education: Acritical perspective. _British Journal ofSpecial Education, 30_(1), 3-12.\n\nGilmour, A. F. (2018). Has inclusion gone too far?Weighing its effects on students with disabilities, their peers, and teachers. _Education Next, 18_(4), 8-17.\n\nSlee, R. (2011). The irregular school: Exclusion,schooling and inclusive education. UK: Routledge.\n\nPivik, J., McComas, J., & Laflamme, M. (2002).Barriers and facilitators to inclusive education. _Exceptional children, 69_(1), 97-107.\n\nBarton, L. (1997). Inclusive education: romantic,subversive or realistic?. _Internationaljournal of inclusive education, 1_(3), 231-242.\n\n**4.**        **Family-professional partnership****家庭與專業人員夥伴關係**\n\nHaines, S. J., Gross, J. M., Blue-Banning, M.,Francis, G. L., & Turnbull, A. P. (2015). Fostering family–school andcommunity–school partnerships in inclusive schools: Using practice as a guide. _Research and Practice for persons withsevere disabilities, 40_(3), 227-239.\n\n**5.**        **Setting up for successful inclusive education:Evaluation for the most appropriate services****為成功的融合教育奠基：評估最適切的教育**\n\nDe Boer, A., Pijl, S. J., & Minnaert, A.(2011). Regular primary schoolteachers’ attitudes towards inclusive education:A review of the literature_. Internationaljournal of inclusive education, 15_(3), 331-353.\n\nInclusive education in China (Dr. Kimberly Hu,Beijing Normal University, China)\n\n**6.**        **Class management and behavior support in inclusivesettings** **融合場域的班級經營以及行為支持**\n\nKamps, D., Wills, H. P., Heitzman-Powell, L.,Laylin, J., Szoke, C., Petrillo, T., & Culey, A. (2011). Class-widefunction-related intervention teams: Effects of group contingency programs inurban classrooms. _Journal of PositiveBehavior Interventions, 13(_3), 154-167.\n\nInclusive education in Japan\n\nInclusive education in Singapore (Dr. Jen-Yi Lee,Nanyang Technological University, Singapore)\n\n**7.**        **Academic accommodations for general curriculum I(adaptation and modification)** **普通教育課程的課業調整一**\n\nInclusive education in Australia (Dr. AriellaMeltzer, University of New South Wales, Australia)\n\n**8.**        **Universal Design Learning principals** **全方位學習原則**\n\nInclusive education in Korea (Dr. Hyojeong Seo,Konju University, Republic of Korea)\n\n9.        Mid-termOral Presentation 期中口頭報告\n\n**10.**      **Academic accommodations for general curriculum II(exam)** **普通教育課程的課業調整二**\n\nInclusive education in Turkey (Dr. Bekir FatihMeral, Sakarya University, Turkey)\n\nGroup Project: UDL lesson plans due\n\n**11.**      **Circle of friends: Peer support** **同儕支持**\n\nInclusive education in Democratic Republic of theCongo (Dr. Heather Aldersey, Queen’s University, Canada)\n\nInclusive education in Zambia(Dr. Martha Elford,University of Kansas, USA)\n\n**12.**      **Least to most: a first-hand experience of astudent with multiple disabilities** **多重障礙學生的經驗分享**\n\nCo-Teacher: Brian Jang, Tamkang University\n\n**13.**      **The least restrictive environment/ assistivetechnology** **最小限制原則****/****輔助科技**\n\nInclusive education in Latin America (Prof.Viviana Lucía Aya Gómez, University of La Sabana, Colombia)\n\n**14.**      **Collaboration with other professionals** **與其他專業人員的合作**\n\nInclusive education in Europe (Dr. Ann Balcells a-Balcells, Universitat Ramon Llull, Spain; Mr. Marco Lombardi, E-Qual Center atGhent University, Belgium)\n\n**15.**      **Response to Intervention and System Change** **介入反應模式與系統改革**\n\nSWIFT (Dr. Shana Haines, University of Vermont,USA)\n\nAinscow, M. (2005). Developing inclusive educationsystems: what are the levers for change?. _Journalof Educational Change, 6_(2), 109-124.\n\n**16.**      **Documentary: Including Samuel** **紀錄片觀賞****:** **跟山姆上學去**\n\nhttp://includingsamuel.com\n\n**17.**      **Across lifespan: Inclusion beyond classroom(post-secondary education, residential arrangement, employment, medical care,leisure activities)** **跨生涯階段****:****教室外的融合****(****大專階段、住宿、就業、就醫、休閒****)**\n\nSupportive employment (Dr. Grace Francis, GeorgeMason University, USA)\n\nRights to play (Dr. Angharad Beckett, Universityof Leeds, UK)\n\n**Re-examining inclusive education in Taiwan; Coursereview**",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "The class is structured around presentations from the instructor and international scholars who are actively doing research or providing direct supports in inclusive educational settings.\n授課教師以及有在進行融合實務或研究的國際學者共同講述相關議題。"
        },
        {
            "type": "Group discussion",
            "note": "Students are expected to come to class prepared to participate with their peers and to demonstrate that you have carefully and critically read all of the assigned material, can offer insights, ask relevant and significant questions. \nStudents are encouraged to use English in class. While grammar is not the major focus of this class, the instructor will provide feedback for students to improve when necessary.\n學生在上課前必須充分閱讀相關文章，在課堂中與同儕進行討論時展現對議題、文章的分析、並提出批判性的提問。\n學生們應以英語交談。雖然文法不是本課程的重點，教師在過程中仍會提出必要的修正，以讓學生進步。"
        },
        {
            "type": "Problem base learning",
            "note": "See assessment for more information on research hackathon.\n請閱讀評分部分關於研究黑客松的描述。"
        },
        {
            "type": "Cooperative learning",
            "note": "See assessment for more information on research hackathon.\n請閱讀評分部分關於研究黑客松的描述。"
        },
        {
            "type": "Media, audio, visual materials",
            "note": "In class, we would watch a documentary film entitled “Including Samuel ” and various relevant video clips. Students are expected to discuss guided questions.\n課堂中會觀賞一片紀錄片及其他相關影片。學生們可就指引問題進行討論與回答。"
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 20,
            "note": "UDL lesson plan is a group assignment that requires students to select one lesson plan, focus on two pupils with various abilities, and develop a guideline for accommodations for general education teachers.\nUDL教案這份團體作業請學生就之前曾教授過的教案，選定兩位不同能力的學生，撰寫出給普通教室閱讀的課程調整建議。"
        },
        {
            "type": "Attendances",
            "weight": 20,
            "note": "Attendance will be recorded for all classes and group meetingS. Students are expected to come to class prepared to participate with their peers and to demonstrate that you have carefully and critically read all of the assigned material, can offer insights, ask relevant and significant questions. \n小組討論及課堂參與將會作為出席紀錄參考。學生在上課期間的參與應反應出其課前的準備。"
        },
        {
            "type": "Presentation",
            "weight": 35,
            "note": "Each student is expected to search online for articles related to inclusive education and prepare a short in-class oral presentation (5 minutes) and a critical reflective one-page paper in English. \n每位學生將在授課教師帶領下選定與融合相關的文章，並準備五分鐘的英語口頭報告、搭配撰寫的一頁英語批判性短文。"
        },
        {
            "type": "other:",
            "weight": 25,
            "note": "Hackathon is an event where groups of students work together on projects for a concentrated period of time. The aim of a hackathon is to bring together students with complementary skills and knowledge to compose a short essay or research plan.\n黑客松為一個學生們在短時間聚焦於計畫，以高強度的專注力完成計畫的活動。黑客松的目的在於讓具備有互補技能與知識的學生聚集在一起，在短時間內完成撰寫一篇短文或是研究計畫。"
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}