{
    "year": 107,
    "term": 2,
    "name": "文化研究與觀光",
    "teachers": [
        "賴嘉玲"
    ],
    "department": "IM82",
    "code": "ETM0060",
    "credit": 3,
    "serial": 1359,
    "group": "",
    "quota": {
        "limit": 20,
        "additional": 5
    },
    "schedule": [
        {
            "day": 3,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "博404"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "本課程意圖介紹從文化研究的各種觀點如何來研究旅遊與觀光，包括現代後現代、後殖民、認同形構、空間與地方感、主客關係、旅遊導引與文化詮釋、象徵鬥爭、品味與區辨、具身化與感官、舞台化與品牌化、全球與在地化、多重流動性、行動網絡理論、物質性、危險與風險等。將使與課同學了解觀光旅遊與休閒如何歷史性地成形，並深深地介入現代社會生活。此課程一方面探討旅遊景點如何成形；其次探究中介部門，包括交通運輸科技，導覽媒介及各種文化詮釋如何介入旅遊景點的建構。另一方面著重於觀光消費者如何參與介入，不論參加旅遊團或自助旅行，運用攝影科技紀錄旅遊經驗與紀念品的採購與收藏，或冒險患難或重視安全保險，觀光客皆展現了各種層次的創造自身旅遊經驗的實踐。同時透過此課程，希望與課者將能深刻反省旅遊產業生成與觀光實踐中，所展演執行個體與社會性的轉變或再製，以及社會權力的建構與重構。",
    "goals": [
        "To gain professional knowledge on tourism studies",
        "To understand the cultural studies approaches",
        "To obtain the capacity to create and design the tourist attraction",
        "To understand the tourist practices and their cultural implication"
    ],
    "syllabus": "課程目標\n\n觀光旅遊休閒不再只是社會生活的邊陲化外殘餘項目，除了對經濟上的產值與就業創業之重大影響外，它更深入大眾社會生活，介入流動社會中全球在地矛盾動力的一步一趨，深入建構社會的儀式與重要事件，騷動日常生活文化互動時的一顰一笑，攪擾與定向社會生活的時間韻律與空間節奏，總之、此一遲來的社會文化議題已悄悄翻轉各面向的社會生活與文化。  \n本課程意圖介紹從文化研究的各種觀點如何來研究旅遊與觀光，包括現代後現代、後殖民、認同形構、空間與地方感、主客關係、旅遊導引與文化詮釋、象徵鬥爭、品味與區辨、俱身化與感官、舞台化與品牌化、全球與在地化、多重流動性、科技研究、物質性、危險與風險等。將使與課同學了解觀光旅遊與休閒如何歷史性地成形，並深深地介入現代社會生活。此課程分為二大部分，一方面探討旅遊景點如何成形，比如自然、歷史文化，事件節慶如何被對象化，且如何被挪用為值得觀看享用的旅遊點；其次探究中介部門，包括交通運輸科技，導覽媒介及各種文化詮釋如何介入旅遊景點的建構。另一方面著重於觀光消費者如何參與介入，不論參加旅遊團或自助旅行，運用攝影科技紀錄旅遊經驗與紀念品的採購與收藏，或冒險患難或重視安全保險，觀光客皆展現了各種層次的創造自身旅遊經驗的實踐。同時透過此課程，希望與課者將能深刻反省旅遊產業生成與觀光實踐中，所展演執行個體與社會性的轉變或再製，以及社會權力的建構與重構。  \n此研究所課程主要以文獻閱讀與討論為主，相關於旅遊文化與消費的影片、藝術創作、展覽、活動、新聞議題以及個人旅遊經驗分析分享則將是課程討論中輔助的素材。學期中將安排一次校外專家演講與校外參訪(課堂討論後決定)。  \n修習本課程的與課同學將不僅學得從文化研究觀點對觀光旅遊分析的專業知識，並可醞釀未來對觀光與文化產業的分析與規劃能力，也培養同學對自身遊歷的反身性的理解，以及對跨文化社會倫理與美學的認識。\n\nThis course aims to introduce the perspectives of cultural studies on tourism research. It explores concepts from modernity, post-modernity, post-colonialism, identity formation, space/places, host-guest relationship, guiding and culture interpretation, symbolic struggle, taste and distinction, embodiment and senses, staging and branding, global-local politics, multiple mobilities, STS, materiality, danger and risk, surveillance society, non-places and complexity. It also includes main tourism topics on destination-making and places in branding, media technology and intermediate guiding system, cultural heritage and festival making, hospitality and service culture, identity formation and consumption practices, transportation and touring culture, as well as tourist practices of photo-taking and souvenirs-collecting.  \nAfter taking this course, students will not only gain professional training for understanding tourism from the perspective of cultural studies, but also can apply these knowledge practically on their future career on cultural and tourism planning.\n\nWeek 1 Cultural Studies on Tourism: An Introduction.  9/11  \nWhen culture studies and tourism studies meet up\n\nWeek 2 What is Tourism? Tourist Gaze and Beyond 9/18\n\nUrry, John and Jonas Larsen. 2011. The Tourist Gaze3.0. London: Sage. Chap 1, 8.  \n(中文版 觀光客的凝視 第二版 葉浩譯 台北: 書林)  \nMacCannell, Dean. 1989. The Tourist. New York: Schocken Books. Chap 5.  \nLöfgren, Orvar. 1999. ‘Introduction’ in On Holiday. London: University of California Press. (中文版  度假 台北: 藍鯨出版社) preface, Chap 1, Chap8.\n\nWeek 3 Destinations in the Making: Nature/Culture under the tourist gaze  自然旅遊景點的製造: 談自然的文化化 9/25\n\nUrry, John. 1995. ‘The Making of the Lake District’, in Consuming Places. London: Routledge.\n\nShields, R. 1991. ‘Niagara Falls: Honeymoon capital of the world’ in Places on the Margin: Alternative geographies of modernity. London and New York: Routledge. Pp: 117-162.\n\nSheller, Mimi. 2003. ‘Iconic islands: nature, landscape, and the tropical tourist gaze’ in Consuming the Caribbean. London: Routledge.\n\nWeek 4 Destinations in the Making: Staging and branding  10/2\n\nEdensor, Tim. 2011. ‘Tourism and performance’, in Sage Handbook of Tourism Studies, edited by Tazim Jamal and Mike Robinson, London: Sage. Pp. 543-557.\n\nBryman, A. 1995. Disney and his worlds. London: Routledge.  \n(或中文版的迪斯尼風暴 The Disneyization of Society)\n\nRef:  \nKirshenblatt-Gimblett, B. 1998. Destination Culture: Tourism, Museums, and Heritage. London: University of California Press. Chap 1.\n\nWeek 5 Cultures and Heritages under the tourist gaze 10/9\n\nUrry, John and Jonas Larsen. 2011. Tourist Gaze. 3.0. London: Routledge. Chap.6.\n\nMacDonald, Sharon. 2011. Difficult Heritage: Negotiating the Nazi Past in Nuremberg and beyond. London: Routledge. (Introduction)\n\nRef:  \nDicks, Bella. 2003. Culture on Display: The Production of Contemporary Visitability. Ch 5,6,7\n\nWeek 6 Events and Tourist destinations  10/16\n\nRoche, Maurice. 2000. ‘Mega-events and cultural citizenship: consumption, inclusion/exclusion and internationalism’ in Mega-Events and Modernity. London: Routledge.\n\nRoche, Maurice. 2000. ‘Mega-events, cities and tourist culture: Olympics and expos’ in Mega-Events and Modernity. London: Routledge.\n\n  \nWeek 7 Transportation and Tourism  10/23\n\nSchivelbusch, W. 1986. The Railway Journey. Trains and Travel in the Nineteenth Century. Oxford: Blackwell. Chap 3,4,5\n\nMark Gottdiener. 2001. Life in the Air: Surviving the New Culture of Air Travel.  \nRowman & Littlefield Publishers, Inc.: Lanham, MD\n\nRef:  \nSaulo Cwerner, Sven Kesselring and John Urry edited 2009. Aeromobilities. London: Routledge.\n\n  \nWeek 8 Destinations on the move  10/30\n\nCresswell, Tim. 2006 ‘The Production of Mobilities at Schiphol Airport, Amsterdam’ , On the Move. London: Routledge.\n\nAuge, Marc. 1997. Non places. London: Verso.\n\nWeek 9 Working under the tourist gaze  11/6\n\nUrry, John. 2011. Tourist Gaze 3.0.. London: Sage. Chap 4.\n\nCynthia Enloe. 2000. ‘On the Beach: sexism and Tourism’, in Bananas, Beaches and Bases: Making Feminist Sense of International Politics. Berkeley: University of California Press (updated edition).Pp. 19-41.\n\n  \nWeek 10 Regulating/ Mediating tourist gaze: 11/13\n\nMacDonald, Sharon. 2011. Difficult Heritage: Negotiating the Nazi Past in Nuremberg and beyond. London: Routledge. Chap 7.\n\nEdensor, Tim. 1998. Tourist at the Taj. Chap 2.\n\nRef:  \nGrewal, Inderpal. 1996. ‘The Guidebook and the Museum’, in Home and Harem, London: Leicester University Press.\n\nWeek 11 Mid-term paper submission and discussion 11/20\n\nWeek 12-18 The Performance of Tourists/ travellers  旅者的展演\n\nWeek 12 Package tour v.s. Canivalesque tour: What is freedom?  11/27\n\nGeorge Ritzer and Allan Liska. 1997. ‘ “McDisneyization\" and \"Post-Tourism\": Complementary Perspectives on Contemporary Tourism\" in Chris Rojek and John Urry, eds. Touring Cultures: Transformations in Travel and Theory. London: Routledge: 96-109\n\nHetherington, Kevin. 2000. ‘Free festivals: Consumption, belonging and the carnivalesque’ in New Age Travellers. London: Cassell.\n\nEdensor, Tim. 1998. Tourist at the Taj. Chap 4.\n\nWeek 13 Travelling with Cameras: Tourist photography and video 12/4\n\nCrawshaw, Carol and John Urry, “Tourism and the Photographic Eye,” in Touring Cultures: Transformations of Travel and Theory, eds. Chris Rojek and John Urry (London & New York: Routledge, 1997), 176-95.\n\nUrry, John and Jonas Larsen. 2011. The Tourist Gaze. 3.0. London: Routledge. Chap. 7.\n\nRef:  \nOsborne, Peter D. 2000. “Travel Products: Promoting the Tourist Vision,” in Travelling Light: Photography, Travel, and Visual Culture. Manchester: University of Manchester Press. Pp: 78-91.\n\nWeek 14 Travelling with objects: souvenirs and collecting 12/11\n\nRogan, Bjarne. 2005. ‘An Entangled Object: The Picture Postcard as Souvenir and Collectible, Exchange and Ritual Communication’, Cultural Analysis, Vol 4: 1-27.\n\nLury, Celia. 1997 \\`The objects of travel\\` in C. Rojek and J. Urry (eds.) Touring Cultures: Transformations of Travel and Theory, Routledge, pp.75-95.\n\nRef:  \nStewart, Susan. 1993. ‘Objects of desire: Part I, Souvenirs’ in On Longing. Duke: Duke University Press.\n\nWeek 15 Travelling with danger/risk: dark tourism and complexity   12/18\n\nBowman, Michael and Phaedra C. Pezzullo. 2009. ‘What’s so ‘dark’ about ‘dark tourism’? Death, Tours, and Performance’, Tourist Studies. Vol 9(3): 187-202.\n\nUrry, John and Jonas Larsen. 2011. The Tourist Gaze. 3.0. London: Routledge. Ch. 9.\n\nRef:  \nLewis, Neil. 2000. ‘The Climbing Body, Nature and the Experience of Modernity’ in Body and Society. Vol. 6 (3): 58-80.  \nUrry, John. 2004. ‘Death in Venice’ in John Urry and Mimi Sheller (eds.) Tourism. Mobilities: places to play, places in play. London: Routledge.\n\nSpecial topics: Dark tourism  \n電影: 南亞海嘯 Tsunami\n\nWeek 16 Travelling inequality and the ethics of sightseeing 12/25\n\nTorpey, John. 2000. The Invention of the Passport: Surveillance, Citizenship and the State. New York: Cambridge University Press.\n\nMacCannell, Dean. 2011. ‘Toward an ethics of sightseeing’, in The Ethics of Sightseeing. London: University of California Press.\n\nRef:  \nBauman, Zygmunt. 1998. ‘Tourists and Vagabond’ in Globalisation. London: Polity Press.\n\nWeek 17 1/1 放假\n\nWeek 18 Conclusion 1/8  \nFrom tourism to mobile cultures",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "出席",
            "weight": 20,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 80,
            "note": "期中報告30%，期末報告50%"
        }
    ],
    "prerequisite": "",
    "general_core": []
}