{
    "year": 110,
    "term": 2,
    "name": "知識服務設計與實務",
    "teachers": [
        "邱銘心"
    ],
    "department": "EM15",
    "code": "ISM0637",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 483,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 0
    },
    "schedule": [
        {
            "day": 2,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "圖資所研討室A"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "「知識服務設計與開發實務」總整課程之授課對象為本所碩二以上學生，透過一系列閱讀、演講、參訪、競賽、以及企業實習等多元活動，學生從(1)海外學術圖書館（美國University of Wisconsin-Madison Library或University of Wisconsin-Milwaukee Golda Meir Library）、(2)國內國家級與大型市立公共圖書館、與(3)國內網路資訊服務企業三個選項則一參與。課程主題依據總整課程精神I（Integration整合）-C（Closure總結）-R（Reflection 反思）-T（Transition轉銜）-I（Inspection檢視）五個步驟執行，每四週為一個單元，採一週指導老師上課，三週親赴企業實習的模式進行。學生在期末針對企業實習所完成的知識服務設計與開發成果提出專題報告。計畫主持人與企業負責人將與修課學生共同進行課程總檢討，藉由三方討論與交流提出對於本所課程規劃與學習環境營造之建議。",
    "goals": [
        "「探究」與「實作」的本質，整合本所基礎與應用領域的課程內涵"
    ],
    "syllabus": "課程進行的具體規劃分為下列三個階段進行：\n\n1.      課程進行前\n\n1.1       企業招募說明會：開學前一個月，由計畫主持人、共同主持人、以及其他計畫成員（本所所有教師）邀集知識服務產業之企業（網路資訊業與圖書館界）負責人與主管前來本所，了解本所規劃總整課程之概況，並確認企業參與本計畫之意願。目前鎖定的企業分屬三類知識服務產業：(1)海外學術圖書館（美國University of Wisconsin-Madison或University of Wisconsin-Milwaukee Golda MeirLibrary）、(2)國內國家級與大型市立公共圖書館、與(3)國內網路資訊服務企業。海外學術圖書館單位為本所長期合作對象美國University of Wisconsin或University of Wisconsin-Milwaukee總圖書館，國內國家級圖書館與大型市立公共圖書館則鎖定國家圖書館、國立公共資訊圖書館、台北市立圖書館與新北市立圖書館。網路資訊服務業則聚焦網路搜尋引擎與資訊檢索（Google、Yahoo、意藍科技）、數位媒體與行銷（安索帕Isobar、安布思沛iProspect）、使用者經驗與互動設計（悠識、應用劇本實驗室）等目前快速發展的網路資訊服務企業。\n\n1.2       企業媒合說明會：開學前兩週，由計畫主持人、共同主持人、以及其他計畫成員（本所所有教師）邀集知識服務產業之企業（國內外圖書館界與網路資訊服務業）負責人與主管前來本所，針對各企業概況以及實習職缺，對本所碩二同學進行介紹與說明。說明結束後由同學對有興趣的職缺所屬企業負責人直接面談並繳交履歷表，最後完成職缺志願排序。\n\n1.3       職缺志願排序與分發：計畫主持人收齊職缺志願排序卡後，與企業負責人共同針對學生志趣專長與人格特質，商討分發事宜，決定分發結果並公告。\n\n1.4       課程說明會：開學前一週公告職缺分發結果，並招開課程說明會，說明課程內容與進行方式、企業實習注意事項、以及教學評量標準等。\n\n2       課程進行中：本課程將透過一系列閱讀、演講、參訪、競賽、以及企業實習等多元活動，每四週為一個單元，採一週指導老師上課，三週親赴企業實習的模式進行。課程主題依據總整課程精神I（Integration整合）-C（Closure總結）-R（Reflection 反思）-T（Transition轉銜）-I（Inspection檢視）五個步驟執行，以下分述之：\n\n2.1       整合（Integration）：修課學生必須為本所碩二以上學生，必須修習過「圖書資訊學導論」與「研究方法」，並且必須在本所三類選修科目「資訊社會」、「圖書資訊使用者研究、學習與教學研究」、與「圖書資訊管理、科技應用、機構管理與行銷」 中至少選修過兩類課，藉由閱讀、參訪、演講等課程活動，修課學生得以整合應用過去研究所一年所學之知識。\n\n2.2       總結（Closure）：修課學生以小組方式進行企業實習專案，實習機構類型主要分為三種：圖書館以及網路資訊服務業，由修課學生依據志願以及企業選才標準進行媒合與分配。對於選擇圖書館為實習單位的學生而言，本門課可視為本所「資訊服務機構管理研究」、「數位出版研究」、「數位典藏與數位圖書館研究」、「學習素才設計與製作」、「資訊資源管理研究」、「中小學圖書館經營暨閱讀研究」、「線上參考諮詢服務」等圖書館學課程之延伸。而對選擇網路資訊服務業為實習單位的學生而言，本門課可視為本所「資訊服務機構管理研究」、「網路技術研究」、「數位內容行銷研究」、「人資互動研究」、「資訊架構專題研究」、「資料探勘技術與應用專題研究」、「多媒體設計與評估研究」等資訊科學課程之延伸。透過企業實習以及期末專題計畫，給予學生總結在專業領域的學習機會。\n\n2.3       反思（Reflection）：透過期末專題計畫驗收以及期末座談會，給予學生反思個人發展抉擇的機會，確認畢業後的職涯規劃路線。根據本課程之規劃，學生得以藉由修課機會評估自己的專長與興趣是否符合繼續就學攻讀博士班或其他領域碩士班，以及朝向圖書館或網路資訊服務業發展。\n\n2.4       轉銜（Transition）：透過前述總整課程“反思“機會，學生得以檢視自己在學習上的優劣勢，授課教師輔導學生運用畢業前的剩餘學期，修習符合其生涯規劃之課程，作為銜接職場的準備。\n\n2.5       檢視（Inspection）：課程最後一週，計畫主持人與企業負責人將與修課學生共同進行課程總檢討，分別就自我表現評估、個人收穫、面臨問題與解決方式、給課程與給所上之建議，藉由三方討論與交流提出對於本所課程規劃與學習環境營造之建議。\n\n課程結束後：本課程結束後，計畫主持人撰寫結案報告，並在本所所務會議上針對課程規劃及學生輔導事宜提出建議，若經通過則實施。",
    "methodologies": [
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "實驗/實作",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 20,
            "note": ""
        },
        {
            "type": "其他",
            "weight": 60,
            "note": "企業實習"
        }
    ],
    "prerequisite": "",
    "general_core": []
}