{
    "year": 109,
    "term": 2,
    "name": "文學與文化研究方法",
    "teachers": [
        "路愷宜"
    ],
    "department": "LD21",
    "code": "END1063",
    "credit": 3,
    "serial": 1554,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "雲204"
        }
    ],
    "programs": [],
    "comment": "教室位於雲和街大樓2樓（地址：雲和街1號），外校學生需申請門禁權限。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "A",
    "hours": 3,
    "description": "本課程主要目的為協助文學組博士班學生更進一步精進研究方法，並熟悉文學、文化研究領域目前的發展方向，為未來從事學術工作做準備。同時以個別諮詢方式，輔導學生尋找自己的研究興趣。  實際執行方式包括： １．\t帶領學生研讀幾個特定領域近年出版的期刊文章與專書章節，了解各領域目前的研究現況與發展脈絡。研讀教材部份由授課教師事先指定，部份則視學生個別興趣調整。某些課程將邀請校內外學有專精的教授擔任客座講師。 ２．\t以工作坊方式，幫助學生精進研究方法及論文寫作技巧。同時指導學生對自己感興趣的領域的期刊及當前研究趨勢進行調查。 ３．\t指導學生實際完成一篇可發表的會議論文。 ４．\t以個別談話方式，幫助學生鎖定可能的研究目標，並與學生討論學術寫作問題。 ５．\t要求學生參加學術活動，紀錄心得。",
    "goals": [
        "協助文學組博士班學生更進一步精進研究方法，並熟悉文學、文化研究領域目前的發展方向，為未來從事學術工作做準備"
    ],
    "syllabus": "Course instructor: Ioana Luca\n\nE-mail: ioanaluca.ntnu@yahoo.com    \n\nOffice: 703\n\n**RESEARCH METHODS: LITERARY AND CULTURAL STUDIES**\n\n**Spring 2021**\n\n**Course Description**\n\nThis seminar is meant to further familiarize students with current debates in literary and cultural studies and enhance their research skills for doctoral studies. Each session brings together a theoretical component and a practical aspect relevant to doctoral studies.\n\n**Objectives**\n\n*   to further familiarize students with recent developments in literary and cultural studies;\n*   to provide insight on writing a PhD dissertation;\n*   to offer assistance with the students’ current writing and research methodology;\n*   to train students about different stages of early academic life (conference presentation, grant proposals, job applications/interviews).\n\n**Attendance**: The collaborative, workshop-style nature of this course makes your presence in class **imperative**.\n\n**Requirements:** Weekly readings and assignments should be completed _prior to_ the class discussion. The seminar workshop format requires constant collaborative thinking, close reading, careful analysis of work under discussion, and full commitment to the work of the course.\n\n**Grade:** Class participation & Moodle responses 50%; Written assignments 50%.\n\n**Readings:** Course pack & materials posted on Moodle.\n\n**Course schedule**: The weekly schedule will be posted on Moodle before the first class.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "實地考察、參訪",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 10,
            "note": "assignments for individual sessions; revision of conference paper"
        },
        {
            "type": "課堂討論參與",
            "weight": 25,
            "note": "preparation and discussion of reading assignments"
        },
        {
            "type": "出席",
            "weight": 5,
            "note": "attendance at class meetings and individual sessions"
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "mock conference presentation; \"state of the field\" presentation"
        },
        {
            "type": "成果展覽",
            "weight": 15,
            "note": "dissertation project presentation"
        },
        {
            "type": "其他",
            "weight": 15,
            "note": "compilation of bibliography for a qualifying exam"
        }
    ],
    "prerequisite": "",
    "general_core": []
}