{
    "year": 107,
    "term": 2,
    "name": "質的研究",
    "teachers": [
        "蔡如音"
    ],
    "department": "IM88",
    "code": "MCM0013",
    "credit": 3,
    "serial": 1416,
    "group": "",
    "quota": {
        "limit": 20,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 3,
            "to": 5,
            "campus": "本部",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "教室：綜合大樓7樓大傳所大教室",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "(1) To explore the multiple entry points into qualitative inquiry, (2) To feel and think through unique research experience; (3) To engage qualitative inquiry as an interdisciplinary practice and beyond the classroom; (4) To write and practice storytelling in creative ways and (5) To gain confidence in articulating one’s concerns and inquiry methods.",
    "goals": [
        "To explore the multiple entry points into qualitative inquiry",
        "To feel and think through unique research experience",
        "To engage qualitative inquiry as an interdisciplinary practice and beyond the classroom",
        "To write and practice storytelling in creative ways",
        "To gain confidence in articulating one’s concerns and inquiry methods"
    ],
    "syllabus": "WK 1      2/22        Introduction; Keywords Raffle Game\n\nÜFind a creative way to teach your keywords to the class on WK 3. Individual or collaborative methods both encouraged.\n\nÜRelevant references: (1) _Keywords in Qualitative Methods—A Vocabulary of Research Concept_ (Michael Bloor and Fiona Wood, 2006, Sage); (2) _Qualitative Inquiry—A Dictionary of Terms_ (Thomas A. Schwandt, 1997, Sage); (3) _Qualitative Communication Research Methods_, 2nd ed (Thomas Lindlof and Bryan C. Taylor, 2002)\n\nWK 2       2/29        No class (228紀念日)\n\nWK 3       3/7          Ethnography and Media; Teaching Key Concepts\n\nÜ (Read) Willis, Paul and Mats Trondman (2002) “Manifesto for ethnography.” _Cultural Studies-Critical Methodologies_ 2(3): 394-402\n\nÜ (Read) Ortner, Sherry. “Studying Sideways: Ethnographic access in Hollywood.” In _Production Studies: Cultural Studies of Media_ (Chapter 13).\n\nÜ (Browse) Ma, Eric. (2005) “Working and spending in South China: a methodological experiment with visual ethnography.” _Inter-Asia Cultural Studies_ 6(1): 113-125.\n\nÜ (Browse) Pink, Sarah et al. (2015) “Tactile digital ethnography: Researching mobile media through the hand.” _Mobile Media & Communication_ Dec. 16 2015.\n\nWK 4       3/14        Guest Lecture on Sound Ethnography by Dr. Wendy Hsu\n\nPh.D. in Critical and Comparative Studies in Music, University of Virginia; ACLS Public Fellow at Department of Cultural Affairs, Los Angeles, USA\n\nÜ (Read): Chapter 1 “Writing Culture and Recording Culture” and 2 “Sonic Compositions” in _Recording Culture_ (Daniel Makagon and Mark Neumann, 2009, Sage).\n\nWK 5       3/21        Feminist Approaches\n\nÜ(Read) Yang, Fangchi (2008). “Engaging with Korean Dramas: Discourses of Gender, Media, and Class Formation in Taiwan.” _Asian Journal of Communication_ 18(1): 64-79.\n\nÜ(Read) “Postfeminist Media Culture?” in _Gender and the Media_ (Rosalind Gill, 2007, Cambridge): 249-271.\n\nÜCollaborative learning issue: Explicate Yang’s feminist positionality.\n\nWK 6       3/28        What kind of feminist are you? (Collaborative issue)\n\nÜ(Read) Tyler, Imogen et al. “Methodological fatigue and the politics of the affective turn.” _Feminist Media Studies_ 8(1): 85-99.\n\nÜ(Browse) Bivens, Rina. “Under the hood: the software in your feminist approach. _Feminist Media Studies_ 15(4): 714-717.\n\nÜ (Read) 陳明莉 《身體再思考—女人與老化》：第四篇中高齡女性的服飾打扮、身體展演及其自我建構：「回憶工作」研究法的實踐與反思（巨流, 2011）: 145-190\n\nWK 7       4/4          Spring break, No Class.\n\nWK 8       4/11        Times of Studying Media and Cultural Production\n\nÜ(Browse) Stonebely, Sarah. “The social and intellectual contexts of the US Newsroom Studies and the media sociology of today.” _Journalism Studies_ 16(2) 2013: 259-274.\n\nÜ(Browse) “Labour, new media and the institutional restructuring of journalism.” _Journalism Studies_ 11:4 (2010): 487-499.\n\nÜ(Read) McRobbie, Angela. “Clubs to companies: Notes on the decline of political culture in speeded up creative worlds.” _Cultural studies_ 16.4 (2002): 576-531.\n\nÜ(Read) Hesmondhalgh, David and Andy C. Pratt. “Cultural industries and cultural policy,” _International Journal of Cultural Policy_ 11.1 (2005): 1-14.\n\nÜCollaborative issue: How did the turn to studying cultural industries come about? Also refer to special issue in _International Journal of Cultural Policy_ 16.3 (2010)?\n\nWK 9       4/18        Production as lived and symbolic experience\n\nÜ (Browse) Music culture studies; why study fans? Subculture?\n\nThornton, Sarah. “Understanding hipness: Subcultural capital as feminist tool.” In _The Popular Music Studies Reader_, 99-105.\n\nÜ Collaborative issue: Browse the following four master’s thesis and review the authors’ research strategies and relationship with the “culture” they studied: (1) 次文化經濟能量之展現（張詩芸，民95）(2) 正統性的對戰：台灣嘻哈饒舌樂的音樂政治（莊景和，民94）(3) 日系混血美：台灣本土時尚圈的生產邏輯 （劉仰芳，民101）(4) 與K-Pop共舞Cover Dance與台灣年輕女性的身體實踐（黃瀞琦，民102) (5) 圖騰樂團音樂實作的美學與真誠性（馮靖惠，民97)\n\nWK 10    Poster Session 1: The most intimate theory to me\n\nWhat has been the most relevant theoretical underpinning in your own research exploration? How has this theoretical terrain changed?\n\nWK 11    5/2          Text, Discourse, Rhetoric, Narrative Data\n\nÜ (Read) Fursich, Elfriede. “In defense of textual analysis.” _Journalism Studies_ 10.2 (2009): 238-252. (Collaborative issue: what’s the matter with textual analysis?)\n\nÜ (Browse) Hardey, Mariann. “Marketing narratives: researching digital data, design and the in/visible consumer” in _Big Data? Qualitative Approaches to Digital Research_ Vol 13 (2014): 115-135.\n\nÜ (Read) 林應嘉〈從「全面禁絕」到「文創產業」：台灣電玩政策論述之變遷〉《傳播文化》14 (2015): 48-87.\n\nWK 12   5/9          Analysis of Visual Materials\n\nÜ (Read) Rowsell, Jennifer et al. “Visual optics: interpreting body art, three ways.” _Visual Communication_ 12.1 (2013): 97-122.\n\nÜ Collaborative Issue: Read 1-2 articles from the special issue on “selfies” in the journal, _International Journal of Communication_ vol 9., 2015. Discuss relevant issues and methodologies concerning working with visual material.\n\nWK 13    5/16        Poster session 2:\n\nDo a critical methdoological review of key studies on your topic. What conceptual issues did you feel to be important? What research strategies do you find worthy of discussion?\n\nWK 14    5/23        Thickness and thinness of interviews\n\nÜ (Read) 林淳得，〈網路酷兒再現娘娘腔〉in《跨性別》(何春蕤編 2013): 221-278.\n\nÜ (Read) Pezalla, Anne. E et al. “Researching the researcher-as-instrument: an exercise in interviewer self-reflexivity.” _Qualitative Research_ 12 (2012): 165-185.\n\nÜ (Browse) Fitch, Kate. “Making history: Reflections on memory and elite interviews in public relations research.” _Public Relations Inquiry_ 4.2 (2015): 131-144.\n\nWK 15    5/30        Conditions and Responsibilities Participation\n\nÜ (Read) O’Reilly, Michelle and Nicola Parker. “Unsatisfactory saturation’: a critical exploration of the notion of saturated sample sizes in qualitative research. _Qualitative Research_ 13(2013): 190-197.\n\nÜ (Read) Pinter, Annamaria and Samaneh Zandian. “I thought it would be tiny little one phrase that we said, in a huge big pile of papers’: children’s reflections on their involvement in participatory research.” _Qualitative Research_ 15.2 (2015):235-250.\n\nWK 16    6/6          Action Research, Researcher as Activist\n\nÜ (Read) 邱林川，〈南方兩週末：工民新聞、批判媒介素養與傳播賦權〉，《傳播與社會學刊》34 (2015): 151-184.\n\nÜ (Browse) Wang, Jing. “NGO 2.0 and social media praxis: activist as researcher.” _Chinese Journal of Communication_ 8.1 (2015): 18-41.\n\nÜCollaborative issue: Reflect on your positionality in your research.\n\nWK 17    6/13        Poster Session 3: Annotated bibliography draft\n\nAn annotated bibliography on your methodological concerns that reflects your (1) knowledge of the methods traditions, (2) views on key studies on your topic, and (3) strategies of data collection and analysis.\n\nWK 18    6/20        Due: Annotated bibliography\n\nTurn in a hard copy of the complete annotated bibliography with an overview, conclusion, and a clear organization. (4,000 words in Chinese and 2,500 in English).",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": "Annotated bibliography: An annotated bibliography on your methodological concerns that reflects your (1) knowledge of the methods traditions, (2) views on key studies on your topic, and (3) strategies of data collection and analysis"
        },
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": "In-class collaboration learning presentation: These are short, peer teaching presentations based on the readings."
        },
        {
            "type": "報告",
            "weight": 40,
            "note": "Poster sessions: See weekly schedule for poster session assignments. Prepare a poster (between one to four A4 paper size) showcasing your findings"
        }
    ],
    "prerequisite": "",
    "general_core": []
}