{
    "year": 108,
    "term": 1,
    "name": "國文（一）",
    "teachers": [
        "林玉玫"
    ],
    "department": "CU",
    "code": "00UA755",
    "credit": 2,
    "serial": 269,
    "group": "",
    "quota": {
        "limit": 35,
        "additional": 0
    },
    "schedule": [
        {
            "day": 5,
            "from": 1,
            "to": 2,
            "campus": "公館",
            "classroom": "綜合館002"
        }
    ],
    "programs": [],
    "comment": "數學系、生科系、地科系、資工系、物理系、化學系、光電工程學士學位學程",
    "restrict": "◎第一階段需人工加選◎第二階段需人工加選◎加退選階段需人工加選",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本課程同時具有語文教育、文學教育與人文教育等性質。\n本課程教學的實施，以重視經典的現代意義，陶冶人文精神、訓練語文能力、提昇閱讀品味為目標，達成語文、文學、文化、生命四者內涵的深化。",
    "goals": [
        "指導學生掌握理解各類文本的方法。",
        "指導學生明瞭常用應用文的格式語法。",
        "提升學生分析、評論各類文本的能力。",
        "增進學生寫作各種文類的能力。",
        "強化學生聆聽及口語表達的能力。",
        "促進學生思考、組織、想像與創造的能力。",
        "誘導學生閱讀的興趣、培養學生閱讀的習慣與品味。",
        "指導學生研讀經典，以充實知識涵養、拓展人生視野、啟發對人文及不同種族文化的關懷與理解。"
    ],
    "syllabus": "第一單元   認識自我與展望未來\n\n【課程目標】\n\n    在大學入學考試之前，大家的目標或許很單純，就是挑選自己想要的領域，朝這方向考上理想的學校和科系。但在通過考試之後，也許會發現，人生的目標已經來到不同的階段了。大學教育更加重視自主、多元化學習，也勢必會認識更多不同的人，同時為了將來的就業，也需要培養更多專業知識。在這樣的情況之下，更應該深入了解自己，找到自我價值，明白李白所謂的「天生我材必有用」之真諦。\n\n    認識自我，重要的是明白自己的優缺點，與自己想要的是什麼。或許不能免俗的需要與其他人事物做比較，但比較的最終目的還在於體認自我與團體、社會的關係。本單元之目標，即希望能讓同學們對自我多一點探索與思考，並能認清自我的定位。在自我探索與思考部份，先以周震宇4E法則練習，用概括和解釋的方式來介紹自己。然後，透過東坡的故事與文學作品介紹，讓同學思考，一個「人物」的產生，與他的家庭環境、成長過程、人生遭遇往往有很大的關係，當自我與社會衝突，或者遇到挫折時，要該如何面對。希望透過這些步驟，讓學生能從初步的到深入的認識自我，並理解自我與團體、社會該處於何種關係，以期展望未來。\n\n【課程綱要】\n\n第1週    **1、課程導論**\n\n           **2、單元導論：擇你所愛與追求自我**\n\n                曾昭旭〈賈伯斯教了我們什麼？〉\n\n                賈伯斯在史丹佛畢業典禮演講影片觀賞\n\n第2週    **深度討論教學法說明**\n\n第3週    **自我定義：以周震宇「4E理論」練習**\n\n第4週    **國慶日調整放假**\n\n第5週    **共同國文思辨及寫作能力測驗（前測）**   \n\n第6週    **莫忘初衷與應對困境：**\n\n            蘇軾生平與〈卜算子〉、〈定風波〉\n\n第二單元   經典閱讀與深度思辨\n\n【課程目標】\n\n    每個時代都有當代流行和推崇的經典，有的經典甚至能一直經過時間的考驗，歷久不衰。但在今天，你或許曾經在書店看過《崩壞國文》的書；或看過《蒙娜麗莎的微笑》變成憤怒；孟克的《吶喊》變成通訊軟體的搞笑貼圖；愛因斯坦的相對論被改成「撩妹」語錄。權威與經典不斷被重塑或消解、顛覆，自然有好有壞，壞處是經典的價值可能受到貶低，好處則是能放下權威感，更貼近一般人的生活。但不論如何，在這種情況下，或許更應該思考，到底什麼才是經典？\n\n    因此，可試著先讓學生思考，什麼是經典？需要具備有什麼條件和價值？經典是可以重新定義的嗎？是可以批判與反思的嗎？接著，以他們所得出的「什麼是經典」這一結論，回過頭思考，在他們所學的領域中，又有哪些經典；或他們的領域中所謂的經典，是否符合這一結論？並期望藉由這一過程，讓學生能夠更深入思考，回到所謂的「文學經典」到底都在呈現與探討哪些問題，以及其不容忽視與值得延續的價值性。\n\n【課程綱要】\n\n第7週     **經典是什麼？能吃嗎？**\n\n             蘇軾〈念奴嬌〉（大江東去）到底是不是經典？\n\n第8週     **經典始終來自於人性——人最重要的是什麼？**\n\n             唐傳奇《杜子春》、芥川龍之介《杜子春》\n\n第9週     **經典始終來自於人性——人最重要的是什麼？**\n\n             唐傳奇《杜子春》、芥川龍之介《杜子春》\n\n第10週    **全校運動會停課**\n\n第11週     **專題演講**\n\n第12週    **善良的原則是什麼？**      \n\n             馬中錫《中山狼傳》與墨家可以教你的事\n\n第三單元  專題探索與優質表達\n\n【課程目標】\n\n    升上大學以後，同學將有機會認識不同科系和領域的人，甚至可能經常被問起：「你們科系都在學些什麼？」因此，不同科系間的彼此交流，是很可能會出現的狀況。而一個真正瞭解自己領域專業知識的人，是能夠用通暢明白、簡明好懂的表達方式呈現出來的。如果你有看過電影《三個傻瓜》，必然會記得裡面有一段情節：一個機械系的教授在課堂上，請同學解釋何謂「機械」，其中一位同學將教科書中複雜且充滿專業名詞的定義一字不漏的背出來，獲得教授的欣賞；而主角用另一種簡單好懂且更為生活化的方式解釋「機械」，卻被教授嗤之以鼻。姑且先不論哪種表達方式比較好，但若我們想要將自己的專業知識，讓非此專業的人理解，那麼先用一種簡單明瞭的方式表現，所獲得的效果可能會更好。\n\n    又或者，四年一次的世界盃開打時，總會有許多「一月球迷」出現，跟隨世界盃的風潮看球，但本身對於足球這項運動的知識卻很少，等世界盃結束，對這項運動的熱情也就隨著減退。於是，網路上有不少資深球迷，開始花不少心力寫作文章，介紹厲害的球星、知名的職業聯隊、好看的職業聯賽等等，期望能用有趣又淺顯的介紹，吸引這些「一月球迷」繼續收看比賽，將足球推廣給更多人知道。\n\n    因此，在本單元中，我們可以試著訓練自己有這樣的能力，能根據聽眾/觀眾/讀者的性質，用適當、流暢且易懂的方式表達自己的專業；同時，還要能夠將自己的專業領域中，具有價值、能解決問題的部分呈現出來，讓大家明白，每個領域都有其存在的意義和重要性。甚至，能因此對你的領域產生濃厚的興趣。\n\n【課程綱要】\n\n第13週    **如何寫好一篇文章？**\n\n            《金字塔原理：思考、寫作、解決問題的邏輯方法》第二章\n\n第14週    **深度議題討論：**\n\n             〈競爭的教育體系讓教育走向險路〉\n\n             延伸閱讀：〈被學霸耽誤的插畫家〉、〈競爭無用論？〉\n\n第15週    **共同國文思辨及寫作能力測驗（後測）**\n\n第16週    **開國紀念日放假**\n\n第17週    **期末成果報告，紙本繳交**\n\n第18週    **期末成果報告，紙本繳交**\n\n**\\* 課綱僅供參考，本課程內容單元設計，將會依照當學期行事曆之假期，與學生之學習進度，進行彈性調整與安排。評分方式亦可能依實際情況需要調整，教師保留最後的修改權利**\n\n**\\* 請尊重智慧財產權，在合理範圍內使用圖書與網路資源，作業與報告嚴禁抄襲**",
    "methodologies": [
        {
            "type": "講述法",
            "note": "教師講述與引導"
        },
        {
            "type": "討論法",
            "note": "深度討論法（Quality Talk），簡稱QT"
        },
        {
            "type": "問題解決教學",
            "note": "訓練問題意識、如何發問好問題"
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 25,
            "note": "每單元會有對應的作業，課前和課中有AB表練習，細節課堂公布"
        },
        {
            "type": "期末考",
            "weight": 30,
            "note": "採報告形式，主題為報導寫作，細節課堂公布"
        },
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": "以QT形式進行"
        },
        {
            "type": "其他",
            "weight": 15,
            "note": "前、後測表現"
        }
    ],
    "prerequisite": "",
    "general_core": []
}