{
    "year": 108,
    "term": 1,
    "name": "英文（三）：教育英文",
    "teachers": [
        "倪通"
    ],
    "department": "CU",
    "code": "00UB9B1",
    "credit": 2,
    "serial": 331,
    "group": "A",
    "quota": {
        "limit": 35,
        "additional": 0
    },
    "schedule": [
        {
            "day": 1,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "正401"
        }
    ],
    "programs": [],
    "comment": "*適合中初級程度以上同學修習。",
    "restrict": "◎必須先修過【英文（一）】◎必須先修過【英文（二）】",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "藉由主題式課程，加深學生對該領域實務趨勢認識、議題簡報、實務案例討論與批判分析。\n強化學生該領域之實務/任務型英語口語溝通、簡報、寫作表達能力。",
    "goals": [
        "增進職場實務知能",
        "提升英語組織與跨文化溝通表達能力",
        "培養實務案例批判及分析能力",
        "拓展國際視野及移動力",
        "促進實務領域的協作能力"
    ],
    "syllabus": "**Objectives****:**\n\n1)      to become more familiar with various issues in education—particularly K to 12—and to be able to discuss these in English;\n\n2)      to appreciate the role that educators play in society;\n\n3)      to improve our overall fluency in oral English and to become more comfortable with expressing ourselves orally;\n\n4)      to build our vocabulary and become more fluent readers of English;\n\n5)      to benefit from interacting with and sharing ideas with fellow classmates.\n\n**Course description****:**  In this course, we will read _Today I Made a Difference: A Collection of Inspirational Stories from America’s Top Educators_ (2009, edited by Joseph W. Underwood).  The writers of these stories are teachers and winners of the Disney Teacher Award in 2004.  They range from kindergarten to high school teachers, and they write about memorable and inspiring experiences in teaching.  We will read one story each week and engage in small-group and whole-class discussions about it.  The stories are about teaching in the United States, but we will focus on universal themes in these stories and invite students to share their own experiences and viewpoints.  Thus, speaking in English will be an important part of this course, and it is expected that students will be able to use English to express their thoughts.  Another of our objectives is to build our English vocabulary, therefore, we will have two tests to help with that learning.  There will also be a written assignment.\n\n**(IMPORTANT NOTE:  In the Thursday class, we will read the same book.)**\n\n**Please note****:**  This course will be taught in English by a native English speaker.  Also, _Today I Made a Difference_ was written for a native English-speaking audience.  **Therefore, this course will require at least a high-intermediate level of English.**  \n \n\n**General guidelines****:**\n\n**1)**      Students will be expected to prepare the homework before coming to class.  This will enable us to have meaningful discussions and other activities.\n\n**2)**      Please bear in mind that General English 3 is a required course.  Therefore, please come to class on time.  Being frequently late to class will affect your grade.  Also, and very importantly, more than three unexcused absences will put your grade in danger.  So please come to class.  We will try to make the course meaningful and enjoyable.  **In order to get an excused absence, use NTNU’s computer system to apply for a** **請假單** **.**",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 20,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 20,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 40,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 20,
            "note": ""
        }
    ],
    "prerequisite": "◎必須先修過【英文（一）】◎必須先修過【英文（二）】",
    "general_core": []
}