{
    "year": 108,
    "term": 1,
    "name": "英文（一）",
    "teachers": [
        "蘇子中"
    ],
    "department": "CU",
    "code": "00UB7A1",
    "credit": 2,
    "serial": 272,
    "group": "A",
    "quota": {
        "limit": 35,
        "additional": 0
    },
    "schedule": [
        {
            "day": 1,
            "from": 3,
            "to": 4,
            "campus": "公館",
            "classroom": "Ｃ006"
        }
    ],
    "programs": [],
    "comment": "理學院一年級 、光電工程學士學位學程(能力分班)",
    "restrict": "◎第一階段需人工加選◎第二階段需人工加選◎加退選階段需人工加選",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "共同科英文（一）課程為一學年課程，每學期兩學分，係為非英語系學生所開設的課程。目標在幫助大一學生活用中學時期所累積的英語知識，提昇英語聽、說、讀、寫整體的溝通能力。為達此目標，本課程要求教師盡量用英語上課，努力營造一個豐富的英語環境，讓學生不但有充分機會以英語參與課堂活動，且樂於使用英語與同學及老師溝通。",
    "goals": [
        "增進學生英語溝通表達能力",
        "透過參與課程活動促進團隊精神",
        "透過多面向英語閱讀促使學生了解多元文化，拓展學生國際化視野",
        "透過課堂討論培養批判精神",
        "提升學生英語學習動機及自主學習興趣"
    ],
    "syllabus": "**Course Objective**\n\nThis course aims to build and strengthen students’ overall English proficiency in the four areas of listening, speaking, reading and writing. Through extensive course works, students shall be able: (1). to develop their integrated language skills, (2). to hone up their verbal and written communication skills, and (3). to enhance their critical reasoning and analytical abilities. Special emphasis of this course is placed on the development of students’ reading competence. Selected course contents include an array of diverse topics and various genres that will allow students to build their reading comprehensions and skills, gain general knowledge, and expand their vocabulary base. Students are encouraged to take active participations in both in-class and after-class language practices and activities.\n\n**Required Textbooks**\n\nBrougham, Doris. _Advanced_. Taipei: Studio Classroom, 2018-2019.\n\nMeeting Schedule\n\n**_2018_**\n\n9/10               Course Introduction\n\nSelf-introduction: Getting to know each other\n\nMicro Movie Contest Introduction\n\n9/17               Self-introduction: Getting to know each other    \n\n**9/24                 Mid-Autumn Festival—No Class Meeting**\n\n10/1                 _Advanced_ October Issue       \n\n10/8                 _Advanced_ October Issue       \n\n10/15               _Advanced_ October Issue\n\n10/22               _Advanced_ October Issue\n\n**10/29               _Advanced_ October Quiz**\n\n11/5                 _Advanced_ November Issue\n\n11/12               _Advanced_ November Issue    \n\n11/19               _Advanced_ November Issue    \n\n**11/26               _Advanced_ November Quiz**   \n\n12/3                 _Advanced_ December Issue\n\n12/10               _Advanced_ December Issue\n\n**12/17**           **_End-of-the-Semester Show Time_**\n\n**12/24               _Advanced_ December Quiz**\n\n**12/31**               **New Year’s Day Holiday****—No Class Meeting**\n\n**_2019_**\n\n**1/9**                   **共同科英文（一）期末集中考試**\n\nCourse Requirements and Evaluation\n\n1.  Attendance and Preparation: Students are expected to attend the class well prepared, and to arrive to class on time. Tardiness and absences will affect your final grade. If you miss the class on more than three occasions, you will fail the course. (Official documentation is required for an absence.)\n2.  Class Participation and presentations, and English Micro Movie productions and presentations (20%): Active participations in class activities and language practices will foster your real-time communication skills and critical thinking, which will lead to a greater improvement in your English language learning. Therefore, you are required to actively participate in classroom activities such as pair/group discussions and make multiple oral presentations on assigned or chosen topics. In addition, in this semester, we will have an in-class English Micro Movie contest. Students are required to produce/show an English Micro Movie about 5 minutes in length per episode in class. 微電影製作比賽：各組學生集思廣益，內容不拘，撰寫英文腳本拍攝微電影，影片長度五分鐘，內容以全英語呈現，輔以英語字幕。\n3.  After-Class Listening & Speaking Practice (20%):\n\na). Weekly Listening Practice—Students will be required to practice their listening skills on a weekly basis by utilizing the audio and video resources provided at the Self-Access English Center (Located at 樸101). It is expected that students complete 3 times of listening practices before the mid-term and another 3 times afterwards, for a total of 6 visits. \n\nb). Weekly Speaking Practice—Students will be required to practice their English speaking skills at the English Chat Room. The minimum requirement for the speaking practices is 3 times before the mid-term and another 3 times after the midterm.\n\n1.  Three _Advanced_ Quizzes (60%) (20% each)\n\n**Extra Bonuses:**\n\n(1). Visit the English Self-Access center and/or the English Chat room more than the minimum requirement.\n\n(2). Participate or/and win a prize in any one type of English competitions held on campus (e.g. the drama competition, the writing contest...etc.)",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": ""
        },
        {
            "type": "期中考",
            "weight": 20,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 20,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 10,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}