{
    "year": 108,
    "term": 1,
    "name": "英文（一）",
    "teachers": [
        "胡浩洋"
    ],
    "department": "CU",
    "code": "00UB7A2",
    "credit": 2,
    "serial": 290,
    "group": "O",
    "quota": {
        "limit": 35,
        "additional": 0
    },
    "schedule": [
        {
            "day": 5,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "正202"
        }
    ],
    "programs": [],
    "comment": "教育學院、營養科學學位學程、音樂系、表演藝術學士學位學程、企管系、東亞系、華語系、競技系一年級(能力分班)",
    "restrict": "◎第一階段需人工加選◎第二階段需人工加選◎加退選階段需人工加選",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "共同科英文（一）課程為一學年課程，每學期兩學分，係為非英語系學生所開設的課程。目標在幫助大一學生活用中學時期所累積的英語知識，提昇英語聽、說、讀、寫整體的溝通能力。為達此目標，本課程要求教師盡量用英語上課，努力營造一個豐富的英語環境，讓學生不但有充分機會以英語參與課堂活動，且樂於使用英語與同學及老師溝通。",
    "goals": [
        "增進學生英語溝通表達能力",
        "透過參與課程活動促進團隊精神",
        "透過多面向英語閱讀促使學生了解多元文化，拓展學生國際化視野",
        "透過課堂討論培養批判精神",
        "提升學生英語學習動機及自主學習興趣"
    ],
    "syllabus": "**Objectives****:** This course is designed to support college freshmen in their use of **English language in academic context** and to improve their reading, writing, speaking, and listening abilities through activities that integrate the four language skills. The objectives of this class include developing students’ (1) **effective English reading skills**, (2) **improved fluency** in expressing ideas **in oral and written forms in English**, and (3) **autonomous self-study skills** using technologies such as computers and internet. In order to do so, there a four-pronged approach to the course:\n\n**1) Firstly,** the **course textbook and online practice website** emphasize vocabulary learning and building in order to provide students the structure and tools to acquire new words. There is also a purposefully structured skills and strategies program to propel language learning and create independent learners. Furthermore, the textbook helps improve reading proficiency and develop practical critical thinking.\n\n**2) Secondly,** students will undertake **two group task-based projects**, in which task groups of no more than 4 students per group.  The first group project is a movie review oral presentation and the second project is creating, writing, and filming their own short movie no longer than 5 minutes in duration.  Students will change project teams after the first project so that they can meet and make friends with other students in the class.\n\n**3) Thirdly,** the course will teach in class **Activity-Based Tasks** and **Mini Projects**, which are almost entirely completed during class time.  There might be some simple follow-on steps necessary for the student to enter results into their computer and upload, but the bulk of the activity will all be done during class.  The purpose of these Activity-Based Tasks and Mini Projects is accomplish dual learning of both English and a useful skill. These activities are generally two-person teams and students will change teams after each task or mini project so that they can meet and make new friends with other students in the class.\n\n**4) Finally**, students will practice their reading and writing skills by reading a high-level book and then writing a five-paragraph essay expressing their opinion about the novel.\n\n**Class Schedule**\n\nSchedule: This is a tentative schedule and _may change_ at the lecturer’s discretion!\n\nWk\n\nDate\n\nContent\n\nNotes\n\n1\n\n09/13\n\nHoliday – Mid Autumn Festival\n-----------------------------\n\nBBQ!\n\n2\n\n09/20\n\n1.  Introduction, Orientation\n2.  **Activity (in class):** “2 Truths and 1 Lie”\n\nMeet classmates and play social game\n\n3\n\n09/27\n\n   Unit 1: We All Need a Role Model\n\n4\n\n10/04\n\n1.  Unit 1: We All Need a Role Model\n2.  **Mini Project (in class)**  \n    Create your own Web Page!\n\nBefore class, please create a **free** account at www.codepen.io\n\n5\n\n10/11\n\nUnit 1: Search for Real Life Heroes\n\n6\n\n10/18\n\n1.  Unit 1: Search for Real Life Heroes\n2.  **Activity (in class):** Write your own NY Times “Fake” News Online Article\n\nAt home students will enter article in computer and take screenshot\n\n7\n\n10/25\n\nUnit 2: So Much Dead Space\n\n8\n\n11/01\n\n1.  Unit 2: So Much Dead Space\n2.  **Activity (in class)**: Logical Reasoning 1/2  \n    The Google Interview\n\n“Google” Interview to demonstrate your reasoning skills in English\n\n9\n\n11/08\n\n**Group Presentation:  \nMovie Review (8 minutes per group)**\n\nHard cut-off at 8 minutes, after that minus points\n\n10\n\n11/15\n\nUnit 2: Now on Stage: Your Home\n\n11\n\n11/22\n\n1.  Unit 2: Now on Stage Your Home\n2.  **Mini Project (in class):** Logical Reasoning 2/2  \n    Design a Game\n\nUse your logic skills to flowchart and design a game\n\n12\n\n11/29\n\nUnit 3: The Good Teen\n\n13\n\n12/06\n\n1.  Unit 3: The Good Teen\n2.  **Participation (in class):** Toastmaster 1/2\n\nPublic speaking\n\n14\n\n12/13\n\n1.  Unit 4: Two Styles of Writing\n2.  **Participation (in class):** Toastmaster 2/2\n\nPublic speaking\n\n15\n\n12/20\n\n1.  Unit 4: Two Styles of Writing\n2.  Book Review Outline\n\nBring your book review outline and 3 key points\n\n16\n\n12/27\n\n1.  Unit 4: Chinese Muslim Calligrapher \n2.  **Mini Project (in class):** Sketch out your own online story game\n\nBring to class a multiple story-line adventure idea\n\n17\n\n12/31\n\n1.  **Mini Project (in class):** Finish online story game\n2.  **Group Presentations Short Film**\n\n18\n\n01/03\n\n   **Group Presentation: Short Film**\n\n**Guidelines and Requirements: The Basics**\n\n1.  **Punctual attendance** **please**. The 8:00 am class is difficult, I know. But please drag yourself out of bed and carry yourself to class on time.  It’s good for you and also respectful to your fellow classmates.  We will have “warm-up” exercises at the beginning of each class so please come on time.  Talk to or email me if you can’t attend class.\n2.  This is a **Flip Class**. Prep work must be done for the class to work properly. This includes reviewing and previewing class chapters.\n3.  **Grades will be downgraded** for failure to attend class without reason, excessive lateness, lack of participation or failure to do assignments.\n4.  **In class activities and in class mini projects** will be scored a **0** if you do not attend with an unexcused absence. For you own benefit, you need to attend class to avoid getting a 0 for this category.\n5.  Smartphones, tablets, etc, must be **turned off** unless needed in class.\n6.  Actively **participate in class discussions**. This is your time to talk and have enjoy speaking in a foreign language.  Don’t be shy.  Learning a foreign language requires participation, and participation makes the class fun for you!\n7.  **What and Why**: When answering questions, please remember to answer with a “what” and a “why”.  The “what” is simply answering the question (what should the person do in this situation?), however, the “why” is much deeper – it is the explanation of your thought process.  The “why” answer is more interesting, more challenging, and if you can answer the “why” then your English will quickly improve.  I will often ask you “why”.\n8.  **Have fun and make friends.**  We will switch groups very often so you can meet everyone in the class and make new friends.\n9.  If another student asks you to temporarily exchange seats for an In-Class Activity or Mini Project, you must say **“Yes! Of course!”.** This facilitates classroom activities and maximizes everyone’s opportunity to meet and practice English with all the other students in the class.\n10.  **I want everyone to succeed.**  Everyone who attends, arrives on time, tries their best, turns in all their assignments, and participates in class will easily pass this course.  No worries.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "Classroom participation"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Attendance"
        },
        {
            "type": "報告",
            "weight": 15,
            "note": "Group Presentation: Movie Review (8 minutes)"
        },
        {
            "type": "成果展覽",
            "weight": 30,
            "note": "In class Activities and Mini Projects"
        },
        {
            "type": "專題",
            "weight": 25,
            "note": "Group Project: Create, Write, and Act in Your Own Short Film (5 minute video)."
        },
        {
            "type": "其他",
            "weight": 10,
            "note": "Individual Book Opinion Essay"
        }
    ],
    "prerequisite": "",
    "general_core": []
}