{
    "year": 110,
    "term": 1,
    "name": "歐洲神話",
    "teachers": [
        "梁孫傑"
    ],
    "department": "ZU93",
    "code": "PGUL048",
    "credit": 3,
    "serial": 3297,
    "group": "",
    "quota": {
        "limit": 60,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 16,
            "to": 11,
            "campus": "本部",
            "classroom": "博413"
        }
    ],
    "programs": [
        "歐洲文化學程"
    ],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "European mythology is not only one of the very sources of the Western culture and tradition, but the living spring of inexhaustible inspiration for literary and artistic creativity for the past generations, especially in the age of the technology and the Internet, its power and influence is further intensified. Whether it’s about love, hate, or revenge, what it shows are windows for us to see the philosophical thinking, artistic splendor, and humanistic grounding. The course will focus on the discussion of the stories and characters, with the help of contemporary representations (films, animations, graphic novels, etc.), intends to explore essential issues of the global concerns, such as identity, gender politics, eco-criticism, life philosophy, in the hope to expose students in the artistic experiences, and at the same time, to develop students’ independent critical thinking.",
    "goals": [
        "The constant communication between the acquired knowledge and the practical experience is the basic requirement in the development of learning.",
        "The application of classroom knowledge to practical experience helps students to be familiar with future challenges. A video presentation is required for the class.",
        "The mode of philosophical and ethical inquiry in a simulated international context is the way to develop capacities for independent judgment, critical thinking, and ethical reasoning.",
        "The goal of this course is the ultimate concern with the other literature and culture (or, the literature and culture of the other) through the speculative mode of thinking."
    ],
    "syllabus": "Tentative Schedule\n\n01      Orientation Meeting\n\n  Creation of human beings (1-9)\n\n**Greek and Roman Mythology**\n\n02      Prometheus: Time, Creation, and the PrimalSplit\n\n03      In search of the golden fleece\n\n04      Danaus and his 50 daughters\n\n05      Perseus\n\n  Oral Presentation 01\n\n06      Oedipus the King\n\n07      Marpessa’s marriage\n\n  Oral Presentation 02\n\n08      Antigone\n\n  Oral Presentation 03\n\n09      Mid-term Examination\n\n**Norse Mythology**\n\n10      From “The Player” to “The Treasure ofGods”\n\n11      From “The Master Builder” to “Thor’sJourney to the Land of the Giants”\n\n12      From “The Last Day of Loki” to “Ragnarok”\n\n  Oral Presentation 04\n\n**Celtic Mythology**\n\n13      From “The Birth of Cú Chulainn” to “TheFinal Battle”\n\n14      Tales from the Ulster Cycle\n\n  Oral Presentation 05\n\n15      Finn the Outlaw\n\n16      Final Examination\n\n17      Re-capitulation 01\n\n18    Re-capitulation 02",
    "methodologies": [
        {
            "type": "講述法",
            "note": "The instructor will conduct mostly interactive lectures."
        },
        {
            "type": "討論法",
            "note": "Questions will be prepared for the students to discuss."
        },
        {
            "type": "問題解決教學",
            "note": "Problems will be assigned to students who work as a team to solve them."
        },
        {
            "type": "合作學習",
            "note": "Students will be teamed up to do oral presentations."
        },
        {
            "type": "媒體融入教學",
            "note": "Students are required to do a short video, and upload it to YouTube."
        },
        {
            "type": "專題研究",
            "note": "Students are required to develop the solution to their assigned problem into a research project."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 10,
            "note": "Response paper"
        },
        {
            "type": "期中考",
            "weight": 20,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 20,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "Students’ contribution to the class discussion"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Being present in the class means to share opinions with the participants"
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "Oral presentation"
        }
    ],
    "prerequisite": "",
    "general_core": []
}