{
    "year": 107,
    "term": 2,
    "name": "英文散文選讀",
    "teachers": [
        "曾思旭"
    ],
    "department": "ZU92",
    "code": "PGUK004",
    "credit": 2,
    "serial": 3167,
    "group": "",
    "quota": {
        "limit": 35,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 8,
            "to": 9,
            "campus": "本部",
            "classroom": "誠304"
        }
    ],
    "programs": [
        "榮譽英語學程"
    ],
    "comment": "",
    "restrict": "◎第一階段限 榮譽英語學程",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "Students will gain an appreciation of prose literature in English, broaden related contextual knowledge, and improve their English comprehension and critical thinking. Students will be introduced to methods of “close-reading” whereby they will understand the elements of English writing style. This will be done through reading famous works of English fiction and non-fiction writing in long and short form along with a basic introduction to the terminology used when discussing fiction and non-fiction works in English. The class will include group discussions on the selected prose where free interpretation and critical opinion is encouraged and practiced.",
    "goals": [
        "強化學生英語文閱讀、聆聽的策略與能力，協助獲取專業領域新知",
        "提昇英語文口語、寫作的表達能力，期盼學生能於工作職場及學術研究領域展現英語專業涵養。",
        "協助學生深入瞭解國際社會的多元文化，培養國際觀，對特定文化現象進行分析、比較，激發學生之批判性思考能力。"
    ],
    "syllabus": "**Course description:**\n\nThis course is designed to enhance students’ English proficiency through guided reading of various prose texts written by women writers, including both fictional and non-fictional. The course will discuss various topics on women’s experiences of their bodies, such as body image, sexuality, sexual violence, and illness. Moreover, the course also invites students to challenge dichotomous thinking by reading texts that deliberately blur the boundary of differences, such as gender and species. Although the themes of pain, violence and suffering reoccur in the readings, this course encourages students to adopt a critical framework of differences to further investigate how the texts envision healing possibilities through their writings on pain. In addition, this course aims to provide a learning environment to practice more responsible and ethical ways of knowing differences, to bridge literary works with social reality in our time, and to imagine social justice collaboratively. Much of the learning in this course will be through critical discussions, group presentations, analysis on the basis of individual and collective efforts, and reflection on personal experiences.\n\n**Tentative weekly schedule:**\n\n_The instructor may make minor changes to the schedule before the beginning of the course._\n\n**Introduction**\n\nweek 1 Introduction to the course\n\nweek 2 Gloria Anzaldúa's “Metaphors in the Tradition of the Shaman”\n\nweek 3 Video: TBD\n\nweek 4 Abra Fortune Chernik's “The Body Politic”, Judith Cofer's “The Story of My Body”\n\nweek 5 Naomi Wolf's “The Beauty Myth”\n\nweek 6 Naomi Wolf's “The Beauty Myth”\n\nweek 7 Lynda Marín's “Her Rites of Passage”, Caridad Souza's \"Missing Body\"\n\nweek 8 Video: _The Hunting Ground_\n\nweek 9 **Midterm**\n\nweek 10 Audre Lorde’s “Breast Cancer: Power vs. Prosthesis”\n\nweek 11 Gloria Anzaldúa's “La Prieta”\n\nweek 12 Lois Gould's “X: a Fabulous Child’s Story”\n\nweek 13 Video: _Growing Up Trans_\n\nweek 14 Ursula Le Guin's “Winter’s King”\n\nweek 15 Selection from Linda Hogan's memoir\n\nweek 16 Selection from Linda Hogan's memoir\n\nweek 17 **Final part 1: group bridging map presentation**\n\nweek 18 **Final part 2: individual written exam**",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 25,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 25,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 25,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 25,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}