{
    "year": 110,
    "term": 2,
    "name": "東亞語言文化比較",
    "teachers": [
        "賀安娟"
    ],
    "department": "LM26",
    "code": "TCC2018",
    "credit": 3,
    "serial": 1643,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "雲306會議室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "認識各種語言在台灣歷史中的地位轉變",
        "瞭解台灣多元文化的傳承與變遷，以殖民及移民的觀點瞭解台灣文化、語言、及文學",
        "具有使用檔案、文獻、文本的能力，具有跨國或跨語言的比較能力",
        "具有專業反思能力"
    ],
    "syllabus": "The aim of this course is to provide a comprehensive overview of the linguistic diversity in East Asia in relation to the cultural and historical specificities that characterize each of the countries under discussion. In the first half, the course load of texts will adapt an historical perspective, while the second half will include present-day language planning and cultural policy in East Asia.\n\nIn this course we will mainly read and study materials (primary and secondary) that are also known as missionary linguistics. We will cover the regions of Korea, China, Japan, Taiwan and these parts of Southeast-Asia where missionaries compiled dictionaries, glossaries and textbooks in Chinese dialects. Attention will be paid to the introduction of different orthographies, the role of the church in 19th century language standardization initiatives and programs, as well as the present-day legacy of missionary linguistics in East Asia. A brief comparison with topics in missionary linguistics beyond East Asian borders will provide the bigger picture. This course is taught in English.\n\nThis course will introduce a number of topics that cover language and culture in East Asia. The focus will be on the Chinese cultural sphere of influence, the Chinese diaspora in Southeast Asia, but also the legacies of colonialism and imperialism in the region. Reading skills in Asian languages and Indo-European languages are required. If desired, the practical aspect of the course may include a few lectures in digital humanities that introduce databases and tools for computational linguistics.\n\nWeek 1   **週**1  **2****月 15****日**   **Introduction and handout of the syllabus**\n\nThis course will introduce a number of topics that cover language and culture in East Asia. The focus will be on the Chinese cultural sphere of influence, the Chinese diaspora in Southeast Asia, but also the legacies of colonialism and imperialism in the region. Reading skills in Asian languages and Indo-European languages are required.\n\nAssignment for week 2: mandatory reading & preparing a 15 min presentation that includes 3 additional references to the chapter and explain why you have chosen these 3 extra readings. The additional material can be in another language\n\nReading: Heylen, Ann (2017) “Island Taiwan in the Seventeenth Century: A Historiographical Overview” In Maria Cruz Berrocal and Cheng-hwa Tsang (eds.) _Historical Archaeology of Early Modern Colonialism in_ _Asia-Pacific_, Gainesville: University Press of Florida, pp. 244-269.\n\nWeek 2 **週2**   **2****月 22****日** Discussion of the Assignment, and lecture on how the themes mentioned in the discussion are applicable to the understanding of Taiwan historical studies in the broader context of East Asian languages and cultures. Focus on the script…  \n\nWeek 3   **週3**  **3****月 1****日** **Introduction to the academic literature on missionary linguistics.**  **“****The Scope of Missionary Linguistics” PPT presentation**\n\n1.  Reading and discussion article by Sandra Breitenbach, _Missionary Linguistics in East Asia. The Origins of Religious Language in the Shaping of Christianity_ (Frankfurt-am-Main: Peter Lang, 2008), pp.25-101\n2.  Presentation of source materials (print)\n\nWeek 4 **週4**  **3****月 8****日** **Discussion of materials that take Taiwan as a case study for missionary linguistics in the 17th century (1)**\n\n1.  Heylen, Ann (2001). “Dutch Language Policy and Early Formosan Literacy (1624-1662)”\n2.  Complementary Readings (class presentations): Henning Kloter. “‘_ay sinco lenguas algo diferentes_’: China’s local vernaculars in early missionary sources” _Missionary Linguistics III, Morphology and Syntax_, edited by Otto Zwartjes, Gregory James and Emilio Ridruejo (Amsterdam: John Benjamins, 2007), pp. 191-210.\n3.  Selection of articles on Dutch Formosa (see moodle upload)\n\nWeek 5 **週5**  **3****月 15** **日**   **Discussion of materials that take Taiwan as a case study for missionary linguistics in the 17th century (2)**\n\n1.  Selection of articles that put Dutch Formosa & Spanish Hermosa in perspective (see moodle upload)\n2.  Reference materials: relevant academic journals\n3.  Introducing the work by Kees Groeneboer and Chris Joby that covers the Dutch language in the VOC and Japan.\n\nOptional: David Mikosz. “Eurocentric Views of Universal Languages from 1605-1828, _Itinerario_ 22.2 (1998), pp. 103-115.\n\nWeek 6 **週6**  **3****月 22** **日**  Discussion of materials that take Taiwan as a case study for missionary linguistics in the 19th century (1)\n\n1.  Reading: Heylen, Ann (2001) “Missionary Linguistics on Taiwan. Romanizing Taiwanese: Codification and Standardization of Dictionaries in Southern Min (1837-1923)”\n2.  Reference materials: relevant academic journals / translations\n3.  DICTIONARIES ONLINE:\n\n[https://archive.org/details/dictionaryofhokk00medhrich](https://archive.org/details/dictionaryofhokk00medhrich)\n\n[http://www.penang-traveltips.com/dictionary/index.htm](http://www.penang-traveltips.com/dictionary/index.htm)\n\n[http://www.bdcconline.net/en/stories/m/medhurst-walter-henry.php](http://www.bdcconline.net/en/stories/m/medhurst-walter-henry.php)\n\nWeek 7 **週7**  **3****月 29** **日**  **Discussion of materials that take Taiwan as a case study for missionary linguistics in the 19th century (2)**\n\n1.  Focus on Taiwan in East Asia, with special attention to the Japanese legacy; Introducing, Heylen Ann, _Japanese models, Chinese culture,_ with special attention to the bibliographic references\n2.  Selection of articles to provide a comparative perspective (see moodle upload)\n3.  Optional: Cemil Aydin (2019) _The Politics of Anti-Westernism in Asia. Visions of World Order in Pan-Islamic and Pan-Asian Thought_, CUP\n\nWeek 8 **週8**  **4****月 5** **日**  No class\n\nWeek 9**週9**  **4****月 12****日 Language and Script in Comparative perspective**\n\n1.  Selection of articles that discuss the concept of ‘mother tongue’, national, official, and native language in the context of Taiwan, past and present.\n2.  Suggested reading: chapters Eric Achimbe eds. (2011) _Postcolonial Linguistic Voices. Identity Choices and Representations_. (Berlin: De Gruyter Mouton, 2011)\n\nWeek 10 **週**10  **4****月 19****日 Culture and Language in Japan**\n\n**Selection of readings that put perspective on the development of writing in Japan vis-a-vis contact with the West and its neighbors in East Asia**  \n\n**Presentation: selected chapters from Frank Dikotter (ed) (1997) _The construction of racial identities in China and Japan_, London: Hurst & Co**\n\nSuggested readings:\n\n1.  **“**Linguistic Studies by Portuguese Jesuits in Sixteenth and Seventeenth Century Japan”Reading and discussion article by Toru Maruyama, _Missionary Linguistics_, edited by Even Hovdhaugen (ed) (Amsterdam: John Benjamins, 2004), pp. 141-160.\n2.  Emi Kishimoto. “The Adaptation of the European Polyglot Dictionary of Calepino in Japan: _Dictionarium Latino Lusitanicum, ac Iaponicum_ (1595)” in _Missionary Linguistics II, Orthography and Phonology_, edited by Otto Zwartjes (Amsterdam: John Benjamins, 2005), pp. 205-224.\n3.  Masayuki Toyoshima. “Phonetic Spellings in Historical Context vs Idiolect: The Japanese grammars by Joao Rodriguez Tcuzu and his holograph documents” in _Missionary Linguistics II, Orthography and Phonology_, edited by Otto Zwartjes (Amsterdam: John Benjamins, 2005), pp. 273-280.\n4.  Selected chapters Nathan Shockey (2019), _[The Typographic Imagination](https://cup.columbia.edu/book/the-typographic-imagination/9780231194280). Reading and Writing in Japan’s Age of Modern Print Media_, CUP\n5.  Nanette Gottlieb (1995) _Kanji politics. Language policy and Japanese script_  London: Kegan Paul\n6.  Optional: Kerim Yasar (2018) _Electrified Voices. How the Telephone, Phonograph, and Radio Shaped Modern Japan, 1868–1945_ CUP\n\nWeek 11  **週**11 **4****月 26****日  Culture and Language in Korea**\n\n**Selection of readings that put perspective on the development of writing in Korea vis-a-vis contact with the West and its neighbors in East Asia**   \n\nSuggested readings:\n\n1.  David J. Silva (2005) “Missionary contributions toward the revaluation of Hangeul in late nineteenth-century Korea,”_International Journal of the Sociology of Language_ 192 (2008), 57-74.  \n2.  Selected chapters Christine Yi (2018) _Colonizing Language._ _Cultural Production and Language Politics in Modern Japan and Korea_, CUP\n3.  Optional: Insup Taylor and M. Martin Taylor (eds) _Writing and literacy in Chinese, Korean and Japanese_ Amsterdam: John Benjamins\n\nWeek 12 **週**12  **5****月 3****日  Culture and Language in Northeast Asia & China**\n\n**Selection of readings that put perspective on the development of writing in Northeast Asia vis-a-vis contact with the West and its neighbor China**   \n\n**Suggested readings:**\n\n1.  Yurou Zhong (2019) _[Chinese Grammatology](https://cup.columbia.edu/book/chinese-grammatology/9780231192637). Script Revolution and Literary Modernity, 1916–1958_ , CUP\n2.  Jing Tsu (2010) _Sound and script in Chinese diaspora_ Cambridge, Harvard UP\n3.  Li Narangoa and Robert Cribb (eds) (2014) _[Historical Atlas of Northeast Asia, 1590-2010](https://cup.columbia.edu/book/historical-atlas-of-northeast-asia-1590-2010/9780231160704) Korea, Manchuria, Mongolia, Eastern Siberia_, CUP\n\nWeek 13 **週**13  **5****月10****日**  **Beyond borders: Missionary linguistics in the Pacific**.\n\nAttention will be paid to the meaning of ‘Formosan’, indigenous, aboriginal and Austronesian. Looking southwards also reaches to Oceania: Australia, New Zealand and islands that have ethnicities who speak Austronesian languages.\n\n Suggested readings:\n\n1.  “Lancelot Threlkeld and missionary linguistics in Australia to 1850”article by  Hilary M. Carey,  _Missionary Linguistics_, edited by Even Hovdhaugen (ed) (Amsterdam: John Benjamins, 2004), pp. 253-275.\n2.  Georg Bossong.“The Influence of Missionary Descriptions of Far Eastern Languages on Western Linguistic Thought: The case of Christoforo Borri, S.J. and Tommaso Campanella” in _Missionary Linguistics III, Morphology and Syntax_, edited by Otto Zwartjes, Gregory James and Emilio Ridruejo (Amsterdam: John Benjamins, 2007), pp. 123-144.\n3.  Antje Lann Hornscheidt. “Postcolonial continuities in Danish monolingual dictionaries: Towards a critical postcolonial linguistics” in Eric Achimbe eds.\n4.  Tomiyama Ichiroo (1997) “Colonialism and the Sciences of the Tropical Zone: The Academic Analysis of Difference in ‘the Island Peoples”,pp. 199-221, in Tani E. Barlow (ed) _Formations of colonial modernity in East Asia_, Duke UP.\n\nWeek 14 **週**14  **5****月17****日  Language and Culture in relation to the Southeast Asian nations**\n\nTopics for this class are Culture: ethnicities and language. We pay special attention to the cultural encounter between the languages as representatives of ideologies. The relevance of politics may be discussed. Taiwan in and about southeast Asian literature. Comparative to East-Asian literature on the topic. Literature and cultural translation. Taiwanese writers, cinematographers, artists in East and SE-Asia. A discussion of case studies.\n\nWeek 15 **週**15  **5****月24****日**  **Theme: Popular Culture**\n\nAssignment: students prepare a presentation that positions language in popular culture or in personal documents. The topic and region can be Taiwan, China, Japan, Korea, SEAsia.\n\nWeek 16  **週**16  **5****月31****日 Exam**\n\nWrite a paper on your topic of choice demonstrating a literature survey, major journals and databases, bibliography, and discuss one commonality that relates to culture and langue in East Asia applying a comparative perspective.\n\nWeek 17 **週**17  **6****月7****日 optional**\n\nWeek 18  **週**18  **6****月 14****日 optional**",
    "methodologies": [
        {
            "type": "Problem base learning",
            "note": "discussing essays"
        },
        {
            "type": "Case studies",
            "note": "term paper"
        }
    ],
    "grading": [
        {
            "type": "Final exam",
            "weight": 40,
            "note": "term paper"
        },
        {
            "type": "Class discussion involvement",
            "weight": 20,
            "note": "discussion of the reading materials"
        },
        {
            "type": "Presentation",
            "weight": 20,
            "note": "2 class presentations, handout or ppt"
        },
        {
            "type": "Case study reports",
            "weight": 20,
            "note": "selection of a region and a language"
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}