{
    "year": 108,
    "term": 2,
    "name": "教育社會學研究",
    "teachers": [
        "黃鴻文"
    ],
    "department": "EM00",
    "code": "EDC0076",
    "credit": 3,
    "serial": 382,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 12
    },
    "schedule": [
        {
            "day": 1,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "教803"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "教育社會學的範圍相當廣泛，從鉅觀層面現象到微觀層面，課題十分多元。1970年代以前，鉅觀方面的分析比較多，包括教育和政治、教育和經濟、社會階級與流動、社會變遷等議題。但1970年代隨著新馬克斯主義（或批判理論、法蘭克福學派）的出現與研究典範的轉變，教育社會學不僅在方法上逐漸增加質性研究與議題，並且也開啟了批判觀點的研究，包括知識社會學、社會機會均等、多元文化教育、文化研究等。至1980年代以後，由於政治意識型態以及全球關係的轉變，新自由主義的教育改革以及全球化發展趨勢，又促成教育社會學新一波的發展，這些都成為當前教育社會學主要的內涵。但無論教育社會學的發展趨勢為何，無論內、外在條件如何變動，新舊議題仍在融合發展之中。在世紀交替之際，古老的教育經濟學結合了全球化、知識經濟和教育改革，傳統芝加哥學派之形象互動論的次文化課題，轉變成不同對象的文化研究，而馬克斯主義長期以來關心的社會公平問題，歷經一個世紀之後仍在M型社會中繼續存在，更發展成為全球體系的財富階層化現象。這些都是教育社會學新、舊關心的課題。本課程由於時間有限，無法一一涉及這些問題的討論，但期望透過有限的文獻閱讀和討論，擴大學員的學術視野，強化教育問題分析之社會學觀點，以及發展對教育問題之社會學論述的能力。",
    "goals": [
        "瞭解教育社會學的基本概念與理論。",
        "分析教育社會學的重要議題。",
        "參與教育社會學的發展與實踐。",
        "思索教育與社會結構的交互關係。"
    ],
    "syllabus": "第1週\n\n課程介紹 來雄的故事\n\n第2週\n\nSociological Imagination & Methodology\n\nMills, C. W. (1959). Sociological imagination. New York: Oxford University Press. (pp.3-11).\n\nRist,R. C. (1990). On the relations among education research paradigms: From disdain to détente. In K. J. Dougherty and F. M. Hammack (Eds.), Education and society: A reader (pp.81-95). Orlando, FL: Harcourt Brace Jovanovich.\n\n沈姍姍（2005）。教育社會學導論。載於台灣教育社會學學會主編，**教育社會學**（3-21頁）**。**台北市：巨流。\n\n謝昇佑、魏龍達（譯）（2010）。D. M. Newman著。**常民風格的社會學**。台北市：學富。(45-53)\n\n第3週\n\nTheoretical Perspectives: Part I\n\nCarnoy, M. (1990). Marxism and education. In K. J. Dougherty and F. M. Hammack (Eds.), Education and society: A reader (pp.60-69). Orlando, FL: Harcourt Brace Jovanovich.\n\nSwartz, D. (1990). Pierre Bourdieu: Culture, education, and social inequality. In K. J. Dougherty and F. M. Hammack (Eds.), Education and society: A reader (pp.70-80). Orlando, FL: Harcourt Brace Jovanovich.\n\n陳奎熹（2001）。**教育社會學導論**。台北市：師大書苑。(15-29)\n\n第4週\n\nTheoretical Perspectives: Part II\n\nGoslin, D. A. (1990). The functions of the school in modern society. In K. J. Dougherty and F. M. Hammack (Eds.), Education and society: A reader (pp.29-38). Orlando, FL: Harcourt Brace Jovanovich.\n\nCollins, R. (1990). Some comparative principles of educational stratification. In K. J. Dougherty and F. M. Hammack (Eds.), Education and society: A reader (pp.39-59). Orlando, FL: Harcourt Brace Jovanovich. (pp.39-57)\n\n第5週\n\nSocial Class and Schooling: Child rearing and educational involvement\n\nLareau, A. (2002). Invisible inequality: Social class and childrearing in black families and white families. American Sociological Review, 67(5), 747-776. (pp.747-749 & 761-774)\n\nLareau, A. (1987). Social class difference in family-school relationships: The importance of cultural capital. Sociology of Education, 60(2), 73-85.\n\n陳奎熹（2001）。**教育社會學導論**。台北市：師大書苑。(51-68)\n\n第6週\n\nSocial Class and Schooling: Summer Loss and Inequality\n\nHeyns, B. (1987). Schooling and cognitive development: Is there a season for learning? Child Development, 58, 1151-1160.\n\nVon Hippel, P. T. (2019). Is summer learning loss real? How I lost faith in one of education research’s classic results. Education Next, 19(4), 9-14.\n\nYouTube: [https://www.youtube.com/watch?v=ZolcNG3GVCs](https://www.youtube.com/watch?v=ZolcNG3GVCs)\n\n第7週\n\nGender and Schooling\n\nMickelson, R. A. (2015). Gender and education. In J. H. Ballantine & J. Z. Spade (Eds.), Schools and society: A sociological approach to education (5th ed.) (pp. 292-303). Thousand Oaks, CA: Sage.\n\nMendick, H. (2013). Choosing subjects: Sociological approaches to young women’s subject choices. In R. Brooks, M. McCormack, & K. 4 Bhopal (Eds.), Contemporary debates in the sociology of education (pp. 202-217). New York: Palgrave Macmillan.\n\n莊明貞（1998）。性別與教育。載於陳奎熹主編，**現代教育社會學**（379-408頁）。台北市：師大書苑。\n\n第8週\n\nEthnicity and Schooling\n\nOgbu, J. U. (1992). Understanding cultural diversity and learning. Educational Researcher, 21(8), 5-14.\n\nFordham**,** S., & Ogbu, J. (2011). Black students’ school success: Coping with the burden of ‘acting white. In R. **Arum, R., I.R. Beattie, K. Ford (Eds.), T**he structure of schooling: Readings in the sociology of education (pp.274-280). Thousand Oaks, CA: Sage.\n\n譚光鼎（1998）。族群與教育。載於陳奎熹主編，**現代教育社會學**（357-378頁）。台北市：師大書苑。\n\n第9週\n\nSchool Organization\n\n**Ballantine****, J**. H. (2001). The sociology of education: A systematic analysis (5th ed.). Upper Saddle River, NJ: Prentice Hall. (pp.234-143)\n\n**Ball, S. J. (2012). The micro-politics of the school: Towards a theory of school organization.** Oxfordshire, UK: Routledge. (pp.7-27)\n\n第10週\n\nSchool Curriculum: Part I\n\nSwidler, A., & Arditi, J. (2008). The new sociology of knowledge. In J. H. Ballantine & J. Z. Spade (Eds.), Schools and society: A sociological approach to education (3rd ed.) (pp. 183-190). Thousand Oaks, CA: Sage.\n\nAnyon, J. (1990). Social class and the hidden curriculum of work. In K. J. Dougherty and F. M. Hammack (Eds.), Education and society: A reader (pp.424-437). Orlando, FL: Harcourt Brace Jovanovich.\n\n黃嘉雄（1998）。課程。載於陳奎熹主編，**現代教育社會學**（179-206頁）。台北市：師大書苑。\n\n第11週\n\nSchool Curriculum: PartII\n\nAnyon, J. (1978). Elementary social studies textbooks and legitimating knowledge. Theory & Research in **Social** Education. 6(3), 40-55\n\nPopkewitz, T. (2002). What is “really” taught as the content of school subjects? Teaching school subjects as an alchemy. The High School Journal, 101(2):77-89.\n\n卯靜儒（2004）。從新馬克斯到後結構主義─課程社會學研究的再概念化。教 育研究集刊，50（1）， 119-142。\n\n第12週\n\nTeachers, Jobs, and their Cultures\n\nLieberman, A., & Miller, L. (1990). The social realities of teaching. In K. J. Dougherty and F. M. Hammack (Eds.), Education and society: A reader (pp.193-204). Orlando, FL: Harcourt Brace Jovanovich.\n\nHargreaves, A. (2010). Presentism, individualism, and conservatism: The legacy of Dan Lortie’s Schoolteacher: A sociological study. _Curriculum Inquiry_, 40(1), 143–154.\n\n郭丁熒（2005）。教師。載於台灣教育社會學學會主編，**教育社會學**（305-344頁）**。**台北市：巨流。\n\n繳交期末報告計畫(計畫書規格與內容將於三月底前上傳moodle)\n\n第13週\n\n**Teacher-student interaction**\n\nHargreaves, D. (1977). The process of typification in classroom interaction: Models and methods. British Journal of Educational Psychology, 47, 274-284.\n\nGannaway, H. (1976). Making sense of school. In M. Stubbs and S. Delmont (Eds.), Explorations in classroom observation (pp.45-82). Chichester, UK: Wiley. (pp.45-67)\n\n第14週\n\nStudents and Their Cultures\n\nColeman, J. (1960). The adolescent subculture and academic achievement American Journal of Sociology, 65**_(_**4), pp. 337-347.\n\nBecker, H. S. (1993). How I learned what a crock was？Journal of Contemporary Ethnography, 22_,_ 28-35.\n\n第15週\n\nHuman Agency: Crossing structural limitations\n\nPhelan, P., Davidson, A. L., &amp; Cao, H. T. (1991). Students’ multiple worlds: Negotiating the boundaries of family, peer, and school cultures. Anthropology and Education Quarterly, 22, 224-249.\n\nLareau, A., &amp; Horvat, E. M. (1999). Moments of social inclusion and exclusion: Race, class, and cultural capital in family-school relationships. Sociology of Education, 72, 37-53.\n\n第16週\n\nMiscellaneous and Coda\n\nRitzer, G. (2002). Enchanting McUniversity: Toward a spectacularly irrational university quotidian. In D. Hayes & R. Wynyard (Eds.), The McDonaldization of higher education (pp. 19-32). Westport, CT: Bergin and Garvey.\n\nShimahara, N. (1990). Socialization for college entrance examinations in Japan. In K. J. Dougherty and F. M. Hammack (Eds.), Education and society: A reader (pp.130-146). Orlando, FL: Harcourt Brace Jovanovich.\n\n課程要求\n\n1.  選修本課程前，本來應具備社會學與教育社會學的基本知識。為讓未上過相關課程同學能補充這些知識，提供部分中文讀物。\n2.  閱讀資料的英文部分，每位學生於課前均應閱讀，並以A4、12號字、適當大小標題撰寫閱讀心得，不得超過2頁。心得首先撰寫上次課堂的心得與反思，其次以一段文字勾勒文章的觀點或內容摘要，然後撰寫從文章中引發的個人想法。心得務必於週日午夜前上傳moodle，上課時請繳交紙本。\n3.  每位同學均應負責英文讀物至少一篇，在課堂中進行導讀工作。導讀時，不得將全文翻譯成英文，必須將文章的內容以自己的口語陳述，適度提供各式大小標題，並提供ppt以備上課導讀使用。每頁ppt上的字數儘量精簡。導讀時間15分鐘。負責導讀當週，得不繳交心得。\n4.  期末撰寫一篇研究報告，主題必須與教師商定後，參考三月底教師上傳moodle之相關規定，撰寫期末研究報告的概要計畫書，於5/18日前上傳繳交。\n5.  與教師在課餘時間商討期末研究報告主題，後續與教師在課餘時間討論完成期末報告，這兩個部份屬於獨立研究部分，即為本學期因疫情延後上課所缺漏的兩週課堂活動。\n6.  無法前來上課，務必課前請假，若為臨時突發狀況，務必於事後親自向教師請假。缺課一次扣學期總分五分。請假依次數由教師酌情扣分，但不超過10%。請假未上課，仍要應按時繳交心得。\n\n評量方式\n\n1.  課堂導讀10%\n2.  閱讀心得35%\n3.  課堂討論10%\n4.  期末報告40%\n5.  出席狀況5%",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 5,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 40,
            "note": "期末研究報告"
        },
        {
            "type": "其他",
            "weight": 45,
            "note": "每週閱讀心得35% 課堂導讀10%"
        }
    ],
    "prerequisite": "",
    "general_core": []
}