{
    "year": 108,
    "term": 2,
    "name": "多元文化教育研究",
    "teachers": [
        "張建成"
    ],
    "department": "EM00",
    "code": "EDC8015",
    "credit": 3,
    "serial": 391,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 12
    },
    "schedule": [
        {
            "day": 5,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "教803"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "1.協助學生瞭解多元文化教育的基本概念、歷史源流、內容議題、研究取向與發展趨勢；\n2.以階級、族群、語言、性別、地區等為經，文化認同、社會正義、教育機會為緯，殷鑑世界各國推動多元文化教育的實際作法與經驗，掌握我國多元文化教育的發展現況與重點；\n3.激發學生探究多元文化相關議題的興趣，務期結合理論與實務，發展解決台灣多元文化教育問題的方案，逐步累積研究成果，並提升教育成效。",
    "goals": [
        "瞭解多元文化教育的基本概念、歷史源流、內容議題、研究取向與發展趨勢",
        "參照世界各國推動多元文化教育的實際作法與經驗，掌握我國多元文化教育的發展現況與重點",
        "激發學生探究多元文化相關議題的興趣，務期結合理論與實務"
    ],
    "syllabus": "壹、教學目標\n\n一、協助學生瞭解多元文化教育的基本概念、重要典範、歷史源流、研究方法、改革方案與發展趨勢；\n\n二、以階級、族群、語言、性別等為經，文化認同、社會正義、教育機會為緯，殷鑑世界各國推動多元文化教育的實際作法與經驗，掌握本地多元文化教育的發展現況與重點；\n\n三、激發學生探究多元文化相關議題的興趣，務期結合理論與實務，發展研究主題，逐步累積研究成果。\n\n貳、教學進度與主題\n\n週次\n\n日期\n\n上課內容\n\n1\n\n0306\n\n1\\. 課程概述與作業說明\n\n2\\. 多元、文化、教育釋義\n\n[C:\\\\Users\\\\User\\\\Downloads\\\\文化取向的教育社會學研究.ppt](file:///C:/Users/User/Downloads/%E6%96%87%E5%8C%96%E5%8F%96%E5%90%91%E7%9A%84%E6%95%99%E8%82%B2%E7%A4%BE%E6%9C%83%E5%AD%B8%E7%A0%94%E7%A9%B6.ppt)\n\n2\n\n13\n\n講述：多元文化教育的意義與任務\n\n[C:\\\\Users\\\\User\\\\Downloads\\\\多元文化教育的基本概念.doc](file:///C:/Users/User/Downloads/%E5%A4%9A%E5%85%83%E6%96%87%E5%8C%96%E6%95%99%E8%82%B2%E7%9A%84%E5%9F%BA%E6%9C%AC%E6%A6%82%E5%BF%B5.doc)\n\n做為一種社會理想、一種思考方式、以及一種改革運動，多元文化教育的旨趣，一方面在於抗拒文化霸權的意識形態宰制，另方面則在彰顯不同文化的主體性、相對性及互補性，強調學校教育的實施，必須掌握公平正義的真諦，消弭唯我族群中心或優勢文化中心主義，維護所有學生的教育權益與學習權利。也就是說，多元文化教育的實施，本質上應是民主社會全民普通教育的基礎，旨在促成公理正義、自由解放及博愛和平的民主生活，期望不同民族、階層、性別、語言、宗教、區域與特殊需求的學生，皆能公平享有教育機會，自在表達個人才情，從歧視或敵視的框架中解放出來，相互欣賞、相互發明，俾以攜手同行，共存共榮。\n\n2-1 提升教育成就，促進公平競爭\n\n2-2 改善族群關係，締造和平社會\n\n3\n\n20\n\n講述：多元文化教育的興起與發展\n\n譚光鼎等(2012)，第一章。\n\n[C:\\\\Users\\\\User\\\\Downloads\\\\多元文化的社會起源、教育實踐與邏輯辯證：臺灣的例子.doc](file:///C:/Users/User/Downloads/%E5%A4%9A%E5%85%83%E6%96%87%E5%8C%96%E7%9A%84%E7%A4%BE%E6%9C%83%E8%B5%B7%E6%BA%90%E3%80%81%E6%95%99%E8%82%B2%E5%AF%A6%E8%B8%90%E8%88%87%E9%82%8F%E8%BC%AF%E8%BE%AF%E8%AD%89%EF%BC%9A%E8%87%BA%E7%81%A3%E7%9A%84%E4%BE%8B%E5%AD%90.doc)\n\n4\n\n27\n\n講述：多元文化教育的實施面向與途徑\n\n譚光鼎等(2012)，相關章節。\n\n5\n\n0403\n\n春假\n\n6\n\n10\n\n講述：多元文化教育評述(一)\n\n[C:\\\\Users\\\\User\\\\Downloads\\\\多元文化教育的三項觀察.ppt](file:///C:/Users/User/Downloads/%E5%A4%9A%E5%85%83%E6%96%87%E5%8C%96%E6%95%99%E8%82%B2%E7%9A%84%E4%B8%89%E9%A0%85%E8%A7%80%E5%AF%9F.ppt)\n\n[C:\\\\Users\\\\User\\\\Downloads\\\\評多元文化主義的論述失誤.pptx](file:///C:/Users/User/Downloads/%E8%A9%95%E5%A4%9A%E5%85%83%E6%96%87%E5%8C%96%E4%B8%BB%E7%BE%A9%E7%9A%84%E8%AB%96%E8%BF%B0%E5%A4%B1%E8%AA%A4.pptx)\n\n[C:\\\\Users\\\\User\\\\Downloads\\\\評多元文化教育的政策失調.pptx](file:///C:/Users/User/Downloads/%E8%A9%95%E5%A4%9A%E5%85%83%E6%96%87%E5%8C%96%E6%95%99%E8%82%B2%E7%9A%84%E6%94%BF%E7%AD%96%E5%A4%B1%E8%AA%BF.pptx)\n\n張建成(2007)，獨石與巨傘：多元文化主義的過與不及。**教育研究集刊**，第五十三輯第二期，103-127頁。\n\n多元文化主義的發展，由於政治正確的關係，迄已過度渲染而出現兩種困境，一方面有人陷入獨石論的迷思，另方面則有人不察巨傘論的浮泛。就獨石論而言，太過重視族群原生本質的結果，不免造成群體權利至高無上、文化傳承故步自封等問題。就巨傘論而言，太過包容文化差異訴求的結果，亦不免造成文化概念混淆、弱勢定義紛歧、性別意識膨脹、階級議題潛蟄等問題。本文逐一分析這些問題之後，鑑於「社會正義」是眾人共同關懷的主題，故而建議不妨以此做為平台，重新建構族群、階級、性別等群體遭受各式社會壓迫的「多維盤錯」關係。\n\n張建成(2007)，文化之間、文化之內與文化之外。**教育研究集刊**，第五十三輯第二期，145-150頁。\n\n張建成(2014)。再論多元文化教育的困境。**教育研究集刊**，第六十輯第三期，111-128頁。\n\n本文繼2007年〈獨石與巨傘〉一文後，將檢討的焦點從多元文化主義（教育）可能走偏之概念邏輯，轉為可能有失的實務運作。理論上，多元文化教育的主要任務，在於促進族群關係與提昇教育成就。可是，臺灣多元文化教育的實施，在促進族群關係方面，多半都在提振弱勢民族（如原住民）本身的族群文化認同，彷彿多元文化教育只是弱勢民族個別的事，與主流族群無關；在提升教育成就方面，臺灣的多元文化教育多半流為表面文章，非徒弱勢民族（如原住民）學業失利及中輟停學的情形，一如過往，整體教育成就的競爭力也依舊落於主流社會之後。伴隨這兩方面的分析，本文也根據相關的事實及論證，提醒不宜過度放大「文化差異」的說詞與效能，以免治絲益棼，造成紛擾。\n\n7\n\n17\n\n講述：多元文化教育評述(二)\n\n資料同上週\n\n8\n\n24\n\n講述：台灣的族群教育研究\n\n[C:\\\\Users\\\\User\\\\Dropbox\\\\文稿\\\\已完稿\\\\台灣族群教育研究\\\\北京師大論壇\\_20190628\\\\北師大\\_臺灣族群教育機會的研究回顧與政策檢討.pptx](file:///C:/Users/User/Dropbox/%E6%96%87%E7%A8%BF/%E5%B7%B2%E5%AE%8C%E7%A8%BF/%E5%8F%B0%E7%81%A3%E6%97%8F%E7%BE%A4%E6%95%99%E8%82%B2%E7%A0%94%E7%A9%B6/%E5%8C%97%E4%BA%AC%E5%B8%AB%E5%A4%A7%E8%AB%96%E5%A3%87_20190628/%E5%8C%97%E5%B8%AB%E5%A4%A7_%E8%87%BA%E7%81%A3%E6%97%8F%E7%BE%A4%E6%95%99%E8%82%B2%E6%A9%9F%E6%9C%83%E7%9A%84%E7%A0%94%E7%A9%B6%E5%9B%9E%E9%A1%A7%E8%88%87%E6%94%BF%E7%AD%96%E6%AA%A2%E8%A8%8E.pptx)\n\nLin, C. W., Jheng, Y. J., Chen, S. H. and Chang, Jason C. (2019). Taiwan: An immigrant society with expanding educational opportunities. In Stevens, P. and Dworkin, A. G. (Eds.), **_The Palgrave handbook of race and ethnic inequalities in education_**, pp.1035-1071. 2nd Edition. Cham, Switzerland: Palgrave Macmillan.\n\nThis paper offers a systematic review of sociological research in Taiwan on the relationship between race/ethnicity and educational inequality between 1980s and 2010s. Six major research traditions are identified: (1) social stratification; (2) education stratification; (3) cultural identity and ethnic education; (4) culturally responsive teaching; (5) language proficiency and literacy program, and (6) intersectionality and academic performance. Most of the research conducted in Taiwan focuses on explaining how indigenous students, especially those from working classes, tend to fail in school. This rich body of research is written in Mandarin and developed mostly by individual sociologists of education and a few times by the government-commissioned research teams. In general, with the overall education expansion, there has been great progress in indigenous education, but still indigenous people fall behind the mainstream despite the policy shift from assimilation to multiculturalism in the past two decades. The final section of this paper provides some discussions for future policy making on how to make more improvement.\n\n9\n\n0501\n\n文獻導讀與交流：多元文化主義的逆境\n\nEuropean backlash over multiculturalism\n\nhttp://rt.com/news/european-leaders-multiculturalism-f/\n\nPublished time: February 14, 2011 09:36\n\nEdited time: February 15, 2011 22:05\n\nThe concept of multiculturalism seems to be failing all around Europe.\n\nThe one who started the trend was German Chancellor Angela Merkel. “This approach has failed, utterly,” she said.\n\nThen British Prime Minister David Cameron weighed in, saying, “We failed to provide a vision of society to which they feel they want to belong.”\n\nAnd now France’s President Nicolas Sarkozy has made an admission, as well. “My answer is, clearly, yes, it's a failure.”\n\n“Multiculturalism will only function if people coming to the country will have a job, have their own money and feel responsible for the community,” says immigration officer Arnold Mengelkoch from Copenhagen. “Otherwise, they are jobless people who lead a passive life with social welfare.”\n\nGrillo, R. (2007). An excess of alterity? Debating difference in a multicultural society. **_Ethnic and Racial Studies_**, 30(6): 979-998.\n\nDebates about the incompatibility of different ways of living are occurring in the UK as in most multicultural societies. These debates, which include diverse voices among both majority and minority ethnic populations, may be observed in public policies, the speeches of politicians and religious leaders, printed media, radio, television, the Internet, in novels, plays and films, and ethnographically in everyday conversations. One point of view, now widely expressed in Europe, is that multicultural countries have become ‘too diverse’, and the presence of communities adhering to values at odds with those of ‘Western’ secular society threaten cohesion. Focusing on the UK, the article examines what has been called a ‘cultural-diversity skeptical turn’ or ‘backlash against difference’, emphasizes the ‘fuzziness’ of the concepts involved, and proposes that the backlash should be understood inter alia in terms of the problems of the governability of what are, in a neo-liberal, transnationalized ecumene, increasingly fragmented societies.\n\nBanting, K. and Kymlicka, W. (2012). Is there really a backlash against multiculturalism policies? New evidence from the Multiculturalism Policy Index. **_GRITIM-UPF Working Paper Series_**, No. 14 (Autumn 2012).\n\nIn much of the western world, and particularly in Europe, there is a widespread perception that multiculturalism has ‘failed’ and that governments who once embraced a multicultural approach to diversity are turning away, adopting a strong emphasis on civic integration. This reaction, we are told, “reflects a seismic shift not just in the Netherlands, but in other European countries as well” (JOPPKE 2007). This paper challenges this view. Drawing on an updated version of the Multiculturalism Policy Index introduced earlier (BANTING and KYMLICKA 2006), the paper presents an index of the strength of multicultural policies for European countries and several traditional countries of immigration at three points in time (1980, 2000 and 2010). The results paint a different picture of contemporary experience in Europe. While a small number of countries, including most notably the Netherlands, have weakened established multicultural policies during the 2000s, such a shift is the exception. Most countries that adopted multicultural approaches in the later part of the twentieth century have maintained their programs in the first decade of the new century; and a significant number of countries have added new ones. In much of Europe, multicultural policies are not in general retreat. As a result, the turn to civic integration is often being layered on top of existing multicultural programs, leading to a blended approach to diversity. The paper reflects on the compatibility of multiculturalism policies and civic integration, arguing that more liberal forms of civic integration can be combined with multiculturalism but that more illiberal or coercive forms are incompatible with a multicultural approach.\n\nAlexander, J. C. (2013). Struggling over the mode of incorporation: Backlash against multiculturalism in Europe. **_Ethnic and Racial Studies_**, 36(4): 531-556.\n\n(First submission October 2010; First published January 2013)\n\nDocumenting the extraordinary potency and reach of the European backlash against multiculturalism, this essay provides a new theoretical model for explaining it. Rather than focusing primarily on demographic and institutional facts about Islamic immigration- such as education, wealth, participation and mobility- the author proposes a cultural-sociological approach that focuses on meanings and emotions as core issues for civil societies. As the demographic presence of Islamic immigrants has intensified, the anti-civil construction of Islamic qualities has led European masses, leaders and intellectuals, not only from the right but from the centre and left, to demand homogenizing assimilation. Representing public practices of Islam as threatening European democracy, newly restrictive citizenship tests have emerged alongside growing xenophobic political parties and newly threatening neo-fascist violence. Initially brought to Europe for economic and political reasons, the question has now become whether the children and grandchildren of Islamic immigrants can be incorporated into European civil society. The conflict is not over whether immigrants should be incorporated but over the grounds for doing so.\n\n10\n\n08\n\n文獻導讀與交流：多元文化主義的論辯\n\nAbu-Laban, Y. (2002). Liberalism, multiculturalism and the problem of essentialism. **_Citizenship Studies_**, 6(4): 459-482.\n\nThis article focuses on key themes in the liberal philosophical debate over multiculturalism, as well as the responses of Canadian social and political actors to the September 11, 2001 attacks in New York and Washington. Since September 11, there has been a renewed popularity of arguments positing a ‘clash of civilizations’ between Muslim and Christian societies, and a new legitimacy advanced for ‘ethnic profiling’ in the name of security. The rapidity with which this has happened in Canada is particularly striking because of the country’s liberal-democratic and multicultural tradition. The introduction of a national policy of multiculturalism in 1971 provided a new understanding of Canadian citizenship that was more inclusionary of immigrants and ethnic and racial minorities. Multiculturalism has also become a hotly debated ideal among Canadian, American and European political philosophers concerned with addressing the possibilities and limits of liberalism given ethnic diversity, and the limits of ethnic diversity given liberalism. Multiculturalism is typically presented as a ‘problem’ for liberal politics and ethics. Building on how multiculturalism policy in Canada has provided a more inclusionary discourse around citizenship, a defence of multiculturalism is advanced which rejects the essentialist treatment of ‘culture’ and ‘cultural’ groups. It is suggested that the unfolding discussions in Canada since September 11 demonstrate the ongoing tension between cultural essentialism and liberal individual rights. The Canadian experience points to the value of an anti-essentialist multiculturalism in challenging discrimination given that neither liberalism, nor liberal democratic states, are neutral in their allocation of resources and legitimacy among more and less powerful ethnic groups. It is argued that rather than multiculturalism, it is essentialist thinking, imagery and ideas which present the greatest ‘problem’ to the ethics of liberalism and the politics of liberal democracies like Canada.\n\nBeckett, C. and Macey, M. (2001). Race, gender and sexuality: The oppression of multiculturalism. **_Women’s Studies International Forum_**, 24(3/4): 309–319.\n\nIn this article we analyse the impact of multicultural ideology on struggles for equality in the spheres of gender, race/ethnicity and sexuality. We argue that multiculturalism has permeated theory, policy and action in these areas and that this has resulted in divisions and conflicts between movements for human rights. This has allowed an uncritical brand of multiculturalism to flourish which operates to further oppress already disadvantaged groups. We illustrate our thesis in relation to the violence committed against Black/Asian women through such cultural practices as forced arranged marriage, domestic violence and female genital mutilation. We also note the violence against gay and lesbian people which is sanctioned by some cultural and religious traditions. We conclude that failure to address fundamental questions about possible limits to cultural diversity in liberal democratic societies has implications for the continued oppression of the least powerful and the future of human rights.\n\nFoley, D. E. (1991). Reconsidering anthropological explanations of ethnic school failure. **_Anthropology & Education Quarterly_**, 22(1): 60-86.\n\nThis article reviews the anthropological debate on why some ethnic minorities fail more frequently in schools. Although neither side presents overwhelming empirical evidence, John Ogbu's caste theory is clearly a more comprehensive, systematic explanation than the \"cultural difference\" explanation. In addition, Ogbu's \"multilevel\" or macro style of school ethnography has important methodological advantages over the less historical, more decontextualized micro ethnographies of classrooms. Nevertheless, as various micro\n\nethnographers have pointed out, caste theory has difficulty accounting for in-group variance and the school success of some oppressed ethnic minorities. Results from a field study in South Texas are used to illustrate that Ogbu's notion of an \"oppositional culture\" does underestimate both in-group variation and the self-valorizing potential of ethnic oppositional cultures. The school-level description of students' \"dramaturgical communicative competence\" demonstrates why many middle-class Mexicanos are not held back by their ethnic oppositional culture. The article ends by advocating a model of macro school ethnography that is based on a multiple dominance view of society and a phenomenological notion of ethnic culture rather than caste theory.\n\n11\n\n15\n\n分組報告與討論：性別與教育\n\n12\n\n22\n\n分組報告與討論：階級與教育\n\n13\n\n29\n\n分組報告與討論：族群與教育\n\n14\n\n0605\n\n分組報告與討論：移民與教育\n\n15\n\n12\n\n文獻導讀與交流：多元文化、跨文化、或後多元文化\n\nCuccioletta, D. (2001/2002). Multiculturalism or transculturalism: Towards a cosmopolitan citizenship. **_London Journal of Canadian Studies_**, vol. 17, pp.1-11.\n\nThe public policy of multiculturalism, passed by the Trudeau Government in 1972, was according to the theory behind it, to establish an eventual cosmopolitan identity of Canadian citizenship. More political than social, this policy, has led to many discussions vis-à-vis the Ghetto nature that has evolved from it. The Mosaic has remained divided. The pluralistic idea of transculturalism (seeing oneself in the other), basically relying on the forces of society (not politicians), has a more interactive (for citizens) and egalitarian approach. With the break down of numerous borders (both physical and psychological), which position is the more harmonious with a true citizenship for the world?\n\nGrosu, L-M. (2012). Multiculturalism or transculturalism? Views on cultural diversity. **_SYNERGY_**, 8(2): 102-111.\n\nThe present article is a critique of multiculturalism and transculturalism in an attempt to gather different opinions about conceptualizing cultural diversity in multi-ethnic states. Multiculturalism represents the foundation on which an entire national policy was built after 1970 in Canada. The article presents the many interpretations of multiculturalism (or cultural pluralism as it has been called) which range from sociology to culture and politics. Some of the most famous debates on multiculturalism are analyzed. Can transculturalism (also known as cosmopolitanism) be the solution for harmonious cultural interaction? The article explores this possibility and discusses different theoretical standpoints.\n\nVertovec, S. (2010). Towards post-multiculturalism? Changing communities, conditions and contexts of diversity. **_International Social Science Journal_**, 61(Issue 199): 83-95.\n\nSince the turn of the millennium, multiculturalism – a term spanning a variety of policies and institutional frameworks – has been seriously challenged in a number of ways. While critics have increasingly attacked multiculturalism and blamed it for numerous social problems, the nature of global migration and modes of immigrant belonging have themselves changed considerably since the time when multicultural models were first established. By way of exploring the post‐multiculturalist condition into which, some commentators suggest, we are all moving, this article addresses the following questions: what are the changing public discourses surrounding multiculturalism? What are the characteristics of new forms of immigration, and how have these new forms of immigration impacted on multicultural theories? What are the relationships of immigrants with sending countries? How do all of these patterns contribute to what might be called post‐multiculturalism?\n\nFollowing an initial section outlining some key aspects of conventional multiculturalism and its critiques, the article includes sections describing emergent migration trends leading toward conditions of ‘‘super-diversity’’, patterns of diasporic identification and transnationalism, recent public debates that are critical of multiculturalism and various policy measures taken in response. It concludes with speculations on the emergence of post-multicultural perspectives that seek to foster both the recognition of diversity and the maintenance of collective national identities.\n\n16\n\n19\n\n期末總檢討\n\n\\*第2-4週及第6-8週，每週上課4小時，用以補實第17-18週的上課時數。",
    "methodologies": [
        {
            "type": "講述法",
            "note": "多元文化教育之基本概念、主要課題及評述，分六次講授。"
        },
        {
            "type": "討論法",
            "note": "「文獻導讀與交流」以及「分組報告與討論」之課堂，師生均需參與討論。"
        },
        {
            "type": "合作學習",
            "note": "全班學生分成四組，分就性別、階級、族群、移民之教育相關課題，研訂主題，蒐集資料，上課時提出口頭報告，期末繳交書面報告電子檔。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": "修課學生須自教學大綱所列三次「文獻導讀與交流」之指定文獻中，每次各選一篇文獻，並各撰寫1至3千字之心得，A4紙張電腦打印，六月12日前繳交。"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "「文獻導讀與交流」以及「分組報告與討論」之課堂參與情形。"
        },
        {
            "type": "出席",
            "weight": 20,
            "note": "不定期點名，總計三次以上無故缺席者，本項以零分計。"
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "參與「分組報告與討論」準備與呈現工作之貢獻程度。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}