{
    "year": 109,
    "term": 2,
    "name": "消費者行為",
    "teachers": [
        "洪秀瑜"
    ],
    "department": "OU57",
    "code": "BAU0013",
    "credit": 3,
    "serial": 2460,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "樸201"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎必須先修過【BAU0021  行銷管理】",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course is an introduction to the world of consumer behavior. The discipline borrows from several social sciences including psychology, sociology, and anthropology to explain behavior in the marketplace. In this course, the student will explore how perceptions, learning, memory, personality, and attitudes influence consumption behavior, how consumption changes during one’s life cycle, and how powerful cultural and subcultural influences are on consumers. This course is to provide you with a working knowledge of the major theories in the area of customer behavior. The goal of this course is not to simply learn the material, rather it is to integrate and apply the material. By the end of this course, you should be able to apply this knowledge to finish the group project and make the final presentation.",
    "goals": [
        "Develop an understanding of consumer behavior theories and apply this understanding in a marketing decision making context.",
        "Evaluate the principal theories of consumer behavior; critically assess strengths, limitations and analyze the current trends in consumer behavior",
        "Apply your consumer behavior research findings when designing and evaluating marketing strategies. Improve your abilities to discover original consumer insights that go beyond surface level intuitions."
    ],
    "syllabus": "Week1 Buying, Having, and Being: An Introduction to Consumer Behavior\n\nWeek2 Consumer Well-Being\n\nWeek3 Perception\n\nWeek4 Learning and Memory\n\nWeek5 Motivation and Affect\n\nWeek6 The Self: Mind, Gender, and Body\n\nWeek7 Personality, Lifestyles, and Values\n\n**Week8 Midterm Exam**\n\nWeek9  Attitudes and PersuasiveCommunications\n\nWeek10 Decision Making\n\nWeek11 Buying, Using, and Disposing\n\nWeek12 Group Influences and Social Media\n\nWeek13 Income and Social Class\n\nWeek14 Subcultures\n\nWeek15 Cultures   \n\n**Week16 Final Presentation**\n\nWeek17 Digital Learning Week\n\nWeek 18 Digital LearningWeek",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 30,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": "In-class contribution will be assessed based on the frequency, quality, and consistency of participation. The quality of our class discussions depends on how well prepared you are and your willingness to share the results of your preparation with the class."
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "This group project provides a hand-on opportunity to analyze and understand specific behaviors consumers engage in. In class you learn a lot of different concepts, theories, and applications related to consumer behavior. This knowledge should help you understand people’s behavioral tendencies that may create problems for your company, non-profit organization, or society at large. You should adopt a ‘client’ for your project and address the specific question from that organization’s perspective. This client can be either real or hypothetical. In teams comprised of about 4 - 6 members, you will investigate an issue or puzzle and try to change it. Using your knowledge of consumer behavior, you will diagnose the underlying consumer tendencies that give rise to that problem, create at least two interventions based on these insights, implement these and measure your success in changing consumer behavior. Finally, you will complete the final report (ppt slides) that summarizes your insights and could be provided to the “client”. \nThe last week (Week 16) will be dedicated to your presentations. Presentations will be 12‐15 minutes (including discussion) and will include: (1) an overview of your issue or question, (2) why this idea/question is important, (3) how it affects people’s behavior and what your solutions/interventions are, (4) how you test your interventions, (5) the testing results (the effectiveness of changing behavior) and what the marketing(or business, management, social) implications might be. The presentation is meant to spur conversation among your classmates. It is mandatory that you attend this presentation , even if you are not presenting."
        }
    ],
    "prerequisite": "◎必須先修過【BAU0021  行銷管理】",
    "general_core": []
}