{
    "year": 107,
    "term": 1,
    "name": "服務學習（一）",
    "teachers": [
        "劉若蘭"
    ],
    "department": "VS",
    "code": "0000001",
    "credit": 0,
    "serial": 3140,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 0,
            "from": -1,
            "to": -1,
            "campus": "",
            "classroom": ""
        }
    ],
    "programs": [],
    "comment": "統一由期末匯入成績",
    "restrict": "◎第一階段需人工加選◎第二階段需人工加選◎加退選階段需人工加選",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 0,
    "description": "服務學習課程以「協同合作」、「互惠」、「尊重多元差異」、「學習為基礎」、「社會正義為焦點」等特質為基礎，以「準備」、「服務」、「反思」、「慶賀」等學習歷程，服務範圍以自己的生活與學習環境為起點而推展至專業社群，服務的技能由一般服務推展至專業服務，服務地點由系所而校園乃至於社區，依序漸進。以培養學生關懷社會及服務人群的情操，並促進公民責任之實踐。  服務學習課程（一）為必修0學分，為充實學生服務學習知能，培養學生服務學習能力，為其終身服務打下基礎，由全人教育中心籌備處規劃辦理「服務學習知能講座」，結合每學年「新生營」辦理2場知能講座，另於每學年上下學期各辦理3場，每場2小時之知能課程。     學生畢業前必須參與3門服務學習知能講座（共6小時），並繳交心得報告，經審核後，始得通過服務學習課程（一）。課程講座預計規劃主題包含：基礎知能類、名人分享類、社團服務類、海外服務類等。",
    "goals": [
        "增進服務學習基本概念的理解",
        "建立自我價值感與自信",
        "發展服務利他的價值觀",
        "提升人際關係溝通與合作的能力",
        "培養自我反省的能力"
    ],
    "syllabus": "**重要注意事項公告：**\n\n**現行服務學習(一)課程，學生不須自行上網加選，學生只要參與三場服務學習知能講座，並上EP系統填寫問卷並撰寫心得報告，經全人教育中心審核通過後，即可通過服務學習 (一)。** \n\n**完成三場者，學生即可在完成當學期於教務系統、成績單看到服務學習（一）的修課紀錄。** \n\n**伯樂大學堂會視各學年安排情形安排一至兩場服務學習知能講座，另外，每學期講座資訊將會於本中心網站及臉書專頁公告，請同學密切注意網站訊息！  \n  \n課程聯絡人：全人教育中心王建傑行政幹事 02-7734-3326 wangchieh@ntnu.edu.tw**\n\n簡介：\n\n服務學習課程以「協同合作」、「互惠」、「尊重多元差異」、「學習為基礎」、「社會正義為焦點」等特質為基礎，以「準備」、「服務」、「反思」、「慶賀」等學習歷程，服務範圍以自己的生活與學習環境為起點而推展至專業社群，服務的技能由一般服務推展至專業服務，服務地點由系所而校園乃至於社區，依序漸進。以培養學生關懷社會及服務人群的情操，並促進公民責任之實踐。\n\n服務學習課程（一）為必修0學分，為充實學生服務學習知能，培養學生服務學習能力，為其終身服務打下基礎，由全人教育中心籌備處規劃辦理「服務學習知能講座」，結合每學年「新生營」辦理2場知能講座，另於每學年上下學期各辦理3場，每場2小時之知能課程。\n\n學生畢業前必須參與3門服務學習知能講座（共6小時），並繳交心得報告，經審核後，始得通過服務學習課程（一）。課程講座預計規劃主題包含：基礎知能類、名人分享類、社團服務類、海外服務類等。",
    "methodologies": [
        {
            "type": "講述法",
            "note": "演講者講述服務學習、志願服務理念，並分享自身服務志工的服務經驗，啟發學生對服務的熱忱，及對生命教育的瞭解。"
        },
        {
            "type": "媒體融入教學",
            "note": "透過教學影片、照片、繪圖、音樂等方式，分享志工的服務經驗。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 50,
            "note": "學生須出席知能講座，並利用刷卡方式登記。"
        },
        {
            "type": "出席",
            "weight": 50,
            "note": "學生聆聽講座後，須繳交心得報告，經審核後，始得通過。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}