{
    "year": 107,
    "term": 2,
    "name": "諮商心理實習（二）",
    "teachers": [
        "王玉珍"
    ],
    "department": "EM01",
    "code": "PCM0086",
    "credit": 3,
    "serial": 444,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 5,
            "to": 7,
            "campus": "本部",
            "classroom": "教600"
        },
        {
            "day": 3,
            "from": 10,
            "to": 12,
            "campus": "本部",
            "classroom": "教600"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎必須先修過【PCM0089  諮商理論專題研究】、【PCM0072  諮商技術專題研究】 ◎課程不開放上修",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 6,
    "description": "本課程旨在透過實習接案、督導、相互討論、閱讀、錄影帶賞析等的方式，統整諮商所學，協助學生能成為更有效能的諮商師，進而統整諮商師自己的個人諮商理論，並應用所學於個人日常生活中增進其個人心理健康，並培養樂於從事諮商工作的興趣與態度。具體而言，本課程目的: (1)\t協助學生能更有效進行諮商，增進對應用諮商理論的認識，並增進新的概念性與應用性的諮商態度與技巧。 (2)\t協助學生至實習單位進行諮商實習，在督導下，獲得實際接案經驗，以培養其諮商專業能力與從事諮商工作的興趣。 (3)\t統整個人的諮商理論，建立個人有效的諮商工作模式。 (4)\t透過同學的研討，與督導的討論，認識不同的個案問題型態與學習多元介入處理的諮商相關知識，以提昇諮商接案的效能，成為具有效能和倫理的諮商師 (5)\t幫助學生諮商所學能獲得充分實習機會，增加對於諮商專業的認同與更深入的瞭解與投入。 (6)\t協助學生能運用所學於個人日常生活中增進個人心理健康。",
    "goals": [
        "瞭解諮商的理論與實務，透過同學的研討與督導，更深入了解不同個案的問題型態與學習多元介入處理的諮商相關知識",
        "透過實習、討論與督導，協助學生能更有效進行諮商，能將所習得的諮商專業，應用於接案過程中，增進對應用諮商理論的認識，提昇諮商專業實務能力，對諮商理論與實務有更深入的瞭解與統整，而成為勝任的諮商師",
        "培養諮商師能夠由不同的角度，多元思考案主的問題，並不僵化、彈性因應處在不同文化下，案主不同的需求",
        "發展與統整諮商師的個人諮商理論，尊重每位諮商師不同的諮商風格",
        "能應用所學於個人日常生活中，以增進個人心理健康並培養諮商師應具有的態度與特質",
        "熟習並實踐諮商專業倫理守則",
        "培養以「人」為本的態度與人文情懷，及樂於從事諮商工作興趣與態度"
    ],
    "syllabus": "科目名稱（中文）：碩諮商心理實習（二）\n\n全/半年：半年   必/選修：必修     總學分數：三學分       \n\n上課時間：每週三中午12:20-15:10\n\n授課教師：王玉珍  （TEL：77343751，EMAIL：yujen@ntnu.edu.tw）\n\n一、教學目標：\n\n1.協助學生提升個案處理與諮商能力。\n\n2.協助實習學生提升諮商接案的效能與信心。\n\n3.協助學生增加對於諮商專業的認同與成長。\n\n4.協助實習學生了解實習場域並促進實習適應。\n\n二、課堂進行方式與活動:\n\n1\\. 分為團體課程以及同儕督導時間。全班同學先進行團體課程(12:20-15:10)，之後分組進行同儕督導(15:20-16:30)。\n\n2.團體課程---主要由同學透過實習經驗分享進行學習或是提出實習問題大家一起討論，此外，由同學輪流於課堂中提出個案報告，並透過角色扮演、概念化討論或其他形式之討論，促進同學對自我的反思與覺察、對個案多元情境的理解與認識，以及學習進行個案概念化。\n\n3\\. 同儕督導—約4-5人一組，每次由一位同學輪流提案並進行討論，目的在於同學之間能支持回饋以及提供可能的不同觀點。\n\n4\\. 講座與閱讀心得:\n\n  講座:曾端真教授 \\*閱讀書目：曾端真(2018):鼓勵孩子邁向勇氣之路:阿德勒學派案例解析與策略。台北:張老師。\n\n三、上課主題與綱要\n\n週次\n\n時間\n\n主題\n\n作業或說明\n\n1\n\n0220\n\n1.  課程說明與相關安排：課程說明、排定個案報告的順序、作業說明\n2.  實習現況與經驗分享\n\n 請於第二週繳交自我整理與期待(2/21-2/24)，**請上傳繳交****/****第二週**請繳交上學期諮商時數計算及簽名之影本(上學期正本請自行保管)\n\n\\*同儕督導時間、場地、組員以及個案安排以及進行方式討論。\n\n2\n\n0227\n\n個案報告與討論1\n\n請提報同學於前一週週日前將提報資料email給玉珍老師/準備書面及口頭ppt資料\n\n3\n\n0306\n\n個案報告與討論2\n\n4\n\n0313\n\n個案報告與討論3\n\n5\n\n0320\n\n個案報告與討論4\n\n6\n\n0327\n\n個案報告與討論5，6\n\n(同儕督導暫停一次)\n\n7\n\n0403\n\n停課\n\n8\n\n0410\n\n個案報告與討論7\n\n9\n\n0417\n\n個案報告與討論8，9\n\n\\*繳交逐字稿作業，上課前**印出紙本**繳交/個人接案時數檢核與預估。\n\n10\n\n0424\n\n個案報告與討論10\n\n11\n\n0501\n\n個案報告與討論11，12\n\n\\*講座前(5/8):提問/心得(半頁A4)，**5/15****上傳繳交**\n\n12\n\n0508\n\n個案報告與討論13\n\n提供感謝函名單（主任、督導兩種角色的）/接案時數檢核與預估\n\n13\n\n0515\n\n講座:曾端真教授\n\n(同儕督導暫停一次)\n\n14\n\n0522\n\n個案報告與討論14\n\n15\n\n0529\n\n個案報告與討論15\n\n16\n\n0605\n\n個案報告與討論16\n\n17\n\n0612\n\n個案報告與討論17\n\n(同儕督導最後一次)\n\n18\n\n0619\n\n實習整理與反思\n\n期末心得與學習評估與分享/繳交個案總結報告，**請印出紙本繳交**\n\n四、課程要求\n\n1\\. 學生至實習機構進行實習。須符合實習內容及時數要求。至機構實習內容規定如下:\n\n(1)關於時數: 每週6-8小時，持續進行一學年。每一學期至少100小時。一學年至少200小時。但配合機構實習，常會從7/1至6/30日為止。\n\n(2)關於機構: 至課程認可的實習機構進行實習，請勿在原工作服務單位進行實習。進行實習活動，請勿影響師大任何課程的修課時間。\n\n(3)關於實習內容:\n\na.進行個別諮商： 每週至少接案3小時，持續進行一學期，一學期至少實際接案時數為40小時。個別諮商一次至少40-50分鐘（如配合課堂長度），初次晤談、電話訪談、家庭訪談、心理測驗為0.6次且總和不得超過12小時，函件輔導不列入計算。晤談時數不足（但至少需滿28小時），可以與上下學期授課教授商議，於時數滿時再次送上學期成績。一學年最少需要接案80小時，上學期晤談時數超過40小時，可以抵掉下學期的40小時要求的時數，唯最多只能抵掉10小時。上學期結束後寒假後所進行之晤談，可開始列為下學期的晤談時數。\n\nb.接受個別督導：需接受每週一小時，一學期約20小時個別諮商督導。\\*在實習機構接受專業督導（含諮商督導與行政督導）。行政督導為機構專任人員，行政督導時數依據機構要求進行。機構內的個別諮商督導（精神科醫師或為有心理師證書者）則以機構專任督導者擔任個別諮商督導為佳。若需要時，可於機構外接受課程或機構認可的個別諮商督導（如博班督導）。在學期初由學生告知督導(包括行政與專業督導)需於期末對督導學生進行實習的評量，評量表由課程教師提供。參與督導時，積極主動投入與預備督導要求的準備事項，請珍惜學習機會多求教學習之，並於需要時與督導討論個人需求。請勿以網路督導進行，網路督導為危急時候使用，最多以0.5次計算，且不超過1/4督導時數。\n\nc.另外每週三小時可配合實習機構的需要，從事帶領諮商小團體、班級座談、小型團體討論會、心理測驗的實施與解釋、整理個案資料、籌備個案研討、及專業行政等。\n\nd. 實習一學年中需涉及八次小團體實務（至少要參與觀察，甚至偕同帶領或主要帶領）。此團體輔導之參與時數將於本學期確認。此項小團體的學習，以爭取機構內提供為主，若真沒有辦法，可搭配其他課程之學習。\n\n2\\. 參與校內課程團體與同儕督導時間。\n\n3\\. 提出個案報告與參與討論。在排定個案報告(包含同儕督導)的時間，每次上課及同儕督導時間，各有同學提出個案報告，全班同學(或同儕督導小組)針對報告的同學提出提問與回饋意見。\\*課堂提報個案盡量以已晤談三次以上為原則，若有困難可再討論。\n\n4\\. 進行專業反思與紀錄。根據各項實習經驗，撰寫規定之心得與紀錄。\n\n5\\. 符合諮商倫理，維護個案之福祉。不隨意談論個案，檔案管理與保存應該注意保密原則，關照自己身心之平衡，接受並考量必要時轉介的需要。\n\n6.請督導（含博班督導）於需要時，主動聯絡授課教師。若有特殊或危機事件，以及超過能力所及之事情，實習生應主動告知授課教授、督導（含博班督導）。於需要時，授課老師也會主動與實習機構或督導（含博班督導）直接商議如何處理。必要時，授課教師會提請實習委員會申請協助資源或進行審議。\n\n五、作業：\n\n(ㄧ)實習機構相關作業\n\n1.  每次接案之後，填寫個案紀錄表，可使用實習機構自訂的紀錄表格，每次個案紀錄由機構督導審閱簽名，並由機構存留。個案紀錄內容包括：諮商員對個案行為的觀察、對個案問題的理解、對個案問題產生的假設、諮商目標的設定、諮商的介入處理、諮商效果的評估等。\n2.  至少針對兩個連續個案進行連續的接案錄音，以供個別督導與課堂討論用途；於第一次諮商開始前取得案主的諮商錄音同意書。\n3.  根據個別督導的要求按時交出督導的相關作業(例如錄音帶、逐字稿、諮商回憶報告、個案紀錄等)；爭取針對同一個個案連續的督導與立即的執行與反思。\n\n(二)實習課程作業\n\n1\\. 學期初繳交項目：\n\n(1) 請繳交上學期諮商時數計算及簽名之影本(上學期正本請自行保管)\n\n(2)書寫自我學習描述與諮商實習期待：於學期初2/21-2/24星期日前上傳繳交，相關格式如附件1。\n\n2\\. **每位同學需要在課堂上提出一次個案報告**，上課前必需準備好個案報告資料、諮商錄音片段與逐字謄稿、督導需求（具體呈現向度與理由）。書面的個案報告向度如上學期，錄音逐字稿資料，內容向度如上學期，於上課前三日 (即週日午夜前)email給授課老師。上課時用ppt呈現個案資料以便討論，上課前由報告同學預備妥當播放錄影/錄音檔的設備(若有需要的話)，當日需將個案報告資料（練習組織與呈現最重要的資料）印出給同學，結束時回收。個案報告時間約15-20分鐘左右，呈現錄音與逐字稿片段10-15分鐘（最具有代表性或配合討論需求者），之後由老師與同學提問、回饋，並視情況進行角色演練或概念化之討論。\n\n3\\. **每週進行****70****分鐘左右之同儕督導**。於每週設定一位主持人(leader)、一位提報同學以及一位記錄，提報個案同學亦須於團體督導前三日(即週日午夜前)將簡要之相關個案資料及提案需求問題等，email給授課老師(提供逐字稿與否可彈性)。同儕督導後，整組由紀錄同學負責彙整繳交一分紀錄與學習心得，需於當週週日午夜前上傳 Moodle 作業區。內容包括提案者及參與同學、討論內容以及進行方式摘要、每個人之心得、紀錄彙整同學。同儕督導整學期時間中，每位同學至少需提案兩次。\n\n4\\. **真實個案逐字稿的評析與反思**：於4/25繳交一份至少有30對對話的逐字稿（不可以與課堂報告或期末個案報告同一位個案），簡述個案資料、前面晤談次數內容及該次晤談重點後，逐句及段落化分析檢討技巧意圖與效果，晤談歷程的轉折，以及整體的反思。3000字。\n\n5\\. **閱讀、提問與思考整理**。約半頁左右，於5/12上傳moodle繳交，格式不限。以第一本為主，行有餘力再閱讀第二本。可彙整一起繳交\n\n（1） 曾端真(2018):鼓勵孩子邁向勇氣之路:阿德勒學派案例解析與策略。台北:張老師文化。         \n\n（2） Gergen, K. J.(2009):醞釀中的變革:社會建構的邀請與實踐。 台北:心靈工坊。\n\n**6.****學期末碩士班諮商實習總心得與自我評估：** **6000****字以內。內容請包含以下向度：**\n\n（1）針對兩年來碩士班各項諮商實習工作的學習經驗回顧\n\n（2）於實習機構接案與督導中對於自我與諮商專業學習的省察\n\n（3）師大課堂團體個案被督導與參與的心得\n\n（4）個人接案能力的強項與弱項評估\n\n（5）實習期間的專業與自我成長評估(對照學期初諮商實習目標與期待)\n\n（6）諮商中個人議題的發現與整理\n\n（7）個人使用的諮商取向與概念化的學習\n\n（8）對諮商實習機構其諮商工作脈絡的認識（如各項方案如何搭配進行、校園或醫療文化中的行政程序執行等）\n\n（9）對未來全職實習的學習目標\n\n7.**個案總結報告**：於期末繳交一份個案總結報告，其中的個案是為連續晤談六次以上的，可為上台報告、期中逐字稿報告或同儕督導者。格式與內容參考如附件，須盡量將各向度資料填寫彙整。（如課堂討論重點、心得，並回頭修改報告時資料，以及報告後再談的晤談次數內容）務必將新增加的訊息加入個案基本資料與累進修改分析。\n\n8\\. 於學期末繳交:**實習項目與實習時數累計表****/****本學期督導時數累計表** ，上述表格，請6由與督導共同簽名)，表格如上學期。\n\n9\\. 於學期末繳交**行政督導與專業實習督導評量表**各一份，由督導各自簽名密封後由學生交給課程教師；如上學期。清楚寫出這學期的資訊，勿與上學期合併寫在一起。請於五月最後一週開始給督導。\n\n\\*上述需於期末繳交的作業項目6-9，請彙整所有作業後一起繳交(請勿先單獨繳交部分作業)，繳交日期皆為**6/19-6/26**，請勿遲交。\n\n六、評量：\n\n1.實習表現(35%):參考實習機構的行政專業督導以及諮商專業督導意見評定各一份。\n\n2.學期作業:對諮商實習的期待、閱讀提問思考(5%)、同儕督導心得(10%)、期末實習總心得與自我評估(10%)、期中逐字稿分析與反思(15%)、個案總結報告(15%)等。\n\n3.課堂個案報告以及課堂出席與參與討論(10%)。全學期不得缺席(含請假)超過兩次，並請事前email告知請假。\n\n附件1\n\n第二週日(2/24)需上傳繳交之個人資料格式:\n\n107 (二)碩二諮商心理實習\n\n同學們好：\n\n很高興與你們在這個學期一起學習！為了讓我們的學習更為順利豐富，需要請你幫忙，讓我能先了解你接下來諮商實習上的需要、對課程及對諮商的期待。透過這個方式，希望能使課程更符合你們的需要，另一方面，對你而言也可以有些自我的整理，在學習諮商的路上，能與自己同在。謝謝你。\n\n王玉珍 謹上  2019.2.11\n\n姓名\n\n年齡\n\n(曾經or現在)服務機構&職稱\n\n年級\n\nemail\n\n聯絡電話\n\n（公）         （宅）\n\n手機\n\n是否計畫考諮商心理師 / 是否參加碩三實習\n\n碩二實習機構行政督導姓名與電話 (若上下學期不同，請分別說明)\n\n個別督導姓名電話(若上下學期不同，請分別說明)\n\n這學期預計實習項目\n\n到目前為止，我喜歡擔任「諮商員」的程度 (1-10)?\n\n到目前為止，我覺得自己能勝任當「有效諮商員」的程度 (1-10)?說ㄧ說理由。\n\n對自己未來生涯計畫的初步想法？當諮商心理師？場域?學校、醫院、社區…服務？行動心理師?...\n\n請簡要敘述過去相關輔導、實務或其他相關經驗 (簡要的簡述即可)。\n\n說說較常或漸漸使用的諮商學派取向與緣由。(個人的欣賞，個人的相信，以及目前學習的狀況或經驗等)。\n\n說說你對於改變或轉變的看法(何時、甚麼樣的條件…)。\n\n實習一個學期以來，對實習機構的形容，以及對自己在適應機構實習、接案上的一些體會。(像是學習、收穫，或者擔心、挫折..)\n\n對於下學期實習機構實習，可能會遇到的挑戰或擔心？\n\n我對此課程的期待或建議？或者，對所擬定的上課內容、主題及方式上的，或其他作業，有沒有疑惑，請提出來。\n\n其他的補充或想說的……\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n附件2 課堂提報個案之格式參考\n\n個案報告大綱【課堂報告用】\n\n一、個案基本資料以及由來\n\n（一）案主個人重要基本資料（機構、性別、擬名、年齡、年級、繪家庭圖、居住地區、晤談的開始時間）。家庭資料包含含出生別；經濟狀況；同居住人基本背景與關係資料，如父母兄弟姊妹職業、年齡、居住關係等；監護人資料\n\n（二）案主的心理、生理或用藥情形、學習情形、測驗等資料\n\n（三）案主與諮商的接觸：主動或轉介而來、轉介的理由、轉介者的期待、案主過去接受晤談的歷史、案主此次對晤談的期待與觀感、諮商者對初次接觸此學生案主的觀察與評估\n\n（四） 需立即注意的事項：是否有危機。是否曾就診於精神科，或有酗酒或暴力的行為。晤談時會否有暴力傾向；與之晤談時的安全性為何。\n\n（五）一同協助當事人的相關機構與社區單位\n\n（六）當事人機構、開案日期、目前接案次數與狀態。\n\n二、個案的主訴問題\n\n（一）當事人個人主觀認為尋求晤談協助的需求、最大期待或是目標。\n\n（二）案主學生對困擾問題的因應：案主對問題的因應方式、因應方式的有效性、案主的內在資源、外在支持系統與評估\n\n三、諮商師對當事人的整體分析與個案概念化\n\n（一）諮商者對案主問題的理解與思考：\n\n（二）諮商師對當事人所形成之概念化：對案主問題的假設與可能之理論依據\n\n（三）依據諮商的資料所形成對案主的諮商目標\n\n（四）介入計畫與策略\n\n四、諮商關係\n\n（一）當事人的投入、對諮商師的態度\n\n（二）互動關係：特徵、特殊事件\n\n（三）諮商關係的進展與變化\n\n五、每次晤談的介入過程\n\n（一）每次晤談內容重點摘述\n\n（二）諮商師介入的方向以及效果\n\n（三）對當事人特別有效、困難的介入策略及原因\n\n（四）晤談間的改變\n\n五、對此次個案報告與討論的期待\n\n*   期待討論的問題或希望獲得的回饋與學習（包括個案的議題、學校系統合作、介入策略、接案歷程、案主狀況等）\n*   經驗分享與反思\n*   督導意見的反思\n\n 六、10-15分鐘的逐字稿並說明摘自哪一次諮商的哪一個段落（時間點、該次前面諮商概要，逐字稿後面的諮商概要）\n\n附件3 期末個案總結報告格式，請參考\n\n個案研究報告格式【期末總報告用】\n\n一、個案基本資料以及由來\n\n（一）學生案主個人重要基本資料（性別、擬名、年齡、年級、繪家庭圖、居住地區、晤談的開始時間）。家庭資料包含含出生別；經濟狀況；同居住人基本背景與關係資料，如家人職業、年齡、居住關係等；監護人資料\n\n（二）案主的心理、生理或用藥情形、學習情形、測驗等資料\n\n（三） 案主與諮商的接觸：主動或轉介而來、轉介的理由、轉介者的期待、學生案主過去接受晤談的歷史、案主此次對晤談的期待與觀感、諮商者對初次接觸此學生案主的觀察與評估\n\n（四） 需立即注意的事項：是否有危機。是否曾就診於精神科，或有酗酒或暴力的行為。晤談時會否有暴力傾向；與之晤談時的安全性為何。\n\n（五）晤談開始時間/晤談次數/目前狀態\n\n二、個案的主訴問題\n\n（一）當事人個人主觀認為尋求晤談協助的需求、最大期待或是目標。\n\n（二）案主學生對困擾問題的因應：案主對問題的因應方式、因應方式的有效性、案主的內在資源、外在支持系統與評估\n\n三、對當事人的整體分析與個案概念化\n\n（一）輔導員對案主問題評估與概念化：對案主問題的假設與可能之理論依據\n\n（二）依據諮商的資料所形成對案主的諮商目標\n\n（三）介入計畫與策略\n\n四、每次晤談的介入過程\n\n*   每次晤談內容重點摘述\n*   整體處遇分析\n\n五、結案與成效評估\n\n（一）後續評估與做法\n\n結案狀態、或轉介做法與建議\n\n（二）改變與成效評估\n\n結案時，當事人與初次晤談時的各種差異與改變；諮商員對當事人的差異與改變的理解與推測。\n\n六、擔任諮商師的覺察與反思\n\n  （一）對當事人的主觀經驗與反思\n\n  （二）對諮商關係的主觀經驗與反思\n\n  （三）諮商師個人議題的覺察\n\n七、督導意見與反思\n\n（一）各次晤談後督導所給的意見與反思\n\n（二）課堂團督的心得與反思\n\n（三）督導意見的整體反思",
    "methodologies": [
        {
            "type": "討論法",
            "note": "討論個案與實習經驗"
        },
        {
            "type": "實驗/實作",
            "note": "符合實習時數"
        },
        {
            "type": "其他",
            "note": "角色演練"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 40,
            "note": "實習期待、學期總心得、月誌、個案報告"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "參與個案討論及課堂出席討論"
        },
        {
            "type": "其他",
            "weight": 50,
            "note": "實習表現/機構督導意見參考"
        }
    ],
    "prerequisite": "◎必須先修過【PCM0089  諮商理論專題研究】、【PCM0072  諮商技術專題研究】",
    "general_core": []
}