{
    "year": 108,
    "term": 2,
    "name": "國文（二）",
    "teachers": [
        "謝秀卉"
    ],
    "department": "CU",
    "code": "00UA826",
    "credit": 2,
    "serial": 239,
    "group": "",
    "quota": {
        "limit": 35,
        "additional": 0
    },
    "schedule": [
        {
            "day": 4,
            "from": 1,
            "to": 2,
            "campus": "本部",
            "classroom": "樸403"
        }
    ],
    "programs": [],
    "comment": "公領系、衛教系、特教系、臺文系、企管系、表演藝術學士學位學程",
    "restrict": "◎第一階段需人工加選◎第二階段需人工加選◎加退選階段需人工加選",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本課程同時具有語文教育、文學教育與人文教育等性質。\n本課程教學的實施，以重視經典的現代意義，陶冶人文精神、訓練語文能力、提昇閱讀品味為目標，達成語文、文學、文化、生命四者內涵的深化。",
    "goals": [
        "指導學生掌握理解各類文本的方法。",
        "指導學生明瞭常用應用文的格式語法。",
        "提升學生分析、評論各類文本的能力。",
        "增進學生寫作各種文類的能力。",
        "強化學生聆聽及口語表達的能力。",
        "促進學生思考、組織、想像與創造的能力。",
        "誘導學生閱讀的興趣、培養學生閱讀的習慣與品味。",
        "指導學生研讀經典，以充實知識涵養、拓展人生視野、啟發對人文及不同種族文化的關懷與理解。"
    ],
    "syllabus": "**第一單元想像力飛翔的國度**\n\n**【教學目標】**\n\n第一單元為「想像力飛翔的國度」。大象會飛，星星會眨眼，山裏住著神仙與精靈。當我們還是孩子的時候，每個人心中都有一處充滿夢幻、神奇與秘密的國度。童年記憶中，可愛的友伴經常悄悄現身，在夢的深底，翻飛起伏的潛意識層，與我們結伴同行。長大後，某些人漸漸遺忘漸漸遠離，某些人則帶著它們走入成年的歲月裏。在這處想像力飛翔的國度，古與今，東方與西方，我族與他者，真實與虛構，懼怕與嚮往，似真若幻，若隱若顯，滋潤著那些正傾聽著與閱讀著的心思。本單元選讀之文字或影像，即在引導同學閱讀與此主題相互呼應關聯之作品，看人類所懷抱的理想、夢想與幻想，如何在生活的大地上開出鮮豔瑰麗的花朵。\n\n1.  課程介紹（3/5）（鶯歌石、婆婆橋）\n2.  山裏的精靈：中國神話寶庫《山海經》（3/12）\n3.  **前測（3/19****）**\n4.  清宮海底總動員：聶璜《海錯圖》篇章選讀（3/26）\n5.      **作業1：貼圖設計暨創意說明**)\n6.  春假（4/2）\n7.  神鬼莫測：干寶《搜神記》篇章選讀（4/9）\n\n**第二單元你所不知道的臺灣咖啡**\n\n**【教學目標】**\n\n第二單元為「你所不知道的臺灣咖啡」。喝咖啡，已成為臺灣人的日常生活風景。而，咖啡，在臺灣，不僅僅做為提神飲料，更成為我們的日常生活文化。日治時期，臺灣咖啡曾經有一段興盛的榮景，有著從種植、採收、洗晒到焙製的完整培育與製程。然而，這段屬於本土咖啡的歷史，卻也隨著日本戰敗與國民政府主政後，咖啡需求日益擴大而開放進口的情況下，趨於凋零式微，飄落歷史之流。本單元選讀之文字或影像，即在引導同學閱讀與此主題相互呼應關聯之作品，認識臺灣咖啡的前世今生，並與臺灣本土咖啡產業結合，引導同學就咖啡行銷與推廣之主題，展開集思討論，並設計相關圖文成品。\n\n1.  福爾摩莎咖啡香：王瑞閔《看不見的雨林─福爾摩沙雨林植物誌》篇章選讀（4/16）\n2.  談場限時的虛擬戀愛：廖怡錚：《女給時代：1930年代臺灣的珈琲店文化》篇章選讀（4/23）（期中考週）\n3.  CLASSROOM CAFÉ：臺灣咖啡介紹暨品嘗體驗（演講）（4/30）\n\n咖啡簡介三折頁大改造**（****作業2****：小田家的咖啡歲時記）**\n\n**第三單元那些人曾走過的路**\n\n**【教學目標】**\n\n第三單元為「那些人曾走過的路」。成長，就似樹的年輪，一圈一圈地形成我們現在的樣子。家人、家庭、家族，同學、朋友，職場同事或社團同好，親近熟悉者有之，緣慳一面者有之，我們所經歷與來往的人、事、物，在不知不覺中，已化成人生際遇或性格的一部分。而，總有那麼些人，曾走過的路，能帶給我們啟發、感動與嚮往。其中，有人，有文，有際遇，有抉擇。駐足暫歇，却顧所來徑，曲曲折折的道途，朦朧者有之，清晰者有之。閱讀，使我們跨越時空阻隔，與他們在思路上相逢，從他們的選擇與經歷找到鼓舞自己前進的力量。本單元所選錄之文字或影像，即是與此主題相互呼應與關聯之作品，引導同學思考那些人如何在特定的時空格局中活出自己的樣子。此外，也藉由評論寫作，提供同學在資訊蒐集整理、揀擇裁取、分析判斷以及陳述與表達等方面的實作練習。\n\n1.  學著，去愛：孫中興《學著，遇見愛》（5/7）**（口頭報告：討論與評論）**\n2.  學著，去愛：孫中興《學著，好好愛》（5/14）**（口頭報告：討論與評論）**\n3.  女身男魂：朱天心〈哪吒盟盟〉；黃惠偵《我和我的T媽媽》（5/21）**（口頭報告：討論與評論）**\n4.  網路世界的你：維多‧麥爾荀伯格〈無法從記憶抹去的「醉海盜」〉（5/28）\n5.  後測（6/4）\n\n**第四單元年輕人，你在什麼樣的天空下思考與行動**\n\n**【教學目標】**\n\n第四單元為「年輕人，你在什麼樣的天空下思考與行動」。好時光匆匆過，做為大學生，你開始習慣大學生活了嗎？此刻，攤展在你面前的，是遠超出視線範圍的大海，各種熟悉的或陌生的經驗，在那些名之為課業、社團、人際關係、愛情的島嶼上等待你前去探索、體驗。定錨乎？航行乎？似乎，隨時都在選擇與思考著。啟程、冒險、停歇、再出發，就像一齣齣youtube短片，拼湊剪接，你也開始逐漸圖寫出屬於自己的生活樣貌。而就這麼，不知不覺的，那些瑣瑣碎碎，點點滴滴，原來，都是成為大人的養分。想一想，那些與你年齡相仿卻身處不同地域的年輕人此刻又在思索些什麼？煩惱些什麼？他們如何找到自己的天賦，又是如何用自己的力量，勇敢堅強地走在自己期盼的道路與風景上？本單元選讀之篇章或影片即是與此相關的作品，同學們可以由此看見，不同地域的年輕人，如何透過思考與行動與他所身處的社會環境對話，並從中感受、反省與思辯，同時，也以此與他人、社會、世界相互交流聯繫。然後，慢慢摸索出自己在整體歷史社會情境中所具有的位置，進而，學習，澄清，靜定，向前。\n\n1.  却顧所來徑：自傳履歷表**（作業****3****：自傳及履歷表）（6/11****）**\n2.  却顧所來徑：自傳履歷表（**作業****3****：自傳及履歷表**）**（****6/18****）**\n3.  端午節放假（6/25）\n4.  自主學習（暑期閱讀）",
    "methodologies": [
        {
            "type": "講述法",
            "note": "教師講述"
        },
        {
            "type": "討論法",
            "note": "深度討論教學法"
        },
        {
            "type": "合作學習",
            "note": "小組討論、師生討論"
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": "課堂公告"
        }
    ],
    "prerequisite": "",
    "general_core": []
}