{
    "year": 108,
    "term": 2,
    "name": "英文（二）",
    "teachers": [
        "陳秋梅"
    ],
    "department": "CU",
    "code": "00UB8A4",
    "credit": 2,
    "serial": 307,
    "group": "D",
    "quota": {
        "limit": 35,
        "additional": 0
    },
    "schedule": [
        {
            "day": 5,
            "from": 1,
            "to": 2,
            "campus": "本部",
            "classroom": "誠205"
        }
    ],
    "programs": [],
    "comment": "文學院（英語系除外）、藝術學院、科技學院、車能學位學程、體育系、台文系、華語系(國華組)一年級 (能力分班)",
    "restrict": "◎第一階段需人工加選◎第二階段需人工加選◎加退選階段需人工加選 ◎必須先修過【英文（一）】",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "共同科英文（二）課程為一學期兩學分課程，係為非英語系學生所開設的課程。目標在幫助大一學生活用中學時期所累積的英語知識，提昇英語聽、說、讀、寫整體的溝通能力。為達此目標，本課程要求教師盡量用英語上課，努力營造一個豐富的英語環境，讓學生不但有充分機會以英語參與課堂活動，且樂於使用英語與同學及老師溝通。",
    "goals": [
        "1. 增進學生英語溝通表達能力 2. 透過參與課程活動促進團隊精神 3. 透過多面向英語閱讀促使學生了解多元文化，拓展學生國際化視野 4. 透過課堂討論培養批判精神 5. 提升學生英語學習動機及自主學習興趣"
    ],
    "syllabus": "Instructor: Chen Chiou-mei 陳秋梅\n\nE-mail and TEL: [t22040@ntnu.edu.tw](mailto:t22040@ntnu.edu.tw)  23638974\n\nOffice: 本部誠八樓805號研究室\n\n**_English II (for PE Majors)_**\n\nSpring, 2020\n\n**Course Objective**\n\nThis course is intended to teach students how to use the tools and resources available to them to do English tasks such as reading aloud an essay, understanding an article, role playing an everyday situation in English, introducing themselves and their majors, teaching people how to learn the skills they are good at, expressing their opinions, taking notes, writing resumes and autobiographies and well-organized essays, etc. Students will be offered lots of opportunities to develop the four language skills along with critical thinking skills through a variety of in-class and out-of-class activities.\n\n**Textbook**\n\n     World Class Reaings 1: A Reading Skills Text\n\n**Requirements and Rules**\n\n**1\\. Punctual attendance**, **lesson preparation** and **active participation** are required. Participation also includes teamwork and group discussion.\n\n*   All student absences will be classified as excused or unexcused.\n*   Absences for the following reasons will be _excused_ if there is timely verification (within 1 week) of such reasons provided to the instructor:\n\n*   Illness or medical emergency\n*   Family emergencies\n*   Pre-arranged medical appointments.\n*   Pre-arranged school-sponsored activities, such as field trips.\n\n*   A Notification of Absence Form has to be submitted online (學生請假系統) within 1 week. Verification document (hard-copy) should also be handed in to the instructor within 1 week. Late submission will not be accepted. A Notification of Absence Form without a verified document will be regarded as an _unexcused_ absence.\n*   Students who are more than 30 minutes late to class will be considered absent.\n*   Students will fail this course if there are more than 3 unexcused absences.\n*   Students will fail this course if they miss more than 5 meetings the whole semester.\n\n**2\\. Plagiarism and cheating on quizzes or exams** is absolutely forbidden. If someone is found cheating on an exam, he/she will fail that exam.\n\n**3\\. Textbook** is a must. Violation of this rule will cost you 2 points (out of your final score) each time.\n\n4\\. You cannot use your laptop or smart phone in class without the teacher’s permission. Violation of this rule will cost you 2 points each time.\n\n5\\. Before every meeting, you should preview the reading. Look up the words that you don’t know in the dictionary. You might be asked in class what the word means. If you can’t answer correctly, you have to write some assignment given by me.\n\n6\\. The whole class will be divided into 4 groups. Each group picks one person who is competent and responsible to be their leader. In every meeting, the leader checks his group members’ textbooks for me. Make sure that each of them has looked up the new words in the dictionary and has written their meanings on the book. Then he goes over the text to see if each member understands everything. After that, the teacher randomly selects some students to read aloud or translate the text and answer the comprehension questions. If they cannot do the task well, they’ll have to do some homework assigned by the teacher. After understanding the whole dialogues, the students are required to role play the situations according to the teacher’s instruction. In this semester, each student must do role plays at least 2 times.\n\n7\\. This semester you have to turn in a resume, an autobiography, and 2 English journals (Each must contain at least 100 words). Print it out on an A4 paper and submit it to me before the deadline. Exceptions are allowed only under emergent circumstances or notification in advance.\n\n8\\. Everyone must take the **Lexile Online Reading Comprehension Test** in June. The score you get will constitute 10% of your final score. You can get extra points if you make progress this time (compared with the test result you got last semester).\n\n9\\. A speaking activity – **Talent** **Show** \\-- will be held on 5/17. It’s a group work. People with the same or similar specialties work together. They use English to introduce and demonstrate their specialties to the class. Think about how to make your show interesting to a layman. If there are 6 people in the group, then the show time should be at least 12 minutes. Everyone must speak for some time so that they can get the credit.\n\n**10\\. Check Moodle 2.8 and email frequently**\n\nI assume that you check your email and the course site frequently. It’s your responsibility to make sure you register with the correct email address on Moodle 2.8. **Not receiving a notice is NOT an excuse for any late submission. Late submission will be penalized 10% per day.**\n\n11\\. You can check out **Lexile levelled books** (Scholastic Inc.) from NTNU library according to your own Lexile level (from 0L~1800L) and write a book summary (about 80 words). Hand in these summaries at the end of the semester and it will help you get some bonus points.\n\n**Grading Policies:**\n\nAttendance and Participation  10%\n\nTwo Role Plays  10%\n\nResume and Autobiography  10%\n\nTwo Journals  10%\n\nTalent Show   20%\n\nLexile Online Reading Comprehension Test  10%\n\nFinal Exam  30%\n\n**Bonus Points (for those who can’t get 60 points in the tests)**\n\n1.  Time spent on the multimedia lab 樸101 may help you earn some bonus points.\n2.  Extra points will be given if you participate in activities that help improve your English ability, such as 3-minute presentations competition, E-book competition, listening to English talks, i-read or language exchange. How many points you’ll get depends on the length of time and efforts you spend on them.\n3.  Summaries of the Lexile outside readings.\n4.  Award-winning athletic performance (e.g. medals in an international or national game)\n\n**Tentative Schedule**\n\n_Week    Content_                                                       \n========================================================================\n\n1         Introduction\n\n2         Grouping + How to use the English **tools** and **resources** + resume\n\n3         Lesson 4 + submit your **resume** and read it out loud\n\n4         **Role play** the situations about L.4 + how to write autobiography\n\n5         submit your **autobiography** + discussion of your talent show\n\n6         English learning websites & apps + play games + prepare talent show\n\n7         **National Holiday, No Class**\n\n8         Lesson 7 + tell how you spend your holiday + submit your 1st journal\n\n9         **Role play** (L.7) + Read an article + discuss the article\n\n10        submit **your second journal** + Lesson 8\n\n11        **Role play** (L.8) + Read an article + discuss the article\n\n12        Lesson 9\n\n13        **Role play** (L9) + **Talent Show**\n\n14        Self-study project\n\n15        **Lesson 10; submit all your assignments**\n\n16        Final Exam\n\n17        Adjusted Holiday, no class.\n\n18        Self-Learning",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "實驗/實作",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 30,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 10,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 20,
            "note": ""
        }
    ],
    "prerequisite": "◎必須先修過【英文（一）】",
    "general_core": []
}