{
    "year": 108,
    "term": 2,
    "name": "英文（二）",
    "teachers": [
        "胡浩洋"
    ],
    "department": "CU",
    "code": "00UB8A2",
    "credit": 2,
    "serial": 277,
    "group": "H",
    "quota": {
        "limit": 35,
        "additional": 0
    },
    "schedule": [
        {
            "day": 5,
            "from": 1,
            "to": 2,
            "campus": "本部",
            "classroom": "正202"
        }
    ],
    "programs": [],
    "comment": "文學院（英語系除外）、藝術學院、科技學院、車能學位學程、體育系、台文系、華語系(國華組)一年級 (能力分班)",
    "restrict": "◎第一階段需人工加選◎第二階段需人工加選◎加退選階段需人工加選 ◎必須先修過【英文（一）】",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "共同科英文（二）課程為一學期兩學分課程，係為非英語系學生所開設的課程。目標在幫助大一學生活用中學時期所累積的英語知識，提昇英語聽、說、讀、寫整體的溝通能力。為達此目標，本課程要求教師盡量用英語上課，努力營造一個豐富的英語環境，讓學生不但有充分機會以英語參與課堂活動，且樂於使用英語與同學及老師溝通。",
    "goals": [
        "1. 增進學生英語溝通表達能力 2. 透過參與課程活動促進團隊精神 3. 透過多面向英語閱讀促使學生了解多元文化，拓展學生國際化視野 4. 透過課堂討論培養批判精神 5. 提升學生英語學習動機及自主學習興趣"
    ],
    "syllabus": "Freshman English - Spring 2020\n==============================\n\n**T****ime****:** Friday, 8:00-10:00, 10:20-12:10                                      **Classroom:** 正  **202 Objectives****:** This course is designed to support college freshmen in their use of\n\n**Englis****h language** in a hands-on learning environment to improve their reading, writing, speaking, and listening abilities through activities that integrate the four language skills. The objectives of this class include developing students’ 1) Quality Talk skills to think outside the box, challenge assumptions, and visualize big issues, 2) Presentation skills to effectively present relatively complex ideas in a way that is easy to understand and remember, 3) Writing skills to effectively persuade the reader, 4) Debate skills to challenge an opponent’s ideas and present your position in a more favourable light, 5) Creative skills to write engaging stories, song lyrics, and podcasts.\n\n**1)**  **Firstl****y****,** students will study the **course textbook** which covers a wide range of skills including vocabulary, sentence patterns, grammar, and a discussion of topical issues facing young people today.     The main focus of the textbook is to use it as a discussion tool for Quality Talks which will be held at least four times this semester. For the Quality Talks, the class will be divided into four person groups where students are encouraged to think outside the box and ask “Why”, “What-if” questions and challenge the basic premise of the discussion topic at hand.\n\n**2)**  **Secondl****y****,** students will participate in **tw****o group projects**, the mid-term podcast project and the final project in creative writing.                                     Each group will be comprised of two students and students are encouraged to use their own creativity to come up with a unique work product.\n\n**3)**  **Thirdl****y****,** students will participate in a number of **in-clas****s activities and small projects**.     The projects will include creating and performing their own rap song, designing an independent essay, integrated essay training, creating their own TOEFL integrated essay question, participating in a TOEFL challenge, and learning how to debate effectively in English.\n\n**4)**  **Finally**, students will practice their reading and speaking skills by reading a high-level **boo****k** and then making an interview-style podcast on this book. The main characters in this book are “interviewed” and asked “what-if” Quality Talk type questions to explore different plot scenarios and further analyse the story, main characters motivation, deeper meaning, and potential different endings for the story.\n\nClass Schedule\n\nSchedule: This is a tentative schedule and _may change_ at the lecturer’s discretion!\n\nWk\n\nDate\n\nContent\n\nNotes\n\n1\n\n02/21\n\nIntro / Rap Song Part I: Write lyrics 4 bars\n\n2\n\n02/28\n\nHoliday - 228\n\n3\n\n03/06\n\nRap Song II: Write lyrics all 16 bars and Perform It\n\n4\n\n03/13\n\nQuality Talk – Chapter 5\n\n5\n\n03/20\n\nDebate I\n\n6\n\n03/27\n\nDebate II\n\n7\n\n04/03\n\nHoliday – Spring Festival\n\n8\n\n04/10\n\nMake Your Own TED Talks\n\nPresentation through Story Telling\n\n9\n\n04/17\n\nQuality Talk – Chapter 6\n\n10\n\n04/24\n\nIntegrated Essay Training\n\n11\n\n05/01\n\nCreate Your Own Integrated Essay Question\n\n12\n\n05/08\n\nQuality Talk – Chapter 7\n\n13\n\n05/15\n\nCreative Writing\n\n14\n\n05/22\n\nVLOG – Video Log\n\n15\n\n05/29\n\nQuality Talk – Chapter 8 part 1\n\n16\n\n06/05\n\nTOEFL Challenge\n\n17\n\n06/12\n\nQuality Talk – Chapter 8 part 2\n\n18\n\n06/19\n\nFinal Presentation of Creative Writing\n\nGuidelines and Requirements: The Basics\n\nOne of my favourite expressions is “Half of life is just showing up.”    The essence of this expression is that if you expect anything good to happen to you in your life, then you will need to make the effort to participate.                               Showing up is half the battle and if you do not show up then you already lost.                             This of course applies in school as well as work and sports.                                                               If you want to improve then you will have to at least show up.\n\nI am very sensitive to maintaining a healthy classroom environment for learning and found that when students do not show up it has a corrosive effect on the classroom atmosphere for several reasons.\n\n•     First, it is not fair to the student’s group team members. It causes hardships for fellow group members who are short one person and have to do extra work or suffer a reduction in quality because their team member let them down and did not attend class.\n\n•     Second, it negatively influences other students because it teaches them that they can also skip class by easily obtaining an approved absence in\n\nthe school system with little or no proof (發燒，頭痛，腳受傷，讀書假，辦理重要文件，家庭聚會，去醫院看親戚，等等).    The system is so easily abused that excused absences have lost all meaning. Therefore, all\n\nabsences are viewed the same whether they are excused or not.    The only thing that matters for grades is did the student attend class and was the assignment turned in on time.\n\n•     Third, it is not fair to the student themselves.    NTNU is an excellent university and the only way to learn is to actually show up and participate. If a student doesn’t want to show up for class, then they might be better of enrolling in an online university rather than taking up a seat that could otherwise go to another qualified Taiwanese student applicant.\n\n•     Fourth, it is not fair to the students who faithfully show up for class even if they are not feeling well and they have other things they would rather do. These dedicated students need to be rewarded and they will be**.**\n\nFor all of the attendance policies, the teacher reserves the right to review special cases on an individual basis but your expectation should be that your special request will not be approved.\n\n**1.**      **Attendance grades are earned (10%)**.    The only way to earn your attendance grade is to actually show up for class on time.              _Therefore, there is **no distinction** between excused and unexcused absences.            If a student does not show up for class, then the student does not earn their attendance grade._                         Leaving early without prior approval from the teacher is also recorded as an absence.\n\n**One absence** is allowed (for any reason) with no deduction in attendance grade. If a student does not attend **two times** (for any reason) then they lose **half** of their attendance grade.   If a student does not attend **three** times (for any reason) then they **lose all** of their attendance grade.\n\nIn summary, miss only one class then receive full 10%, miss two classes then receive 5%, miss three classes then receive 0% which is a full letter grade deduction.\n\n**2.**      **Students who fail to attend class four or more times _for any reason_**\n\nwill fail the class, regardless of how well they are doing in class.\n--------------------------------------------------------------------\n\n**3.**      **Attendance will be taken after the start of class**.    Late attendance will result in ½ absence.                       As an example, arriving late 4 times is equivalent to missing class twice, which is losing half the attendance points.         After the first class period, arriving late is viewed the same as a no-show, which is a complete absence.\n\n**4.**      **Required Textbook**:    The required textbook for this class is **“**Daise, D., & Norloff, C. (2015). _Q: Skills for success–Reading and writing (Book 4)._ New York, NY: Cambridge University Press**”**, which is the exact same textbook that was required for the previous semester.     Older versions of this textbook are **not acceptable**.              Smartphone photos of the textbook and photocopies of selected pages are also **not acceptable**.    Avoid all these problems by buying the required textbook.\n\nStudents who fail to bring their textbook to class **once or twice** on Homework/QC days will receive a **two-letter grade deduction** for that day’s homework and QT discussion.                                                                    Students who fail to bring their textbook to class on Homework/QT days **three times** will receive an **F (0 points)** for their 20% QT overall course grade.\n\nMake-up homework and make-up QT discussions must be handed in to the teacher the **following week and requires showing the teacher their textbook** (in person, not email) with the corresponding answers and QT. Make-up homework and make-up QT discussions will be **downgraded two letter grades**. After one week no partial credit will be given.\n\n**5.**      This is a **Flip Class**. Prep work must be done for the class to work properly.\n\nThis includes reviewing and previewing class chapters.\n\n**6.**      Smartphones, tablets, etc, must be **turned off** unless needed in class.\n\n**Consistent abusers** of classroom policies such as playing on smartphones during class, failing to participate, and sitting in the back of the room talking will find that their class participation grade will suffer, to the point of earning an **F** for classroom participation and downgrades for their in-class activities and QT discussions.       Classroom policies are reasonable and easy to follow, so please don’t test the limits to see how much you can get away with, because it will hurt your grade.\n\n**7.**      **In class activities and in class mini projects.**     We will have a number of in-class activities and small in-class projects.                               The only way to receive a full grade is to actually participate in class.                                             If a student does not attend, it will be difficult to make up that assignment because it was an activity that is based on what was taught during class, and in many cases it is with group members.\n\nStudents will be given the chance to make up this in-class grade within one week but will be **downgraded two letter grades for a maximum score of a C** since it is impossible for them to learn what was missed and they lost the benefit of group interactions. **After one week, make-up work will not be accepted.**     On the positive side, it is very easy for a student to receive a minimum of a B if the student shows up and actively participates. These are easy grades to earn and many students will earn an A.\n\nOne exception for make-up projects is the Debate in-class activity.    If a student cannot make those two weeks then they can receive partial credit by writing an essay on a topic I give them.                                                                              This make-up work will also be downgraded two letter grades, so an “A” essay will be a “C” make-up grade\n\nand a “B” essay will be a “D” make-up grade.    As you can see it is in your best interest to show up for class.\n\n**8.**      **Quality Talk**. Group projects and in-class activities are designed to follow the quality talk philosophy of asking “Why” and posing “What-if” type questions. These QT discussions are intended to be fun, interactive activities where you chat with your teammates and ask though-provoking questions.            Remember, in most cases there is no “right answer” so think outside the box.    Even if it sounds a bit crazy or totally non-traditional, that is OK and is encouraged.          All that is required is that you come up with logical, well-structured reasons to support your ideas.\n\n**9.**      **Have fun and make friends.**    We will switch groups very often so you can meet everyone in the class and make new friends.\n\n**10\\.** **I want everyone to succeed.** Everyone who attends faithfully, arrives on time, tries their best, turns in all their assignments, and participates in class will easily pass this course with a good grade.   No worries.\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=fc44dcf6290742cfa73867816e75c0d1&fno=087251b37b5f4b618737220c4d12f622)",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 10,
            "note": "Book Podcast of “Cinder” or “Shiver”"
        },
        {
            "type": "期中考",
            "weight": 10,
            "note": "Midterm: TED Talks (5 minutes)"
        },
        {
            "type": "期末考",
            "weight": 15,
            "note": "Final: Creative Writing"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "Class Participation"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Attendance"
        },
        {
            "type": "專題",
            "weight": 25,
            "note": "In class Activities and Mini Projects"
        },
        {
            "type": "其他",
            "weight": 20,
            "note": "In class Quality Talk Discussions"
        }
    ],
    "prerequisite": "◎必須先修過【英文（一）】",
    "general_core": []
}