{
    "year": 108,
    "term": 2,
    "name": "英文（二）",
    "teachers": [
        "項瑞芳"
    ],
    "department": "CU",
    "code": "00UB8A4",
    "credit": 2,
    "serial": 312,
    "group": "J",
    "quota": {
        "limit": 35,
        "additional": 0
    },
    "schedule": [
        {
            "day": 5,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "樸206"
        }
    ],
    "programs": [],
    "comment": "教育學院、營養科學學位學程、音樂系、表演藝術學士學位學程、企管系、東亞系、華語系(應華組)、競技系一年級(能力分班)",
    "restrict": "◎第一階段需人工加選◎第二階段需人工加選◎加退選階段需人工加選 ◎必須先修過【英文（一）】",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "共同科英文（二）課程為一學期兩學分課程，係為非英語系學生所開設的課程。目標在幫助大一學生活用中學時期所累積的英語知識，提昇英語聽、說、讀、寫整體的溝通能力。為達此目標，本課程要求教師盡量用英語上課，努力營造一個豐富的英語環境，讓學生不但有充分機會以英語參與課堂活動，且樂於使用英語與同學及老師溝通。",
    "goals": [
        "1. 增進學生英語溝通表達能力 2. 透過參與課程活動促進團隊精神 3. 透過多面向英語閱讀促使學生了解多元文化，拓展學生國際化視野 4. 透過課堂討論培養批判精神 5. 提升學生英語學習動機及自主學習興趣"
    ],
    "syllabus": "**FRESHMEN ENGLISH:**\n\nSpring Semester 2020\n\n**#Instructor:**Shiang, Ruei-Fang\n\n**#E-mail:**[joyceshiang@ntnu.edu.tw](mailto:joyceshiang@ntnu.edu.tw)\n\n**#Course Description**\n\nThis course aims to develop student’s English proficiency regarding all four language skills. Students are expected to increase their reading and writing literacy along with listening comprehension and communication competence through a variety of in-class and out-of-class activities.\n\n**#Textbook**\n\n_School-Assigned:_\n\n1.  Macintyre, Paul & Bohlke, David.  (2015).  _Reading Explorer: Book 2 (Second Edition)._  National Geographic Learning.\n2.  Lexile Graded Reader\n\n_Optional, Discipline-related:_\n\nonline resources\n\n**A) Requirements and Rules**\n\n1.  **Punctual attendance**, **lesson preparation** and **active participation** are required. Participation also includes teamwork and group discussion.\n2.  All absences will be classified as excused or unexcused.\n3.  Absences for the following reasons will be _excused_ if there is timely verification (within 1 week) of such reasons provided to the instructor:\n\n\\-Illness or medical emergency.        \n\n\\-Family emergencies\n\n\\-Pre-arranged medical appointments.\n\n\\-Pre-arranged school-sponsored activities, such as field trips.\n\n1.  A Notification of Absence Form has to be submitted online (學生請假系統) within 1 week. Verification document (hard-copy) should also be handed in to the instructor within 1 week. Late submission will not be accepted.\n2.  Students who are more than 20 minutes late to class will be considered absent.\n3.  Students will fail this course if there are more than 3 unexcused absences.\n4.  Students will fail this course if they miss more than 5 meetings the whole semester.\n\n**B) Plagiarism and cheating on quizzes or exams** is absolutely forbidden. If you are found cheating on an exam, you will fail that exam.\n\n**C) Textbook** is a must. Violation of this rule will cost you 2 points (out of your final score) each time.\n\n**D)** You cannot use your laptop or smart phone in class without the teacher’s permission. Violation of this rule will cost you 2 points each time.\n\n**E)** Before every meeting, you must preview the reading. Consult dictionaries for unfamiliar words and write down their meanings. Then read the paragraphs out loud. Try to grasp the main idea of each paragraph. I’ll check whether you have done all the preview tasks in class. Those who fail to do what is required for the preview will lose one point each time.\n\n**F)** The whole class will be divided into 7 groups. Each group choose one person who is competent and responsible to be their leader. In every meeting, the leader checks his/her group members’ textbooks for me to see if each of them has consulted the new words in the dictionaries and written their meanings on the book. Then the leader goes over the text to see if each one understands everything. After that, some students will be randomly called to read aloud or translate the text and answer the comprehension questions. If they cannot do the task well, they’ll get some assignment to do after class. Moreover, some follow-up questions will be raised for further discussion. Each discussion session will last 20 minutes. Exchange your opinions within your group and contribute your ideas. \n\n**G)** This semester you have to turn in a very special assignment related to the school-assigned Lexile novel. The details of this assignment will be given at the beginning of this semester, and as always, please submit them to me as scheduled. \n\n**H)** A very edgy project will be held in this semester. You can use multimedia and all kinds of resources (apps, props, costumes, photos, etc.) to make your project interesting to the audience. It must be done in English. The length of your project presentation should be no shorter than 4 minutes. More details about this trendy project will be given in class.\n\n**I)**In this semester, we won’t have paper tests. Instead, we’ll have lots of games and oral practices. Each time you do the practice and participate a given game which is relevant to the topics we are studying, one point is given and taken as classroom participation \n\n**J )**In order to improve your extensive reading skills and discussion skills, Lexile novel is assigned as an outside reading for you to practice high level reading skills and Quality Talk Q&A skills (QT: Q&A). Your teacher will briefly review the essence of QT, the most frequently used 6 types of questions and responses that had been taught in the previous semester. Each student must try to ask as many questions as possible, give responses as many as possible, proving that you really understand how to ask questions and give responses in order to elicit important information and stimulate further thoughts. This Lexile Novel QT activity will be held at week 17. The details of this event will be given at the beginning of this Autumn semester. \n\n**K)** At the end of the term, the leader rates his/her group members’ degree of engagement in the discussion and their overall contribution on a 0–5 scale. In addition, in order to encourage the students to enlarge their word bank, vocabulary tests will be held to see how many important words the students have learnt. \n\n**L)** **Check Course Group Page and email frequently**\n\nI assume that you check your email and the course site frequently. It’s your responsibility to make \n\nsure you register with the correct email address on course group page. **Without receiving a notice** \n\n**is NOT an excuse for any late submission. Late submission will be penalized 10% per day.** \n\n**\\# Grading Policies**\n\nAttendance 15%\n\nEdgy Project  10%\n\nGroup Presentation 10%\n\nSpecial Assignment on the Lexile Reading   5%\n\nLexile Novel QT Activity  5%\n\nPeer Evaluation 5%\n\nClassroom Participation/ Oral Practice/Vocabulary Test  50%\n\n**#Bonus Points (for those whose scores are below 60 before the end of the semester)**\n\n1.  Bonus points will be given if you spend time on the multimedia lab樸101 or chatroom \n2.  Extra points will be given if you participate in activities that help improve your English ability, such as Spelling Bee, Reading Aloud Competition, 3-minute presentations competition, E-book competition, listening to English talks, i-read or language exchange, etc. How many points you’ll get depends on the length of time and efforts you spend on them.\n3.  Summaries of the school-assigned Lexile novel. \n\n**#Tentative Schedule**  \n\n**Week**\n\n**Topics**\n\n**1**\n\nQuality Talk: How to Ask Question and Respond (QT) \n\n**2**\n\nUnit 7B: The Power of Perfume/Optional Topics (QT1)\n\n**3**\n\nUnit 7B: The Power of Perfume/Optional Topics (QT2)\n\n**4**\n\nOptional topics QT (3) \n\n**5**\n\nEnglish Games. (Mon.)  / Bank Holiday: No Class (Fri.)\n\n**6**\n\nUnit 9A: The Teenage Brain (QT4)\n\n**7**\n\nUnit 9A: The Teenage Brain (QT5)\n\n**8**\n\nThe Edgy Project (Part 1)\n\n**9**\n\nThe Edgy Project (Part 2)\n\n**10**\n\nUnit 11 B: Unexpected Beauty (QT6)\n\n**11**\n\nUnit 11 B: Unexpected Beauty (QT7)\n\n**12**\n\nOptional Topics (QT8)\n\n**13**\n\nOptional Topics (QT9)\n\n**14**\n\nLexile Reading Activity (QT10)\n\n**15**\n\nLexile Reading Project Due (NTNU’s Birthday)\n\n**16**\n\nTutorial for Final Project.\n\n**17**\n\nDragon Boat Festival (No Class)\n\n**18**\n\nFinal Project Due.",
    "methodologies": [
        {
            "type": "討論法",
            "note": "Group and whole class discussion"
        },
        {
            "type": "問題解決教學",
            "note": "Problem solution"
        },
        {
            "type": "合作學習",
            "note": "group works"
        },
        {
            "type": "實驗/實作",
            "note": "Practices & Games"
        },
        {
            "type": "媒體融入教學",
            "note": "Multimedia"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 50,
            "note": "Participation"
        },
        {
            "type": "出席",
            "weight": 15,
            "note": "Attendance"
        },
        {
            "type": "報告",
            "weight": 10,
            "note": ""
        },
        {
            "type": "其他",
            "weight": 25,
            "note": "others"
        }
    ],
    "prerequisite": "◎必須先修過【英文（一）】",
    "general_core": []
}