{
    "year": 111,
    "term": 1,
    "name": "地球系統科學與災害風險評估",
    "teachers": [
        "陳正達",
        "陳卉瑄",
        "葉孟宛"
    ],
    "department": "SU44",
    "code": "ESC9050",
    "credit": 3,
    "serial": 3017,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 5,
            "from": 7,
            "to": 9,
            "campus": "公館",
            "classroom": "Ｓ504"
        }
    ],
    "programs": [],
    "comment": "限大三、大四及碩班學生修習-因本門課程為中階以上跨領域課程，適合大三以上學生修習，以作為探究研究所之先修課程，同時也開放碩士班無此課程基礎之學生選修。",
    "restrict": "◎限大三大四 ◎限碩一碩二碩三以上修習",
    "form_s": "",
    "classes": "9",
    "dept_group": "",
    "hours": 3,
    "description": "未來地球面對的挑戰，是氣候變遷和人為活動的衝擊下，各種天然災害的規模和交互作用如何變化？而如何有效地降低災害風險？台師大地球科學系，綜合了大氣、海洋、地質、地物與天文五大領域的專任師資，是國內唯一具有橫跨地球系統的研究型系所。為培養學生具有跨領域的視野、強化「地球永續」、「減災預防」的未來使命，本課程由四位專任教師針對跨層圈的天然與人為災害之交互作用進行授課，並從整合資料進行之探究與思考。學生在課程中，除了能運用實際的資料庫進行多重災害間的時間和空間關聯性，並能設計不同的資料分析門檻，將多重災害致災因子的特徵，近一步釐清與討論。在這個課程，強調天然災害的形成與演化，必須在「跨層圈」的交互作用過程中重新思考，和單一天然災害不同的致災因子和災害風險差異為何？相同處為何？ 而這些理解如何幫助我們並進一步精進未來的減災策略？",
    "goals": [
        "教師傳授地球不同的災害現象在不同時間、空間尺度的特徵和運作機制",
        "學生討論水、氣圈、地圈、生物圈的交互作用，提出地球系統面臨的問題",
        "經由資料的彙整和探究，強化對不同災害互動的衝擊之評估，討論未來地球永續方案"
    ],
    "syllabus": "  \n1.    Science of Earth System: why do we care?   \n地球系統科學所為何來？  \n而地球系統，是由不同地圈、水圈、氣圈、生物圈組成的整合系統，層圈息息相關，而其互動無時無刻不在發生。地球系統科學，在釐清各種自然現象在不同時間、空間尺度的特徵和運作機制，目的在對未來環境的變化做出預測並提供解決方法。本節課將首先介紹長時間尺度的熱交換、水循環，讓學生進行其他循環的探討（例如探循環、氮循環等）。\n\n2.    Formation and evolution of natural disasters: Individual hazards  \n天然災害的形成與演化: 單一天然災害  \n第二堂課，則開始介紹短時間尺度的天然與人為災害，由地理位置切入（如下圖）。  \n地震的災害大多發生在哪裡？為什麼？  \n風暴的災害大多發生在哪裡？為什麼？  \n洪災大多發生在哪裡為什麼？  \n旱災大多發生在哪裡？為什麼？  \n而學生則探討其他課堂沒有提到的災害其發生之空間、時間特徵，並釐清其物理機制。\n\n3.    Formation and evolution of natural disasters: Individual hazards  \n天然災害的形成與演化: 人為災害  \n第三堂課，則開始介紹人為災害，哪種人類活動，會在不同層圈引發顯著的災害？  \n人類活動可能引發地震嗎？為什麼？  \n人類活動可能引發水災嗎？為什麼？  \n人類活動可能引發山崩嗎？為什麼？  \n人類活動可能引發海嘯嗎？為什麼？  \n而學生則探討其他課堂沒有提到的災害其發生之空間、時間特徵，並討論其物理機制。\n\n4.    Formation and evolution of natural disasters I: geophysical vs. others  \n天然災害的形成與演化 I：地球物理的複合式災害  \n第四堂課，以地圈為主角（地下的構造活動），介紹它與其他層圈的災害/人為災害之相伴現象，過去有什麼案例？其發生的特徵為何？機制為何？ 對社經的衝擊為何？   \n第五堂課，讓學生分組報告 – 「與地球物理災害相伴發生的，有什麼？我能利用資料，說明其互動的特性和過程嗎？」  \n提供學生地震資料庫，請學生分組利用此資料庫，找出與其他環境參數的關係 – 探究重點： 利用這個資料庫，我可以看到和其他災害/環境參數的時間空間關聯性嗎？（例如：規模要多少的地震，和火山爆發的關係就很顯著？怎麼樣的地震，才能看到和海嘯的相關性？）\n\n  \n5.    Formation and evolution of natural disasters I: geophysical vs. others  \n天然災害的形成與演化 I：地質的複合式災害  \n第六堂課，以地表過程為主角，介紹它與其他層圈的災害/人為災害之相伴現象，過去有什麼案例？其發生的特徵為何？機制為何？ 對社經的衝擊為何？   \n第七堂課，讓學生分組報告 – 「與地質災害相伴發生的，有什麼？我能利用資料，說明其互動的特性和過程嗎？」  \n提供學生地質資料庫（例如山崩、土石流事件），請學生分組利用此資料庫，找出與其他環境參數的關係 – 探究重點： 利用這個資料庫，我可以看到和其他災害/環境參數的時間空間關聯性嗎？（例如：地層下陷和地下水資料的相關性為何？ 致災因子為何？）\n\n  \n6.    Formation and evolution of natural disasters II: hydrological vs. atmospheric hazards  \n天然災害的形成與演化 II：大氣的複合式災害  \n第八堂課，則以氣圈為主角（例如風暴），介紹它與其他層圈的災害/人為災害之相伴現象，過去有什麼案例？其發生的特徵為何？機制為何？ 對社經的衝擊為何？ \n\n第九堂課，讓學生分組報告 – 「與氣象災害相伴發生的，有什麼？我能利用資料，說明其互動的特性和過程嗎？」  \n提供學生氣象資料庫，請學生分組利用此資料庫，找出與其他環境參數的關係 – 探究重點： 利用這個資料庫，我可以看到和其他災害/環境參數的時間空間關聯性嗎？（例如：哪種風暴系統，能帶來劇烈降雨和洪災？氣候、降雨和地表地質災害的致災因子為何？）\n\n7.    Formation and evolution of natural disasters II: hydrological vs. atmospheric hazards  \n天然災害的形成與演化 III：水文的複合式災害  \n第十堂課，以水圈為主角，介紹它與其他層圈的災害/人為災害之相伴現象，過去有什麼案例？其發生的特徵為何？機制為何？ 對社經的衝擊為何？ \n\n第十一堂課，讓學生分組報告 – 「與水文災害相伴發生的，有什麼？我能利用資料，說明其互動的特性和過程嗎？」  \n提供學生海洋資料庫，請學生分組利用此資料庫，找出與其他環境參數的關係 – 探究重點： 利用這個資料庫，我可以看到和其他災害/環境參數的時間空間關聯性嗎？（例如：哪種海洋的現象，能引發氣候的顯著變動？海氣交互作用的致災因子為何？）\n\n  \n8.    Disaster risk assessment and management   \n複合式災害的風險評估  \n第十二堂課，找講師來說明災害風險的架構，重點鎖定：從單一災害到多重災害，如何評估？ \n\n9.    Studies of cascading disaster   \n多重天然災害的互動 （案例探討與數據分析操作）  \n第十三堂課，介紹多重災害的互動案例：汶川地震的「連鎖災害鍊」。在課堂中，演練和討論風險評估和減災策略的研擬（前一堂課必須學到明確的方針）。\n\n  \n第十四堂課以後，學生分組進行多重天然災害的案例分析，要求(1) 用前人研究評估災害的社經衝擊、致災因子的釐清 (2) 用數據庫進行資料的分析和作圖 (3) 討論該區域的減災策略之方向。而分組報告的檢核點，在期中考之後即可開始。",
    "methodologies": [
        {
            "type": "講述法",
            "note": "在第一～三，四、六、八、十周，由四位開課教師分別授課。 The lectures will be given by four lecturers from 1st ~ 3rd, 4th, 6th, 8th and 10th weeks."
        },
        {
            "type": "討論法",
            "note": "第五、七、九、十一週由學生分組討論該週作業，第十四週以後學生討論及報告自選主題。\nThe students will group up for assignments at 5th, 7th, 9th, and 11th weeks and for final presentation after the 14th week."
        },
        {
            "type": "問題解決教學",
            "note": "第五、七、九、十一週周學生分組討論時，由授課教師共同參與科學問題的發想及探究。\nWhile doing the group assignments at 5th, 7th, 9th, and 11th weeks, the students and lecturers will work together to discuss which questions to be addressed and what materials/data are useful for exploration."
        },
        {
            "type": "合作學習",
            "note": "第十四週以後由學生分組討論，學生需要分工合作 (1)決定跨層圈的科學主題  (2)決定有代表性的數據庫  (3)蒐集和分析資料 (3) 準備口頭報告\nOnce the topic is chosen, the students need to collect, analyze the data and present their work as the final presentation."
        },
        {
            "type": "專題研究",
            "note": "學生分組報告的目地，即在收集可用的材料、利用不同數據庫，進行跨層圈災害研究分析。\nThe group activity requires the student to work is actually to choose different study area."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": ""
        },
        {
            "type": "期中考",
            "weight": 30,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 10,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 10,
            "note": "此與期末報告結合"
        }
    ],
    "prerequisite": "",
    "general_core": []
}