{
    "year": 108,
    "term": 1,
    "name": "環境教育實務實習",
    "teachers": [
        "方偉達"
    ],
    "department": "SM46",
    "code": "EEM0088",
    "credit": 2,
    "serial": 2751,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 5,
            "from": 1,
            "to": 4,
            "campus": "公館",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "要求具備相關基礎課程",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 4,
    "description": "提供研究生獲得應證所學之環境教育理論方於真實場域，妥善有效執行環境教育的專業實務機會。能運用先備之環境教育理論及方法於正規或非正規環境教育機構組織之規劃、執行及評估的專業經驗。",
    "goals": [
        "熟習環境教育的各項基本原理、教學方法、策略與技巧",
        "熟練並能運用環境教育之規劃、設計、教學與評估的理論與各種實務策略於各式情境"
    ],
    "syllabus": "本課程可於學期中或寒暑假期間進行，視修課同學實習單位狀況需求而定。學生必須主動選擇申請去進行實習的機構單位，填具繳交實習計畫書後始得開始執行。授課教師設定數次檢核與輔導時間。全班集合討論時間有以下幾大區塊：\n\nI.期初，報告實習的狀況（實習的單位、工作內容、初步的心得）、介紹服務學習概念進行反思，繳交反思報告。（附錄二或運用附錄一的講義）  \n  \nII.期中，準備ppt檔或資料，報告學實習狀況  \n運用反思，學生思考他們所學的經驗、知識和技能如何與他們的生活及社區連接，包括學生發掘他們的學習對他們的行為和未來行動的影響。過程中若個人的服務或態度有改變，請敘述。  \n  \nIII.期末分享、慶祝（預備餐點）  \n透過展示、表演、寫信來進行，來呈現預備、行動和反思。學生公開的呈現清楚，並帶有慶祝。學生也可以邀請服務單位、學弟妹或學長姐進來，讓服務單位或機構說明是否符合他們的需要，與學生互動過程的心得、感謝學生的貢獻，未來的期望。  \n提交書面報告一份（三千字以上），包括：實務發展單位簡介、工作內容及心得、建議（參考附錄一、二），並擇定日期邀請服務單位，進行公開口頭報告，及慶祝活動。  \n  \n附錄二  \n就下面的題目進行反思（限兩千個字以下）。若實習期間沒有特別注意到，反思的題目你可以簡略寫，但希望這些反思題目可以提供你再進入實習場域時的思考。各位同學或許期中聚會前，你又在實習場域有機會服務或關心他們的近況，會有更多的分享、心得及想法，那時候再敘述詳細。你可以比對自己是不是一次比一次進步、深入。  \n  \n實習學生：  \n實習單位：  \n實習期間：  \n紀錄日期：  \n  \n一、課堂分享：  \n暑假期間你做了什麼？看到什麼？有什麼感想？  \n  \n二、反思：  \n1.從實習中你學習到什麼？是否運用到所上學得的專長？  \n2.你的實習態度為何？  \n3.你實習的機構或單位，是一個怎麼樣的機構，是否具有潛力？或影響力？  \n4.你在實習單位是否是很配合？很參與？是個助力？或是轉化者？麻煩製造者？  \n5.你的實習對該單位有什麼助益？或是造成負擔？  \n6.你的實習對於環境教育或環境有什麼貢獻？  \n7.現在你對環境教育的未來有什麼看法？  \n8.接下來，如果有機會再進入（繼續）該機構或單位實習，你打算做什麼？如何進行？",
    "methodologies": [
        {
            "type": "實驗/實作",
            "note": "於寒暑假或學期中進行。實習前繳交一份實務發展單位基本資料表及實習計畫書（目標、工作內容、時數及分配）。實習期滿時，由實務實習單位填寫「實務老師對研究生整體績效評估表」。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 40,
            "note": "實習日誌"
        },
        {
            "type": "報告",
            "weight": 45,
            "note": "成果報告"
        },
        {
            "type": "其他",
            "weight": 15,
            "note": "含：評估表5%"
        }
    ],
    "prerequisite": "",
    "general_core": []
}