{
    "year": 111,
    "term": 1,
    "name": "智慧型手機與開放軟體之日常物理學習",
    "teachers": [
        "賈至達"
    ],
    "department": "GU",
    "code": "06UG023",
    "type": "通",
    "grade": null,
    "credit": 2,
    "serial": 1008,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 5
    },
    "schedule": [
        {
            "day": 3,
            "from": 3,
            "to": 4,
            "campus": "公館",
            "classroom": "Ｄ101"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "",
    "goals": [
        "Use modern technology to explore natural phenomena in life and understand the relationship between science and life",
        "Learn to understand natural phenomena and build problem-solving skills",
        "Use technology to communicate with people and collaborate on projects",
        "Understand the function of open software and hardware, the impact on society and changes in daily life"
    ],
    "syllabus": "The main goal of the course is to learn the operating principle of the APP sensor, the measurement technology of physical quantities and its application in daily life, and essential concepts such as interdisciplinary concepts in the field of natural sciences, sampling, and scientific demonstration.\n\nEnglish is the only language for communication in the classroom. Therefore, all the assignments and the homework have to be written or presented in English. Each week's assignment is the following. \n\nWeek 1 \n\nCourse introduction and grouping, the teaching content is as follows:\n\n1.  Introduction to course content, grouping, familiarizing with partners. We will assign a job for each group, such as measuring the size of the classroom. \n\n**Note 1:** We will announce that each group will accomplish a project this semester. At the end of the semester, you will present your project's achievements.  \n\n**Note 2:** There is an assignment each week, and each student has to write a report and turn it in next week. The MOODLE next week.   \n\nWeek 2 \n\nSafety of APP use and implementation, the theme of smartphone APP life implementation (the theme of the final result presentation): The teaching content is as follows:\n\n1.  To understand APP and using open software and hardware, you should pay attention to implementation security and intellectual property rights, etc., as well as related courtesy. \n2.  The safety of using the smartphone to do the measurement is the priority. Students need to know the limitation of each sensor of the smartphone. It should not be over the limit of the sensors in the smartphone. \n3.  Introduction of phyphox APP\n\nWeek 3 ~ Week 4\n\nPart I: Introduce the operating principle of the APP sensor and the measurement and application in the daily life of the APP; the teaching content is planned as follows:\n\nThe principle of mobile phone sensors and the accuracy of related APPs. Discussion of the PROs and CONs of using smartphones.\n\nPart II: Data recording, graphing, and analysis processing are used by the open software SciDAVis. The teaching content is planned as follows:\n\nIntroduction to SciDAVis Data Plotting Software\n\nHere is a free software for scientific data analysis: SciDAVis. SciDAVis has the advantages of being cross-platform and free, and it is pretty easy to use. Learning how to use it will improve personal data organization ability and enhance the professionalism of experimental reports. I will share it with you and welcome to use it for teaching.\n\nLinks to lecture materials:\n\n1.https://www.dropbox.com/s/6clp2z0mze6poi2/SciDAVis%20%E6%95%B8%E6%93%9A%E7%B9%AA%E5%9C%96%E8%BB%9F% E9%AB%94%E7%B0%A1%E4%BB%8B.pdf?dl=0\n\n2\\. https://www.dropbox.com/s/25jdz1a7z6brs9o/TH-003%E8%83%BD%E6%BA%90%E7%A7%91%E5%AD%B8%E5%8B%95% E6%89%8B%E5%81%9A%28%E4%BF%AE7%E7%89%88%29%28QR%20Code%E5%8A%A0PPT%29.pdf?dl=0\n\nWeek 5 ~ Week 6\n\nTopic: Coefficient of restitution\n\nWe will provide the material for the student to investigate the Coefficient of Restitution, such as sports balls, glass beads, etc.\n\nEach group of students needs to work together to find the theme of their investigation, design the measurement, analysis the result, and get the conclusion. \n\nFinally, share the finding with all the students.\n\nWeek 7~ Week 8\n\nTopic: Polarization of Light\n\n1.  We will demonstrate the polarization of light in daily life. We will present a few tricks by using the polarizers, and students need to investigate the Malus law using the polarizer and analyzer.\n2.  Students will use tape and polarizers to make an art plate and share the results.\n\nWeek 9\n\nMidterm Report:\n\nA brief report about the final projects' progress for each group of students is needed. In addition, the presentation should show a discussion of any request to complete the assignments.\n\nWeek 10~12\n\nTopic: the FUN of sound\n\nThree tasks for \"the FUN of sound\":\n\n1.  Understand the resonance of sound\n2.  Measure the sound speed in aluminum of rod,\n3.  Measure the frequency by rubbing the wineglass. \n\nAt the end of these three weeks, each group will play a short note of a song.\n\nWeek 13~14\n\nTopic: The Earth's Magnetic Field\n\n1.  determine the earth's magnetic field strength and direction.\n2.  Find the position of the magnetic sensor of your smartphone,\n3.  Determine the field strength as a function of distance. \n\nShare the results at the end of three weeks' learning.\n\nWeek 15~17\n\nPresentation of the final results of the project\n\nEach group has 30 minutes to present their project and conclude their studies. \n\nWeek 18\n\nStudents will prepare a poster of the project to display and share with teachers and classmates. In addition, we will host a competition poster session, and all the students will participate in the evaluation.",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "The main goal of the course is to learn the operating principle of the APP sensor, the measurement technology of physical quantities and its application in daily life, and essential concepts such as interdisciplinary concepts in the field of natural sciences, sampling, and scientific demonstration."
        },
        {
            "type": "Group discussion",
            "note": "Group discussions and whole-class discussions clarify the APP implementation course and discuss related topics."
        },
        {
            "type": "Lab/Studio",
            "note": "Based on the themes in life, use the smartphone APP for practical implementation and data acquisition."
        },
        {
            "type": "Media, audio, visual materials",
            "note": "It is supplemented by an information platform to guide the learning of open software, open hardware, and the use of information technology equipment such as tablet computers."
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 20,
            "note": "Each teaching stage and practice has related homework, especially measurement and data analysis and discussion of results."
        },
        {
            "type": "Class discussion involvement",
            "weight": 20,
            "note": "Each group has to complete the assignment and share the result every time."
        },
        {
            "type": "Attendances",
            "weight": 10,
            "note": "A group of 2 people will work together to complete each week's assignment. Unless there is an extraordinary accident, total attendance is required."
        },
        {
            "type": "Presentation",
            "weight": 25,
            "note": "The APP is implemented in groups, and there will be discussions every time, and there will also be text reports. At the end of the term, students will present their results. The scoring criteria include originality, or social influence, the consistency between theory and data, and oral and written communication skills."
        },
        {
            "type": "Shows/ Exhibitions",
            "weight": 25,
            "note": "The results will be displayed and shared with teachers and students at the end of the semester."
        }
    ],
    "prerequisite": "",
    "general_core": []
}