{
    "year": 111,
    "term": 1,
    "name": "日語（一）",
    "teachers": [
        "張怡倩"
    ],
    "department": "GU",
    "code": "0HUG501",
    "type": "通",
    "grade": null,
    "credit": 2,
    "serial": 1038,
    "group": "B",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "誠109"
        }
    ],
    "programs": [],
    "comment": "日語母語者不可修本課程",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本課程之主要目的，在於讓同學學習初步的日語語彙、句型與文法。除了奠定同學們在今後學習日語之根基外，亦期透過日常生活日語會話能力之養成，以提昇學習興趣。",
    "goals": [
        "培養基礎日語能力",
        "吸收日本資訊",
        "了解日本社會與文化",
        "奠定日本研究能力"
    ],
    "syllabus": "本課程【授課方式:16+2週】 第1-16週為精實課程,第17-18週為彈性授課。\n\n第1週.\n\n(1)教授50音平假名、數字及打電話的表達。運用自製的平假名講義，講解平假名的歷史由來、演化與特質。並藉由漢字的由來，教授平假名的筆順，壤學生容易記憶。此外，也教授簡單的數字，導入日語打電話的練習，讓學生了解數字的表達及應用。最後，藉由平假名日語歌曲，輔助學生背誦與記憶。                                       \n\n(2)教授50音片假名及日常寒暄用語。運用自製的片假名講義，講解片假名的歷史由來、演化與特質。並藉由漢字的由來，教授片假名的筆順壤學生容易記憶。此外，亦導入日常生活基本寒暄用語，讓學生學會基本的打招呼用語。最後，藉由片假名歌曲及繞口令，輔助學生背誦片假名                          \n\n第2週.教授50音其他假名及發音要項。首先，複習平片假名，並讓學生做認字練習。藉由50音的平、片假名，來講解其他假名。最後，說明日語發音的規則及特點。讓學生完全熟悉日語基本字母及發音規則。                   \n\n第3週.第一課 初次見面。首先，導入季節用語。接著，講解課本單字並說明本課部分句型。然後，讓學生練習造句。藉由學生的姓名、國籍及職業，來做自我介紹的練習。最後，練習課本上的會話文，藉由會話文中的角色扮演，讓學生之間能夠互動練習，並學會在職場上做自我介紹。                                 \n\n第4週.第一課 自我介紹 。首先，導入日本拉麵文化的介紹。接著，複習第一課單字，導入自我介紹教室活動。並教授另一部份的句型，讓學生練習。最後做課本練習題，逐一解題解答後，並讓學生背誦課本中重要的例文。                                        \n\n第5週.第二課 今後承蒙您照顧 。首先，導入日本時事。接著，教授第二課單字。在單字熟悉後，緊接著教授本課的指示代名詞的使用與句型。於句型教授完畢後，導入教室活動。藉由教室活動，讓課堂上所學的單字與指示代名詞，能夠實際地運用於教室活動上。\n\n第6週.第二課 拜訪鄰居。首先，導入日本壽司的介紹。接著，複習第二課單字，並教授另一部分的句型。在單字與句型熟悉後，講解拜訪鄰居的會話文，並讓學生做角色扮演練習會話文，使之瞭解日本人新居拜訪鄰居的文化。最後，帶念課本中的句型及練習課本的問題。                                                  \n\n第7週.第三課 多少錢?首先，導入季節用語。接著，說明第三課單字及句型。本課將區別地點和方位的不同表達。藉由地點和方位的指示代名詞及句型，讓學生學會人、事、物所在位置的表達。                                   \n\n第8週. 期中考  筆試\n\n第9週. 第三課 購物及價格的表達 。首先，導入，旅遊日語。接著，複習第三課單字。然後導入所有數字的念法。接著講解句型，並導入用數字購物的教室活動，讓學生做分組練習。最後說明本課的會話文。於講解及聽解內容後，讓學生練習與背誦。                                                                                 \n\n第10週.第四課 您那邊營業到幾點?首先，導入餐旅日語，點餐用語。接著，教授第四課單字與句型。並於句型教授前，教導時間語彙的基本表達，讓句型學習更有邏輯、更順利。最後，教授名詞與動詞的區別，以及動詞基本的四個時態的表達。                        \n\n第11週.第四課 時間的表達及使用。首先，導入時事日語。接著，複習本課單字。然後，教授另一部分的句型。在完成句型後，導入「我的一天」生活作息的教室活動。藉由此活動，來熟悉時間及動詞的表達。最後，教授會話及解答課本問題。                \n\n第12週.第五課 這電車是要往甲子園的嗎?  首先，導入棒球文化介紹。接著，講解課本單字及句型。本課部分句型，在強調日語助詞的使用。藉由這些基本的助詞，可做基本的日語會話表達，讓學生可編寫基本的會話文。\n\n第13週.第五課 基本助詞的使用及日期的表達。首先，導入日本時事用語。接著，複習本課單字並講解另一部分句型。再施行句型講解前，補充日期的語彙。之後，再施行有關「您的星座及生日是甚麼？」的教室活動。最後，講解及聽解搭電車問路的會話文及解答課本問題。                         \n\n第14週.第六課 要不要一起去〜呢? 首先，導入旅遊日語。接著，教授第六課單字及句型。本課著重「他動詞的表達」及助詞的其他語意。本課增加許多日常生活上實用的動詞及片語的表達。讓學生可以學習到更多的表達。\n\n第15週.\n\n(1)第六課 邀約對方的表達。首先，導入日本時事。接著，教授另一部份句型。即是用於邀請別人一起做某事的用法。在由淺而深的練習後，導入句型及會話練習。讓學生學會，用日語邀請客人做某事的表達。                               \n\n(2)第七課 授受動詞的使用。首先，導入旅遊日語。接著，教授第七課單字與句型。本課的重點之一，在於助詞其他意思的表達。區別助詞的多義性，用這些助詞來做正確的表達。                              \n\n第16週.   期末考      筆試     \n\n第17週  第七課授受動詞的使用。此次上課方式於moodle數位平台上,提供上課用PPT 及參考講義,以供學習。\n\n第18週  總複習本學期1-7課之內容及看日劇學日語。此次上課方式於moodle數位平台上,提供上課用PPT ,參考講義以及日劇影片,以供學習。",
    "methodologies": [
        {
            "type": "講述法",
            "note": "教師講解語法"
        },
        {
            "type": "討論法",
            "note": "分組編寫會話文"
        },
        {
            "type": "合作學習",
            "note": "分組練習"
        },
        {
            "type": "媒體融入教學",
            "note": "教師使用PPT及影片教學"
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 30,
            "note": "筆試"
        },
        {
            "type": "期末考",
            "weight": 40,
            "note": "筆試"
        },
        {
            "type": "出席",
            "weight": 20,
            "note": "出席率"
        },
        {
            "type": "其他",
            "weight": 10,
            "note": "單字小考"
        }
    ],
    "prerequisite": "",
    "general_core": [
        "人文藝術"
    ]
}