{
    "year": 111,
    "term": 1,
    "name": "中國經典文學閱讀：古典與現代",
    "teachers": [
        "王思韻"
    ],
    "department": "GU",
    "code": "0HUG248",
    "type": "通",
    "grade": null,
    "credit": 2,
    "serial": 1032,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 15
    },
    "schedule": [
        {
            "day": 3,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "誠302"
        }
    ],
    "programs": [],
    "comment": "授權碼優先發放給大四或延畢同學。",
    "restrict": "◎國文系（學）不得選修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "",
    "goals": [
        "Provide introduction of classic Chinese literature to international students by discussing the connections between literature and its historical, cultural, or political content.",
        "Enhance the experience of Chinese literature studying for local students by analyzing literary works in English.",
        "Analyze works by authors who represent Chinese cultures, perspectives and values, and critique literature using key literary terminology."
    ],
    "syllabus": "**Weekly Syllabus and Topics (※This course is taught in English. 本課全程全英文授課。)**\n\n**Weekly Syllabus and Topics (16+2 weeks)**\n\n**Week**\n\n**Topic**\n\n1\n\nClass Orientation\n\n2\n\nThe History of Chinese Literature\n\n3\n\nShijing (Book of Songs)\n\n4\n\nTang Poetry: High Tang Poetry\n\n5\n\nTang Poetry: Middle Tang Poetry\n\n6\n\nSong Poetry: From Li-Yu to Su-shi\n\n7\n\nSong Poetry: The female poet, Li Ch'ing-chao\n\n8\n\nChinese Classic Drama: Yuan Dynasty, Guan Han-qing, Snow in Midsummer (Injustice to Dou E)\n\n9\n\nChinese Folklore: “Tale of the White Snake”\n\n10\n\nChinese Folklore: “Tale of the White Snake” (Movie: White Snake)\n\n11\n\nClassic Fiction, Ming Dynasty: Journey to the West\n\n12\n\nMovie: The Monkey 2\n\n13\n\n**\\*Group Presentations (1st half of the groups)**\n\n14\n\n**\\*Group Presentations (2nd half of the groups)**\n\n15\n\n**Review & Discussion**\n\n16\n\n**Final Exam**\n\nFlex week\n\nTang Poetry: Movie: Legend of the Demon Cat\n\nFlex week\n\nModern Novel - Love in a Fallen City by Eileen Chang\n\n\\*All the above activities might be subject to change.\n\n**\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\***\n\nThe course will be conducted in the physical classroom. However, **if affected by COVID-19, the course will be held online on WebEX. In which case, please download and test it before the class starts:** \n\n*   English page  \n    https://www.webex.com/downloads.html\n*   Chinese page  \n    https://www.webex.com/zh-tw/downloads.html\n\nPlease see Moodle for the meeting link. Or, the meeting information will be uploaded ASAP on the school page.\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=b10b83da5f254d7db06ddf2a803e2722&fno=5fd1a70777e64a488a4f5bf2cf2f44ec)",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "This course comprises the readings of both the classic and the modern Chinese literature, which involves the genres of poetry, drama, fiction, and short stories. The class is directed mainly by lectures, with the emphasis on the analysis of the major aspects of literature such as theme, characterization, structure, etc.\n\n(※This course is taught in English. 本課全程全英文授課。)"
        },
        {
            "type": "Group discussion",
            "note": "Class discussions are encouraged."
        },
        {
            "type": "Media, audio, visual materials",
            "note": "The class will be assisted with PowerPoint slides. Movies and other media support will be used during the class."
        }
    ],
    "grading": [
        {
            "type": "Final exam",
            "weight": 40,
            "note": "There will be a final exam for this course. The formats of the exam will be informed one week before the exam date. Students are required to verify the time and location of the written test. There will be no make-up exams for the exam, except for medical emergencies."
        },
        {
            "type": "Attendances",
            "weight": 20,
            "note": "If students miss more than 3 classes, their grade for class participation will be affected."
        },
        {
            "type": "Presentation",
            "weight": 40,
            "note": "There will be an oral presentation on a group basis, to be scheduled the two weeks before the final exam date. The time for each group is 15-20 minutes. You are asked to time your presentation accordingly, and overtime will have a penalty of 10% off for the grade. If any equipment is required, you will have to prepare and set it up before your presentation. The topic is suggested to be Chinese literature related."
        }
    ],
    "prerequisite": "◎Exclusive of students within Department of Chines",
    "general_core": []
}