{
    "year": 109,
    "term": 1,
    "name": "近代西洋思想史（一）",
    "teachers": [
        "李峙皞"
    ],
    "department": "LU22",
    "code": "HIU0295",
    "credit": 2,
    "serial": 1952,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "誠306"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "經濟學家凱因斯曾說：「那些講求實用而看輕理論的人，自以為不受到任何思想的影響，但事實上往往只是某個已故經濟學者的奴隸」。其實，不只經濟學說，歷史上重要的典範思想都繼續牽動著人們日常生活的偏好、判斷與行動——為何同樣面對生老病死，基督徒與佛教徒卻可能採取南轅北轍的態度與做法？為什麼行之千年的儒家文化，在現代人眼中竟顯得荒謬甚至可惡？歸根結柢，不同的宗教思想與價值預設決定了人們看待世界與自我的方式。同理，西方思想與近/現代西方社會的形成密不可分，而本課程的目的便在於以思想為取徑，來探索近代西方文明的內涵。透過考察西方主要思想傳統以及不同思想間的辯證與交融，本課程希望引導同學思考：西方文明關注哪些核心價值？這些價值如何被不同的思想家所詮釋、演繹？而這些思想又如何指引西方人一步步構築近代世界？\n        本課程的教材以英文為主，同學每周須閱讀約20頁英文資料，並撰寫三份2000-2500字的期中作業。由此，期待同學能培養分析英文史料、闡述個人史學觀點的初步能力。",
    "goals": [
        "認識西洋近代社會的思想特質",
        "培養學術思辯能力",
        "理解西洋社會的思想淵源"
    ],
    "syllabus": "2020.9.1 更新\n\n第一週   課程說明、思想史關注甚麼？近代西洋思想史有哪些核心課題？\n\n第二週   古希臘傳統I：城邦與正義 \n\nBeatty ed., Heritage of Western Civilization, v. 1, pp. 44-72. (Sophocles, Antigone.)\n\n第三週   古希臘傳統II：民主體制的思辨\n\nBeatty ed., Heritage of Western Civilization, v. 1, pp. 73-82, 92-107. (Thucydides, History of the Peloponnesian War; Plato, The Apology.)\n\n第四週 古希臘的探索III： 柏拉圖的經驗世界與理型世界\n\nBeatty ed., Heritage of Western Civilization, pp. 120-126. (Plato, The Republic \\[The Allegory of the Cave\\])\n\nBaird ed., Philosophic Classics: From Plato to Derrida, pp. 47-58. (Plato, Phaedo) \n\nTierney and Scott eds., Western Societies: A Documentary History, pp. 85-88. (Aristotle, Metaphysics & The Nichomachean Ethics)\n\n第五週   猶太-基督教傳統\n\nBeatty ed., Heritage of Western Civilization, v. 1, pp. 27-39, 191-99. (Old Testament: Genesis, Exodus, Book of Job; New Testament: Gospel of Matthew; St. Paul, The Epistle of Paul the Apostle to the Romans.)\n\n第六週   基督信仰與中世紀世界觀\n\nCampbell ed., Western Civilization in a Global Context, pp. 144-47, 150-153, 233-236. (Augustine, The City of God; Monastery Rules; Dante, The Divine Comedy.)\n\nCottingham ed., Western Philosophy: An Anthology, pp. 214-221. (Aquinas, Summa Theologiae) \n\n第七週   文藝復興I ：文藝復興的人文主義精神\n\nBaumer ed., Main Currents of Western Thought, pp. 112-115, 120-129, 133-135. (Francesco Petrarch, My Secret; Giorgio Vasari, The Lives of the Painters; Francesco Petrarch, Letters to Classical Authors; Pico della Mirandola, Oration on the Dignity of Man; Desiderius Erasmus, On the Education of Children; Leo Battista Alberti, Treatise on Painting.)\n\n第八週   文藝復興II：馬基維利與現實主義政治思想\n\nCohen and Fermon eds., Princeton Readings in Political Thought, pp. 167, 171-187. (Niccolò Machiavelli, The Prince.) \n\n第九週   宗教改革I：馬丁路德與宗教改革的理念\n\nRogers ed., Aspects of Western Civilization, pp. 441-460. (Archbishop Albert, Instructions for the Sale of Indulgences; Johann Tetzel, How Many Sins Are Committed in a Single Day?; Luther, Salvation through Faith Alone; Luther, The Ninety-five Theses; Luther, Address to the Christian Nobility of the German Nation; Luther, On Christian Liberty; Luther, Here I Stand; Martin Luther, On Celibacy and Marriage; Luther, Condemnation of the Peasant Revolt.)\n\n第十週   宗教改革II：喀爾文與清教倫理\n\nBaumer ed., Main Currents of Western Thought, pp. 189-198, 231-239. (John Calvin, Institutes of the Christian Religion; John Calvin, Letter on Usury; Richard Baxter, A Christian Directory; Thomas Wilson, A Discourse upon Usury.)\n\n第十一週   科學革命I：科學方法與哲學演繹\n\nKenneth L. Campbell ed., Western Civilization in a Global Context, p. 413. (Title Page of Vesalius’s On the Structure of the Human Body.)\n\nTierney and Scott eds., Western Societies: A Documentary History, pp. 365-369. (Bacon, The Great Instauration; Descartes, Discourse on Method.)\n\nCottingham ed., Western Philosophy: An Anthology, pp. 21-25, 221-227. (Descartes, Meditations.) \n\n第十二週   科學革命II：科學、宗教與王權\n\nBaumer ed., Main Currents of Western Thought, pp. 337-356. (Hugo Grotius, The Law of War and Peace; Bishop Bossuet, Politics drawn from the Holy Scriptures; Thomas Hobbes, Leviathan; John Milton, Prose Works.)\n\n第十三週   啟蒙運動I：普世主義與進步觀\n\nBaumer ed., Main Currents of Western Thought, pp. 366-375. (Voltaire, Letters on the English; Denis Diderot and Jean-le-Rond d’Alembert, The Encyclopedia.) \n\nDawson, The Chinese Chameleon, pp. 188-190, 196-198.\n\nBaumer ed., Main Currents of Western Thought, pp. 441-447. (Marquis de Condorcet, The Progress of the Human Mind.)\n\n第十四週   啟蒙運動II：洛克與自然權利說\n\nCohen and Fermon eds., Princeton Readings in Political Thought, pp. 243-247, 250-264. (John Locke, Two Treatises of Government.)\n\n第十五週   啟蒙運動III：盧梭與社會契約論\n\nV. Gourevitch ed., The Social Contract and Other Later Political Writings (Cambridge: CUP, 2001), pp. 41-54, 57-60. (Jean-Jacques Rousseau, Of the Social Contract.) \n\n第十六週   啟蒙運動IV：康德的先驗哲學\n\nMelvin Rader ed., The Enduring Questions: Main Problems of Philosophy (New York: Holt, Rinehart & Winston, 1976), 300-316.\n\n第十七週   總結：現代性的誕生\n\nImmanuel Kant, ‘An answer to the question: What is enlightenment?’ in Mary J. Gregor ed., Practical Philosophy (Cambridge: Cambridge University Press, 1996), pp. 17-22.\n\n第十八週  期末考",
    "methodologies": [
        {
            "type": "講述法",
            "note": "同學應預習各週讀本。"
        },
        {
            "type": "討論法",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 60,
            "note": "\t撰寫三份期中摘要評論作業。請同學自行從第二至第十六週中挑選三個講次，以該講次之讀本為基礎，撰寫三份每份2000~2500字的作業。作業內容應包括兩大部份：I) 史料文獻摘要(以1000字為限) 及II) 同學對於文本的史學評析 (例如：綜合比較(各)文本的論點、連結思想與社會脈絡、分析思想的特質與限制等等)。\n\n\t關於評論部分，注意事項有二：\nI) 請同學自問自答，擬定1~2個問題加以討論。就此，可選擇從以下幾個角度切入：\n-\t作者在寫作時對於政治、社會、經濟關係可能懷有甚麼預設？文獻呈現了怎樣的時代精神與社會氛圍？\n-\t對於同一議題，不同作者的觀點有何差異？為什麼？\n-\t對於該思想觀點的評述：是否有邏輯一致性？其有效性與限制是甚麼？在歐洲思想史上的突破性何在？\n\nII) 評論須引用一本以上的中英二手研究書籍(不可引用期刊論文、線上百科或部落格)，並須註明出處，引注格式以師大歷史學報格式為準。請盡可能以自己的話語重述，切勿大篇幅引用原文。\n\n\t作業請於所選定講次上課前兩天上傳至Moodle。(例如，撰寫9/30講次作業的同學，請於9/28 23:59以前上傳作業。)"
        },
        {
            "type": "期末考",
            "weight": 20,
            "note": "五分鐘期末口試。從事先公布之七題考題中，隨機出題。"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "5~6人一組。每位組員從第二至第十六週中擇三週導讀(可與個人期中作業週次相同/不同)。導讀人需準備文獻摘要大綱(以一頁A4為限)，於討論課發給每位組員一份 (並請另備一份供教師計分)，以進行15分鐘的導讀提要；摘要大綱須包括1~2個延伸問題，引導組員進行15分鐘的文本討論。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}