{
    "year": 107,
    "term": 2,
    "name": "認識藝術史",
    "teachers": [
        "蔡家丘",
        "Candida",
        "Syndikus",
        "林麗江",
        "哈德森",
        "諾斯邦"
    ],
    "department": "GU",
    "code": "01UG028",
    "credit": 2,
    "serial": 939,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 0
    },
    "schedule": [
        {
            "day": 3,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "正202"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本課程安排各種生動有趣的主題，內容跨越古今中外，由藝術史研究所教師群輪流擔綱，以淺顯易懂、循序漸進的方式帶領同學進入藝術史的世界。\n\n本課程選擇更貼近生活的角度，設計多面向的藝術史課程。跨越東西方、媒材、議題的限制，涵蓋繪畫、器物、建築、電影、博物館、市場、性別等方面。在追求人文素養的提昇之際，結合藝術與歷史的教學，正是從美感與智識的角度提供所需的養分，促進對藝術史的了解。同時，也鼓勵同學主動探索，發揮創造與想像力。內容豐富，陣容堅強，是為「旗艦版」的藝術史課程。通識課就是要選藝術史啊不然要幹嘛？！",
    "goals": [
        "培養對藝術的欣賞能力",
        "認識藝術史研究的趣味與特色",
        "以各種角度對不同文化藝術進行關懷理解",
        "以分組討論與報告方式探討相關課題"
    ],
    "syllabus": "授課教師：\n\n林麗江教授  \n曾肅良教授  \n辛蒂庫絲教授（英語授課）  \n諾斯邦副教授（英語授課）  \n蔡家丘助理教授\n\n  \n第一週—課程介紹\n\n  \n第二週—美的初體驗：美感與鑑賞  \n    欣賞藝術品需要培養觀看的眼睛、沈思的頭腦，與加以陳述的口才或文筆。本週將討論如何具備這些能力和技巧，作為培養美感與鑑賞觀的第一步。\n\n  \n第三週—藝術史是什麼？（~黑人問號？）  \n    藝術史是什麼？哪裡有趣了？懂不懂藝術史有什麼差別？學習藝術史對我有什麼影響？對將來的專業或工作有什麼幫助？這些其實是每位學習藝術史的學生都會遭遇的問題，值得我們一同來思考。\n\n  \n第四週—藝術愛玩客：繪畫中的休閒、娛樂、旅遊  \n    作為史料，許多繪畫恰如其分地紀錄了過往社會中的娛樂活動、休閒文化。作為藝術，畫家們精心繪製，創作一幅幅道路風景、壯遊山水。藝術史中有不少作品，其實正呈現了這些「玩家」們，寄情遊樂的趣味，或馳騁四方的足跡。\n\n  \n第五週—展覽參觀活動  \n    本週將擇一展覽活動前往，實際觀察美術品，從各種角度欣賞、理解。有別於用平面圖檔的方式解說，可以有更立體全面的觀察。同時，一場展覽如何呈現美術品？無論與主題、布置、陳列、解說文等方面的配合都有密切相關，參觀展覽提供了最好的觀察機會。\n\n  \n第六週—整座城市都是我的家：建築與城市生活  \nArchitecture and City Life  \nIt might be possible to live without art, though this would be a joyless life. It is, though, virtually impossible to live without architecture. Whether we are aware of it or not, our life is deeply influenced by the buildings, which surround us and in which we pass our daily life. With its appearance, dimension, volume and materials, architecture influences our mood and our behavior. In our cities, designed spaces organize our collective and individual life. This lesson will try to provide guidance how to read the architecture surrounding us. By taking Taipei as a case study, we shall, moreover, discuss the various—political, economic and social—factors, which determine the shape of modern cities.\n\n  \n第七週—校園建築導覽  \n日本建築師井手薰帶領著他的技師們，建立了當今師大建築最初的樣貌。隨著新建築的加入為校園添加了不少故事和新期許，老建築則保留了舊時代的回憶，等待我們去述說它的故事。散步、穿梭、奔跑，時常遊走在校園裡的你，是否真的了解它的故事？由本校藝術史研究所的師生帶領，邀請同學一起探索校園。\n\n  \n第八週—期中考試\n\n  \n第九週—有亮點！經典與鎮館之寶  \n講到鎮館之寶，大家腦海中也許浮現出「翠玉白菜」或是「蒙娜麗莎的微笑」，但是這些鎮館之寶是誰指定的？所謂的藝術經典又是如何形成的？經典是否自古皆然？經典背後所反映的是何種意識型態？甚至是何種歷史積澱？本次課程將帶同學深入探討此中奧秘。\n\n  \n第十週—圖像與文本：如何用圖像說故事？  \n「詩中有畫，畫中有詩」是大家耳熟能詳的說法，但是詩中如何有畫，畫裡又如何有詩？詩與畫，兩種不同的媒材如何相互轉換，甚至相互影響？更常見的是所謂的敘事畫，圖像如何轉譯文本？用圖像說故事跟用文字說故事有何不同？本次課程以北宋詩畫與敘事畫為主體，希望帶領同學讀懂畫中之詩，讀懂畫裡的故事，並真正領略詩畫相映所產生的美感。\n\n  \n第十一週—「淘寶」：藝術收藏與市場  \n    除了收藏在博物館、美術館之外，許多藝術品仍然流傳於民間收藏家或藝術市場，如何獨具慧眼從中淘寶，需要有豐富學識及鑑定經驗，才能識破作偽，以物讀史，認識價值不凡的古物，與周遭環境對話。\n\n  \n第十二週—啞瓷之光：工藝器物的藝術史  \n    深海沈船打撈出的破片、歐洲博物館裡的陶瓷、中國皇帝珍玩的多寶格、日本將軍的茶杯……，工藝器物中隱藏什麼樣的故事？如何藉此解開歷史的迷團？器物雖然闇啞無語，其實不但是工藝技術的結晶，還連繫了跨文化貿易的網絡，猶如瓷器雨過天青般的色澤反映著時代微光。\n\n  \n第十三週—福爾摩斯的眼睛：藝術史中的偵探  \nArt History as Detective Story?  \nArt History and more specifically Connoiseurship have been deeply influenced by the same methods of investigation used by detectives. If the personality of Giovanni Morelli, for instance, has been compared with the character of Sherlock Holmes by Carlo Ginzburg, latest examples confirm that forensics and interpretative methods in art history rely on the same paradigm. As we will see there are numerous examples in which art works can be apprehended as if they were the support of a criminal intrigue.\n\n  \n第十四週—藝術是無價之寶嗎？  \nStrange Business! Art and Value  \nArt is a strange business. From the medieval icons and relics until today’s artistic production, the work of art seems to have always belonged to another realm. It is considered as a priceless thing bearing immaterial values, whereas at the same time it should be considered as a commodity which can reach atmospheric sums. This contradiction is part of the paradoxical and subjective value and status given to artefacts. The course will present different objective and subjective criteria that may help to understand how works of art have been priced throughout the centuries. It will also focus on recent examples, as for instance conveyed by Yves Klein, Andy Warhol, Wim Delvoye or Damien Hirst, which directly question and challenge the business of art.\n\n  \n第十五週—放閃！藝術史愛情故事  \n    你知道藝術品中經常表現與愛情有關的主題嗎？如中國的長恨歌、日本的源氏物語，或是西洋希臘羅馬神話，均反映了人世間的七情六欲、愛恨情仇，透過藝術家的巧手刻畫為各種風格的作品。本週將介紹並分析不同文化中的藝術品是如何地「放閃」！\n\n  \n第十六週—我覺得可以vs.我覺得不行！藝術史辯論大會  \n    藝術的理念、創作經常與社會價值觀產生衝突，有時並非對與錯的問題，而是不同價值觀或文化背景所造成。其次，藝術史家也會對作品的鑑定、意義，基於不同的理由產生意見相左的推論，藝術便是在如此爭論與辯證的過程中逐漸發展。本週將選擇藝術史中曾經發生過的爭論，與同學分組進行辯論活動，藉此深入理解問題所在。\n\n  \n第十七週：小組報告與討論\n\n  \n第十八週：期末考試\n\nPS. 本課程不另外開放授權碼",
    "methodologies": [
        {
            "type": "講述法",
            "note": "由教師講述各單元的歷史背景，配合多媒體圖像或影片，與參考書目中相關內容，使學生對該主題有深入淺出的了解。"
        },
        {
            "type": "討論法",
            "note": "以課堂討論參與之方式，引發學生主動欣賞藝術的興趣，使其獲得自身觀看的眼光與美感。"
        },
        {
            "type": "實地考察、參訪",
            "note": "參觀博物館、美術館，藉由展覽直接欣賞美術品；導覽如學校建築，則是實際前往建築物考察，進行講解，提供更立體的觀照與學習方式。"
        },
        {
            "type": "媒體融入教學",
            "note": "運用多媒體教材，協助學生認識並欣賞藝術品。目的並非要求學生去記憶藝術品的作者、年代，而是經由對美術歷史文化的理解，對該主題能有深入的認識。運用多媒體教材，協助學生認識並欣賞藝術品。目的並非要求學生去記憶藝術品的作者、年代，而是經由對美術歷史文化的理解，對該主題能有深入的認識。"
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 30,
            "note": "以簡要的筆試作為重點複習"
        },
        {
            "type": "期末考",
            "weight": 30,
            "note": "以期末筆試作為重點複習，提供同學思考、解決問題的學習機會與成果展現。"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "就該週主題提出相關問題，引導同學觀察美術品，誘發對該主題的興趣與思考。"
        },
        {
            "type": "出席",
            "weight": 20,
            "note": "在前項課堂參與討論的同時進行出缺席記錄。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}