{
    "year": 107,
    "term": 2,
    "name": "邏輯思考與應用",
    "teachers": [
        "王鍾山"
    ],
    "department": "GU",
    "code": "05UG001",
    "credit": 2,
    "serial": 990,
    "group": "D",
    "quota": {
        "limit": 50,
        "additional": 5
    },
    "schedule": [
        {
            "day": 5,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "樸306"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "邏輯學主要的發展至今已有兩千多年的歷史，是人類思考方法學中最基本也最重要的一種思考工具。各種千差萬別的環境背景、種族特性、語言型態…等差異性，卻皆以共同的邏輯思維形式及其規律結合各自不同的思想與經驗內容而成就了過去與現今各種族的文化與文明。邏輯學展現在古今中外各面向的思考、發展與應用。\n\n邏輯對於現今的人們而言，是一種非常重要的概念與能力，是一門關於思維形式及其規律的理性科學。現代的科技文明可以說是完全建構在邏輯之上的，一切科學的推演與證明，皆建立在嚴謹的邏輯論證基礎上，在各學門領域中，被廣泛的採用與應用，尤其是數學、哲學、法律、語言學、計算機科學、自然科學 … 等產生了非常重要的影響。因此，邏輯學可說是任何學科必備的基本工具，它包含了所有科學的基本觀念和原理，掌握了邏輯便掌握了一切知識學問中最根本、最重要的一半。所以，邏輯學在眾學科中處於特別基礎的地位，聯合國教科組特別把邏輯列為眾學科之首，而歐美各國也把邏輯列為必須加以研修的傳統。邏輯學可幫助任何人進行正確思維、嚴謹的論證推理來認識自然客觀事物、獲取新知識以及表達思想交流，並進一步的掌握與理解自然科學的精髓與真理。尤其是對正在學習各種知識的學生更加來得迫切需要。\n\n本課程的教學內容，盡可能的將形式邏輯符號，以日常生活有趣的邏輯問題或案例來作說明與解釋，使學生能容易理解明白。透過講述完整紮實嚴謹的思考方法學外，並透過課堂上的討論，讓學生有更細緻的思維能活用於日常事例中，能在攪盡心思的推理解謎過程中獲得刺激與無法言喻的成就感。有系統性的理解與日常有趣鮮明的邏輯事例，讓學生對邏輯推理論證方法或觀念能活用自如，並能對可能的思考陷阱能有相當的免疫力，進而使學生更懂得去懷疑，並自然而然地用更細緻、嚴謹的思考方法去批判日常生活中的想法與論證。透過此課程有趣且紮實學習，希望這些重要且基本的思考方法學（形式與非形式的）能成為學生終身受用的思考工具。",
    "goals": [
        "讓學生對基本邏輯學有個正確清楚的概念，建立健全的思考能力與有效論證的推理方法，進而使學生的思維更嚴謹，語言表達更準確、更有條理來論證自己的思想。",
        "培養學生有獨立的思考與推理能力，對日常生活的人、事、物能有合理的判斷與分析。除了能開發智力和提高工作效率外，更能快速地揭露謬誤和駁斥詭辯。",
        "透過本課程有系統的邏輯訓練與思考方法的學習，使邏輯學成為學生終身有利工具。幫助學生在未來研讀更高階的專業知識以及從事研究工作時，其學習與解讀能力更有效率，探討問題或探求新",
        "日常生活中，尤其是報章媒體到處充斥著似是而非的謬誤或詭辯，藉由煽情式、簡潔有力的語言以及豐富生動的肢體動作，來迷惑、愚弄、欺騙或甚操控一些未經深思熟慮或總是一相情願的習慣"
    ],
    "syllabus": "**第一週    課程導言**\n\n        什麼是邏輯；論證的結構：概念與命題、前提與結論；一門導向自由的科學的自由技藝\n\n**第二週    二二八連續假期**\n\n**第三週    「親愛的，我永遠愛你！」**\n\n        論證的標準形式與entymeme修辭論證；邏輯的基本原理：同一律、矛盾律、排中律\n\n**第四週    「月球是生乳酪做的？」**\n\n        如何組織簡短的論證；從舉例到概括推論；類比論證\n\n**第五週    「台灣人不愛讀書？」**\n\n        充足理由律；因果解釋與論證；原因分類  \n        （繳交期中報告閱讀資料之解析）\n\n**第六週    「英國研究顯示⋯⋯」**\n\n        理由的可接受度與訊息來源的可信度、懷疑與批判之必要、訴諸權威問題  \n        （繳交期中報告大綱）\n\n**第七週    民族掃墓節** \n\n**第八週    「如果男人靠得住⋯⋯」**\n\n        命題邏輯系統簡介；論證有效性問題；實質條件句問題  \n        （繳交期中報告）\n\n**第九週    期中考**\n\n**第十週    「批判性思考vs慎思明辨」**\n\n        第一次作業解析和期中考題解析\n\n**第十一週    「若P則Q」：命題邏輯演繹系統**\n\n        五個重要的演繹論證：肯定前件、否定後件、假言三段論、選言三段論、建設性兩難論證；自然演繹法證明\n\n**第十二週    「所有的獨角獸都會飛」**\n\n        定言命題分析：全稱與特稱、肯定與否定；定言命題的對當關係\n\n**第十三週    「誰是Barbara ？」**\n\n        古典定言三段論；24種有效的定言三段論；存在預設問題\n\n**第十四週    組織論證的寫作(I)**\n\n        探索議題與發展論證；分析：功能、程序、因果；比較與對照\n\n**第十五週    「Human by nature desire to know?」：分析寫作經典文獻解析**\n\n        從字句到段落；如何對分析性文本進行論證分析\n\n**第十四週    組織論證的寫作(II)**\n\n        從大綱到反饋；學術論文基本結構  \n        （繳交期末報告大綱）\n\n**第十七週    「你有一隻狗⋯⋯」：形式與非形式謬誤**\n\n        謬誤簡介、古代謬誤分類：實質、言辭與形式謬誤、謬誤列表與例子  \n        (繳交期末報告）\n\n**第十八週    期末考**",
    "methodologies": [
        {
            "type": "講述法",
            "note": "以投影片引導課程主題介紹"
        },
        {
            "type": "討論法",
            "note": "作業前置階段需經分組討論後繳交"
        },
        {
            "type": "問題解決教學",
            "note": "實際於課堂中示範作業要求之寫作與證明解題的問題"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 40,
            "note": "同學需分階段撰寫二篇3000字的議論論文作業：學期中針對期初公佈的閱讀資料文獻，撰寫一篇對該文的「批判性評論」；並於學期末針對期中公佈的哲學經典文章，撰寫一篇對它的「論證分析」。"
        },
        {
            "type": "期中考",
            "weight": 30,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 30,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "除學期初每週必定點名外，之後的課程也將經常點名；點名不會列入成績計算，但六次未到（不論是否請假）期末考將不予計分。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}