{
    "year": 107,
    "term": 2,
    "name": "教育遊戲設計與應用",
    "teachers": [
        "洪榮昭"
    ],
    "department": "GU",
    "code": "06UG026",
    "credit": 2,
    "serial": 1036,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 1,
            "from": 7,
            "to": 8,
            "campus": "本部",
            "classroom": "誠402"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本課以教育性遊戲為主題，初期課程安排體驗教育遊戲APP及VR，引導學生拋棄原有傳統學習模式，嘗試以不同的APP及VR體驗進而熟悉遊戲學習理論、遊戲學習設計規劃方法。次之，本課程將分享遊戲學習案例，以及闡明遊戲式學習之概念，並引導學生進行學習遊戲（桌遊、App、網頁）題庫的編撰，讓本課程修畢學生在學習理論及遊戲設計之整合能力有所提升，且課程結束能有編撰學習教材之經驗。",
    "goals": [
        "本課程以幫助學習者提升同儕合作能力為目標。",
        "本課程以培養學習者能透過多種角度描述、分析、比較與批判既有遊戲式學習媒材之異同為目標。",
        "本課程以幫助學習者建構美學基礎概念為目標。",
        "本課程以幫助學習者善用資訊搜索與應用能力為目標。",
        "養成主動探究學習媒材之意涵、學習目的、設計規劃及學習理論的探究學習習慣。",
        "能思考如何以新穎的遊戲學習方式提升學習者的學習興趣與學習效用，及完成教育遊戲發想專題。"
    ],
    "syllabus": "**第一週**      **課程大綱及教育遊戲體驗**\n\n首次課程將說明本門課程整體規劃，並課程安排不同組別學生體驗個人與團體類型的教育類型遊戲的體驗，進行去除對於遊戲舊有想法之體驗活動。藉以引導學生感受在遊戲中學習的情緒與情境，再請各組別同學進一步分享遊戲式學習的心得與傳統學習法的差異與優缺點。\n\n**第二週**      **遊戲式學習理論**\n\n本週課程講授遊戲學習的相關理論，經由learning by playing or learning for playing，讓修課學生了解學習者如何在遊戲中有效提升學習成效、學習興趣。並講授如何將翻轉學習與行動學習等學習法與遊戲式學習結合\n\n**第三週**      **遊戲人機介面設計**\n\n本週授以教育遊戲App及VR的人機介面的設計概念，讓修課學生瞭解不同的介面設計之優缺點與其特色，並讓學生嘗試剖析現有的教育遊戲App及VR之特性與可改良之處。\n\n**第四週**      **遊戲系統可用性評量**\n\n本週授以**系統可用性評量**的概念，以及標準化評量的架構下，說明評量與計分時應注意之事項，以及不同**評量**方法，同時提供多種的評量範例及出題原則之介紹。\n\n**第五週**      **遊戲學習效益評量**\n\n授以學習評量之信度與效度的概念，以及內容難易度之分析方法，並讓學生於課堂中練習建構學習評量的雛形，引導學生建構出具有信效度之評量內容。\n\n**第六週**      **遊戲規劃**\n\n本週將剖析教育遊戲設計規劃之要點，介紹遊戲之系統架構發展歷程，以及如何轉化研發限制，同時提供多款的遊戲設計規劃範例，藉此讓學生深度了解遊戲設計規劃之完整發展歷程。\n\n**第七週**      **遊戲設計**\n\n本週將延續上周課程，增加說明如何評估遊戲開發所需之經費，以及如何規劃遊戲開發的時程與資源，並建置遊戲設計市場需求評估表，藉此讓學生能夠了解如何規劃出高可行性與高市場性之產品。\n\n**第八週**      **教育遊戲設計專家講座**\n\n經本課程前半學期，了解多種的遊戲式學習方式後，本週將邀請教育遊戲開發之業者、學術界之研發人員等，前來分享其教育遊戲設計之發展歷程，以提供同學最直接及直觀的經驗傳承。\n\n**第九週**      **教育遊戲特性分析報告發表**\n\n本週將著重讓學生發表不同類型教育遊戲之特性分析，簡介遊戲方式、學習內容、學習理論與評量方法等，每組分享完後由授課老師進行總結與建議，最後，再以小組討論的方式，促使學生彼此間相互交流分析心得與看法。\n\n**第十週**      **文史領域的****遊戲設計與實證**\n\n本週課程講授文史領域的遊戲式學習方法，並藉由教育遊戲案例輔以闡釋學習理論如何正確的應用到遊戲中，以及如何設計題庫，產生兼具遊戲與教育性質，達到寓教於樂之目的的遊戲，讓修課學生了解學習者如何在遊戲中有效提升學習成效、學習興趣。\n\n**第十一週**            **藝術領域的****遊戲設計與實證**\n\n本週課程將簡介藝術領域教育遊戲「見微知美App」的設計理念，同時授予修課學生完形心理學的理論概念，並引導學生以小組為單位進行遊戲學習體驗。\n\n**第十二週**            **科學領域的****遊戲設計與實證**\n\n本週將介紹科學領域的遊戲式學習方法，並說明如何將新科技應用於科學遊戲學習，藉此讓學習者體會更多遊戲式學習的可行性。\n\n**第十三週**            **生活科技領域的****遊戲設計與實證**\n\n本週將介紹生活科技領域的遊戲式學習方法，首先將以空間能力的學習系統App提供學生體驗，並於課堂中進行心得分享與討論，教師將於課堂中介紹其學習理論、評量方法與設計理念，使其對於該類型的教育遊戲App能有更深一層的了解。\n\n**第十四週**            **期末專題激盪與發想**\n\n經本學期14週的課程，修課學生對於不同領域的教育遊戲已有基礎的了解，因此本週將請同學進行期末遊戲題庫設計專題報告的分組，並發想學習領域以及遊戲方式，最後由授課教師提供專題發想的建議。\n\n**第十五週**            **VR****遊戲設計介紹**\n\n本週將介紹VR遊戲式學習方式，同時提供多款的相關領域的遊戲VR，藉此讓學生深度了解體感認知(embodied cognition)的遊戲式學習之效用。\n\n**第十六週**            **VR****遊戲實證**\n\n本週授以VR遊戲的遊戲式學習方法，並討論市面上的相同教育性質遊戲的特性，並介紹實証成效分析方法，並請各位同學分組嘗試使用至少一款的VR遊戲p並於下次上課分享心得。\n\n**第十七週**            **成果發表（一）**\n\n在最後二堂課，將安排教育學習內容題庫專題之成果發表，發表形式得採簡報、海報張貼、多媒體影片模擬展示等，就各組之學習理念、發想歷程、內容規劃撰寫重點等上台分享，用以檢視本課程學習成果。\n\n**第十八週**            **成果發表（二）**  \n在最後一堂課，將安排教育學習內容題庫專題之成果發表，發表形式得採簡報、海報張貼、模型展覽、多媒體影片展示等，就各組之設計理念、發想歷程、內容規劃撰寫重點等上台分享，用以檢視本課程學習成果。最後並針對這兩週的成果發表，提出綜合性的回饋建議。",
    "methodologies": [
        {
            "type": "討論法",
            "note": "在課堂中，教師引導學生針對每週課程主題進行練習，並就各項練習結果進行分享與討論。"
        },
        {
            "type": "實驗/實作",
            "note": "學期末讓學生就本學期所學，進行教育遊戲學習內容規畫，並練習撰寫成果報告。"
        },
        {
            "type": "專題研究",
            "note": "於教育遊戲專題設計時，學生應就現有之教育遊戲，進行市場接受度、需求性、學習特色等優缺點進行比較分析，並將分析結果回饋於專題設計中。"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 60,
            "note": "上課擬以小組方式進行，並將小組成員彼此間之討論參與程度作為評分參考。"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "本課之出缺席情形將作為本項評分參考。"
        },
        {
            "type": "專題",
            "weight": 30,
            "note": "教育遊戲學習內容規劃專題之實用性、趣味性等，作為本項評分依據。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}