{
    "year": 107,
    "term": 2,
    "name": "環境倫理與永續發展",
    "teachers": [
        "張子超"
    ],
    "department": "GU",
    "code": "06UG006",
    "credit": 2,
    "serial": 1023,
    "group": "A",
    "quota": {
        "limit": 50,
        "additional": 34
    },
    "schedule": [
        {
            "day": 3,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "誠302"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本通識課採用「為修課學生建構做為具批判思考與省察能力的優質公民」為課程基礎，從身邊最臨近的校園、社區為出發點，藉由教育的過程，培育人類對整體環境的正確認知與態度，養成基本知識、技能，進而體認關切環境的變遷，發揮真正的環境關懷與行動，成為具有「在地行動，全球性思考」的地球公民",
    "goals": [
        "藉由校園探索活動激發並增進學生對環境觀察的敏感度，使學生能發現多樣的校園環境生態，培養學生觀察與發現問題的能力",
        "應用地區鄉土資源進行設計與教學，使學習內容生活化與意義化；採用地區性環境議題之探索與解決為導向，使學生獲得主動學習與解決問題的能力",
        "推動校園生活環保，養成節約能源、惜福愛物及減廢的生活方式與習慣，促進學生對環境與永續發展理念的認知，建立積極正面的價值觀與態度，並能自動自發產生環保行為",
        "激發學生對永續校園環境的認知，並習得維護環境的技能、態度，重塑正確價值觀，培養具有環境素養及責任感的公民"
    ],
    "syllabus": "  \n**※第1週：學期課程介紹**  \n  \n**※第2週：我的自然經驗與分組活動  \n**－經驗學習強調學生必須對即將要探索的對象、環境、自然或者是人文，存有基本認知，並且要對它有相當的敏感度。有了這些當基礎，才可能對於我們所要探索的對象，進行所謂經驗學習。因此，透過本教學活動，教師喚醒學生對自然的渴望，加強學生與自然的連結。  \n－個人作業1：我的自然體驗  \n  \n**※第3週：校園探索**  \n－校園是我們每天生活與學習的主要場域，其景觀規劃、環境設施、與人際互動都深深影響我們的作息與感受。本教學活動強調讓學生思考校園與自己的互動，如校園對自己的影響，甚至自己又如何影響校園。學生可從自己的觀點，選擇校園最美的景觀、最具意涵的景物、最感人的故事、以及最適合約會的地點等等。  \n－團體作業1：師大校園之美  \n**  \n※第4週：校園議題探索**  \n－校園雖然是一個人為規劃與建設的空間，但是校園的地理位置、氣候環境、建築的方位與材質、及與社區的互動空間，都影響我們的作息與感受。校園就像是一個小型的社會，存在著各種的環境議題；就範疇而論，生活中的食、衣、住、行、育、樂，都有與環境相關的議題，而就影響的急迫性來區分，有的是立即的影響，有的是具有緩慢但深遠的效果。   \n－藉由環境議題的討論與調查，可以促進學生對校園有深刻的認識，尤其是對生活的體驗有直接接觸及研究的機會。   \n  \n**※第5週：全球環境議題與議題探索**  \n－引起動機：合動畫遊戲介紹主要的全球環境問題。  \n－發展主題：全球暖化、臭氧層破洞、能資源耗竭、生物多樣性減低、天然災害  \n－小組討論：請學生分享對於全球環境改變的問題提出經驗或心得分享  \n   \n**※第6週：永續校園實務分享  \n**－個人作業2：永續校園實務分享演講心得  \n  \n**※第7週：議題探索實務分享**  \n－透過實務分享讓學生針對生活中的環境議題，藉由深入分析議題本質的內涵與考量外在環境的機會與威脅，瞭解環境議題的複雜性與相互依存關係，並能心思縝密地進行環境議題解學策略與執行方案的規劃。  \n－個人作業3：議題探索實務分享演講心得   \n  \n**※第8週：校園議題探討期中報告**  \n－於課堂中發表學習成果，並進行討論與互動。再指導學生以活動中形成的概念進一步應用於新的情境。  \n－團體作業2：校園環境議題探索  \n  \n**※第9週：期中隨堂課驗  \n**   \n**※第10週：專書議題發表會  \n**－團體作業3：小組專書閱讀報告  \n－個人作業4 :個人專書閱讀心得  \n  \n**※第11週：永續發展的內涵與趨勢  \n**－引起動機：以古今中外大師的永續發展理念讓學生明白永續發展不論古今中外，都是被注重的議題。  \n－發展主題：瞭解永續發展之核心、國際間全球變遷與永續發展相關科學與技術究、永續發展之實踐內容。  \n－小組討論：請學生從『能源有限』的議題上，討論其永續發展的策略；以及請學生分享生活中所聽聞永續發展的例子。   \n   \n**※第12週：環境典範與土地倫理**  \n－引起動機：以「失去部落的卡拉社人」的簡報資料，帶出本單元的主題。  \n－發展主題：瞭解環境典範與土地倫理之內容。  \n－小組討論：請學生從西雅圖天空的「土地買賣」、風中奇緣的「野蠻人」與否的觀點來看環境典範轉移的過程，並且提出自己的土地倫理觀點。   \n  \n**※第13週：師大永續校園戶外參訪**  \n－戶外參訪與討論活動：台師大永續校園計畫－人工濕地   \n   \n**※第14週：永續發展的公民素養**  \n－請學生從生活中分享討論可以實踐綠色生活的例子；「想一想，對於我們個人、學校、或社區、全球實踐綠色生活的好點子」。透過《社區的力量：看古巴如何度過石油危機》讓學生知道古巴如何從大型的慣型農業、依賴農藥、除草劑轉型為小型的都市菜園。從一個高度仰賴工業的社區轉變為有機型態的農業。在討論過程中，協助學生進一步為自己的小組議題做連結與反思。   \n  \n**※第15週：公民素養與綠色實踐  \n**   \n**※第16週：綠色文明與生活**  \n－引起動機：從二十一世紀以來的環境問題愈來愈多，地球公民需要學習與地球和平共存。  \n－發展主題：現代公民需要瞭解到的生態法則及生態智慧，及公民素養所需具備的能力。  \n－小組討論：請學生從『生活周遭的環境議題』上，分享生活中所聽聞哪些不符合現代環境公民的例子，討論如何發展現代公民的策略；「想一想，還可以怎麼做?或者怎麼做會更好呢?」   \n  \n**※第17週：師大校園議題討論公聽會**  \n－確定角色的定位與立場：每一個環境議題中一定會有不同的角色，當中一定有不同的利害關係人物、組織，或者是個人。  \n－轉換角度思考：學生扮演哪個角色就必須把自己掏空，學生必須經過長時間的資料收集和分析，將自己放在那個角色，以扮演角色的觀點思考其價值立場、價值選擇。  \n－使意念明朗化：透過角色扮演，讓學生在公聽會中，各自扮演各自的，進行一場所謂的辯論或公聽會。並藉此讓學生的意念更明朗化，即在公開報告時，清晰的告訴大家扮演角色的想法。  \n－公聽會的表達與辯論：透過公聽會，讓每個角色能將自己的價值立場、以及角色最在乎的觀點，加以呈現出來，而且藉由這樣的公聽會活動，提出自己扮演的角色對他人角色的質疑，藉不同立場的討論瞭解對方的損失。或共同經歷一場價值澄清過程，而達到某些基本的共識。讓學生了解別人是怎麼想的、別人是在乎什麼話題。   \n－團體作業4：各組觀點彙整  \n  \n**※第18週：校園議題探討成果報告  \n**－團體作業5：議題公聽會成果報告書  \n－個人作業5：學習心得建議與回饋",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": "藉由課堂中、數位學習平台上的討論，可增強學生課程參與感，提高彼此互動討論的機會，並且延長學習的時效性，讓學生更樂於學習。"
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": "讓學生進行小組合作學習。透過分組的建立，可促使小組的學習網絡更加活躍，加強個體、群體間的互動。"
        },
        {
            "type": "實地考察、參訪",
            "note": "帶學生走出教室，實際探索永續發展的概念如何在校園中有前瞻性地體現。"
        },
        {
            "type": "媒體融入教學",
            "note": "利用教育部數位學習示範課程-環境變遷與永續發展網站進行教學"
        },
        {
            "type": "其他",
            "note": "使用「價值澄清教學法」進行校園環境議題公聽會，學生必須提出自己扮演的角色對他人角色的質疑，藉不同立場的討論瞭解對方的損失。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 35,
            "note": "課程共計有五份個人作業：我的自然體驗、永續校園演講心得、議題分享演講心得、專書閱讀心得、學期學習心得。"
        },
        {
            "type": "期中考",
            "weight": 10,
            "note": "期中測驗"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "學生平日於課堂間活動參與、課後小組討論的認真與積極投入也是本門課評鑑的重要依據。"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "修習本門課不得無故缺課三次"
        },
        {
            "type": "報告",
            "weight": 35,
            "note": "課程共計有五份團體報告：師大校園之美、期中校園環境議題探索、小組專書報告、校園環境議題公聽會資料彙整、校園環境議題公聽會成果報告。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}