{
    "year": 107,
    "term": 2,
    "name": "科技與人文的對話",
    "teachers": [
        "林基興"
    ],
    "department": "GU",
    "code": "06UG014",
    "credit": 2,
    "serial": 1030,
    "group": "B",
    "quota": {
        "limit": 70,
        "additional": 20
    },
    "schedule": [
        {
            "day": 2,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "誠201"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本課程主要是以科學史、科學思想與科學哲學為主要脈絡，來澄清一般非理工科學生長時期以來對科學發現、技術發明及科學本身的一些片面和模糊認識，進而了解科學家的科學精神、科學思想和科學思維方法，以及科學發現和發明的艱苦、曲折的革命歷程。這些有系統且有歷史性的科學知識饗宴，都是其他非自然科學所無法獲得的重要觀念。\n科學、科技與我們的生活息息相關，它影響我們的一切生活，也影響我們的思維，更衝擊宗教的信仰理念，讓「人」自身重新反思在這宇宙中的地位與價值。當然對大自然萬物存在的美妙規律的本質也讓人們進一步重新思索與領悟。科學與藝術都有它的美，科學的美與藝術的美都值得呈獻給大家來欣賞，讓同學們感受甚至發現科學可愛、美妙的一面。\n相信透過一系列科學史、科學原理及其科技應用的介紹，以及課程中的學習與討論，除了讓同學更加的了解科學、科技以及科學家人性的一面外。進一步的培養學生科學精神、提高科學素質，凡對人、事、物具備獨立思考、理智分析以及客觀求證的精神與態度。善用並理解日常各種千變萬化的科學新知，相信對適應瞬息萬變的未來科技社會，會有相當大的助益。",
    "goals": [
        "在演講授課的開始或過程中提出某些開放式問題，鼓勵學生嘗試性回答，勾住學生的注意力並引發學生的興趣。透過精彩的歷史檔案圖片或簡短的科學短片，讓學生有如身歷某個時代背景的科學",
        "引領學生到過去、現代至未來可能的人類科技文明中，如何以人自己本身的角度，反思在典範時代，人們主要會從事哪些研究和持哪種世界觀；到新問題產生導致科學革命及其思想變革，可能發",
        "為了激發學生學生問問題或表達個人見解以及能夠確切的評量，本課設計個人心得報告和小組上台討論報告。透過這些報告報告，除了能夠評量學生對此課的學習吸收狀況，更能夠達到師生之間",
        "書面報告為搜尋某科學主題的相關資料，要懂得如何節選重要且有憑有據的訊息，探討某科學之美感或規律以即與人生活有關，報告必須圖文並冒且排版精簡整齊。以自身所學科系為例，對所學"
    ],
    "syllabus": "**教學進度與主題**（請詳細說明每週進度及課程內容）\n\n**週次 課程內容**\n\n1 課程大綱、思維方式；「兩種文化」（人文與科技的發展與互動）。西遊記的文藝與科幻。詩經的「可以興可以群、多識於鳥獸草木之名」。\n\n2 科學可否證、科技如兩面刃；證據權重；風險與福祉。生命意義。創意的魅力與陷阱。文藝的慰藉之功；文藝美吧？科技美嗎？\n\n3 電磁波：媒體與環團宣染恐慌、不解科技者「愛之適以害之」。\n\n4 電磁波：自然與人為、應用與誤用（「手機上癮症」等）。\n\n5 電磁波：健康效應、自由社會人人可發言（自由心證）、定性與定量（可知專家與否）。恐慌首因在於「無影無蹤」。\n\n6 電磁波：比較福祉與風險、自由經濟的趨力與後果（科學家的社會責任）。\n\n7 基因改造：各式作物與演化、地球的環境承載力、「寂靜的春天」。\n\n8基因改造：自然與人為、應用與誤用、顧此失彼。立委幫倒忙。\n\n9 （期中考）檢討「期中報告」。\n\n10基因改造：健康效應、自由社會人人可發言（自由心證）、定性與定量（可知專家與否）。恐慌首因在於「不自然」。\n\n11基因改造：比較福祉與風險、科技的創意與後果（科學家的社會責任）。\n\n12核能與輻射：比較各式能源，顧及環保與經濟。以空污為例論選擇的智慧。\n\n13 核能與輻射：自然與人為、應用與誤用、物盡其用。世代正義、欺負弱勢嗎？\n\n14 核能與輻射：健康效應、自由社會人人可發言（自由心證）、定性與定量（可知專家與否）。恐慌首因在於受到「輻射的認知」制約。\n\n15 核能與輻射：比較福祉與風險、「潘朵拉的盒子」。\n\n16科技的冰冷與人文的溫潤。社會責任與義工思維。原子科學家的反思。為何尊重專業？「專家只是訓練有素的狗」？辯論的得與失。\n\n17 綜合人文與科技（獨立與互補）；意義的追尋。史來，人文的演化、科技的功過；「文明的躍昇」。一學期來，同學的「領悟或頓悟」。\n\n18 （期末考）檢討「期末報告」。\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=7b4321c13c4f44d9ad244ccfcaf55ccb&fno=8f66594922ce4f97a2af36ed26a9078b)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "學生預覽，老師提示重點與解析難處。科技內涵較需輔導。"
        },
        {
            "type": "討論法",
            "note": "引發學生興趣、由學生提問知其程度與關心。「集體智慧」可取長補短。"
        },
        {
            "type": "實驗/實作",
            "note": "這是「生活中的科技」課程，實際瞭解相關設施與實物；親身經歷會比較印象深刻。"
        },
        {
            "type": "專題研究",
            "note": "寫然後知不足。詖辭知其所蔽、遁辭知其所窮。比較期中與期末報告瞭解學生的進展。"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": "每人發言「貢獻」意見、訓練公共發言的膽識。"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "上課是學生的責任、增加與師生互動的機會。"
        },
        {
            "type": "報告",
            "weight": 60,
            "note": "期中報告20%、期末報告40%。培育「美感與品味、科學素養、反思、溝通表達與團隊合作」能力。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}