{
    "year": 107,
    "term": 2,
    "name": "文學與藝術",
    "teachers": [
        "林秀玲"
    ],
    "department": "GU",
    "code": "0AUG215",
    "credit": 2,
    "serial": 1037,
    "group": "A",
    "quota": {
        "limit": 75,
        "additional": 20
    },
    "schedule": [
        {
            "day": 1,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "誠202"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "The purpose of this course is to provide students with an introductory history of western art and its literary reception. Each week we will be looking at a different cluster of visual artworks and discussing it with reference to (1) its own cultural context and (2) a short literary text written in response or as a complement to it. \n\nThe course will, in the main, follow the chronology of the visual artworks that we will be considering. This means we will move from medieval to modern/contemporary periods of artistic production. The literary texts we will be looking at are mostly poems from the twentieth century. Students on this course will always be encouraged to try out their own interpretations of works of visual art and literary texts alike.",
    "goals": [
        "To provide students with an introductory history of western art and its literary reception"
    ],
    "syllabus": " This semester, we will study the theme of Greek mythology and legends in Western art and literature.  We plan to structure our class around the theme of Greek mythology.  We will organize our lectures, student presentations, group discussions around the thematic exhibition. \n\nUnlike Christian monotheistic traditions, Greek mythology is not based on faith, and is polytheistic.  It reflects system of the ancient Greeks features.  Actually, myths are not just imaginative stories based purely on fiction and with no basis in fact. Rather, they represent a form of universal truth transmitted through ballads and based on the collective memory of a people.  \n  \nA long succession of painters and sculptors over the ages has striven to visualize these narratives, attempting to picture and portray them. The fascinating and ingeniously crafted narratives and images inspired by Greek mythology have continued to inspire many an artist, even down to modern times, such as Pablo Picasso.\n\nWe will discuss ancient images and modern expressions that depict the gods and other stories along with age-old texts that served as their inspiration together for comparison.  We will also read selections of Chinese translations of _Iliad_ and _Odyssey_, both traditionally attributed to Homer, Hesiod’s _Theogony_, Virgil and Ovid’s _Metamorphoses_.  \n  \n\nA more detailed syllabus will be announced in the class.",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Lectures and talks"
        },
        {
            "type": "討論法",
            "note": "Discussion and group discussion"
        },
        {
            "type": "問題解決教學",
            "note": "Thematic group discussion"
        },
        {
            "type": "合作學習",
            "note": "Group discussion"
        },
        {
            "type": "實地考察、參訪",
            "note": "Visit the exhibition “Western Mythology and Legends Selected Works from the Louvre Museum” at the National Palace Museum."
        },
        {
            "type": "專題研究",
            "note": "Midterm and final papers"
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 35,
            "note": "Midterm short paper (3 pages)"
        },
        {
            "type": "期末考",
            "weight": 35,
            "note": "Final paper (5 pages)"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "課堂口頭報告"
        }
    ],
    "prerequisite": "",
    "general_core": []
}