{
    "year": 109,
    "term": 2,
    "name": "休閒產業組織行為研究",
    "teachers": [
        "陳美燕"
    ],
    "department": "AD31",
    "code": "SRD0009",
    "credit": 3,
    "serial": 9,
    "group": "",
    "quota": {
        "limit": 15,
        "additional": 2
    },
    "schedule": [
        {
            "day": 1,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "綜603"
        }
    ],
    "programs": [
        "高齡學程"
    ],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course covers the foundation for the study and application of organizational behavior. The perspective, historical background, methodology and theoretical framework for human behavior in organizations for hospitality and tourism industries are studied. Attention is given to the micro perspective (perception, personality and attitudes, motivation, and learning), the dynamics (group dynamics, conflict, stress, power and politics, and leadership), and organizational culture. Applications for performance improvement, organizational change, and development are stressed.",
    "goals": [
        "Know the challenges faced by today’s hospitality and tourism organizations.",
        "Deal with today’s hospitality and tourism workforce.",
        "Demonstrate the competencies needed by effective hospitality and tourism managers.",
        "Understand the importance of effective hospitality and tourism organizational behavior.",
        "Negotiate effectively in cross-cultural settings and the dot-com, global workplace"
    ],
    "syllabus": "Course Descriptions 1.Leisure Organizational Management addresses the employment demands of the sport, recreation, and leisure sector. 2.Phenomenal growth has occurred, and is predicted to continue well into the future, for the career opportunities targeted by this program. 3.These diverse and expanding sectors are bolstered by the globalization of the leisure and tourism industry. Specialization in the Leisure Organizational Management 1.Leisure and Sport Studies: explore a variety of learning options in the sport, leisure and recreation. 2.Recreation and Sport Management: focus on the business, management and leadership aspects of the sport, recreation and leisure industry. 授課方式與內容 1.課堂講授重要理論與概念 2.教學影帶、時事議題網路連結、網際網路運用 3.文獻閱讀與探討 4.運動休閒管理個案分析 5.實際參訪運動休閒產業 6.邀請專家學者專業分享",
    "methodologies": [
        {
            "type": "講述法",
            "note": "專業理論與知識"
        },
        {
            "type": "討論法",
            "note": "個案討論"
        },
        {
            "type": "專題研究",
            "note": "期末專題"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 20,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 30,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 30,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}