{
    "year": 107,
    "term": 1,
    "name": "科技與工程教學策略研究",
    "teachers": [
        "林坤誼"
    ],
    "department": "HM71",
    "code": "ITM0096",
    "credit": 3,
    "serial": 1139,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 5
    },
    "schedule": [
        {
            "day": 3,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "科506"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "本課程之目的在探討科技與工程教育教學策略相關議題。本學期將釐清科技、工程與科學之分野、探討如何界定各級學校之科技與工程教育教學目標及各層級間之相互銜接關係，探討教學活動設計的模式、要素、步驟與流程，探討適用於科技與工程教育的教學策略與教學方法及其在教學實務上的應用，探討如何評量科技與工程教育教學活動與學生的學習成就。本課程將綜合講述、示範、個案討論、教學活動設計與專題報告等方式實施教學。",
    "goals": [
        "瞭解科技與工程教育的意義及其重要性。",
        "瞭解科技、工程與科學之分野。",
        "瞭解如何界定並銜接各級學校之科技與工程教育教學目標。",
        "具備運用不同的教學策略設計科技與工程教育教學活動的能力。",
        "了解如何評量科技與工程教育教學活動與學生的學習成就。",
        "應用教學活動設計模式，設計、執行並評估科技與工程教育教學活動。",
        "瞭解科技與工程教育教學策略的重要趨勢與課題。"
    ],
    "syllabus": "第一週：課程內容簡介、上課規範、以及評分方式；TSSCI、SSCI資料庫使用說明；期中、期末作業說明。\n\n第二週：科技與工程教育對學生的助益為何？培養學生什麼能力？課前請蒐集、閱讀相關文獻，並撰寫一頁A4的心得與評論（編號1、2）。\n\n第三週：科技與工程問題解決教學策略：學生在實作活動中的問題解決能力表現為何？學習過程中產生什麼問題？課前請蒐集、閱讀相關文獻，並撰寫一頁A4的心得與評論（編號3、4、5）。\n\n第四週：STEM教學策略：學生在實作活動中是否能將理論與實務進行整合？現階段的研究成效為何？遭遇什麼問題？課前請蒐集、閱讀相關文獻，並撰寫一頁A4的心得與評論（編號6、7、8）。\n\n第五週：創造思考教學策略：學生在實作活動中的創造思考表現為何？科技創造力表現為何？學習過程中產生什麼問題？課前請蒐集、閱讀相關文獻，並撰寫一頁A4的心得與評論（編號9、10、11、12）。\n\n第六週：批判思考教學策略：學生在科技史活動中的批判思考表現為何？學習過程中產生什麼問題。課前請蒐集、閱讀相關文獻，並撰寫一頁A4的心得與評論（編號13、14）。\n\n第七週：思考與實作：學生在實作活動中的思考表現為何？實作表現為何？在實作活動過程中，思考與實作的表現遭遇什麼問題？課前請蒐集、閱讀相關文獻，並撰寫一頁A4的心得與評論（編號15、16）。\n\n第八週：能源科技實作活動：現階段能源教育的問題為何？學生透過能源科技的實作活動，是否能夠強化其負責任的環境行為？課前請蒐集、閱讀相關文獻，並撰寫一頁A4的心得與評論（編號17、18）。\n\n第九週：期中報告：請針對你參與或教導實作活動的經驗，研提你所認為學生在學習過程中所遭遇的問題（或教師教學上的問題），並說明你覺得該如何解決這個問題，請以一頁A4為限。\n\n第十週：鼠夾車實作教學個案探討：解釋如何規劃與設計鼠夾車教學活動，並透過不同挑戰的設計來協助學生整合理論與實作。\n\n第十一週：鼠夾車實作教學個案探討：實際設計與製作鼠夾車，並從中探究學生所可能遭遇的問題與困難。\n\n第十二週：鼠夾車實作教學個案探討：實際設計與製作鼠夾車，並從中探究學生所可能遭遇的問題與困難。\n\n第十三週：STEM實作教學活動報告：請蒐集國外STEM教學活動，並將其重點（請說明為什麼你覺得這個活動有價值）以一頁A4呈現。\n\n第十四週：STEM實作教學活動設計：請設計一個STEM教學活動，並將其重點（請說明為什麼你覺得這個活動有價值）以一頁A4呈現。\n\n第十五週：教學策略研究設計與規劃：如何設計一個值得探究的教學研究？現階段有哪些研究的重點？該採用什麼樣的研究設計模式與資料分析方法？。\n\n第十六週：準實驗設計之不相等組前測後測設計：為什麼要用此一設計？有哪些注意事項？該採用什麼資料分析方法？（請事先安裝SPSS統計分析軟體）。\n\n第十七週：期末報告：針對期中報告的題目撰寫一篇文章，字數八千至一萬五字間，請準備簡報，每人報告時間為15分鐘，討論時間為10分鐘。\n\n第十八週：期末報告：針對期中報告的題目撰寫一篇文章，字數八千至一萬五字間，\n\n          請準備簡報，每人報告時間為15分鐘，討論時間為10分鐘。",
    "methodologies": [
        {
            "type": "講述法",
            "note": "講述科技與工程教育教學策略的相關理論與應用。"
        },
        {
            "type": "討論法",
            "note": "透過分組討論協助學生應用課堂所學的相關知識與技能。"
        },
        {
            "type": "問題解決教學",
            "note": "經由問題的解決協助學生培養問題解決能力。"
        },
        {
            "type": "合作學習",
            "note": "提供學生合作學習的機會以激發彼此的創意。"
        },
        {
            "type": "實驗/實作",
            "note": "進行鼠夾車實作活動設計與製作，以探究學生可能會遭遇的學習困難，與該如何透過活動的設計以強化學生整合理論與實務的能力。"
        },
        {
            "type": "媒體融入教學",
            "note": "運用網路多媒體資源以提升學生的學習動機與興趣。"
        },
        {
            "type": "專題研究",
            "note": "針對科技與工程教育實作教學的問題進行專題研究。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 40,
            "note": "閱讀與反思科技與工程教育教學策略的相關理論與應用。"
        },
        {
            "type": "期末考",
            "weight": 15,
            "note": "請針對你參與或教導實作活動的經驗，研提你所認為學生在學習過程中所遭遇的問題（或教師教學上的問題），並說明你覺得該如何解決這個問題。"
        },
        {
            "type": "出席",
            "weight": 15,
            "note": "學生平時的出缺席狀況、在課堂中參與討論、主動提問與答題的表現。"
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "針對期中報告的題目撰寫一篇文章，字數八千至一萬五字間。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}