{
    "year": 108,
    "term": 1,
    "name": "質化研究",
    "teachers": [
        "袁千雯"
    ],
    "department": "EM15",
    "code": "ISC0111",
    "credit": 3,
    "serial": 542,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 1,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "圖資所研討室A",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "Ph.D. Seminar in Qualitative Research Methods is a hands‐on review of the literature, tools, and strategies that inform a variety of qualitative researcher methods.  This course is intended to help prepare Ph.D. students across a wide range of disciplines related to information profession who are conducting, or may be contemplating, a qualitative study or thesis.",
    "goals": [
        "ocuses on the nature and uses of qualitative inquiry, including designing qualitative inquiry for library and information settings"
    ],
    "syllabus": "本課程旨在協助碩士班同學認識社會科學領域常用的質化研究方法，及其優缺點與限制，習得相關知識技能，並藉以規劃、執行質化研究。本課程除了綜合性介紹質化研究相關概念與理論之外，也希望同學們利用上課所學習到概念與方法，閱讀、分析、批判以質化方法撰寫的學術論文。透過理論與實作相互印證的方式，學習如何正確地操作質化方法，培養同學實際執行質化研究的能力。  \n \n\n本課程將會探討質化研究基本概論、研究問題形成、資料蒐集、資料分析、研究嚴謹度與研究倫理。首先，相對於量化研究的實證主義，質化研究背後的認識論主張個別詮釋以及知識脈絡的重要性。透過介紹不同典範的認識論，瞭解質性研究法的本質，讓同學利用不同的思考角度審視、並形成自己有興趣的研究問題。接著課程將會介紹不同的質化研究方法，如民族誌研究、觀察法、深度訪談等，說明不同方法是如何進行資料蒐集，而研究者在這幾個方法中所扮演的角色為何。最後，透過資料分析以及報告撰寫使同學實際進行操作，並完成研究。在這過程中，同學們也將學習如何貫徹質性研究嚴謹度與研究倫理。\n\n本課程的進行方式以老師講述與同學們參與及討論為主，老師會針對重要的理論與概念進行說明與補充。同學們則是負責1) 引言與導讀當週閱讀文獻；2) 利用理論概念引導相關的問題分析並帶領討論；3) 積極參與每週上課討論。此外每位學生必須在修課期間實際設計與執行一小型質化研究，依次繳交以下幾個小作業，包含研究主題、研究背景與目的、研究對象範圍與問題、文獻檢閱、訪談逐字與整理稿、初具學術格式的研究全文等作業。並在課程中與班級分享自己的研究，並學習評論、建議他人的研究設計、方法與成果。簡言之，本課程希望同學透過教材研讀、範例講義導讀、及質化研究計畫書擬定、資料蒐集分析、與質化研究論文的撰寫，充分理解並應用所學質化研究的設計與執行，以期提昇對於質化研究的素養與鑑賞能力。",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "實驗/實作",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 70,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 15,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 15,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}