{
    "year": 108,
    "term": 1,
    "name": "思考方法",
    "teachers": [
        "紀金慶"
    ],
    "department": "GU",
    "code": "02UG002",
    "credit": 2,
    "serial": 942,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 30
    },
    "schedule": [
        {
            "day": 4,
            "from": 6,
            "to": 7,
            "campus": "公館",
            "classroom": "理圖003"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本課程之教學目標在教導學生廣義之思考方法 (不限於一般之邏輯)，包含理論與實作，以提昇其思考、學習與問題解決能力，並運用思考於哲學、道德與一般推理。其內容包括：思考風格與模式、多元智能、思考歷程向度、問題爭議與討論、圖像化思考、心智圖法、理性情緒、道德思考、推理思考、批判性思考、創造性思考等。",
    "goals": [
        "養成主動思考之習慣",
        "養成關懷與正義之德行",
        "具備批判思考之智能",
        "具備創意思考之智能"
    ],
    "syllabus": "**第一周 柏拉圖的形上學思維與西方哲學開端(I)**\n\n**第二周 柏拉圖的形上學思維與西方哲學開端(II)**\n\n    柏拉圖的形上學思維，是西方理性思維的開端。\n\n    自柏拉圖的理性思維開始，西方文化開啟了一種面對生命的基本思維，將生命經驗區分出感官與超感官層次，捨棄感官層次，而通過一定抽離程度的理性方式去審視生命，從而抉擇價值理念。\n\n    柏拉圖的這種思維方式帶來正反兩面的文化影響，而直到現代世界，從尼采、沙特、海德格等一系列哲學家的努力，才逐漸開啟不同生命思維的浪潮。因此，在本學期的前兩周課程，我們選擇以柏拉圖做為開場，讓同學們去理解柏拉圖的基本思維模式，從而理解西方思維方法的原型。\n\n**第三周** **啟蒙時代**: **古典理性到近代理性的轉折點**\n\n    啟蒙時代在西方歷史上是一個重要的里程碑，挾帶著科學革命與工業革命的優勢，讓啟蒙思想的文化影響力貫穿到今日世界。\n\n    從思想史的發展看，尤其是啟蒙運動所操持的理念，以及基於這個理念所需、所附帶的方法論與知識論要求，至今仍是現代理性的重要骨架。那麼，啟蒙時代的理念為何？其在方法論與知識論的追求下產出什麼樣關於思維方法的要求？而這些思維方法又如何的不同於柏拉圖以來的思考方式？最後，作為一個現代人，我們如何重估近代思維方法所帶來的利弊兩面？這是我們在這周課程中所要積極探討的重要議題。\n\n**第四周** **近代理性主體思維的開端****:****笛卡兒****(I)**\n\n**第五周** **近代理性與主體思維的開端****:****笛卡兒****(II)**\n\n    笛卡兒，近代主體哲學之父。他在他所提出的方法論懷疑中，推出了｢我思，故我在。｣這個重要的近代思維起點、以及演繹法的方法論、知識論進路。\n\n    那麼，笛卡兒的｢方法論式的懷疑｣，其精神為何？而他的｢我思，故我在。｣又開起了什麼樣的近代思維模式？其對於現代文化的影響具有什麼樣決定性的影響？我們又當如何審度當中的優劣得失？這些問題將是我們在這周課程中所要一同思考的重要話題。\n\n**第六周** **近代理性與主體思維的里程碑****:****康德的****《****純粹理性批判****》****(I)**\n\n**第七周** **近代理性與主體思維的里程碑****:****康德的****《****純粹理性批判****》****(II)**\n\n    康德，近代理性與主體思維的里程碑，尤其是他在經典著作《純粹理性批判》中的許多重要觀點，除了更加確立現代思維方法與古典形上學思維方法的分界，同時更重要的是，他的思維方法也是後來西方思維方法不斷重新回頭檢視、繼承、或批判、或轉化的源頭。\n\n  可以說，若不理解康德，則我們無法理解現代思維方法的發展、以及眾多思維方法背後潛在對話的深層根源。\n\n  在本周的課程中，我們將探討康德的思維方法確立了什麼？而同時也遺留了什麼沒有解決的問題留待後人進一步追尋？\n\n**第八周** **邏輯實證論與卡爾波普的****｢****否證法****｣****的洞見與拘限****(I)**\n\n**第九周** **邏輯實證論與卡爾波普的****｢****否證法****｣****的洞見與拘限****(II)**\n\n    邏輯實證論是上個世紀 40年代在美國開始蓬勃發展的思維方法，而時至今日，其主要的思維綱領幾乎成了現代自然科學與社會科學的主流思想。\n\n    那麼，邏輯實證論發生的文化背景是什麼？其主要的理念為何？而同時期相繼發展起來的美國思維方法、例如卡爾波普的｢否證法｣與孔思的｢典範說｣是如何的針鋒相對卻又系出同源？這些思維方法本身是否亦有其侷限性？其限制為何？這些問題都是我們在這周課堂所要與各位同學一起思考的重要問題。\n\n**第十周** **胡賽爾的現象學精神****(I)**\n\n**第十一周** **胡賽爾的現象學精神****(II)**\n\n    胡賽爾，現象學的重要開端。無論是繼承或批判，他的現象學精神幾乎成了現代歐陸哲學的共同根源。\n\n    在思維方法上，胡賽爾更是開創了許多重新思考我們經驗、我們世界的嶄新方法，例如著名的｢現象學懸擱｣、｢現象學還原｣、｢本質直觀｣等等現象學手法。\n\n    那麼，這些現象學的思考方式的基本要領是什麼？其又帶來什麼樣嶄新的思想視野？尤其是很重要的，在今天的意義為何？這些問題是我們在這兩周課堂要與各位同學分享，並且一起思考、斟酌的方向。\n\n**第十二周** **從現象學到詮釋學**: **海德格的《存有與時間》****(I)**\n\n**第十三周** **從現象學到詮釋學**: **海德格的《存有與時間》****(II)**\n\n    海德格的《存有與時間》，被譽為二十世紀以來至今影響力最深遠的哲學經典。\n\n  在這本著作中，海德格嫁接胡賽爾現象學的思維手法，並重新改造詮釋學思想，形成海德格特殊的思維方法:｢詮釋學進路的現象學｣。\n\n  當海德格通過他的｢詮釋學進路的現象學｣重新返回拆解並鬆動西方古典形上學思維時，更是重新將理解我們世界、我們自身、我們與社會的關聯性等基本框架重新賦予了新的意涵。至今，海德格在《存有與時間》所開鑿出來的思想可能性仍是源源不斷的影響許多人文與社會領域的思想研究。\n\n  那麼，海德格的｢詮釋學進路的現象學｣的基本精神是什麼？其又為現代思潮帶來什麼樣嶄新的思想視野？海德格式的思維方法的潛能為何？將是這兩周課程的重點所在。\n\n**第十四周** **詮釋學精神****:****高達美的****《真理與方法》****(I)**\n\n**第十五周** **詮釋學精神****:****高達美的****《真理與方法》****(II)**\n\n    高達美，德國哲學家，成名作《真理與方法》自1 9 6 0年問世以來，影響所及幾乎涵括人文領域的各個層面。從高達美的成名著作《真理與方法》的內容看，有許多深刻的見解，尤其是對於現代思維的迷失所進行的針砭，對於我們思考現代文化的諸多盲點別有所助益。\n\n    特別值得一提的是，高達美也從他的詮釋學式的思維方式建立一種實踐哲學、行動哲學。我們知道現代社會同時也是一個兼容多元價值的世界，而多元價值也意味著彼此的差異與距離，在一個多元社會中如何建立共通價值理念成了問題，而缺乏共通理念，社會的整合也將流於分歧甚至衝突對立。因此，而高達美的「視域融合」的對話理念也在社會實踐上扮演一定個理論指引。最明顯的，莫過於曾經一度放棄哲學的哈伯瑪斯因為受到高達美的啟發，而重新回到哲學與社會學論述場域，試圖建立溝通行動理論的社會實踐。當然，這段思想發展的過程還包含很多精彩的插曲，例如哈伯瑪斯或主動或被動地引來後現代主義者的論戰外，最後甚至連高達美也被逼的出來與哈伯瑪斯論理，強調哈伯瑪斯的實踐哲學與他原先的堅持有許多關鍵上的不同。這當中的幾個思想轉折，都有助於我們如何思考多元對立的現代世界如何建立共通價值，這些問題將會在我們的課程中一一娓娓道來。\n\n**第十六周** **德希達的解構思想**\n\n    現代思維方法，往往具有相當的批判性、甚至是顛覆性，其中，解構思想也被視為是其中一支廣泛運用在人文、政治、宗教與文學領域的重要思潮。\n\n    然而，不同於許多受到德希達啟發的思潮運動，細讀德希達的文本讓我們發現，德希達思考的是更深層的解構，這種解構不是簡單的、消極性的反對或摧毀，德希達解構的真義是為了鬆動那些橫在我們與傳統之間的教條，因此積極性的解構則是企圖更進一步的希望將傳統之中被禁錮的理念釋放出來。\n\n    對德希達而言，解構的實際執行方式首先必須是一種字裡行間的細讀法，這種細讀法追蹤文本(德希達所指的文本也包含一切政治實踐)細節間的灰色地帶，無論原先作者有意識或無意識導向的結論，只要是形諸於論述，經由德希達的解讀過後，往往至少呈現文本內部兩種以上自身相互對反的邏輯，德希達如此逼使原著作者以及教條的追隨者放棄他們對於文本解讀的主宰地位，或是被逼出原作未曾到達的理念。\n\n    在這周的課堂裡，我們企圖為同學解析的就是德希達解構思維的魔力。\n\n**第十七周** **傅柯的系譜學精神**\n\n    在傳統型的社會批判中，進行社會批判的知識份子往往被設想成真理、正義的一方，而在對面的另一方則是充滿錯誤意識形態、必須被打倒的政治威權。\n\n    有別於此，有時法國哲學家傅柯的姿態更像是一個冷眼旁觀的思想家，他的｢系譜學｣往往連同正反兩方立場的形成背景檢視的一乾二淨，因此往往看到那些宣稱進步的理念以及有待被顛覆的意識形態其實包裹在一個更大的局裡頭，只是處在運動當中的兩造作為局中人沒有看到。\n\n    在本周的課程中，我們將通過介紹傅柯的系譜學精神，來與各位同學一同思考一個重要的批判思維議題: 何謂｢理性｣？何謂｢批判｣？而理性批判的運用時，我們應當思考的具體環節是什麼？\n\n**第十八周** **期末考**",
    "methodologies": [
        {
            "type": "講述法",
            "note": "由教師針對基本概念以及重要議題進行介紹"
        },
        {
            "type": "討論法",
            "note": "請學生針對理論的適用性以及當前文化經驗進行評估、論辯與討論"
        }
    ],
    "grading": [
        {
            "type": "期末考",
            "weight": 60,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 20,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}