{
    "year": 108,
    "term": 1,
    "name": "流行文化與亞際溝通",
    "teachers": [
        "蔡如音"
    ],
    "department": "GU",
    "code": "04UG022",
    "credit": 2,
    "serial": 976,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 5,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "誠302"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "This course introduces the concept of “inter-Asia” and its associated practices in connection with popular culture production, circulation, consumption, and meaning making in the regional and global contexts. Each week we will discuss a case study in which “inter-Asia” communication has been enabled. The case studies cannot encompass all of the dynamic interactions that take place in constructing and questioning “Asia.” The studies selected here, written by various “local” researchers in Asia, are meant to urge critical, creative, and empathetic thinking beyond economic globalization and cultural nationalism.",
    "goals": [
        "發現流行文化的跨國、跨區域、與跨社群動員力。",
        "發展去國族的亞際思維與意識。",
        "拓展自我作為亞際社會中的主體行動，譬如透過翻譯、論述、參與、社交、創作、連結、組織等嘗試"
    ],
    "syllabus": "每週針對一個亞際間透過流行文化進行公民溝通的例子。亞際間＝亞洲內部跨國、跨區域、跨社群的社會空間，可以是去國族、後國族，或是超國族的。交流的主體可能是公民、網民、組織內文化中介者、獨立文化生產人、閱聽人、迷群、或是各種新形成的身份主體與社群。\n\n**Calendar**\n\nWeek\n\nDate\n\nTopics/Reading\n\n1\n\n9.14\n\nIntroduction\n\n2\n\n9.21\n\nSoft Power Geometry in East Asia\n\n(1)   Chua, Beng Huat (2012). “Chap 7: Pop Culture as Soft Power.” In _Structure, Audience, and Soft Power in East Asia_. (Excerpt p.119-129).\n\n3\n\n9.28\n\nKorean Wave 1.0, 2.0\n\n(1)   Liew, Kai Khiun. “Chap 10: K-pop dance trackers and cover dancers: Global cosmopolitanization and local spatialization.” In _The Korean Wave: Korean Media Go Global_. (Excerpt p. 173-178).\n\n(2)  Mori, Yoshikata. “Winter Sonata and Cultural Practices of Active Fans in Japan: Considering Middle-aged Women as Cultural Agents.” In _East Asian Pop Culture: Analysing the Korean Wave_. (Excerpt p.135-140).\n\n4\n\n10.5\n\nNegotiating Visual Pleasure\n\n(1)   Ida, Rachma. “Consuming Taiwanese Boy Culture: Watching Meteor Garden with Urban Kampung Women in Indonesia.” _Popular Culture in Indonesia_. (Excerpt p.102-106)\n\n(2)  Deppman, Hsiu-Chuang. “Made in Taiwan: An Analysis of Meteor Garden as a East Asian Idol Drama.” _TV China_: _A Reader on New Media_. (Excerpt p. 98-104).\n\n(3)  Chow, Yiu Fai and Jeroen de Kloet (2011). “Blowing in the China Wind: Engagements with Chineseness in Hong Kong’s Zhongguofeng Music Videos.” _Visual Anthropology_ 24 (Excerpt p.68-72).\n\n5\n\n10.12\n\nDiscussion (1) Mixing Pleasure with Power\n\n6\n\n10.19\n\nInformal Economy and Distribution Power\n\n(1)   Kuotsu Neikolie (2013) “Architectures of Pirate Film Cultures: Encounters with Korean Wave in Northeast India. _Inter-Asia Cultural Studies_ 14.4 (2013): (Excerpt p.585-589).\n\n(2)  Srinivas, S.V. (2003) “Hong Kong Action Film in the Indian B Circuit.” _Inter-Asia Cultural Studies_ 4(1): (Excerpt p.40-46).\n\n(3)  Otmazgin, Nissim (2014). “A Regional Gateway: Japanese Popular Culture in Hong Kong” IACS 15.2 (Excerpt p.4-8).\n\n7\n\n10.26\n\nLabor in Popular Culture and Industries\n\n(1)   Choo, Kukhee. “Hyperbolic Nationalism: South Korea’s Shadow Animation Industry.” _Mechademia_ 9 (2014): (Excerpt. p150-155).\n\n(2)  Hu, Kelly. “Competition and Collaboration: Chinese Video Websites, Subtitle Groups, State Regulation and Market.” _International Journal of Cultural Studies_ 17.5 (2014): (Excerpt p.439-446).\n\n(3)  Yoon, Ae-ri. “In between the values of the global and the national: The Korean animation industry” (Excerpt p. 106-113)\n\n8\n\n11.2\n\nDiscussion (2) Popular Culture Economy and Industries\n\n9\n\n11.9\n\n**Midterm**\n\n10\n\n11.16\n\nLimit of Soft Power\n\n(1)   Sakamoto, Rumi and Matthew Allen (2007). “Hating ‘the Korean Wave’ Comic Books: A Sign of New Nationalism in Japan.” _The Asia-Pacific Journal: Japan Focus_. Excerpt (p.1-7).\n\n(2)  Bukh, Alexander. “Reception of the Revisionist Historical Manga in Japan: A Case Study of University Students.” _Inter-Asia Cultural Studies_ 13.4 (2012): (Excerpt p.627-634).\n\n(3)  劉昌德（2015）”國族主義的娛樂化與經濟邏輯：台灣媒體運動報導中「仇韓」與「仇中」言論的演變。新聞學研究 v. 122. Excerpt p.22-34。\n\n11\n\n11.23\n\nPolitics of ACG (Anime-Comics-Games)\n\n(1)   Fran Martin (2012) “Girls who love boys' love: Japanese homoerotic manga as transnational Taiwan culture,” _Inter-Asia Cultural Studies_, 13:3, (Excerpt p.365, 371-375.)\n\n(2)  Hjorth, Larissa et al. (2009) “Chap 14: Games of Gender: A Case Study on Females Who Play Games in Seoul, South Korea.” (excerpt) _Gaming Cultures and Place in Asia-Pacific_ (Excerpt p. 259-268).\n\n(3)  Silvio, Teri. (2006) “Chap 12: Informationalized Affect: The Body in Taiwanese Digital Video Puppetry and COSplay (Excerpt p. 195-198, 209-215).\n\n12\n\n11.30\n\nDiscussion 3: Gender, Technology\n\n13\n\n12.7\n\nIslam and Popular Culture Production in Indonesia\n\n(1)   Heryanto, Ariel, “Chap 1: Pop Culture and Competing Identities.” _Popular Culture in Indonesia: Fluid Identities in Post-Authoritarian Politics_. (Excerpt p. 11-21)\n\n(2)  Ida, Rachmah. “Polygamy and Islam in Indonesian Films.” In _Pop Culture Formations Across East Asia_. (Excerpt p. 67-77).\n\n14\n\n12.14\n\nNamawee, Malaysian Popular Culture, and National Imaginations\n\nExcerpt from 吳偉銓(2016) 【馬來西亞的國族想像與華人認同：探討黃明志作品中的政治意向】國立台灣師範大學大眾傳播研究所碩士論文。\n\n15\n\n12.21\n\nDiscussion 4:\n\n16\n\n12.28\n\nComplicating Multicultural Representations\n\n(1)   Screening: Bandhobi (2009)\n\n(2)  Jirn, Jin Suh. “Happy Seoul for Foreigners: Scenes from Multicultural South Korea.” _Inter-Asia Cultural Studies_ 15.2 (2015): 315-322.\n\n17\n\n1.4\n\nDiscussion 5: Dealing with stereotypes in popular culture\n\nBring an example\n\n18\n\n1.11\n\n**Final exam**\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=5b81c61dd8de4d1b8a95ea4dfb6fb988&fno=fa79cf99219c4e1cb83b245fd56e6809)",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "其他",
            "note": "為了促進正規教育中非正規經驗的流通，每週兩小時的上課時間主要將分成「師說、生說」兩個部分。在第一節課，我會將當週的指定閱讀提出關鍵字與討論主題，依照需要搭配相關影音網站資料促進思考。第二節課將時間給三到四位同學分享自己與當週關切的亞際位置（如印度、回教馬來西亞）與流行文化（如寶萊塢電影、國際運動賽事）的經驗連結。  期中與期末報告將用來發展「我的亞際溝通」（My Inter-Asian dialogue）行動。這可以是透過流行文化的傳遞、生產、消費結交亞際間內的社群，也可是利用亞際溝通的觀察與經驗進行微規模文化生產。"
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 25,
            "note": "November 9, 2016. Hand-written and typed essays in Chinese or English are accepted. The questions contain definition (e.g., cultural nationalism) and short essay questions that ask students to take a position on certain issues and give reasoning."
        },
        {
            "type": "期末考",
            "weight": 25,
            "note": "January 11, 2017. Final exams questions will be distributed a week in advance (on January 4, 2017). I will accept hand-written or typed essays in Chinese or English. The format is similar to the midterm."
        },
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": "There will be five discussion sessions following each sequence of lectures. During these sessions, students are expected to join groups and respond to issues and questions (e.g., weekly @stake) raised during the previous lectures."
        },
        {
            "type": "出席",
            "weight": 20,
            "note": "Show up on time. Turn off your mobile devices. Let me know in advance if you must be absent, late, or leaving early"
        }
    ],
    "prerequisite": "",
    "general_core": []
}