{
    "year": 108,
    "term": 1,
    "name": "東南亞文化與歷史概略",
    "teachers": [
        "廖弘民"
    ],
    "department": "GU",
    "code": "04UG033",
    "credit": 2,
    "serial": 983,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 4
    },
    "schedule": [
        {
            "day": 4,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "誠104"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "This is an introductory course on the history and culture of Southeast Asia. The aim of the course is to expand students’ understanding of Southeast Asia, exploring topics ranging from early kingdoms to some current issues faced by different southeast Asian countries. By the end of the course, students should have constructed a general understanding of Southeast Asia, be aware of the major similarities and differences among Southeast Asian countries, and have a better grasp of the varied and rich cultures of Southeast Asia.",
    "goals": [
        "習得東南亞文化、歷史概略",
        "經由主題討論、歷史事件解析與同儕合作學習"
    ],
    "syllabus": "This is an introductory course on the history and culture of Southeast Asia. The aim of the course is to expand students' understanding of Southeast Asia, exploring topics ranging from early kingdoms to some current issues faced by different Southeast Asian countries. By the end of the course, students should have constructed a general understanding of Southeast Asia, be aware of the major similarities and differences among Southeast Asian countries, and have a better grasp of the varied and rich cultures of Southeast Asia.\n\nThe course will be conducted entirely in English. Students will be required to participate in classroom discussions in English.\n\n選擇本課程的學生**應有優良的英語能力**（即能夠閱讀大學程度學術英語文獻、能與英語母語者自然、流暢且無障礙地溝通、討論）。英語程度不符前述的同學請慎重考慮。\n\nWeek 1. Introduction\n\nWeek 2. Exploration of Southeast Asia topics\n\nWeek 3. Overview of Southeast Asia\n\nWeek 4. Topic 1: Religion\n\nWeek 5. October 10 (No Class)\n\nWeek 6. Topic 1: Religion\n\nWeek 7. Topic 2: History & Culture - Indochina\n\nWeek 8. Topic 2: History & Culture - Indochina\n\nWeek 9. Midterm\n\nWeek 10. \"First they killed my father\"\n\nWeek 11. Topic 3: The Killing Field\n\nWeek 12. Topic 4. History & Culture - Nusantara\n\nWeek 13. Topic 4. History & Culture - Nusantara\n\nWeek 14. Topic 5 Contemporary Southeast Asia\n\nWeek 15. Topic 5 Contemporary Southeast Asia\n\nWeek 16. Excursion: Southeast Asia in Taiwan\n\nWeek 17 Final Discussion / Presentation\n\nWeek 18 Final Exam",
    "methodologies": [
        {
            "type": "討論法",
            "note": "This course will be discussion-intensive. Please be prepared to share your view."
        },
        {
            "type": "問題解決教學",
            "note": "This course will present issues and topics for in-class research and discussion."
        },
        {
            "type": "合作學習",
            "note": "Students are expected to collaborate with their peers in research and presentation."
        },
        {
            "type": "實地考察、參訪",
            "note": "Students are expected to make one excursion in this course."
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": "Grading will be discussed in class with students."
        }
    ],
    "prerequisite": "",
    "general_core": []
}