{
    "year": 108,
    "term": 1,
    "name": "邏輯思考與應用",
    "teachers": [
        "王銀國"
    ],
    "department": "GU",
    "code": "05UG001",
    "credit": 2,
    "serial": 984,
    "group": "A",
    "quota": {
        "limit": 150,
        "additional": 25
    },
    "schedule": [
        {
            "day": 2,
            "from": 8,
            "to": 9,
            "campus": "本部",
            "classroom": "誠101"
        }
    ],
    "programs": [],
    "comment": "當最多的通識課，請慎選！但有心想學，保證教到會(免費個別家教)。  授權碼優先給上學期平均3.7(A-)分以上的同學。    歡迎社會人士旁聽全國最簡單最實用的邏輯學。",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "邏輯學主要的發展至今已有兩千多年的歷史，是人類思考方法學中最基本也最重要的一種思考工具。各種千差萬別的環境背景、種族特性、語言型態…等差異性，卻皆以共同的邏輯思維形式及其規律結合各自不同的思想與經驗內容而成就了過去與現今各種族的文化與文明。邏輯學展現在古今中外各面向的思考、發展與應用。\n\n邏輯對於現今的人們而言，是一種非常重要的概念與能力，是一門關於思維形式及其規律的理性科學。現代的科技文明可以說是完全建構在邏輯之上的，一切科學的推演與證明，皆建立在嚴謹的邏輯論證基礎上，在各學門領域中，被廣泛的採用與應用，尤其是數學、哲學、法律、語言學、計算機科學、自然科學 … 等產生了非常重要的影響。因此，邏輯學可說是任何學科必備的基本工具，它包含了所有科學的基本觀念和原理，掌握了邏輯便掌握了一切知識學問中最根本、最重要的一半。所以，邏輯學在眾學科中處於特別基礎的地位，聯合國教科組特別把邏輯列為眾學科之首，而歐美各國也把邏輯列為必須加以研修的傳統。邏輯學可幫助任何人進行正確思維、嚴謹的論證推理來認識自然客觀事物、獲取新知識以及表達思想交流，並進一步的掌握與理解自然科學的精髓與真理。尤其是對正在學習各種知識的學生更加來得迫切需要。\n\n本課程的教學內容，盡可能的將形式邏輯符號，以日常生活有趣的邏輯問題或案例來作說明與解釋，使學生能容易理解明白。透過講述完整紮實嚴謹的思考方法學外，並透過課堂上的討論，讓學生有更細緻的思維能活用於日常事例中，能在攪盡心思的推理解謎過程中獲得刺激與無法言喻的成就感。有系統性的理解與日常有趣鮮明的邏輯事例，讓學生對邏輯推理論證方法或觀念能活用自如，並能對可能的思考陷阱能有相當的免疫力，進而使學生更懂得去懷疑，並自然而然地用更細緻、嚴謹的思考方法去批判日常生活中的想法與論證。透過此課程有趣且紮實學習，希望這些重要且基本的思考方法學（形式與非形式的）能成為學生終身受用的思考工具。",
    "goals": [
        "讓學生對基本邏輯學有個正確清楚的概念，建立健全的思考能力與有效論證的推理方法，進而使學生的思維更嚴謹，語言表達更準確、更有條理來論證自己的思想。",
        "培養學生有獨立的思考與推理能力，對日常生活的人、事、物能有合理的判斷與分析。除了能開發智力和提高工作效率外，更能快速地揭露謬誤和駁斥詭辯。",
        "透過本課程有系統的邏輯訓練與思考方法的學習，使邏輯學成為學生終身有利工具。幫助學生在未來研讀更高階的專業知識以及從事研究工作時，其學習與解讀能力更有效率，探討問題或探求新",
        "日常生活中，尤其是報章媒體到處充斥著似是而非的謬誤或詭辯，藉由煽情式、簡潔有力的語言以及豐富生動的肢體動作，來迷惑、愚弄、欺騙或甚操控一些未經深思熟慮或總是一相情願的習慣"
    ],
    "syllabus": "**第****1****週：****第一章 緒論**\n\n什麼是邏輯學；思維、語言和邏輯；邏輯學的性質和作用；學習邏輯的方法與意義。\n\n**第****2****週：****第二章 概念與定義**\n\n什麼是概念；概念的內涵和外延；概念的種類；概念外延間的關係。\n\n**第****3****週：****第二章 概念與定義**\n\n概念的概括和限制；定義的種類和方法；劃分的種類和方法。\n\n**第****4****週：****第三章 命題邏輯（複合命題及其推理）**\n\n命題和推理概述（句子、語句、命題；命題的形式及其種類；推理的形式、種類及其判定；複合命題的基本聯結詞）；聯言、選言命題及其推理（聯言命題及其推理；選言命題及其推理）\n\n**第****5****週：****第三章 命題邏輯（複合命題及其推理）**\n\n假言命題及其推理（充分條件命題及其推理；必要條件命題及其推理；充要條件命題及其推理；常見的假言命題推理）；否定命題及其推理（基本否定命題及其推理；否定複合命題的等值推理）。\n\n**第****6****週：****第三章 命題邏輯（複合命題及其推理）**\n\n複合命題的其他推理（二難推理；反三段論與歸謬式推理）。第四章 命題邏輯之有效性判定演繹推理的意義及特性；前提、結論與推理的關係。\n\n**第****7****週：****第四章 命題邏輯之有效性判定**\n\n重言式及其判定方法（真值形式與真值函數；重言式與推理有效的判定）；命題邏輯的有效論證判定方法（真值表方法；歸謬賦值法）\n\n**第****8****週：****第四章 命題邏輯之有效性判定**\n\n命題邏輯的有效論證判定方法：自然演繹法簡介（直接證法；條件證法；歸謬證法）；期中考預習考題的討論與演練\n\n**第****9****週：****期中考2小時（第一章～第四章）**\n\n**第****10****週：****第五章 邏輯的基本規律**\n\n同一律（同一律的要求與日常應用）；矛盾律（矛盾律的日常應用及其「悖論」）；排中律（排中律的要求與日常應用）；充足理由律（日常應用要求與作用，理由與原因）；邏輯基本規律間的關係。\n\n**第****11****週：****第六章** **詞項邏輯****（簡單命題及其推理）**\n\n引言（詞項邏輯與命題邏輯）；直言命題（直言命題的結構與類型；直言命題中詞項的外延性）；直言命題間的對當關係。\n\n**第****12****週：****第六章** **詞項邏輯****（簡單命題及其推理）**\n\n直言命題的直接推理（對當關係直接推理；命題變形直接推理）；直言命題的三段論（三段論的定義、結構及其公理；三段論的規則）。\n\n**第****13****週：****第六章** **詞項邏輯****（簡單命題及其推理）**\n\n直言命題的三段論（三段論的格與式；三段論的非標準形式）；關係命題及其推理（關係命題及其種類；關係命題的推理）。詞謂邏輯簡介。\n\n**第****14****週：****第七章** **模態邏輯與模糊邏輯****簡介**\n\n對模態邏輯與模糊邏輯的基本概念作簡單的介紹。並簡單戰事模態邏輯的幾個公理化系統：K S4 S5。\n\n**第****15****週：****第八章 歸納與類比推理**\n\n歸納邏輯概述；歸納推理（簡單枚舉法；科學歸納法；概率歸納與統計歸納推理）；探求因果聯繫的邏輯方法（因果關係的特點；求因果聯繫五法）。\n\n**第****16****週：****第八章 歸納與類比推理**\n\n類比推理（類比推理概述；類比推理的特性與作用）。第九章謬誤概述；謬誤概述及其種類；非形式謬誤簡介；不清晰謬誤（語詞歧義謬誤；語句歧義謬誤；斷章取義謬誤；非黑即白謬誤；分舉謬誤；合舉謬誤；稻草人謬誤）\n\n**第****17****週：****第九章****謬誤概述**\n\n不充分謬誤（以全蓋偏謬誤；以偏蓋全謬誤；因果的謬誤；統計歸納的謬誤；滑坡謬誤）；不真確謬誤（內定結論的謬論；複雜問語謬論；強詞奪理、胡攪蠻纏的謬誤）；不相干謬誤（轉移論點謬誤；訴諸無知的謬誤；訴諸強力謬誤；訴諸人身謬誤；訴諸情感謬誤；訴諸成見的謬誤；訴諸眾人謬誤；訴諸權威的謬誤；）；謬誤的避免\n\n**第****18****週：****期末考2小時（第五章～第九章）**",
    "methodologies": [
        {
            "type": "講述法",
            "note": "基本邏輯概念說明、形式邏輯推算演練、相關實際生活、新聞時事等來作邏輯例子進行論證與推理。"
        },
        {
            "type": "討論法",
            "note": "師生互相答辯推理、個別小組討論報告。"
        },
        {
            "type": "問題解決教學",
            "note": "邏輯推算演練問題、學生學習檔案和作業、個別學習心得和意見、日常生活新聞時事等邏輯相關問題等，一切都為課外討論，由教學助教上網與學生互動交流討論並解答，若有艱澀、叼鑽、語意不清或模稜兩可問題之情形，則教學助教與老師討論，老師並於課堂上予以討論與澄清，且將討論問題的結果以及建議的延伸閱讀資料立即公布於課程網頁中。老師將上網觀察助教與學生的討論互動，以評量其表現，並給予意見。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 15,
            "note": "按主題的各種邏輯類型例子，舉出日常生活有趣的類似例子，以正確為基本分數，舉的例子盡量要與現今學生生活上有所關連，所舉或論述的例子越妙越絕越有趣，分數越高。"
        },
        {
            "type": "期中考",
            "weight": 35,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 35,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 15,
            "note": "平時表現、網頁問答交流與出席率共15 %。（缺席5次(含)以上者，期末扣考並視為不及格）"
        }
    ],
    "prerequisite": "",
    "general_core": []
}