{
    "year": 108,
    "term": 1,
    "name": "中國經典文學閱讀：古典與現代",
    "teachers": [
        "王思韻"
    ],
    "department": "GU",
    "code": "0HUG248",
    "credit": 2,
    "serial": 1056,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "誠202"
        }
    ],
    "programs": [],
    "comment": "授權碼發放限大四或延畢同學。",
    "restrict": "◎國文系（學）不得選修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "This course comprises the readings of both the classic and the modern Chinese literature, which involves the genres of poetry, drama, fiction, and short story. The class is directed mainly by lectures, with the emphasis on the analysis of the major aspects of literature such as theme, characterization, structure, etc. Through the exploration of Chinese literary masterpieces, this class hopes to provide a general comprehension of Chinese culture and society out of the trajectory of Chinese literature. The class language is English.\n本課程主要以閱讀著名的中國文學作品為主，內容包括詩、小說、戲劇、短篇等。授課內容主要以講授為主，討論為輔，將探討分析文學中的重要要素。本課程期望藉由中國經典文學的閱讀，俾使學習者能對中國文化與社會有更多認識與了解。本課程以全英語授課。",
    "goals": [
        "本課程期藉由探討文學作品的歷史與文化背景，提供國際學生認識中國文學的代表著作。",
        "藉由使用英語分析與探討中國文學的過程，加強在地學生對中國文學的學習，並予其以英語表達自身文學的學習經驗。",
        "分析文學作品作者與其展現的中華文化與價值，並學習用文學的角度與工具對其加以分析，以達更深度的文學賞析。"
    ],
    "syllabus": "**Week**\n\n**Date**\n\n**Topic**\n\n1\n\n9/11\n\nClass Orientation\n\n2\n\n9/18\n\nThe History of Chinese Literature\n\n3\n\n9/25\n\nShijing (Book of Songs)\n\n4\n\n10/2\n\nTang Poetry: High Tang Poetry\n\n5\n\n10/9\n\nTang Poetry: Middle Tang Poetry\n\n6\n\n10/16\n\nTang Poetry: Movie: Legend of the Demon Cat\n\n7\n\n10/23\n\nSong Poetry: From Li-Yu to Su-shi\n\n8\n\n10/30\n\nSong Poetry: The female poet, Li Ch'ing-chao\n\n9\n\n11/6\n\nChinese Folklore: \"Tale of the White Snake\" \n\n10\n\n11/13\n\nChinese Folklore: \"Tale of the White Snake\" (Movie: White Snake)\n\n11\n\n11/20\n\nChinese Classic Drama: Yuan Dynasty, Guan Han-qing, Snow in Midsummer (Injustice to Dou E)\n\n12\n\n11/27\n\nClassic Fiction, Ming Dynasty: Journey to the West\n\n13\n\n12/4\n\nThe Monkey King 2 or\n\nModern Writer: Eileen Chang, Love in a Fallen City\n\n14\n\n12/11\n\n**\\*Group Presentations (1st half of the groups)**\n\n15\n\n12/18\n\n**\\*Group Presentations (2nd half of the groups)**\n\n16\n\n12/25\n\n**Review & Discussion**\n\n17\n\n1/1\n\nNew Year’s Day (day off)\n\n18\n\n1/8\n\n**Final Exam**\n\n\\*All the above activities might be subject to change.",
    "methodologies": [
        {
            "type": "講述法",
            "note": "The class is directed mainly by lectures, with the emphasis on the analysis of the major aspects of literature such as theme, characterization, structure."
        },
        {
            "type": "討論法",
            "note": "Class discussions are encouraged."
        },
        {
            "type": "媒體融入教學",
            "note": "The class will be assisted with PowerPoint slides. Movies and other media support will be used during the class."
        }
    ],
    "grading": [
        {
            "type": "期末考",
            "weight": 40,
            "note": "There will be a final exam for this course. The formats of the exam will be informed one week before the exam date. Students are required to verify the time and location of the written test. There will be no make-up exams for the exam, expect for medical emergencies."
        },
        {
            "type": "出席",
            "weight": 20,
            "note": "If students miss more than 3 classes, your grade for class participation is likely to be affected. Absence from the class is expected to take the official leave on the school online system."
        },
        {
            "type": "報告",
            "weight": 40,
            "note": "There will be an oral presentation in a group basis, to be scheduled the two weeks before the final exam date. The time for each group is 15-20 minutes. You are asked to time your presentation accordingly, and overtime will have a penalty of 10% off for the grade. If any equipment is required, you will have to prepare and set it up before your presentation. The topic is suggested to be Chinese literature related."
        }
    ],
    "prerequisite": "",
    "general_core": []
}