{
    "year": 108,
    "term": 1,
    "name": "自主學習（一）",
    "teachers": [
        "胡衍南"
    ],
    "department": "GU",
    "code": "0SUG529",
    "credit": 1,
    "serial": 4635,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 0
    },
    "schedule": [
        {
            "day": 0,
            "from": -1,
            "to": -1,
            "campus": "",
            "classroom": ""
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎第一階段需人工加選◎第二階段需人工加選◎加退選階段需人工加選",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 1,
    "description": "為鼓勵學生自主學習，培養跨域探索及終生學習之精神，學生得依據不同學習狀態及需求自主規劃學習方案，由個人或團隊自主規劃至少18小時之自主學習課程並提出學習計畫書，經審核通過後實施。本課程期許透過學生自行規劃與實踐學習方案的過程，激發學生自主、多元的學習能力。",
    "goals": [
        "促使學生能確立大學目標並培養良好的主動學習動機與方法。",
        "使同學探究大學之生涯規劃，以便日後大學生涯目標之訂定與實踐。"
    ],
    "syllabus": "第一週：劇本討論與主題擬定（三小時）\n\n本週課程主要是讓學生可以以共同寫作的方式，以本學期課程的成果——動畫為主題，藉由彼此靈感的激盪，讓學生可以以實作的方式訓練腳本寫作的技巧，亦可讓成員間的創意進行交流，藉此吸取彼此創作中的優點。\n\n第三週：樂器演奏技術和繪圖透視技術分享與交流（三小時）\n\n本週課程讓所有學生對於不同專業技術有興趣的同學進行分組交流，針對動畫製作所需要的音樂、美術素材製作上的技巧進行專業技術分享及練習，學生可以選擇自己有興趣的主題進行課堂參與。本週主題在音樂方面為樂器練習、美術方面為透視技術分享，前半課堂想讓同學在課堂上藉由彼此分享吸收相關知識，後半課堂為自由練習討論，藉由練習及交流發現自身的問題後，期待學生間能主動提問討論。\n\n第四週：各式劇本解析與討論（三小時）\n\n本週課程想藉由讓學生彼此分享自己喜歡的影視作品中的劇情，去討論這些作品的劇本中有何要素是會讓學生特別注意的、什麼樣的橋段或要素是讓學生印象深刻或是特別喜歡的，「什麼樣的劇本元素會受人注目、喜愛」將是此堂課的討論主題。\n\n第六週：劇本寫作技巧分享（三小時）\n\n本週課程延續上週的討論，此堂課希望學生將上週討論的結論實際運用到劇本寫作中，本週藉由讓學生以期末展演的動畫之腳本進行實際寫作，讓學生思考要用怎樣的寫作技巧才能讓想呈現的要素得以呈現在劇本中，並藉由寫作後的心得分享讓學生交流彼此的寫作技巧，讓學生彼此之間激發出新的啟發。\n\n第八週：期中劇本進度回報與討論（三小時）\n\n本週課程為期中前的成果小驗收，藉由讓同學分享目前的腳本寫作進度以初步驗收同學自主學習交流的成果，也讓對於動畫素材製作有興趣的學生可以選擇自己有興趣的腳本，以其他同學的動畫腳本為基礎，討論適合這些動畫腳本的音樂及美術素材，以利進行後續的素材製作。\n\n第十週：配樂與音效表現手法和繪圖構圖技術分享與交流（三小時）\n\n本週為素材製作相關專業技能的交流課程，一樣讓所以學生依照自己有興趣的專業技能進行分組交流，學生可以選擇自己有興趣的課程主題進行參與。本次的交流將以動畫素材製作為導向，讓學生決定好想要製作的動畫素材後，音樂專業部分針對樂曲cover演奏、美術部分針對素材所需的構圖技巧，讓學生進行討論與創作，期待學生可以累積實際的創作經驗，以及可以在創作過程中發現自身問題或是技術尚不足之處，藉由與同學的交流進行問題討論及經驗分享。\n\n第十二週：剪輯技術分享與交流（三小時）\n\n本週的專業技能分享交流以動畫後製需要的剪輯技術為主，在討論前先行準備練習用素材，讓學生藉由實際的操作練習動畫後製所需的剪輯技巧，並藉由彼此的成果分享及討論讓學生可以藉由彼此的經驗精進自身。\n\n第十三週：樂器與繪圖練習成果交流（三小時）\n\n本週課程為音樂、美術專業技能的成果交流，音樂方面希望同學可以以個人演奏或是樂團團練方式呈現自主學習交流中之練習成果。美術方面希望同學可以向其他人展示在自主學習交流中所創作之作品，並向大家說明創作理念及運用技巧等。\n\n第十五週：劇本成果交流與修正（三小時）\n\n本週課程將會請同學提出本學期中關於腳本的自主學習成果，包含各自的角色設計與腳本，並請同學互相提出對於彼此作品的建議與感想後，對各自的成果後進行最後的修正。\n\n第十六週：實作成果驗收與討論（三小時）\n\n本週課程為最後期末的成果驗收，將會驗收角色設計與基礎腳本等等內容。並且將會請同學間互相討論整個學期於劇本寫作時所遇到的難處與解決方法，並一同回顧整個學期的自主學習心得與內容做為收尾。",
    "methodologies": [
        {
            "type": "合作學習",
            "note": "使同學以專案小組的形式合作，並在創作專案作品的過程中獲得團隊合作的經驗與互相交流學習的成效。"
        },
        {
            "type": "實驗/實作",
            "note": "使同學在專案小組之中學習如何在團隊溝通中共同創作出一部動畫作品。"
        },
        {
            "type": "其他",
            "note": "學生依據不同學習狀態及需求自主規劃學習方法"
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": "學生依據不同學習狀態及需求自主規劃評量方式\n共同討論交流課程出席(20%)\n小組成果互評(40%)：將要求學生按組別提交出該組的作品後請各組進行成果互評。\n小組成員互評(40%)：將請學生進行組內互評，其評分標準將包含組員的分工、參與程度、貢獻度等"
        }
    ],
    "prerequisite": "",
    "general_core": []
}