{
    "year": 108,
    "term": 1,
    "name": "大學入門",
    "teachers": [
        "陳貞夙"
    ],
    "department": "GU",
    "code": "0SUG526",
    "credit": 2,
    "serial": 1098,
    "group": "G",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "特103"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大一修習◎限特教系（學）選修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "不同於高中以前的教育以升學考試主題主導學習內容，並且由教師傳遞標準答案，大學階段的知識探索強調打破時間和空間的界線，並著重由學習者自身的需求和問題出發，藉由體驗、反思、歸納和應用的持續學習，不斷檢視、更新和建構內在經驗與客觀知識的合理性。在持續學習的過程中，大學生一方面努力認識自己與所屬社會，也從中思考透過不同價值的社會行動，自身和環境將被帶往何處，進而確認自己存在的價值感。就像J. Krishnanmurti所說到的︰「教育的目的，在於免除人的恐懼。人越了解世界，越了解自己在這個世界中的位置，越能免於恐懼。」\n    但是，對剛踏入大學校園的學生來說，舉凡時間、壓力和情緒管理、多元學習策略的運用、弱勢關懷與社會實踐、生涯目標與實踐策略的擬定等議題，都是亟待他們一步步習得的重要知能。這時候如何跳脫以往高度控制與僵化的教與學框架，引導學生透過對真實生活現象的敏銳覺察，從中反思、歸納出各類重要人生道理，進而懂得在大學生涯中逐步習得、應用這些核心知能，乃是「大學入門」階段的重要課題。\n為此，本課程將以「認識環境、認識自己及規劃未來生涯」三大議題為主軸，帶領大家從認識師大周邊生活圈開始體察生活世界的重要議題，從群己動態關係中認識自己的價值觀、優缺點及長期累積的焦慮情緒。在自己及生活世界有基本了解後，再進一步運用社會教育系獨特的方案設計流程，從過往感興趣的事情中確立自己適合的生涯方向，並具體擬定可能實踐生涯目標的行動策略。\n    過程中，我們還會藉由邀請同學課堂成果展和期末學習計畫分享的方式，引導同學記錄成長軌跡和階段性成果，並透過課堂小組討論交流大家遭遇挫敗時的心情，彼此陪伴鼓勵。最後，為了讓同學們更清楚地認識社教系的專業實踐場域，我們也會相約大家都方便的時間，一同走訪侯硐礦工生態園區，希望藉此讓大家一次體驗社區營造、社會創新、成人教育、博物館、文化旅遊及故事行銷等等專業實踐的樣貌。\n    我們期盼透過上述多元議題的探討，可以燃起同學們對探索世界和問題解決的好奇心，形成持續發展自我與改善所屬社群生活的行動力，進而感受到「透過共學社群面對人生挑戰的美好」，而不用重蹈以往填鴨式和清談式教育的覆轍。甚至在未來大學生涯中如果遇到任何生涯困難，也都能勇於尋求周遭同儕的協力、連結並創造各類資源，一起將生涯危機轉化為成長的養分。具體而言，整套大學入門課程的參與，亦有助於社會教育系之成人創新學習規劃能力、社會文化事業推展能力及組織永續經營發展能力等核心能力的培養。",
    "goals": [
        "促使學生能夠確立大學目標並具備良好的學習動機與策略。",
        "讓同學們瞭解大學人際間交往、個人情緒管理等議題，協助其良好地適應大學生活。",
        "協助同學能在大學生活之初即能養成健康的生活態度。擁有希望的開始，才能讓大學的每一步都朝向自我實現的目標邁進。",
        "使同學瞭解大學之生涯規劃與就業準備方向，以便日後大學生涯目標之訂定與實踐。"
    ],
    "syllabus": "一、課程核心能力(配合校級基本素養與核心能力)：\n\n（一）溝通表達與團隊合作：\n\n1.能傾聽他人意見正確理解訊息，並運用適當的表達與溝通技巧闡述個人見解。\n\n2\\. 能進行有效分工並參與團隊討論，以達成團隊目標。\n\n（三）批判反思與人文涵養：\n\n1\\. 能以求真的態度運用理性思維分析問題、評斷證據以獲致結論。\n\n2\\. 能展現對人的尊重與關懷，並確立道德判斷的依據以處理多元價值衝突的議題。\n\n（五）科學思辨與資訊素養：\n\n2\\. 能分辨各種資訊媒體的功能與限制，並有效運用網路檢索資訊。\n\n（六）主動探究與終身學習：\n\n1\\. 能善用各種學習資源與管道，主動探究與學習新知。\n\n能體認終身學習的重要性，不斷充實各種知能，以因應與時俱進的環境需求。\n\n（七）創新領導與問題解決：\n\n1\\. 能運用創意與新思維，帶領團隊成員突破困境。\n\n2\\. 能系統剖析與探究問題，並運用有效策略解決問題。\n\n二、學習目標：\n\n1\\. 協助學生了解高中到大學的轉變，讓學生能盡快適應大學生活。\n\n2\\. 協助學生了解學校生活與學習輔導系統，以及建立學生資訊系統使用能力。\n\n3\\. 建立學生校園防災與安全意識、防災與安全教育。\n\n4\\. 引導學生覺察與規劃大學四年的學習與生活目標、建立目標實踐之行動策略與計畫，以完成大學目標。\n\n5\\. 協助學生建立適切的溝通、禮儀、人際互動、團隊合作之能力，讓大學生活與學習更順暢。\n\n6\\. 協助學生覺察個人情緒變化、建立適切情緒管理技巧，並教導使用本校心理輔導相關資源網絡。\n\n7\\. 認識特殊教育的專業以及職涯發展，包含與普通教育領域之接軌。\n\n8\\. 建立健康生活的態度，學習並實踐健康生活策略。\n\n三、課程內容(暫定)：\n\n週次\n\n日期\n\n課程內容規劃\n\n一\n\n9/11\n\n課程介紹、自我介紹( 我對大學生活的期待～！)\n\n班會，Ｍoodle系統使用 (教研中心師長)\n\n高中生到大學生—Are you ready!?\n\n二\n\n9/18\n\n認識特殊教育專業（1）--本系課程架構與專業標準 (本校特殊教育中心胡心慈主任)\n\n三\n\n9/25\n\n圓夢助學，有你真好(教官)\n\n四\n\n10/2\n\n師大生活安全遊(教官)\n\n大學生請假的權利與義務（請假系統教學）\n\n五\n\n10/9\n\n課堂活動(1): 大一階段該做的事\n\n小組討論與分享\n\n六\n\n10/16\n\n課堂活動(2):認識新生綜合症，紓解或預防方法有哪些？\n\n小組討論與分享\n\n七\n\n10/23\n\n學習與作業的大幫手：認識與體驗圖書館 （圖書館館員）\n\n認識著作權、如何避免抄襲\n\n八\n\n10/30\n\n講述：社群網路使用之個人資料的安全、倫理\n\n課堂活動(3)：書情話意（與同學、學長姐、系上老師、教學現場老師或家長互動時的溝通禮儀及書信範本設計、報告格式應包含的元素討論）\n\n九\n\n11/6\n\n邀請演講：自我覺察—走出自己的路 （通識中心師長）\n\n期末成果報告說明：分組、小組目標、行動計畫\n\n十\n\n11/13\n\n邀請演講：另一種可能—復健諮商所與身心障礙者的職涯發展（邀請復諮所吳亭芳老師）\n\n十一\n\n11/20\n\n邀請演講：壓力管理與學輔中心資源應用 （學輔中心賴思均心理師）\n\n十二\n\n11/27\n\n情緒管理\n\n邀請演講：自我情緒覺察與情緒管理技巧\n\n課堂活動(4)：我的情緒引爆點與降溫策略\n\n分組討論與分享\n\n十三\n\n12/4\n\n認識特殊教育專業(2)：我想成為什麼樣的老師。（暫定：松山工農 朱尹安 老師）\n\n專業、時尚、休閒的穿搭（暫定：本系邱春瑜老師）在面試、試教、班遊、報告、約會、跟長輩吃飯等不同場合時該怎麼搭配得體的衣著）、\n\n十四\n\n12/11\n\n講述：營養、運動與健康\n\n課堂活動(5)：柴米油鹽醬醋茶—怎麼吃才健康？（調查周邊餐飲特色，包括有哪些選擇？各項選擇的健康指數？考量價位、適合人數、是否有無障礙、與學校的距離、大眾運輸工具？）\n\n十五\n\n12/18\n\n講述：資訊正確性的判斷方式、工讀注意事項\n\n課堂活動(6)：信不信由你\n\n分組討論與報告\n\n十六\n\n12/25\n\n邀請演講：幸福向內看--走進朱芯儀的愛情診療室（學輔中心朱芯儀心理諮商師）\n\n講述：報告怎麼做？(word, pdf, ppt, poster, oral)\n\n十七\n\n01/01\n\n109年元旦放假\n\n01/8\n\n期末分享：我的大學生活與學習藍圖\n\n小組報告\n\n大一下學期選課策略與規劃（可先向學長姐請益）\n\n四、實施方法：\n\n1\\. 課堂討論\n\n2\\. 小組報告\n\n3\\. 演講\n\n五、評量方式：\n\n隨著課堂中個人、小組活動進行，針對課堂出席、課堂活動、小組報告，進行百分評分，評分項目與各項目佔比，說明如下。\n\n（一）評分項目說明：\n\n1\\. 課堂出席：由於本課程為選修課，多數活動又於上課期間進行，出席參與相當重要未出席當次小組討論成績為0。若需請假需於課前或課後（課程當天上課前須傳訊息給老師）上請假系統請假。\n\n2\\. 課堂活動36%：搭配課程有6次課堂活動，若需要額外搜集資料會在課堂中提供同學各組20-30分鐘準備報告(全班分享約20分鐘)。\n\n3\\. 對特教專業的認識10%：共有兩次，於課前每組先擬三個問題，小老師收集後交由演講的老師，請老師解惑，同學針對老師的講課，將三個問題所得到的回答寫下，上課時間做5分鐘分享，當次上課繳交書面文件。\n\n4\\. 大學藍圖19%：你對大學的期許是什麼?你在大學期間想要完成什麼目標?請找到有相似目標的小組成員，進行較為具體的討論，並於moodle討論區發表。學期末以海報形式發表。\n\n5\\. 演講心得 25%：本學期有五次演講，於時限內繳交心得每次5分。\n\n6\\. 個人專書報告 10％：為培養同學閱讀習慣，請於學期結束前讀完一本自己有興趣的書籍(主題不限）於moodle繳交一頁的讀書報告並在期末博覽會形式與同學進行分享。\n\n（二）評分等第對照參考：\n\n按照紀錄以Ａ～Ｆ給予等第，若皆完成將有Ａ，視個別表現酌予調整為A+或A-。\n\nＢ～Ｆ級請參考下列範例（範例中列舉可能影響成績的表現）。\n\nＡ+：課堂出席情況良好，10次課堂活動皆有參與討論或發表之紀錄，小組報告介紹其他學系時發表出色，小組目標具體且有挑戰性，全班專題提案及其他討論中展現領導能力。\n\nＡ：課堂出席情況良好，10次課堂活動皆有參與討論或發表之紀錄，小組報告介紹其他學系積極參與，個人專書閱讀報告完整，認真參與全班專題提案 。\n\nA-：課堂出席情況良好/缺席在兩次之內且能請假，10次課堂活動皆有參與討論或發表之紀錄（遇請假時會預先或者事後提供意見），小組報告介紹其他學系時能參與準備，組目標具體，認真參與全班專題提案 。\n\nＢ： 大致能完成A等第課程要求，但10次課堂活動有1至2次未留下參與討論發表之紀錄 或 有參與全班專題提案討論但較組員不積極。\n\nＣ：大致能完成Ｂ等第課程要求，但小組報告介紹其他學系或課堂活動時參與度較低 或 小組目標有繳交但不具體或不適切。\n\nＤ：大致能完成Ｃ等第要求，但課堂未出席情況超過兩次以上未請假，10次課堂活動超過3次沒有參與討論或發表之紀錄，小組報告介紹其他學系時參與度不高，或未參與全班專題提案討論。\n\nＥ：大致能完成Ｄ等第要求，但10次課堂活動超過4次沒有參與討論或發表之紀錄，小組報告介紹其他學系時未見參與紀錄，小組目標未繳交，或未參與全班專題提案討論。\n\nＦ（不及格）：課堂未出席情況超過三次且未請假，有超過一項作業未繳交或沒有參與證明。\n\n六、參考閱讀\n\n林幸台、田秀蘭、張小鳳、張德聰（2010）。生涯輔導。臺北市：心理。\n\n劉安婷（2014）。出走，是為了回家：普林斯頓成長之路。臺北市：天下文化。\n\n李麗君譯（2007）。做個成功學習的大學生：動機與學習自我管理（M. H. Dembo著）。臺北市：心理。\n\n章澤儀譯（2016）。優秀的綿羊。臺北：三采文化。\n\n七、上課相關規定\n\n1\\. 各節次的課程講義或投影片等教學公告事項，請參照教學平台http://moodle2.ntnu.edu.tw。\n\n2\\. 每堂課均以學習單或小考作為出席成績紀錄。為了保障同學的權益公假和事假需要當週課程之前提出假單、病假可以在次週補提上網登記才准假。 若未准假視為缺曠課，扣除當日出席成績。\n\n3\\. 上課時間禁止未經允許使用電子產品。若違反規定將每次扣除5分總分。\n\n4\\. 隨堂及期末作業請按時至教學平台繳交。遲交一週內補交分數以80%計算，一週後將不收作業。個人作業請勿抄襲。\n\n5\\. Email給老師時請注意標題格式: \\[大學入門\\]聯絡事項或繳交報告(組員或姓名)，並寄至chiuc@ntnu.edu.tw 作業若為附加檔請註明組員/同學姓名。",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": ""
        },
        {
            "type": "期中考",
            "weight": 10,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 20,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 10,
            "note": ""
        },
        {
            "type": "成果展覽",
            "weight": 10,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 10,
            "note": ""
        },
        {
            "type": "其他",
            "weight": 10,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}