{
    "year": 108,
    "term": 2,
    "name": "教師專業發展（IB）",
    "teachers": [
        "葉怡芬",
        "李秀芬"
    ],
    "department": "EU",
    "code": "IBUE003",
    "credit": 3,
    "serial": 3146,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "樸205"
        }
    ],
    "programs": [
        "國際教師學程-國際"
    ],
    "comment": "",
    "restrict": "◎第一階段限 國際教師學程-國際◎限國際教師學程-國際選修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course aims at preparing students to do continuing professional development (CPD) as well as stimulating deeper understanding of the professionalism of being a teacher. The importance of CPD in contemporary educational practices is acknowledged globally. In order to equip students with abilities to achieve better in this fast-changing world, education professionals can no longer teach knowledge but have to infuse high order thinking skills such as critical thinking and systems thinking in their teaching. Education Professionals such as teachers, and school leaders are required to be life-long learners so that they can improve the quality of their teaching practices, engage students in various learning activities and demonstrate that they continuingly expand their capacity as an individual and a professional.",
    "goals": [
        "Observe classrooms and practice interdisciplinary teaching.",
        "Understand the need and importance of CPD; understand various approaches to CPD.",
        "Apply certain approach of CPD;　understand how professional learning community works in schools.",
        "Understand the need and importance of CPD.",
        "Experiencing and reflecting good practices of CPD in schools"
    ],
    "syllabus": "**Weekly Schedule**\n\nWeek\n\nTopic\n\nAssignment\n\n\\[1\\] 3/6\n\nGlobal Education Reform Movement\n\n\\[2\\] 3/13\n\nOnline\n\nDevelopment of CPD and PLC\n\n\\[3\\] 3/20\n\nOnline\n\nDevelopment of CPD and PLC\n\n\\[4\\] 3/26 (Thurs.)\n\nVisit\n\n// PLC at Da-Yuan Int’ High School//\n\nPersonal AAR plan\n\n\\[5\\] 4/10\n\nOnline\n\n\\[Workshop by Dr. Graham\\]\n\n\\[6\\] 4/24\n\nOnline\n\n\\[Workshop by Dr. Graham\\]\n\n\\[7\\] 5/1\n\nOnline\n\nIB materials\n\n\\[8\\] 5/7 (Thurs.)\n\nVisit\n\n//PLC at Da-Yuan Int’ High School//\n\n\\[9\\] 5/8\n\nBook Sharing \\[1\\], AAR Progress\n\n\\[10\\] 5/14 (Thurs.)\n\nVisit\n\n//PLC at Da-Yuan Int’ High School//\n\n\\[11\\] 5/15\n\nBook Sharing \\[2\\], AAR Progress\n\n\\[12\\] 5/21 (Thurs.)\n\nVisit\n\n//PLC at Da-Yuan Int’ High School//\n\n\\[13\\] 5/22\n\nBook Sharing \\[4\\], AAR Progress\n\n\\[14\\] 5/29\n\nBook Sharing \\[5\\]\n\n\\[15\\] 5/30-5/31\n\nWorkshop\n\n\\[Thematic Workshop\\]\n\n\\[16\\] 6/5\n\nBook Sharing \\[6\\]\n\nAAR progress report\n\n\\[17\\] 6/12\n\nPLC case presentation I\n\n\\[18\\] 6/19\n\nPLC case presentation II\n\nCase Report due on 6/26\n\n**Class Rules**\n\n1\\. All the sessions are interactive, so your attendance and intellectual contributions are very important. Attendance for the workshops or related events is required.\n\n2\\. All the assignments need to be written in English. Please try your best to ensure all the outputs are grammatically correct and understandable. You will be demanded to re-write assignments or lose some points if the language doesn’t meet the benchmark.\n\n3\\. Make sure you are familiar with 1) Subject Guide and 2) From Principles into Practice. You can also access to MY IB for more documents.\n\n4\\. A good teacher is a life-long learner (open-minded and adaptive). Practice now and you can bring positive role models to your future students.",
    "methodologies": [
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "Sharing a book：You need to read a book that is related to educational leadership, pedagogy inquiry, or professional development. The book list will be offered. You will need to 1) write a 500-word book introduction, 2) post the introduction to the Moodle, 3) initiates the discussion with 3 questions and respond to each peer’s discussion thread, and 4) 1500-word short essay explaining how it inspires you or how you will apply that to your future teaching."
        },
        {
            "type": "專題",
            "weight": 30,
            "note": "Case Study：Each group needs to choose at least one PLC as their case study. They need to participate 3 meetings of the case PLC and take necessary field notes. Students also need to interview the PLC members with self-designed interview questions. Findings of how the PLC operates and key factors for successful PD need to be presented and each group needs to design and lead related discussions."
        },
        {
            "type": "其他",
            "weight": 30,
            "note": "Personal CPD plan：Individual student needs to design their personal CPD plan."
        }
    ],
    "prerequisite": "",
    "general_core": []
}