{
    "year": 110,
    "term": 2,
    "name": "旅客飲食行為研究",
    "teachers": [
        "麥康妮"
    ],
    "department": "AM31",
    "code": "SRM0111",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 46,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 0
    },
    "schedule": [
        {
            "day": 5,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "綜603"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course is designed to acquaint students with fundamental concepts and theories in the field of tourist food consumption and food tourism. A multidisciplinary approach will be adopted, which synthesizes relevant perspectives, including food consumption, hospitality and tourism, and sociology, to enable students to gain a thorough understanding of tourist food consumption. Various topics will be covered, such as globalization and food consumption in tourism, food tourism as a form of special interest tourism, food events, and cooking school holidays. Students will learn about best practices in the hospitality industry in both domestic and international contexts. Through a final project, students will have the chance to apply concepts and theories they have learned in a tourist food consumption / food tourism study.",
    "goals": [
        "Develop an interdisciplinary understanding of tourist food consumption behavior.",
        "Aware of the influence of globalization on food supply and tourist food consumption.",
        "Recognize the relationship among place, environment, and food.",
        "Understand the nature and importance of various types of food tourists.",
        "Acquire knowledge on the design of various food tourism activities.",
        "Apply the knowledge acquired into the development of a tourist food consumption / food tourism study."
    ],
    "syllabus": "**Course Topics & Schedule (by week):**\n\n1.  **Introduction to the Course** \n2.  **Why do we eat what we eat? – Food Consumption Behavior**\n3.  **Why are some people afraid of trying new food? -- Foodies and Food-related Personality Traits** \n4.  **What do tourists eat and why? -- Tourist Food Consumption Behavior (TFCB)**  \n5.  **Can we taste the world without leaving home? – Globalization, Glocalization, and Food Consumption in Tourism**  \n6.  **Who are food tourists? -- Food Tourists, Gastronomy/Food Tourism as a Form of Special Interest Tourism (SIT)** \n7.  **What can food tell us about a culture? – Food Tourism as a Type of Integrated Cultural Tourism** \n8.  **What can food tell us about a place? – Terroir, Milieu, Foodscape, and Slow Food Movement** \n9.  **Exploring culture through food** \n10.  **How to turn food into an experience? – Experiential Marketing** **\\+** **Food and Wine Events + Cooking School Holidays**  \n11.  **How to turn food into an attraction in destination marketing? (Part 1) – From Terroir into a Tourist Destination + Food and Wine Tourism Best Practices 1**  \n12.  **Can we eat more environmentally friendly? – Guest Talk**   \n13.  **How to turn food into an attraction in destination marketing? (Part 2) – The Supply Side of Food Tourism + Itinerary Planning and Organization + Food and Wine Tourism Best Practices 2** \n14.  **Food Photography, Food Porn, and Foodstagramming**  \n15.  **Food Photography** \n16.  **_Holiday – Prepare for Group Final Project_**  \n17.  **Group Final Project Oral Presentations** **\\*\\*\\***\n18.  _**Revise Presentation**_",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Introduce students to key concepts and theories through lecturing."
        },
        {
            "type": "討論法",
            "note": "Allow students to discuss issues and trends in the field through group discussion."
        },
        {
            "type": "合作學習",
            "note": "Enable cooperative learning (CL) through a final group project (Themed Food Tour)"
        },
        {
            "type": "實地考察、參訪",
            "note": "Provide students with the opportunity to experience or explore tourist food consumption behavior / food tourism through a field trip."
        },
        {
            "type": "媒體融入教學",
            "note": "Familiarize students with latest audio / visual materials relevant to studies in the field."
        },
        {
            "type": "專題研究",
            "note": "Introduce students to contemporary issues and best practices in the field through case studies."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "Group – Mini-task Presentation: Concepts or Theories"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "Food Story Sharing"
        },
        {
            "type": "出席",
            "weight": 25,
            "note": "Class Attendance & Participation"
        },
        {
            "type": "報告",
            "weight": 35,
            "note": "Group – Final Presentation: Designing a themed “Food Tour”"
        }
    ],
    "prerequisite": "",
    "general_core": []
}