{
    "year": 107,
    "term": 2,
    "name": "書報討論－科技應用管理（四）",
    "teachers": [
        "黃啟祐"
    ],
    "department": "HM70",
    "code": "IEM0388",
    "credit": 1,
    "serial": 1131,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 8,
            "to": 8,
            "campus": "本部",
            "classroom": "研討二"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 1,
    "description": "\tThe objective of goals：\n1.\tTo provide the latest professional knowledge in technological application management and enhance the level of research.\n2.\tTo discuss the professional method of research and help students do research.\n\n\tLearning Materials:\nWe’ll offer given reading materials in the course.\n\n\tGrading:\n1.\tPaper Presentation:  50%\nEvery student should present papers in the semester.\n2.\tClass Participation:  50%",
    "goals": [
        "瞭解全球科技管理研究與理論之最新發展"
    ],
    "syllabus": "The course aims to help Management of Technology (MOT) major students understand the most up-to-date trends of MOT research through reviews and presentations of selected papers from the leading SSCI indexed journals being listed below:\n\n1.          Cunningham, S.W., Kwakkel, J., 2011. Innovation forecasting: A case study of the management of engineering and technology literature. Technological Forecasting and Social Change 78, 346-357.\n\n2.          Dangelico, R.M., Garavelli, A.C., Petruzzelli, A.M., 2010. A system dynamics model to analyze technology districts\\` evolution in a knowledge-based perspective. Technovation 30, 142-153.\n\n3.          Dijk, M., Yarime, M., 2010. The emergence of hybrid-electric cars: Innovation path creation through co-evolution of supply and demand. Technological Forecasting and Social Change 77, 1371-1390.\n\n4.          Järvenpää, H.M., Mäkinen, S.J., Seppänen, M., 2011. Patent and publishing activity sequence over a technology\\`s life cycle. Technological Forecasting and Social Change 78, 283-293.\n\n5.          Phaal, R., O\\`Sullivan, E., Routley, M., Ford, S., Probert, D., 2011. A framework for mapping industrial emergence. Technological Forecasting and Social Change 78, 217-230.\n\n6.          Ringland, G., 2010. The role of scenarios in strategic foresight. Technological Forecasting and Social Change 77, 1493-1498.\n\n7.          Sørensen, F., Mattsson, J., Sundbo, J., 2010. Experimental methods in innovation research. Research Policy 39, 313-322.\n\n8.          Samila, S., Sorenson, O., 2010. Venture capital as a catalyst to commercialization. Research Policy 39, 1348-1360.\n\n9.          Shin, J., Park, Y., Evolutionary optimization of a technological knowledge network. Technovation 30, 612-626.\n\n10.      Tran, Y., Hsuan, J., Mahnke, V., 2011. How do innovation intermediaries add value? Insight from new product development in fashion markets. R&D Management 41, 80-91.\n\n11.      Wang, C.-H., Chin, Y.-C., Tzeng, G.-H., Mining the R&D innovation performance processes for high-tech firms based on rough set theory. Technovation 30, 447-458.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "實地考察、參訪",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "期末考",
            "weight": 40,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 40,
            "note": ""
        },
        {
            "type": "其他",
            "weight": 20,
            "note": "隨堂小考"
        }
    ],
    "prerequisite": "",
    "general_core": []
}