{
    "year": 107,
    "term": 2,
    "name": "服務業經營管理研究",
    "teachers": [
        "洪榮昭"
    ],
    "department": "HM70",
    "code": "IEM0096",
    "credit": 3,
    "serial": 1107,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 2,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "研討三"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "A service is a provider/client interaction that creates and captures value. Because a successful services provider/client relationship has a critical dependency upon a well-defined and functional relationship, this course will provide an overview of service management from an integrated viewpoint with a focus on customer satisfaction. The material will integrate operations, marketing, strategy, information technology and organizational issues.\n\n\nTherefore, the course aims to help MOT majored students in understanding the \"state of the art\" in service management strategies, develop an awareness of how information technology can enhance service firms' competitiveness, understanding the tools for analyzing and optimizing the service experience, understanding the operational processes for managing the service encounter to achieve internal and external customer satisfaction, and understanding the complexities associated with implementing change.\nand sustain competitive advantage. The course includes lectures, readings, case discussion, presentations, field visits, and term project.",
    "goals": [
        "協助學生瞭解服務業經營及管理之理論、進展與方法"
    ],
    "syllabus": "**1.課程大綱講解**\n\n首堂課程將說明本門課程整體規劃，與評分方式的講解。藉由師生共同討論的分事來安排課程的評分方式。\n\n**2.服務基礎理論與內涵**\n\n本週課程講授服務業基礎的相關理論，經由基礎理論讓修課學生更能了解服務業的歷史演進與其核心價值。\n\n**3.服務業與管理程序之概念**\n\n本週授以管理程序為核心來服務業經營模式的理論與案例，並請學生下週蒐集並報告新興的服務業經營管理程序的案例。\n\n**4.新興的服務業經營與管理程序的案例分享**\n\n本週請學生報告新興的服務業經營管理程序案例分享，並與學生互相針對案例進行探討與反思。\n\n**5.服務業經營的ＳＷＯＴ分析**\n\n本週授以服務業經營案例的ＳＷＯＴ分析，並請學生下週蒐集並報告近期新興的服務業經營與４Ｐ的案例。\n\n**6.服務業經營的ＳＷＯＴ分析案例分享**\n\n本週請學生報告新興的服務業經營案例的ＳＷＯＴ分析，並請學生互相針對案例進行探討與反思，激盪出不同的想法。\n\n**7.服務業與４Ｐ之概念**\n\n本週授以服務業為核心來探討４Ｐ（價格price，產品product，促銷promotion和地點place），並請學生下週蒐集並報告近期新興的服務業經營與４Ｐ的案例。\n\n**8.新興的服務業經營與４Ｐ的案例分享**\n\n本週請學生報告新興的服務業經營與４Ｐ的案例分享，並請學生互相針對案例進行探討與反思。\n\n**9.服務業與人力資源管理之概念**\n\n本週授以瞭解人力資源管理的選才、訓才、育才、用才、留才對服務業的重要性與案例。\n\n**10.服務業與人力資源管理的案例分享**\n\n本週請學生報告服務業與人力資源管理之案例分享，並請學生互相針對案例進行探討與反思。\n\n**11.服務業經營與消費者行為（一）**\n\n本週課程將講解消費者行為的基礎概念。\n\n**12.服務業經營與消費者行為（二）**\n\n本週課程將講解消費者行為的進階概念與案例。\n\n**13.專題報告討論**\n\n本週課程將針對學生本次課程的期末研究報告進行進度討論，並提供修正意見。\n\n**14.專題報告討論**\n\n本週課程將請學生針對上週所提供的修正意見，檢視其修正情形再次進行討論。\n\n**15.服務業經營與消費者行為的案例分享**\n\n本週請學生報告服務業經營與消費者行為之案例分享，並請學生互相針對案例進行探討與反思。\n\n**16.服務業與企業社會責任**\n\n本週課程將講解服務業與企業社會責任的關係與案例分享，並請學生下週蒐集並報告近期服務業與企業社會責任的案例。\n\n**17.專題報告（一）**\n\n在最後二堂課，將安排學生進行服務業經營的專題之發表，發表形式採簡報、海報張貼、多媒體影片模擬展示等，其餘學生就其專題報告給與回饋與建議，用此來檢視本課程學習成效。\n\n**18.專題報告（二）**\n\n在最後一堂課，將將安排學生進行服務業經營的專題之發表，發表形式採簡報、海報張貼、多媒體影片模擬展示等，其餘學生就其專題報告給與回饋與建議，用此來檢視本課程學習成效。最後並針對這兩週的成果發表，提出綜合性的回饋建議。",
    "methodologies": [
        {
            "type": "討論法",
            "note": "在課堂中，教師引導學生針對每週課程主題進行練習，並就各項練習結果進行分享與討論。"
        },
        {
            "type": "實驗/實作",
            "note": "於學期末讓學生就本學期所學，撰寫成果報告。"
        },
        {
            "type": "專題研究",
            "note": "於課程中，學生應就現有之服務業與其經營概念，進行市場比較分析，並將分析結果回饋於期末專題報告中。"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "師生互動之討論參與程度作為評分參考。"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "本課之出缺席情形將作為本項評分參考。"
        },
        {
            "type": "專題",
            "weight": 70,
            "note": "以服務業經營來進行專題報告。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}