{
    "year": 107,
    "term": 2,
    "name": "代間共學發展與研究",
    "teachers": [
        "王雅鈴"
    ],
    "department": "EM02",
    "code": "SOC8007",
    "credit": 3,
    "serial": 455,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 2,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "教710"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "臺灣已進入高齡化社會，並衍生許多社會、經濟與教育問題，包括如何解決老年獨居、提升高齡者生活品質以及增進高齡者學習機會及動機，都是目前台灣社會相當重要且值得專家學者投入解決的問題。另一方面，青年世代知識與科技更新日新月，無形中更加速了世代之間思維與觀念落差加劇的現象，更甚者造成家庭與代間隔閡擴大。因此，「代間共學」成為目前高齡學習領域重要的發展與研究趨勢，然而，來自不同世代的個體，如何共處與共學，並貢獻自己所知以幫助彼此成長，同時也能滿足自己的需求，進而共學同樂以及經營正向互動關係將是本課程終程學習重點。\n本課程首先廣泛介紹與定義代間共學之發展與趨勢，進而深入討論代間共學發生的契機與潛在問題(包含世代需求差異及共老共榮模式)，最後介紹目前代間共學研究設計技術與分析方法(例如：遊戲式學習、行為模式與對偶資料分析等)。期待透過本課程學習能幫助學生瞭解代間學習之發展與趨勢，並進一步促進青銀世代的正向互動品質與學習成效，達到跨世代共榮共好之願景。",
    "goals": [
        "幫助學生瞭解目前代間共學相關研究發展與趨勢，並熟悉代間研究方法與研究設計",
        "幫助學生瞭解目前台灣代間共學之實務方案",
        "促進青銀世代正向互動關係與共學成效，達到跨時代共榮共好之願景"
    ],
    "syllabus": "**教學週數與學習重點**\n\n**學習主題**\n\n**參考文獻**\n\n**W1-W5**\n\n**代間共學之相關理論與研究發展**\n\n1.  代間共學、代間學習、青銀共學、混齡學習之相關界定\n2.  跨世代共老共榮模式與相關研究\n3.  代間共學之學習歷程、策略與方案成效\n\n陳毓璟(2014)。代間學習策略融入社會老年學之學習歷程與成效研究。教育科學研究期刊，59（3），1-28。\n\nGlass, A. P., & Vander Plaats, R. S. (2013). A conceptual model for aging better together intentionally. _Journal of Aging Studies, 27_(4), 428-442. doi:10.1016/j.jaging.2013.10.001\n\nMaureen Tam (2014). Intergenerational Service Learning Between the Old and Young: What, Why and How. _Educational Gerontology_, 40, 401–403.\n\nShort-De Graff, M. A., & Diamond, K. (1996). Intergenerational program effects on social responses of elderly adult day care members. _Educational Gerontology, 22_, 467-482.\n\n**W6-W7**\n\n**代間需求差異之探討**\n\n1.  自我決定理論/心理需求理論\n2.  青銀世代的需求差異\n\nDeci, E. L., & Ryan, R. M. (2000). The \"what\" and \"why\" of goal pursuits: Human needs and the self-determination of behavior. Psychological Inquiry, 11(4), 227-268. doi: Doi 10.1207/S15327965pli1104\\_01\n\nHewett, M. (2014). _Developing a board game to facilitate the relationship between older people and young adults._ Master Dissertation. Clinical Psychology. North-West University.\n\nHewett, M., Roos, V., & de Klerk, W. (2016). The Development of a Board Game as Intergenerational Intervention: Secondary Analysis of Data from the Mmogo-method. In R. V. (Ed.), _Understanding Relational and Group Experiences through the Mmogo-Method_: Springer, Cham.\n\nReis, H. T., Sheldon, K. M., Gable, S. L., Roscoe, J., & Ryan, R. M. (2000). Daily well-being: The role of autonomy, competence, and relatedness. _Personality and Social Psychology Bulletin, 26_(4), 419-435.\n\n**W8-W11**\n\n**代間共學新面貌與應用**\n\n1.  共學共樂：遊戲式學習/社交性桌遊\n2.  數位學習與網路媒介之應用\n3.  實務探討(W11)：代間共學機構參訪或專家講座\n\nAl Mahmud, A., Mubin, O., Shahid, S., & Martens, J. B. (2010). Designing social games for children and older adults: Two related case studies. _Entertainment Computing, 1_(3), 147-156.\n\nKaplan, M., Liu, S., & Hannon, P. (2006). Intergenerational engagement in retirement communities: A case study of a community capacity-building model. The Journal of Applied Gerontology, 25(5), 406-426.\n\nPlass, J. L., Homer, B. D., & Kinzer, C. K. (2015). Foundations of game-based learning. Educational Psychologist, 50(4), 258-283.\n\n**W12-W16**\n\n**代間學習方案與研究設計**\n\n*   研究設計\n\n1.  跨階層研究設計 (Multilevel research design)\n2.  主動、伴侶相依模式(Actor-Partner Interdependence Model, APIM)\n\n*   互動資料分析\n\n1.  互動向度編碼系統\n2.  學習行為模式分析\n3.  對偶資料(dyadic data)\n\nCampbell, L., & Kashy, D. A. (2002). Estimating actor, partner, and interaction effects for dyadic data using PROC MIXED and HLM: A user-friendly guide. _Personal Relationships, 9_, 327-342.\n\nCook, W. L., & Kenny, D. A. (2005). The actor-partner interdependence model: A model of bidirectional effects in developmental studies. _International Journal of Behavioral Development, 29_(2), 101-109.\n\nCsikszentmihalyi, M., & Larson, R. (1987). Validity and reliability of the Experience-Sampling Method. _The Journal of nervous and mental disease, 175_(9), 526-536.\n\nCsikszentmihalyi, M., & Rathunde, K. (1992). The measurement of flow in everyday life: Toward a theory of emergent motivation. _Nebraska Symposium on Motivation. Nebraska Symposium on Motivation, 40_, 57-97.\n\nHou, H. T.(2015). Integrating cluster and sequential analysis to explore learners' flow and behavioral patterns in a simulation game with situated-learning context for science courses: a video-based process exploration, Computers in Human Behavior, 48, 424-435.\n\nHou, H. T.(2012). Exploring the behavioral patterns of learners in an educational massively multiple online role-playing game (MMORPG), Computers and Education, 58, 4, 1225-1233.\n\nKashy, D. A., & Kenny, D. A. (2000). The analysis of data from dyads and groups. In H. T. Reis & C. M. Judd (Eds.), _Handbook of research methods in social and personality psychology_ (pp. 451-477). New York: Cambridge University Press.\n\nKenny, D. A. (1996). Models of interdependence in dyadic research. _Journal of Social and Personal Relationships, 13_, 279-294.\n\nKline, G. H., Julien, D., Baucom, B., Hartman, S., Gilbert, K., Gonzales, T., & Markman, H. J. (2001). _The manual of The Interactional Dimensions Coding System-Problem Discussion_: University of Denver.\n\n**W17**\n\n研究設計指導(one-on-one discussion)\n\n**W18**\n\n期末總報告",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 35,
            "note": "**Paper Reading**\nThis assignment will be marked as collaborative or group-based. Students must work with the other members in the group including hosting discussion or presenting in class. Each group is required to select a topic related to intergenerational learning and review latest research papers for class discussion."
        },
        {
            "type": "出席",
            "weight": 30,
            "note": "Attendance is required. Repeated failure to attend lectures or discussion may result in a lowered semester grade. Participation in class discussions also counts. \n\nStudents will be required to complete a review and raise a question regarding weekly topics before class. In doing so, students will earn points each week for their contributions to class discussions.\n\nExamples: \n\t2~3(points)*5(Reading Previews) = 10~15 points\n\tRaising one good question or discussion will earn 1 extra point. For example, if you participate in class discussions 10 times thorough the whole semester, you will get 10 points."
        },
        {
            "type": "成果展覽",
            "weight": 35,
            "note": "Each student is required to propose his research ideas or questions and discuss with the lecturer during the midterm week. Research topics may focus on relevant theories or methods in the fields of intergenerational learning. Please submit the abstract onto MOODLE in the 16th week and be prepared to share them at the end of the semester. \n\nTry to limit the abstract to a short paragraph (about 300 words) and prepare for a 10-15 min presentation. Each abstract and presentation will be graded based on clarity, coherence, relevance, and originality."
        }
    ],
    "prerequisite": "",
    "general_core": []
}