{
    "year": 107,
    "term": 1,
    "name": "繪畫與電影專題研究：畫布與銀幕之間",
    "teachers": [
        "諾斯邦"
    ],
    "department": "T",
    "code": "T0C8001",
    "credit": 3,
    "serial": 2993,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 2
    },
    "schedule": [
        {
            "day": 2,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "教室於藝史所教室",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "繪畫長期以來都是詮釋真實和創造虛構的重要媒介，但在1895年，法國盧米埃和美國愛迪生發明了動態影像，從此打開了全新的視野。本課程主要探討電影與繪畫的各種關係，包括從基本的媒材差異，到再現物體的相似性。從畫家雷諾瓦和他當製片的兒子在藝術上的互動，我們會發現他兒子並未用電影直接模仿繪畫，但卻有一些相似和呼應關係。\n本課將會提供繪畫與電影媒材比較的不同觀點。第一，藝術史需要新的研究方法來探討電影。我們注意到藝術及電影的研究正在增加，這使我們必須用新的觀點來探討這兩種媒材。例如今天要談印象派畫家捕捉光影瞬間的畫作，就不能忽略運用連續攝影的法國攝影家Marey和英國的Muybridge。類似的原則也出現在竇加畫舞者及裸體像，還有莫內畫車站風景、白楊樹、大教堂和乾草堆，他們的手法也和當時的電影實驗有關。第二，若將電影視為繪畫的繼承，有助於理解西洋藝術累積數世紀的圖像傳統。從這個角度來看，電影沿用了許多繪畫的操作手法，並藉此獲得與繪畫同等的藝術地位。電影導演用這種做法，讓他們的作品不再被認為只是一種娛樂方式。這項策略出現在希區考克和Fritz Lang等一些同代導演。我們也會分析這個想法如何延續到1960年代的安東尼奧尼以及法國新浪潮電影，乃至於今天的Peter Greenaway和大衛·林區。第三，經過前兩項的討論之後，我們便能進一步探討電影對20和21世紀藝術的重要性。電影從一開始就是新的美學指引，並深切衝擊了當時的藝術家。例如，我們可以從達達主義和超現實主義的作品中，看到電影的影響，像是西部電影如1903年的《火車大劫案》，以及黑幫電影如1913年法國導演Louis Feuillade的Fantômas。在1960年代，演員和電影的流行形象形塑了美國和歐洲的普普藝術，而當代藝術家如Cindy Sherman、Jeff Wall、Stan Douglas和Pierre Huyghe至今仍在他們的作品中呼喚和質疑影像。\nPainting has been for a long time the privileged medium for transcribing reality and inventing fictions, but the inventions of the Frères Lumière and Thomas Edison in 1895 opened new perspectives. This course attempts to show the different relationships between painting and cinema from their fundamental difference to their intimate similitude. As the filiation between the painter Pierre-Auguste Renoir and his son the filmmaker illustrates, we do not find in the movies of Jean Renoir an imitation of the art of painting, but similarities and echoes. I. Several points of views will be proposed. First, there is a need to outline the new theoretical interest for cinema in art history. We notice that an increasing numbers of studies are now dedicated to film and art. It forces us to reconsider both mediums under a new light. For example it is now impossible not to take into account the works of Impressionism and their quest of instantaneity and movement without the context of the experimentations of Marey and Muybridge. The principles of series which appear for example in Degas’ Dancers and Nudes, and especially in Monet’s Railway Stations, Poplars, Cathedrals and Ricks are connected with the cinematic experimentations of that time, too. II. Secondly, it is helpful to consider cinema under the heritage of painting, which constructed the western imaginary during several centuries. In this respect it appears that the multiple references with painting made in film seem to legitimate the respectability of cinema. In quoting such a prestigious medium as painting, directors want to demonstrate their legitimacy as authors: thus their movies cannot be considered only as a means of entertainment. This strategy appears with the films of the generation of Fritz Lang and Alfred Hitchcock and we will see how to analyze this heritage perpetuated in the 60’s by Michelangelo Antonioni and the French Nouvelle Vague or today by Peter Greenaway and David Lynch. III. Finally it will be fruitful to assess the importance of films in the art of the 20th and 21st centuries. From the beginning cinema has been the vector of a new aesthetic, which has deeply impressed the artists. We can follow the influence of the first westerns and gangster movies (respectively Porter’s The Great Train Robbery, 1903; Louis Feuillade’s Fantômas, 1913) on Dada and the Surrealists for example. The popular imagery of actors and films nourished Pop Art in the USA and its European counterpart during the 60’s, while contemporary artists such as Cindy Sherman, Jeff Wall, Stan Douglas or Pierre Huyghe are still evoking and interrogating film imagery through their works.",
    "goals": [
        "To impart a critical approach on the relationships between painting and cinema",
        "To consider cinema under the pictorial heritage, and conversely to assess the impact cinema has had on the art of the 20th and 21st centuries",
        "To cultivate student’s abilities to understand the relationships between different artistic mediums",
        "To shape student’s abilities to question and solve issues related to the topic. To encourage their critical thinking",
        "To train students to study, and analyze primary and secondary sources, comment the literature related to the relationships between cinema and painting"
    ],
    "syllabus": "Weeks 1-3: Introduction. Cinema and Art History: Critical Comments\n\nWeeks 4-6: Cinema and Painting: Lineage and Correspondences\n\nImpressionism and the Cinematic View\n\nPainted Series in the Era of the Reproducibility of Images\n\nWeeks 7-8: Icon and Narration: the Portrait in Cinema\n\nWeeks 9-11: Still / Motion\n\nWeeks 12-14: Art in Film: Museums, Monuments, Artworks, Artists etc. as decor\n\nWeeks 13-17: Film in Art: Cinema as Model for Artists in 20th and 21st Centuries\n\nWeek 18: Conclusion",
    "methodologies": [
        {
            "type": "實地考察、參訪",
            "note": "Study visits are organized when possible and according to the course topic, and depending on the cultural actuality (exhibitions, events etc.)"
        }
    ],
    "grading": [
        {
            "type": "出席",
            "weight": 20,
            "note": "During the course the skills of the students are tested through questions intended to tackle problems in direct relationship to the topic. They are trained in the observation of artworks. They are taught how to describe a work (from the more general to the more specific), to understand its structure, its content, and its meaning. They are asked to compare works (or documents) with similar or contradictory examples. They are taught to identify and to interpret the different meanings of a work. Their aesthetic sensitivity and their critical thinking are encouraged through an acute observation and analysis of the works, documents, and academic writings introduced throughout the course. If the content presented seems to be unclear to the students, it is clarified through questions and answers."
        },
        {
            "type": "報告",
            "weight": 80,
            "note": "Paper 50%: Students are asked to hand out a final paper respecting some formal, but essential points according to the common use in the academic field of art history (table of contents, quotations and correct referencing, presence of bibliography, illustrations etc.). Students are given a style sheet on which they can take example. The content should be well structured, written correctly, and thoroughly documented. Presentation 30%: Students’ abilities to formulate a specific issue on a specific topic related to the course attended are trained, and improved. They are asked to present and structure their argumentation coherently, to produce a critical research based on an acute observation of the works analyzed, and to find possible solutions in a 30 minute time-lapse. The discussions, comments, and critics formulated during and/or after their oral presentation are always thought in a constructive way. They are intended to encourage the students to improve their critical approach, to redirect their previous intentions."
        }
    ],
    "prerequisite": "",
    "general_core": []
}