{
    "year": 110,
    "term": 2,
    "name": "愛爾蘭日常文化專題研究",
    "teachers": [
        "梁孫傑"
    ],
    "department": "IM82",
    "code": "ETM0089",
    "credit": 3,
    "serial": 1323,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 5
    },
    "schedule": [
        {
            "day": 2,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "博404"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This class is designed to familiarize students with the lifestyle represented in modern Irish literature in terms of the five major aspects (i.e., the food, clothing, architecture, transportation, and festivals), and to submerge students into a thematically-relevant (higher degree of verisimilitude) environment intended to recreate the hands-on experience of that lifestyle with the knowledge of the modern Irish literary works chosen to discuss in the class. Understandably the class is a combination of classroom learning and the acquisition of practical experience. In a post-Covid era when the opportunities of international cultural exchange are largely dwindled to be kept at a minimum possible level, it’s highly urgent to create an environment for students to verify what they have learned in the class in light of actual emerging experiences. In addition to classroom lectures, guest speakers will tour students through the five aspects of Irish lifestyle in the form of a field trip study, and students will be required to do a feedback presentation on the basis of the classroom lectures and the practical experiences.",
    "goals": [
        "The constant communication between the acquired knowledge and the practical experience is the basic requirement in the development of learning.",
        "The application of classroom knowledge to practical experience helps students to be familiar with future challenges. A video presentation is required for the class.",
        "The mode of philosophical and ethical inquiry in a simulated international context is the way to develop capacities for independent judgment, critical thinking, and ethical reasoning.",
        "The goal of this course is the ultimate concern with the other literature and culture (or, the literature and culture of the other) through the speculative mode of thinking."
    ],
    "syllabus": "1.  02/15    Orientation Meeting\n\n**Irish Films**\n\n2\\. 02/22     _The Secret of Kells_ (2009)\n\n                                Film response papers are due at 1pm on Monday before the class\n\nmeeting.\n\n3\\. 03/01  _Wolfwalkers_ (2020)\n\n         **_Ulysses_** **by James Joyce**\n\n4\\. 03/08        FOOD              Chapter 4: “Calypso”\n\n              Joyce response papers are due at 1pm on Monday before the class\n\nmeeting\n\n5\\. 03/15       CITY              Chapter 10: “The Wandering Rocks”\n\n6\\. 03/22   VIOLENCE       Chapter 12: “Cyclops”\n\n7\\. 03/29       LOVE              Chapter 18: “Penelope”\n\n8\\. 04/05       Spring Break\n\n9\\. 04/12      Individual Conference\n\n10\\. 04/19     Oral Presentation (Group)\n\n**Fashion**\n\n11\\. 04/26       Oscar Wilde: “The Philosophy of Dress”\n\n12\\. 05/03     洪麗芬工作室       Guest Speaker: 洪麗芬\n\n**Leisure**\n\n13\\. 05/10       Celtic Music            Guest Speaker: 林世唐\n\n14\\. 05/13       IRISH NIGHT\n\n15\\. 05/24     三草工作室              Guest Speaker: 龔于堯\n\n16\\. 05/31     Oral Presentation (Individual)\n\n17\\. 06/07     NO CLASS：The Exhibition\n\n18\\. 06/14     NO CLASS：Recapitulation\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=8b9b4836a9ce4e3eb45d59125e046ac7&fno=d8ec0c5df0ba4efca4d3de00929c3438)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "The instructor will conduct mostly interactive lectures."
        },
        {
            "type": "討論法",
            "note": "Questions will be prepared for the students to discuss."
        },
        {
            "type": "問題解決教學",
            "note": "Problems will be assigned to students who work as a team to solve them."
        },
        {
            "type": "合作學習",
            "note": "Students will be teamed up to do oral presentations."
        },
        {
            "type": "實地考察、參訪",
            "note": "Five field trips will be integrated into the teaching process."
        },
        {
            "type": "媒體融入教學",
            "note": "Students are required to do a short video, and upload it to YouTube."
        },
        {
            "type": "專題研究",
            "note": "Students are required to develop the solution to their assigned problem into a research project."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 10,
            "note": "Response paper"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "Students’ contribution to the class discussion"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Being present in the class means to share opinions with the participants"
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "Oral presentation"
        },
        {
            "type": "成果展覽",
            "weight": 40,
            "note": "he achievement presentation is modelled on the Bloomsday Festival"
        }
    ],
    "prerequisite": "",
    "general_core": []
}