{
    "year": 107,
    "term": 1,
    "name": "影像˙音樂˙書寫",
    "teachers": [
        "林秀玲"
    ],
    "department": "GU",
    "code": "01UG024",
    "credit": 2,
    "serial": 913,
    "group": "A",
    "quota": {
        "limit": 75,
        "additional": 20
    },
    "schedule": [
        {
            "day": 1,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "誠202"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本課程之設計理念，即在於建立不同表現媒介之間的關連，幫助同學豐厚藝術人文的基本知識，化成其人文藝術涵養，引介古今中外著名作品，從導論、引介，到觀賞、聆聽、閱讀、分析、比較、討論、思辯、構思，到創作。本課程設計的主題比照本系（英語系）文學選修課程（三小時）的規劃(目前通識中心暫先核定為二小時課程)，選材範圍寬廣，依據不同主題，每學期區分為幾大類，各主題之間有可能彼此獨立，也有可能互有關連，大體上皆為人文藝術學門研究領域之主要議題。為吸引人文學門以外的理工企管教育等不熟悉文學藝術研究的同學的興趣，我們將採用文學作品改編為音樂劇、電影、歌（舞）劇、舞劇，然後搭配原文字作品選文賞析的方式，冀望同學在引起動機之後，進一步主動閱讀中英文原著或擴大對其他作品的研究觸角。本課程以著名的中外經典之作為賞析重點，每學期依據不同議題更換，旨在補強學生對中外文化產品的認知。課程目的不在於單純賞析，而是藉由作品賞析、研究，激勵學生思考、發言、討論，以開啟其洞察力和耙梳思考理路的思辨能力，進而看見影/音/文再現內隱含的對於社會、政治、倫理、愛情、人生的批判與洞見。課程前半段將系統性引創作者和其作品之文化歷史脈絡，其後，藉由比對影劇的視音呈現和文字書寫的敘述方式，我們將引導同學洞察視/聽覺再現（visual/audio representation）和文字再現(verbal representation)的差異與裂縫。我們希望提高同學的藝術鑑賞力和深化其思辨能力，瞭解到視/聽覺再現的優勢並無法完全取代文字再現提供的想像空間以及描述或再現經驗的細緻性。本課程最終目的為拓展學生的人文視野。除了以世界藝術/音樂/文學名著為主要媒介，並將輔以相關主題的探索，以達到開發學生對人文議題的敏銳度及討論興趣。\n本學期\n這門課本學期的設計屬於比較文學訓練中跨文化、及跨學科整合的課程。這學期分兩大部分，期中報告之前以梁祝為主題，以及期中報告之後以紅樓夢為主題。這門課期中報告之前將討論越劇〈梁祝〉與崑曲及黃梅戲、以及與何占豪〈梁祝小提琴協奏曲〉、以及與莎劇〈第十二夜〉、〈羅密歐與茱麗葉〉的比較。自期中之後第二部分將以《紅樓夢》文本為主，探討京劇、越劇、粵劇、以及崑曲的改編。\n\n第一部分：越劇〈梁祝〉與與何占豪〈梁祝小提琴協奏曲〉以及與\n莎劇〈第十二夜〉、〈羅密歐與茱麗葉〉的比較\n\n(A)：越劇〈梁祝〉與何占豪〈梁祝小提琴協奏曲〉\n這門課我們將放映越劇〈梁祝〉、以及莎士比亞戲劇〈第十二夜〉、以及〈羅密歐與茱麗葉〉改編電影，並將探討越劇「梁祝」生成以及演化的歷史，以及梁祝小提琴協奏曲與越劇的關係。\n〈梁祝小提琴協奏曲〉是1959年由上海音樂院學生何占豪和陳綱以上海越劇院的《梁山伯與祝英台》為基礎的音樂創作。上海越劇院的〈梁祝〉後來拍成電影，也是1949年以後中國第一部的彩色戲曲電影。\n當時由何占豪提供主旋律、陳綱編曲配器，再由俞麗拿修訂並首演。\n1958年，當時中國為迎接建國十週年國慶，上海音樂學院時任黨委書記孟波倡議組建「中國小提琴民族學派實驗小組」，推動將西洋樂器與中國傳統地方戲曲文藝結合起來。\n何占豪出生於浙江紹興旁的西施故里諸暨，父親喜歡紹興戲、祖母喜歡越劇，因此何占豪從小接觸越劇，並耳濡目染。他二十四歲考入上海音樂院，但在此之前，他在越劇團工作。在他進入上海音樂院之後距離〈梁祝小提琴協奏曲〉的誕生只有一年。在〈梁祝〉之前，何占豪先根據越劇曲調填寫了一個弦樂四重奏版本，在校內引起反響，直到出生自西洋音樂世家的作曲系學長陳綱參與加入了何占豪組織的「中國小提琴民族學派實驗小組」之中，他們同時意識到民間戲曲是一座「超級富礦」，全新投入創作，從確定主題到完成，只花了半年時間。\n1959年5月27日在蘭心大戲院首演，小提琴獨奏為上海音樂院學生俞麗拿、鋼琴部分的首創者和首演者則為巫漪麗。自此，梁祝成了中國古典音樂的經典曲目，也標誌了一個西方音樂和中國戲曲完美結合的實驗。\n梁祝之後，何占豪又繼續致力於中國傳統的民族音樂及越劇交響樂化，如和丁芷諾合作將傳統二胡名曲《二泉映月》轉為交響配置；在越劇方面，合作的對象包括鄭國鳳的《紅樓夢》中的「想當初」、「寶玉哭靈」等折，以及〈北地王〉中的「嘆月」等折。除了創作交響《紅樓夢》外，何占豪尚將越劇〈莫愁湖〉等改編為交響樂。\n\n(B)：\n除了以〈梁祝〉為題，探討中西方音樂作曲及中國戲曲的融合實驗外，我們將另討論〈梁祝〉與莎劇〈羅密歐與茱麗葉〉、〈第十二夜〉的關係。\n〈梁祝〉和〈羅密歐與茱麗葉〉的比較重點全放在二者都是愛情悲劇，我們將探討中、西方愛情悲劇的構成要素。在〈梁祝〉中，悲劇起因於封建制度之下父母之命、媒妁之言。梁山伯送祝英台下山，途中祝英台多方比喻暗示，但梁山伯是個忠厚志誠君子，人物刻劃宛如一隻「呆頭鵝」，完全沒理會得祝英台自為媒妁的暗示。\n而莎士比亞的〈羅密歐與茱麗葉〉的悲劇性亦在於社會性，二家是世仇，世仇之子女相戀，再加上也是父母之命，茱麗葉父親把她嫁給派利斯，導致殉情悲劇發生。\n莎士比亞的另一部作品〈第十二夜〉則是部喜劇，可以和〈梁祝〉相比較的是二者都處理到改扮男裝（cross-dressing）和性別以及誤認身分（misidentity）。〈第十二夜〉中一開始是一對雙胞胎兄妹在地中海地區船難失散。上岸的妹妹醒來後，裝扮成她哥哥的衣著，打扮成一位男子，進入公爵家工作。公爵在追求一位女伯爵，便要這位長相斯文、口才便給，才學談吐不俗的僕人代替他前往女伯爵家代為傳達公爵的愛意，但女伯爵對公爵一點興趣都沒有，反而為此僕人不俗的言談所吸引，而愛上了這位女扮男裝的代言者。故事中發生許多妙處橫生，是一齣肇因於誤認及肇因於性別改扮的喜劇，妙處橫生。\n誤認（misidentity）也構成數個中國喜劇的重要元素，如崑曲中的〈西園記〉、以及〈風箏誤〉。越劇亦改編自崑曲成另一部成功、但結局稍異的〈西園記〉。\n\n第二部分：《紅樓夢》文本與越劇、崑曲、粵劇各改編版本\n本課程自期中報告之後的第二部分將以《紅樓夢》為例，探討文本與越劇、崑曲、粵劇各改編版本的異同。在1958年之前《紅樓夢》搬上舞台及電影包括梅蘭芳的「黛玉葬花」一折，但整本小說中400多個人物濃縮並擇重要故事主線寶黛釵的戀愛在三個半小時一個晚上演出可以演完的改編版首推1958年上海越劇院在上海共舞台的首演，由徐玉蘭及王文娟主演，由徐進作詞、顧振遐編曲。此版本於1962年在香港製作拍攝成電影。電影創下中國戲曲電影多項票房紀錄。雖然甫拍攝完畢，即碰上文革禁演，但文革一過，塵封二十年的電影一旦解禁，馬上席捲中國，創下多項票房紀錄，立即成為經典。\n越劇《紅樓夢》今年恰逢舞台首演60週年。此版本對於日後粵劇、以及崑曲的《紅樓夢》影響極大。粵劇及崑曲《紅樓夢》的改編幾乎遵循這版越劇的改編。\n近幾年台灣國光劇團也嘗試改編《紅樓夢》並搬上舞台，如〈王熙鳳大鬧寧國府〉，其實依循的是早年在文革之前為上海京劇院的童芷苓量身編寫的〈王熙鳳〉。國光又創作〈探春〉，陸續以紅樓人物為創作。\n \n此課的設計希望探討文本、音樂、以及影像三者之間的關係，藉此培養同學文學、音樂、及戲劇的賞析能力。",
    "goals": [
        "本課程旨在引領同學探索影像、音樂、文本的再現中可能交互出現的元素和互動。本學期的教學重點在於比較、欣賞、分析文學名著改編音樂劇與原作品的閱讀。除了比較再現法則與美感呈現的差異外，也重視探討作品的內涵和主題，以及影音和文字呈現如何強化或簡化某些效果或作者的意圖。冀望深化同學的人文關懷，豐厚其人文藝術涵養，達成藝術人文教育之為慢策略(slow",
        "冀望透過作品賞析、研究，激勵學生思考、發言、討論，以開啟其挖掘各種「可能性」的洞察力和耙梳思考理路的思辨能力，進而看見影/音/文再現內隱含的對於社會、政治、倫理、愛情、人生的批判與洞見。",
        "藉由作品賞析、研究，激勵學生思考、發言、討論，以開啟其洞察力和耙梳思考理路的思辯能力，進而看見影/音/文再現內隱含的對於社會、政治、倫理、愛情、人生的批判與洞見。",
        "比對影像呈現、音樂再現，和文字書寫的表現法則；比較視覺再現、聽覺再現，和文字再現的差異與裂縫。我們希望賦予同學對作品內容、技巧運用、表現媒介相互融合支援的基本知識，深化其思辨能力，瞭解視/聽覺再現的優勢並無法完全取代文字再現所提供的想像空間以及描述或再現經驗的細緻性，三者之間可以形成互補關係。",
        "拓展學生的人文視野。除了以世界藝術/音樂/文學名著為主要媒介，並將輔以相關主題的探索，以達到開發學生對人文議題的敏銳度及討論興趣。"
    ],
    "syllabus": "1, 9/10, 課程簡介\n\n2, 9/17  越劇〈梁祝〉與何占豪〈梁祝小提琴協奏曲〉\n\n3, 9/24  中秋節\n\n4, 10/1  越劇〈梁祝〉生成及早期歷史\n\n5, 10/8  越劇電影〈梁祝〉(1953)\n\n6, 10/15 越劇〈梁祝〉各流派賞析\n\n7, 10/22黃梅戲〈梁祝〉\n\n8, 10/29崑曲〈梁祝〉(2012)\n\n9, 11/5  William Shakespeare, “The Twelfth Night”\n\n10, 11/12 William Shakespeare, “Romeo and Juliet”\n\n11, 11/19 越劇《紅樓夢》\n\n12, 11/26崑曲《紅樓夢》\n\n13, 12/3 粵劇《紅樓夢》\n\n14, 12/10 京劇《紅樓夢》: 黛玉葬花、王熙鳳、探春、紅樓二尤\n\n15, 12/17《紅樓夢》中的戲劇\n\n16, 12/24《紅樓夢》中的戲劇\n\n17, 12/31 (彈性元旦連休)\n\n18, 1/7  (期末考周) 期末繳交個人學習檔案及口頭報告  \n  \n學期成績評量標準：\n\n**評量方式**/**百分比說明：**\n\n**課堂討論參與**:\n\n**出席**: 出席是最起碼的課程參與 10%\n\n期末繳交個人學習檔案 30%\n\n同學必須針對每一系列之影音、文學作品，收集相關資料至少一篇，並於該資料後附上自己的書面評論意見（中英不拘，A4格式），於期末整理成一份書面評論意見集。期末的個人學習檔案，則包含了1) 書面評論意見集，2)隨堂筆記，3)閱讀週誌。請同學在統整修改後，做成一份**學習檔案**（**portfolio**），於期末繳交（格式方面可以參考通識中心的優秀學習檔案）。我們將依據班級人數比例（前 10%）選出優秀作品，代表本班參加本校通識中心舉辦的優秀學習檔案遴選。\n\n期中、期末書面報告各占30%\n\n期中報告：以下題目四擇一\n\n（一）〈梁祝〉文本生成歷史及改編；\n\n（二）〈梁祝小提琴協奏曲〉與越劇之間的關係；\n\n（三）越劇〈梁祝〉與莎士比亞〈羅密歐與茱麗葉〉之比較；\n\n（四）越劇〈梁祝〉與莎士比亞〈第十二夜〉之比較\n\n\\-------------------------------------\n\n期末報告：《紅樓夢》之改編。同學可以擇一劇種之改編討論與小說文本的關係，亦可討論不同劇種之間相互影響而成的改編或演出。",
    "methodologies": [
        {
            "type": "講述法",
            "note": "本課程將以個別主題做為研討焦點，每學期更換不同主題，講述並導讀中外經典名著，藉由欣賞、分析影像、音樂、文字等不同表現媒介的融合，培養學生全方位的美學素養，提升文化視野、審美品味、藝術鑑賞力，進而激發創造力。對於每一部作品的文學背景，教師會提供相關的作者背景、歷史資料，以及寫作風格的導讀，並鼓勵同學閱讀原作。"
        },
        {
            "type": "討論法",
            "note": "目的不在於單純的影/音/文字賞析，而在於討論視覺藝術、音樂、文學的互補和互涉，藉以提升學生對於文字再現和視覺/聽覺呈現的分析、批判，以及鑑賞力。＊在每一系列的第三週討論活動中，我們亦將引導同學討論音樂的加入對於該作品欲表達的訴求，在情意、認知、和欣賞上，產生何種強化或減弱的作用。"
        },
        {
            "type": "問題解決教學",
            "note": "針對每部作品提供學習導讀單(study guide)以及簡介，導讀，問題等，並搭配選文和解析，經由討論引導同學針對問題所面臨的情境提出解決之可能性。"
        },
        {
            "type": "合作學習",
            "note": "藉由欣賞結合影像、音樂、文學作品的融合和相互之間的關係，培養學生全方位的美學素養，提升文化涵養、審美品味、激發創造力。並學習將課程中學習到的知識應用轉換到自製的短片。"
        },
        {
            "type": "實地考察、參訪",
            "note": "配合該學相關活動進行參訪或邀請嘉賓專題演講"
        },
        {
            "type": "其他",
            "note": "Moodle Participation"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": "隨堂筆記 + Moodle 發表影音欣賞文本閱讀週誌（詳見評量百分比說明）"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 60,
            "note": "(期中、期末報告各占30% )\n期中報告：以下題目四擇一\n（一）〈梁祝〉文本生成歷史及改編；\n（二）〈梁祝小提琴協奏曲〉與越劇之間的關係；\n（三）越劇〈梁祝〉與莎士比亞〈羅密歐與茱麗葉〉之比較；\n（四）越劇〈梁祝〉與莎士比亞〈第十二夜〉之比較\n-------------------------------------------\n期末報告：《紅樓夢》之改編。同學可以擇一劇種之改編討論與小說文本的關係，亦可討論不同劇種之間相互影響而成的改編或演出。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}