{
    "year": 107,
    "term": 1,
    "name": "臺灣小說選讀",
    "teachers": [
        "林淑慧"
    ],
    "department": "GU",
    "code": "01UG006",
    "credit": 2,
    "serial": 3212,
    "group": "",
    "quota": {
        "limit": 150,
        "additional": 15
    },
    "schedule": [
        {
            "day": 3,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "教201演講廳"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "配合核心通識課程藝術與美感領域的教學目標，培養學生深度閱讀台灣經典小說的能力，並引導學習賞析小說的方法。從人物塑造、題材來源、情節結構、敘事觀點、場景描繪、語言文字等關鍵，以增進學生賞析文學作品美感的能力。導引探索台灣小說的歷史脈絡(context)，討論藝術的創作背景、歷史事件、社會情境，並分析小說中的象徵、意象等文學要素，以及虛構/寫實等藝術表現的議題。以時代為導讀的先後順序，規劃以教師講述、問題討論、分組報告、教學網站交流以及影片賞析等方式，增進學生閱讀的興趣，以重新省思文學與現代生活的關連性。",
    "goals": [
        "習得閱讀台灣小說的方法",
        "培養學生具備美學、倫理現代公民核心素養。",
        "以「問題導向」及「以學生主體」的活動，提昇自主學習的能力。",
        "引發省思文學作品與現代生活的關連性，期許年輕學子關懷臺灣為終極教育目標。"
    ],
    "syllabus": "18週的進度預定如下：\n\n1-6週 課程主旨；台灣小說賞析的方法\n\n\\*說明課程主旨、上課方式、內容進度、學期報告等實施方法。\n\n解析臺灣小說於台灣文學史的意義，並理解各時期的發展脈絡。\n\n\\*台灣小說賞析的方法 (一)\n\n應用資料庫以廣泛蒐尋台灣小說參考文獻的方法。如：\n\n(1)國家圖書館「當代文學史料影像全文系統」收錄臺灣戰後1945年至今兩千餘位作家的相關資料。此資料庫包括生平、傳記、手稿、照片、作品目錄與評論以及各項得獎記錄等。\n\n(2)文建會「國家文化資料庫」：賴和紀念館、鍾理和數位博物館等十個專題網。   \n\n(3)客家文化委員會策劃的「台灣客家文學館」，包括龍瑛宗、吳濁流、鍾理和、鍾肇政、李喬、鍾鐵民等六位作家，提供作家代表作品、客語詞彙庫、作家即時資訊、電子報、作家照片、手稿、影音資料，文學資料檢索、生平大事年表、作品繫年等資料。 \n\n講義：林淑慧，〈資料庫於台灣文學史教學與研究的應用〉\n\n當週單元討論：\n\n如何從資料庫中搜尋小說作者及時代背景的資料？\n\n分組討論準備資料的蒐羅，以進行另類閱讀理解方式。\n\n\\*台灣小說賞析的方法 (二)\n\n講義：林淑慧，〈日治時期啟蒙運動的再現－鍾肇政《滄溟行》、李喬《荒村》的歷史敘事〉\n\n以大河小說為例，探索台灣歷史小說的創作背景、歷史事件、社會情境，並分析小說中的象徵、意象等文學美感要素，以及虛構 / 寫實等藝術表現的議題。\n\n台灣大河小說常結合真實與虛構的歷史敘事，呈現關於人類命運與理想的思考。如鍾肇政【台灣人三部曲】、李喬【寒夜三部曲】中的第二部《滄溟行》及《荒村》，運用「台灣文化協會」、「台灣農民組合」等相關史料，再現家族參與當時啟蒙運動的情境。將帶領學生探討小說中台灣文化協會與農民運動史料的轉化、演講的氛圍與啟蒙意義，以及主題人物的真實與想像等層面。同時參酌相關一手檔案、文獻，分析小說中的情節編織技巧，詮釋其歷史敘事的特殊質性，並探析作家如何藉由小說人物的言論及行動，想像日治時期台灣群眾的啟蒙思維。   \n\n當週單元討論：\n\n(1)作家是如何有意識地消化龐雜的史料，再現這段台灣文化史上的重要事件？\n\n(2)又是以何種虛實交錯的寫作手法，想像或建構歷史的脈絡？\n\n(3)「鱒魚的夢」所代表的象徵意義為何？\n\n\\*台灣小說賞析的方法 (三)\n\n講義：林淑慧，〈日治末期《風月報》、《南方》所載女性議題小說的文化意涵〉\n\n當女性生長於新舊社會過渡的階段，價值觀念亦變動劇烈的時代，小說中所女性的困境如：\n\n(一) 家庭父權干涉婚姻自主\n\n(二) 處於資本社會的經濟負荷\n\n(三) 協力皇民化運動下的國家宰制\n\n當週單元討論：\n\n(1)    小說如何鋪陳日治時期女性於不合理的封建禮教、資本社會及殖民的處境？\n\n(2)    你如何關懷現代女性於婚姻、職場及國家體制中所遇及的困境等議題？\n\n7-12週 台灣日治時期小說選讀與賞析；期中小組報告\n\n\\*日治時期：楊逵〈送報伕〉選讀與賞析\n\n內容揭露社會的不公不義，打破族群、階級的身份，小說中日本人田中與佐藤，與主角楊君形成休戚與共的生命共同體。作品展現「提出問題，並且解決問題」的思維模式，作者認為解決社會問題的方法是透過民眾集體的力量，和平抵抗，創造公義平等的願景。\n\n當週單元討論：\n\n(1)若你身處楊君立場，收到來自叔父的信後，是否會返台？其原因為何？\n\n(2)作者於小說結尾所提「表面上的美麗肥滿」和「惡臭逼人的血膿」分別象徵何種寓意？\n\n\\* 日治時期：呂赫若〈牛車〉選讀與賞析\n\n創作背景為1930年代的台灣農村，現代化的謀生工具取代了傳統工具，汽車取代了牛車。小說中主角楊添丁比以前更努力工作，生活卻愈來愈艱難，此作品突顯社會上『種族』、『階級』與『性別』的宰制，作者為維護弱勢團體的生活尊嚴而寫。\n\n日治時期：楊千鶴〈花開時節〉選讀與賞析\n\n篇名所使用「花開」一詞，帶給人希望，如生命的綻放，感覺未來是多變不可限的。主角的創新思想或勇於抵抗強權、不畏流俗的行為，不僅展現了當時女性的自主意識，亦足成為現代女性的借鑒。\n\n當週單元討論：\n\n（1）「花開時節」的「花開」所代表的意涵為何？\n\n（2）小說中以女性的自覺為主要描述對象，但是否真的擺脫父權？\n\n【台灣作家身影系列】：楊千鶴影片賞析\n\n當週單元討論：\n\n(1)如何應用閱讀小說的經驗，豐富拍攝作家紀錄片的內容？如何從觀賞紀錄片的經驗中，理解作家時代背景及創作歷程的內容？（以楊千鶴為例）\n\n\\*日治時期：龍瑛宗〈植有木瓜樹的小鎮〉選讀與賞析\n\n此作品於1937年獲得日本知名文藝雜誌《改造》的年度小說佳作獎，作者透過人物對話傳達理想與現實的落差，呈現陳有三等處在殖民統治時期台灣知識份子的心境。文中揭開空間與身份認同的問題，主角在「身份被架空」、「追求新身份」到「雙重失落」的過程，正是被殖民者的悲哀。\n\n當週單元討論：\n\n（1）木瓜樹在小說中出現幾次？其象徵意義為何？\n\n（2）若處於殖民統治時期，高等職位與堅持理想，你會如何抉擇？\n\n\\*期中小說小組報告成果分享（一）\n\n觀摩與回饋\n\n\\*期中小說小組報告成果分享（二）\n\n觀摩與回饋\n\n7-12週 台灣戰後時期小說選讀與賞析；期末回饋\n\n\\*戰後時期：王禎和〈香格里拉〉選讀與賞析\n\n「香格里拉」代表理想世界，藉此來運用反襯的手法，對照現實生活中悲情的母子。作者曾說作家應該寫他最熟悉的東西，這樣作品才有生命與感情，讀者也才有親切感，會產生共鳴。外文系出身的王禎和是現代主義興盛期的台灣作家。他的小說角色多是鄉土人物，卻大量使用現代主義的手法，如意識流、內在獨白、語言的扭曲等。以嘲弄式的語言，描繪小人物進退兩難的困境。他形塑小說人物卑微不堪的處境，卻以喜劇方式表達出深沈的悲憫與哀傷。\n\n當週單元討論：\n\n(1)「香格里拉」在小說中有何象徵意義？\n\n(2)在當時年代裡，女性以何種態度處理受制於環境下的壓力？\n\n\\*講義：林淑慧，〈歷史創傷與行旅記憶：吳濁流的戰亂敘事〉\n\n【台灣百年人物誌】：吳濁流影片賞析\n\n戰爭對人類的影響既深且久，作家書寫戰爭或讀者閱讀作品，有助於理解個人及集體的傷痛記憶，也是面對創傷的方式之一。吳濁流的小說敘說對戰爭的觀感，無論質量皆相當可觀。從《亞細亞的孤兒》、《無花果》、《臺灣連翹》及單篇小說〈路迢迢〉等作品中，探討戰爭的敘說與壓抑的集體記憶、戰爭的荒謬性與軍事動員、旅外書寫的戰爭遺跡與省思有關戰爭議題的敘事意義。\n\n當週單元討論：\n\n觀看吳濁流影片對於理解文本有哪些助益？\n\n戰後時期：黃春明〈蘋果的滋味〉選讀與賞析\n\n作者用輕鬆幽默的筆法，呈現對比與諷刺的效果，如美國上校豪華的大轎車，與阿發的破舊腳踏車，以及家人所住破舊、凌亂的違章矮房，與寬闊、整齊潔白的美國醫院都形成強烈的對比。蘋果的滋味，其實是酸，卻強說是甜，反映了當時代一般平民百姓的複雜心情，刻劃當時候台灣人在美援下的矛盾與悲涼。\n\n當週單元討論：\n\n(1)「蘋果」在小說中的象徵寓意為何？\n\n(2)作者將大量的閩南俚語置入文本中，造成何種閱讀感受？\n\n黃春明〈蘋果的滋味〉電影版\n\n小說與電影的藝術表現手法有何不同？\n\n\\*戰後時期：白先勇〈遊園驚夢〉選讀與賞析\n\n此小說有兩組對比人物，多象徵與隱喻，極講究藝術性。今、昔，是此篇小說的主線，緊扣著赴宴前後的心緒起伏鋪陳。「錢」夫人是諷刺嫁給錢鵬志是為榮華富貴、「夢」多寓潛意識，從夢中驚醒而以倒嗓作結，她在南京如戲如夢的人生也愕然終止。在今昔對比，驚夢中與鄭參謀歡愛之「生」與錢鵬志「死」之對照間，映照出錢夫人的流離感。\n\n當週單元討論：\n\n（1）作者如何使用意識流技巧來鋪陳故事？\n\n（2）故事中角色的相互關係為何？如果周遭的朋友之間產生情感糾葛，你有何建議？\n\n\\* 校外嘉賓講座\n\n\\*戰後時期：拓跋斯．塔瑪匹瑪《最後的獵人》選讀與賞析\n\n小說中蘊含原住民文化元素，及神話傳說等象徵的應用。創作意圖是對原住民狩獵權被剝奪的一種控訴，比雅日主角始終為過去的榮耀感到驕傲，唯有在山林裡他才能感到自在，最後卻被警察先生的偏見和假公濟私的行為，剝奪這一切。究竟真正破壞山林的人是誰？隨著強勢文化的出現，導致弱勢文化逐漸失落，這些問題都值得我們重新反思。\n\n當週單元討論：\n\n1.為何比雅日堅持「不是農夫就是獵人」的傳統？作者將小說命名為「最後的獵人」，其中涵義為何？\n\n2.如何兼顧現今原住民的處境與環境倫理的議題？\n\n\\*講義：林淑慧，〈遠遊的共鳴：《兩個芙烈達‧卡蘿》、《驅魔》的自我定位〉\n\n施叔青在這些遊記書寫中皆藉由共性與他人對話，從失衡的自我認同中，企圖重新找尋平衡。《兩個芙烈達‧卡蘿》中遭逢車禍事故的女畫家，仿如於政治現實社會中受到創傷的自己；又如《驅魔》中繡菱母女，如過去身陷青春期壓抑與中年焦慮的自己。綜觀兩部小說皆是找尋自我身分認同，在陌生的地方，聯想熟悉的人事，以引起讀者共鳴。\n\n當週單元討論：\n\n(1)如何從遠方與自己的家鄉台灣相參照？\n\n(2)如何藉由隱喻創作，驅逐心魔並自我實現？\n\n\\*成果分享 觀摩與回饋",
    "methodologies": [
        {
            "type": "講述法",
            "note": "老師講述重要概論及理念"
        },
        {
            "type": "討論法",
            "note": "全班分組研讀小說主題，依進度報告並參與討論。"
        },
        {
            "type": "問題解決教學",
            "note": "教師設計問題情境，激發學生解決問題的動力。"
        },
        {
            "type": "合作學習",
            "note": "分組期中報告"
        },
        {
            "type": "專題研究",
            "note": "進行另類閱讀理解方式。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 25,
            "note": "資料蒐集與整理的分組書面報告"
        },
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": "課堂發表、資料蒐集、討論"
        },
        {
            "type": "出席",
            "weight": 25,
            "note": "出席統計"
        },
        {
            "type": "專題",
            "weight": 20,
            "note": "依據資料的蒐集成果與口頭報告加以評量"
        }
    ],
    "prerequisite": "",
    "general_core": []
}