{
    "year": 107,
    "term": 1,
    "name": "現代公民與法律",
    "teachers": [
        "劉恆妏"
    ],
    "department": "GU",
    "code": "03UG005",
    "credit": 2,
    "serial": 936,
    "group": "A",
    "quota": {
        "limit": 50,
        "additional": 40
    },
    "schedule": [
        {
            "day": 3,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "綜508會議室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎公領系（學）不得選修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "一、現代公民應具備的法律素養是什麼？是在媒體上看到某個罪大惡極的「壞人」被法官判無罪時，成為鍵盤法官大喊「司法已死」？還是在網路看到各種爆料與批評時，也跟風當個「正義魔人」？又或者是生活中與別人意見不合時，只會躲在自己的同溫層討拍而不願意溝通對話？\n\n二、這些情形，想必在各位的生活中都不陌生。社會中不乏高舉公平正義大旗的人們，憑藉著內心素樸的正義感，未經思考就對別人進行批評與撻伐。然而，這樣的情形無異使得人民成為被操控的工具，有心人透過輿論的形成，藉由民粹的力量來摧毀法治以達成目的。法治的摧毀，就是對人民的權利產生嚴重的侵害。\n\n三、因此，本課程的目標，即是建立每位現代公民所應具備的法律基本素養，人權與法治的維護，不僅是學法律的人要做的事，也是每位公民的責任。本課程將透過法律議題的探討，訓練同學獨立思考與分析的能力，以及同學間相互溝通與說服的能力，希望同學能學習從不同角度來思考法律問題，並藉由意見的交換來尋求共識。此外，本課程所習得的能力，除了進行法律議題的探討外，對於將來在學校或社會面對各式各樣的人，也能夠運用本課程所學來進行思考與溝通。\n\n四、本課程將藉由授課教師的基礎講演以及小組討論中的情境演習與爭點討論，以國內相關案例故事引導發展學生的問題意識與思考架構，並以多元活潑的課程進行方式，引領學生思考討論人權的理念與內涵，尤其著重於探討具有衝突性情境下，自我與群體價值與定位的相互關係、調和並存的可能性與路徑，希望以此方式不斷探索最佳的解方。\n\n五、本課程希望能培養同學廣泛地認識、關懷現代社會相關法律問題，並進行批判性思考的能力，因此課程著重於引導修課同學自主性的討論，不以教師講授為主，課程最後將要求修課同學以分組方式各自提出課堂尚未討論過或未深入討論過的法律議題，自行進行思考剖析，並與其他同學分享心得，藉此擴大同學思考的腹地與深度。\n\n六、本課程將運用多元教學素材，包括數位教學、實地參訪、小組討論、小組情境演習、影片欣賞等方式，引導同學認識並思考法律的價值與衝突問題。本課程有意縮減教師片面講授時間，避免形成教條式說理，強化小組討論與學習功能，並安排學生實地參訪台北地方法院與台北地方檢察署。",
    "goals": [
        "建立現代公民所應具備的法律基本素養",
        "訓練法律閱讀與整合的能力",
        "學會提出問題與解決的能力",
        "培養獨立思考與分析的能力",
        "提升溝通說服與表達的能力",
        "加強法治社會的公民參與和實踐",
        "體認寬容與尊重的價值"
    ],
    "syllabus": "課程進度與大綱（暫訂） 次數 某週教學主題（主要範圍） 備註 正式大綱將於上課時討論確定  \n1 課程進行方式介紹、概論  \n2 法律資料庫、法學資料查詢教學  \n3 什麼是法治？台灣民主憲政與法治發展史  \n4 【司法機關參訪：憲法法庭參訪、地方法庭開庭旁聽】 北市重慶南路  \n5 現代公民之權利意識 繳交參訪、旁聽心得報告  \n6 現代法律體系之基本概念  \n7 【人權紀錄片座談會：人權團體座談】  \n8 我的公民權利：基本人權從憲法說起、如何看懂大法官解釋 繳交座談心得報告  \n9 憲法救濟:基本人權案例研討（一）  \n10 憲法救濟:基本人權案例研討（二）  \n11 憲法救濟:基本人權案例研討（三）  \n12 【人權電影欣賞與討論】  \n13 民事救濟程序與實例研討：如何請求救濟與看懂民事審判書類 繳交電影欣賞心得報告  \n14 刑事救濟程序與實例研討：如何請求救濟與看懂刑事審判書類  \n15 【行政機關參訪：法務部調查局參訪】 北縣新店市中華路  \n16 我的守法政府：行政程序法、政府資訊公開與個人資料保護 繳交調查局參訪心得報告  \n17 行政救濟、國賠實例研討：如何請求救濟與看懂行政審判書類  \n18 期末法治觀念小測驗",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": "人權電影欣賞與討論"
        },
        {
            "type": "實地考察、參訪",
            "note": "行政機關參訪：法務部調查局參訪；司法機關參訪：憲法法庭參訪、地方法庭開庭旁聽"
        },
        {
            "type": "媒體融入教學",
            "note": "人權電影欣賞與討論"
        }
    ],
    "grading": [
        {
            "type": "期末考",
            "weight": 30,
            "note": "期末小測驗"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 60,
            "note": "司法院、法務部參訪各600-800字心得報告：20%；電影欣賞600-800字心得報告：20%；座談600-800字心得報告：20%"
        }
    ],
    "prerequisite": "",
    "general_core": []
}