{
    "year": 107,
    "term": 1,
    "name": "大學入門",
    "teachers": [
        "蔣宗哲"
    ],
    "department": "GU",
    "code": "0SUG526",
    "credit": 2,
    "serial": 1081,
    "group": "S",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 6,
            "to": 7,
            "campus": "公館",
            "classroom": "Ｂ102"
        }
    ],
    "programs": [],
    "comment": "加退選階段開放資工系其他年級修習",
    "restrict": "◎限資工系（學）選修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "不同於高中以前的教育以升學考試主題主導學習內容，並且由教師傳遞標準答案，大學階段的知識探索強調打破時間和空間的界線，並著重由學習者自身的需求和問題出發，藉由體驗、反思、歸納和應用的持續學習，不斷檢視、更新和建構內在經驗與客觀知識的合理性。在持續學習的過程中，大學生一方面努力認識自己與所屬社會，也從中思考透過不同價值的社會行動，自身和環境將被帶往何處，進而確認自己存在的價值感。就像J. Krishnanmurti所說到的︰「教育的目的，在於免除人的恐懼。人越了解世界，越了解自己在這個世界中的位置，越能免於恐懼。」\n    但是，對剛踏入大學校園的學生來說，舉凡時間、壓力和情緒管理、多元學習策略的運用、弱勢關懷與社會實踐、生涯目標與實踐策略的擬定等議題，都是亟待他們一步步習得的重要知能。這時候如何跳脫以往高度控制與僵化的教與學框架，引導學生透過對真實生活現象的敏銳覺察，從中反思、歸納出各類重要人生道理，進而懂得在大學生涯中逐步習得、應用這些核心知能，乃是「大學入門」階段的重要課題。\n為此，本課程將以「認識環境、認識自己及規劃未來生涯」三大議題為主軸，帶領大家從認識師大周邊生活圈開始體察生活世界的重要議題，從群己動態關係中認識自己的價值觀、優缺點及長期累積的焦慮情緒。在自己及生活世界有基本了解後，再進一步運用社會教育系獨特的方案設計流程，從過往感興趣的事情中確立自己適合的生涯方向，並具體擬定可能實踐生涯目標的行動策略。\n    過程中，我們還會藉由邀請同學課堂成果展和期末學習計畫分享的方式，引導同學記錄成長軌跡和階段性成果，並透過課堂小組討論交流大家遭遇挫敗時的心情，彼此陪伴鼓勵。最後，為了讓同學們更清楚地認識社教系的專業實踐場域，我們也會相約大家都方便的時間，一同走訪侯硐礦工生態園區，希望藉此讓大家一次體驗社區營造、社會創新、成人教育、博物館、文化旅遊及故事行銷等等專業實踐的樣貌。\n    我們期盼透過上述多元議題的探討，可以燃起同學們對探索世界和問題解決的好奇心，形成持續發展自我與改善所屬社群生活的行動力，進而感受到「透過共學社群面對人生挑戰的美好」，而不用重蹈以往填鴨式和清談式教育的覆轍。甚至在未來大學生涯中如果遇到任何生涯困難，也都能勇於尋求周遭同儕的協力、連結並創造各類資源，一起將生涯危機轉化為成長的養分。具體而言，整套大學入門課程的參與，亦有助於社會教育系之成人創新學習規劃能力、社會文化事業推展能力及組織永續經營發展能力等核心能力的培養。",
    "goals": [
        "促使學生能夠確立大學目標並具備良好的學習動機與策略。",
        "讓同學們瞭解大學人際間交往、個人情緒管理等議題，協助其良好地適應大學生活。",
        "協助同學能在大學生活之初即能養成健康的生活態度。擁有希望的開始，才能讓大學的每一步都朝向自我實現的目標邁進。",
        "使同學瞭解大學之生涯規劃與就業準備方向，以便日後大學生涯目標之訂定與實踐。"
    ],
    "syllabus": "01\\.    自我介紹 / 資工系課程與教師介紹\n\n自我介紹 / 修業規定 / 教師與研究領域介紹 / 本系與瑞典烏普薩拉大學交換生與雙聯學制介紹\n\n02.    校務電子系統使用教學\n\n學習使用各式校務系統(moodle/EP/請假/補助/課務/電郵設定/系主機)\n\n03\\.    座談：系友職涯分享 I\n\n邀請各領域服務的系友返系分享職場經驗。\n\n04\\.    實作：簡報製作與表達技巧\n\n學習簡報技巧與通則，同時為課程後段的口頭報告預作準備。\n\n05\\.    座談：學長姐學習經驗分享\n\n邀請高年級學長姐分享如何有效率閱讀(原文)書籍，如何兼顧學業與其它活動，以及國際交換生的所見所聞。\n\n06\\.    實作：資料分析\n\n資料分析是越來越重要的基本能力，本次上課將學習運用試算表進行資料分析。\n\n07\\.    報告：大學生活與時間管理\n\n由修課同學彼此分享進入大學後的社團、家族與系隊體驗，討論如何與人互動及經營人際網絡。\n\n08\\.    座談：健康管理專題演講\n\n邀請專家來與同學們分享關於飲食、運動、情緒、壓力等等主題的知識。\n\n09\\.    實作：未來規畫和履歷撰寫\n\n經過半學期的大學生活，也聽過學長姐和系友的分享，寫下自己對未來的規畫。在資訊時代，電子履歷的經營十分重要，此次課程也會讓同學建立屬於自己的電子履歷 (使用 LinkedIn 等平台)\n\n10\\.    報告：書報/議題討論 I（遊戲與我）\n\n許多資工系同學都對電子遊戲很有興趣，該如何在遊戲與現實中取得平衡？又該如何利用遊戲讓自己的生活更美好呢？\n\n11\\.    座談：系友職涯分享 II\n\n邀請各領域服務的系友返系分享職場經驗。\n\n12\\.    報告：書報/議題討論 II（生命與我）\n\n從小一路唸書到大學，是否曾認真思考過未來的人生？\n\n13\\.    報告：行動應用/網路工具分享\n\n人手一機的時代，如何善用行動應用來促進學習效率和改善生活習慣？本次課程將由同學們分享私房應用工具。\n\n14\\.    座談：網路法律、安全與禮儀\n\n邀請專家講述網路法律、安全與禮儀之重要知識，教導同學們如何在虛擬世界中保護自己與表達自己。\n\n15\\.    報告：書報/議題討論 III（世界與我）\n\n「移動力」已被認為是新世代需培養的重要能力，在移動之前，我們希望更了解這個世界。\n\n16\\.    座談：系友職涯分享 III\n\n邀請各領域服務的系友返系分享職場經驗。\n\n17\\.    報告：書報/議題討論 IV（科技與我）\n\n科技快速發展，對人類究竟是福是禍？我們該如何面對未來的社會？\n\n18\\.    報告：大學生活經驗分享\n\n由修課同學分享大學第一學期的生活經驗，寫下自己滿意與不滿意之處。\n\n（107-1 學期將有一次上課遇到元旦連假，實際的座談主題和週次可能依實際情況而有調動。）",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "實驗/實作",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "團體小專題 10%，資料分析 10%"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "座談心得回饋或隨堂小作業"
        },
        {
            "type": "出席",
            "weight": 15,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 45,
            "note": "書報討論報告 30%（四選一），分享報告 15%（二選一）"
        }
    ],
    "prerequisite": "",
    "general_core": []
}