{
    "year": 110,
    "term": 2,
    "name": "跨文化交流研究",
    "teachers": [
        "孟柱憶"
    ],
    "department": "IM84",
    "code": "CLM0093",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 1347,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "綜10樓華語系教室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "本課程主要從理論與實踐的角度討論跨文化溝通。跨文化溝通從文化交流、語言學習、跨文化體驗等實踐的理解，並且發展對應的研究方法，使研究生具備進行相關研究的能力與經驗。",
    "goals": [
        "理解跨文化溝通的性質",
        "學習研究跨文化溝通理論",
        "跨文化溝通的實踐及體驗",
        "語言學習與文化學習",
        "學習跨文化研究的方法"
    ],
    "syllabus": "【授課方式：16+2週】\n\n**教學進度**  \n第一周  跨文化交際   \n    教學主題：當今世界不同文化背景的個人或群體之間的交流日趨頻繁，跨文化交際已成為人類社會生活不可缺少的一部分。可從差距的角度分為遠距離交際和近距離交際。  \n第二周  語言與文化的關係   \n    教學主題：語言是文化的重要載體。語言符號反映社會的政治、經濟、文化、生活等方面的基本特徵。另一方面語言與文化相互依賴、相互影響，文化對語言有制約作用。  \n第三周  文化與交際   \n    教學主題：文化決定人們如何決定人們如何感知和理解周圍的世界，文化影響人們如何處理人際關係和日常生活。  \n第四周  華語教學中文化的界定   \n    教學主題：對我們有意義的文化指跟（作為二語教學的）華語教學由較大關係的文化。這決定此時此地所探討的文化知識範疇。  \n第五周  文化教學所需的知識   \n    教學主題：從教學的角度文化可分為交際文化與知識文化。應以交際文化的傳授為主，但也要包括目的文化社會成員都熟悉的知識文化。因為對二語者而言，交際文化和知識文化都算是要學習的知識。  \n第六周  語言交際   \n    教學主題：因文化差異而引起的語言交際問題主要出現在詞彙層面和由於諧音形成的對語境依存度差異上，詞彙問題主要分為辭彙空缺和語義衝突。前者為只在一種語言中存在的詞彙，因獨特的文化背景所形成的詞語，後者為因一種語言或兩種語言的特點形成差異的同源詞。 此外還有外國專名、縮略語等的問題。   \n第七周  非語言交際   \n    教學主題：二語者常常把自己文化和目的文化之間的對應文化當做等值物，但實際內涵不盡相同。感官認知的結果相同或相近的對應文化被對方詮釋為相差甚遠的。習慣做法、風俗、法規等方面的外延在乍看時會被認為相同或相近，但在不同文化群體中的意義、性質、地位等有不可忽略。  \n第八周  文化的種類   \n    教學主題：文化根據人類行事方式或行為模式可分為表層文化和深層文化，或中間還加中層文化。直接反映在表面上的繪畫、時尚、裝飾等物質文化屬於表層文化，思想觀念、價值取向等精神文化屬於深層文化。介乎中間的憤俗習慣、制度等屬於中層文化。  \n第九周  價值觀與文化模式  \n    教學主題：價值觀是認定事物、辯定是非的一致思維或取向，是文化的核心，對跨文化交際的影響最大。跨文化交際中語言或非語言方面的差異都反映了價值觀的不同。瞭解不同文化的價值觀和文化模式有助於更好地瞭解不同文化群體交際行為背後的文化原因。  \n第十周  跨文化交際中的文化衝突  \n    教學主題：不同民族、社區和群體的文化之間常有不同的價值觀和價值取向的競爭或對抗的關係。主要原因是人們常常各自以自己的文化為優越，視異文化為低劣的或危險的。經歷文化衝突時，若是弱勢則常有受害意識，若是強勢則有不同程度的攻擊性。  \n第十一周  異文化適應  \n    教學主題：異文化適應是一個複雜、動態的過程。早期叫做蜜月期，對目的文化感到新奇有趣，心情興奮而激動，覺得一切都美好。第二個階段是挫折期，在目的文化區待了一段時間之後發現很多規則和自己的不同，實際生活方面遇到不少不便，心情變得失望。第三個階段是恢復期，隨著時間的推移，陌生的逐漸習慣了，意識到了文化的差異。雖有一些不盡人意的，但基本可以接受、理解。第四個階段是適應期，對異文化的瞭解更加深入，對文化差異持有更客觀、包容的態度。開始積極地接受對方的觀念和行為方式，並樂意調整自己的方式。心情變得平和而愉快。  \n第十二周  交際立場：主場 ／ 客場         當事人 ／ 旁觀者  \n    教學主題：跨文化交際跟立場也有不可忽視的關係。在自己的環境中進行跨文化交際，是接待的立場，要有主動積極性；在對方的環境中，是被接待的立場，一般是配合主方就可以。參與交際的程度差異也影響具體表現，旁觀者可以消極地對方文化，而當事人則在理解和表達兩方面都要儘量積極地適應。   \n第十三周  交際的心理與態度  \n    教學主題：要指導學習者具有健全的國際交流態度。要以文化相對主義的視角與平和的心態去客觀地觀察並尊重對方的文化。為細緻並準確的觀察，需要具有對比的眼光。\n\n第十四周  防止交際障礙的原則   \n    教學主題：現在的漢語教學確實重視文化教學，但還缺乏對交際的全面考慮。交際是以理解與表達構成的。但現有的文化教學往往只偏重於理解這一方面。障礙來自理解與表達兩方面的，要防止交際障礙，應該消除理解上的不正確詮釋，同時也要在表達上排除被誤解的可能。\n\n第十五周  瞭解文化的方向性   \n    教學主題：文化學習往往限於學習或瞭解target culture（目標文化或目的語文化）上，但是因為交際由理解和表達兩方面構成，對source culture（本源文化、來源文化或背景文化）的關注和學習也不可缺少。 積累文化知識應是雙向性的。此外，學習者作為現代國際社會的成員，屬於常識範疇的世界文化也會在靠漢語進行的交際中常常被提到，所以對世界文化的理解也是不可缺少的。  \n 第十六周  交際障礙的程度   \n    教學主題：根據對交際產生影響的程度，應該按照從嚴重到輕微的順序瞭解。以語言交際障礙來說，影響人際關係的障礙被判斷為非常嚴重的。外國人的言語行為如果在語法上出錯是較為容易諒解的，但是感情色彩表達錯誤或語用錯誤則不然。因為感情色彩或語用上的問題會使聽話人的心情不好或激起憤怒。此外交通規則或法律規定方面的問題會引起嚴重的後果。障礙的程度應視為決定教學順序的依據。  \n第十七周  自主學習  \n第十八周  自主學習",
    "methodologies": [
        {
            "type": "講述法",
            "note": "教師以宏觀的視角，逐周介紹核心内容与之有關的各種跨文化交際理論。"
        },
        {
            "type": "討論法",
            "note": "師生共同討論，探討各種跨文化交際案例。"
        },
        {
            "type": "合作學習",
            "note": "學生以生生互动的方式，分析各種跨文化交際案例中所遭遇的難題，並提出解決的方案。"
        },
        {
            "type": "專題研究",
            "note": "學生選取跨文化交際相關主題，撰寫期末研究報告。"
        },
        {
            "type": "其他",
            "note": "同學們按計劃關於每周學習內容做口頭報告。"
        }
    ],
    "grading": [
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "臺上表現及發言稿"
        },
        {
            "type": "專題",
            "weight": 40,
            "note": "期末研究報告"
        },
        {
            "type": "其他",
            "weight": 20,
            "note": "互動及討論"
        }
    ],
    "prerequisite": "",
    "general_core": []
}