{
    "year": 110,
    "term": 2,
    "name": "人生哲學與批判性思考",
    "teachers": [
        "紀金慶"
    ],
    "department": "GU",
    "code": "02UG010",
    "credit": 2,
    "serial": 896,
    "group": "C",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 4,
            "from": 3,
            "to": 4,
            "campus": "公館",
            "classroom": "理圖001"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本課程旨在引導同學對人生問題進行批判性的反思，恢復哲學的活動性意義。\n本課程以多元的教材(含哲學電影、文學作品、哲學理論)及反思性寫的訓練，引導同學進行「認識自己」、並進一步思索「如何成就自己」的哲學活動。課程內容分成三階段進行：一．首先是藉由哲學電影、哲學文學的閱讀，經營哲學反思的問題情境，興起同學對生命問題的關注與批判性的反思。二．是介紹東西方哲學實踐的傳統及哲學生活的構想。三．最後一個單元則是引導同學「做哲學」的實踐，引導同學經歷並思考建構生命意義過程的根本問題，如：如何認識自己、生命存在的空間問題、生命存在的時間問題、生命存在的價值問題等。\n課程操作具結構化引導的反思性寫作及自評互評的檔案教學，深化學生認識自己、敏銳觀察、對人生議題進行探究及形成合理論述的能力；並培養相與為善的合作學習及自我導向的學習能力。",
    "goals": [
        "深化認識自己、反思與批判能力",
        "培養相與為善的合作學習能力",
        "提升對自己及他者的觀察能力",
        "培養自我導向的學習及探究能力"
    ],
    "syllabus": "**第一周** **從柏拉圖到尼采****(I)**\n\n**第二周** **從柏拉圖到尼采****(II)**\n\n    柏拉圖，西方形上學的開端。從柏拉圖的形上學思維開始，西方世界開啟了一種面對生命的基本思維，將生命世界區分出感官與超感官層次，捨棄感官層次，而通過一定抽離程度的理性方式去審視生命，從而選擇人生價值。\n\n    柏拉圖的這種思維方式帶來正反兩面的文化影響，而一直到了十九世紀，才由尼采真正開啟另一種不同生命思維的浪潮。\n\n    在開學前兩周的課程中，我們除了介紹柏拉圖與尼采兩種生命哲學的基本思路外，也希望能與課堂上的同學充分討論兩種生命哲學對我們的啟發，以及在理解過後，如何衡量取捨的問題。\n\n**第三周** **沙特的存在主義****(I)**\n\n**第四周沙特的存在主義****(II)**\n\n    在20世紀，存在主義思潮反對傳統思維，並進而呼籲回歸真實生命。\n\n    儘管，於存在主義的主張中，不難發現其中許多立論都有待斟酌，然而，其能夠引起廣大的影響，也說明其主張反映了現代生活特殊的時代焦慮。\n\n    沙特的存在主義基本理念是什麼？而他的存在主義方案在20世紀遭遇許多的爭議，這些圍繞著存在主義的爭議是什麼？\n\n    在本周課堂中，我們主試圖從沙特存在主義的介紹以及相關爭議中得出我們自己的評判、以及對於現代文化處境的反思。\n\n**第五周** **海德格的存在哲學****(I)**\n\n**第六周** **海德格的存在哲學****(II)**\n\n    海德格在1946年回覆友人的〈人道主義書信〉中，審視並批判沙特存在主義的立論，在這篇名作中，海德格除了表達他對於傳統形上學、人道主義與存在主義的批判與反思外，同時也展露了海德格在思索真理問題時特有的批判性思考。\n\n  特別值得注意的是，在當代西方生命哲學思想的發展過程中，海德格除了開啟存在主義思潮的孕生外，此後也被推崇為當代詮釋學與與後現代思潮的先驅。\n\n    在本周的課堂中，我們將為同學提綱挈領的介紹海德格對於現象學與詮釋學的繼承與改造，並一同來思索在這種運用與改造中，讓我們對於生命的理解，帶來什麼嶄新的視野？最後，並期待與同學一起反思、斟酌在今天的生活處境，詮釋學與後現代主義所能帶給我們人生的啟發。\n\n**第七周** **漢娜鄂蘭的****《人的條件》****(I)**\n\n**第八周** **漢娜鄂蘭的****《人的條件》****(II)**\n\n    漢娜鄂蘭是當代重要的政治哲學思想家，她對於生命、文化與政治的批判融合了現象學與批判理論的長處，並飽含對於當代生活世界省思的人本關懷。\n\n    在這兩周的課堂中，我們將為各位同學描繪漢娜鄂蘭的經典著作《人的條件》的基本框架，尤其是漢娜鄂蘭對於現代社會批判以及相應提出的行動哲學。\n\n**第九周** **突破現代思考的反思與行動**: **從漢娜鄂蘭論****｢****邪惡的平庸性****｣****到德希達論****｢****責任****｣(I)**\n\n**第十周** **突破現代思考的反思與行動**: **從漢娜鄂蘭論****｢****邪惡的平庸性****｣****到德希達論****｢****責任****｣(II)**\n\n    《平庸的邪惡：艾希曼耶路撒冷大審紀實》，是漢娜鄂蘭反思納粹集中營的政治思想著作，且不同於一般性的政治評論，漢娜鄂蘭將批判性的深度，進一步的挖掘至現代性世界的根基，也就是現代工具理性的思維模式。\n\n    漢娜鄂蘭在這本著作中，提出了｢邪惡的平庸性｣的概念來解析現代技術理性所導致的無思狀態，並希望能夠進一步思索一種除了｢職責｣(duty)之外更積極的倫理要求，而這個要求恰與法國解構主義大師德希達的｢責任｣(responsibility)有所呼應。\n\n    在本周課堂中，我們所要解析的就是兩位哲人對於現代理性、現代體制的質疑，以及他們各自提出來新倫理要求為何的問題。\n\n**第十一周** **佛洛姆的****《****逃避自由****》****(I)**\n\n**第十二周** **佛洛姆的****《****逃避自由****》****(II)**\n\n    佛洛姆，揉合批判理論與精神分析的現代思想大師，他在經典著作《逃避自由》中從宗教革命、資本主義等等成因剖析現代心靈本應自由、卻為何由於承受不了自由的重負而轉為逃避自由。\n\n    在未來兩周的課堂中，我們將為同學解讀《逃避自由》這本著作，並一同來思想現代心靈何去何從的生命問題。\n\n**第十三周** **佛洛姆的****《愛的藝術》**\n\n    什麼是愛？愛的條件是什麼？我們又當如何愛？\n\n    以及，承接著上述三個問題，在現代世界的文化條件下，是什麼讓我們錯估了愛？是什麼讓我們常常錯將本已偏頗的關係更錯誤的誤植到情感關係上。\n\n    在本周的課堂裡，我們將通過佛洛姆的著作《愛的藝術》，一同來思考這個問題。\n\n**第十四周** **班雅明的廢墟哲學與彌賽亞救贖****(I)**\n\n**第十五周** **班雅明的廢墟哲學與彌賽亞救贖****(II)**\n\n    班雅明，現代批判思維中一個特殊的身影，在過去的歲月裡，由於班雅明的思想被劃歸在新馬克思主義的批判路線中，而使人長期低估了他的哲學批判所具有的潛力，直到70年代至後，學界才逐漸挖掘他潛藏的對於現代批判截然不同的視角。\n\n在接下來兩周的課堂中，我們將特別針對《德國悲悼劇的起源》、〈機械複製年代的藝術作品〉、〈說故事的人〉、〈歷史哲學綱領〉等班雅明著作的解析，來挖掘特屬於班雅明的批判思維，尤其是關於他的廢墟哲學與彌賽亞救贖，對於我們社會以及我們生命所帶來的啟發。\n\n**第十六周** **深層經驗的追尋**: **榮格對佛洛伊德精神分析的轉化****(I)**\n\n**第十七周** **深層經驗的追尋**: **榮格對佛洛伊德精神分析的轉化****(II)**\n\n    榮格，當代著名的精神分析大師。他對於佛洛伊德精神分析的繼承、批判與改造，將精神分析從心理學治療的範圍擴展至文化救贖、女性主義、宗教追尋、東方思想與人生哲學等各個面向。\n\n    在這兩周的課堂裡，我們將為各位同學講解榮格為何從佛洛伊德思想的傳統中出走、而他又如何轉化精神分析，使得精神分析具有生命哲學的深層意義。最後，我們仍舊是一同來思考、來斟酌榮格精神分析對於我們生命的啟發。\n\n**第十八周** **期末考**",
    "methodologies": [
        {
            "type": "講述法",
            "note": "由教師針對基本概念以及重要議題進行介紹"
        },
        {
            "type": "討論法",
            "note": "請學生針對理論的適用性以及當前文化經驗進行評估、論辯與討論"
        }
    ],
    "grading": [
        {
            "type": "期末考",
            "weight": 60,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 20,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": [
        "社會科學"
    ]
}