{
    "year": 110,
    "term": 2,
    "name": "臺灣流行文化",
    "teachers": [
        "莊佳穎"
    ],
    "department": "GU",
    "code": "03UG012",
    "type": "通",
    "grade": null,
    "credit": 2,
    "serial": 904,
    "group": "",
    "quota": {
        "limit": 120,
        "additional": 13
    },
    "schedule": [
        {
            "day": 4,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "誠101"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "",
    "goals": [
        "Learn how the concept of \"Taiwan\" was created, practiced",
        "Recognize the fluid nature of \"identity\" and \"culture\"",
        "be able to apply the cultural studies theories discussed in the course to their own subsequent research",
        "Ability to think critically about the current cultural conditions of Taiwanese society"
    ],
    "syllabus": "**Taiwan Popular Culture (EMI)**\n\n**Course instructor: Yin C. Chuang**[**\\***](#_ftn1)\n\n**Email:laalaapiano@gmail.com**\n\n**Course Outline**\n\nWhat is \"Taiwan\"? What is \"Taiwan Popular Culture\"?\n\nHow does \"Taiwan Popular Culture\" provide researchers with a snapshot of Taiwanese consumer society?\n\nWhy and how, do fans of popular culture fall in love with particular fandoms?\n\nHow is pop culture content produced and consumed?\n\nHow can one understand the relationship between Taiwan’s popular culture and its democratic political process?\n\nThe Eslite Bookstore（誠品書局）, Shiny 3 sisters（閃亮三姊妹）, Hello Kitty, Pili Puppet Show（霹靂布袋戲）, _Cape No.7_（海角七號）, Lantern Soy sauce Braised Food（燈籠滷味）, Jay Chou（周杰倫）, Starbucks（星巴克）, A-Bian Doll（扁娃）, the Beehive Fireworks Festival（鹽水蜂炮）, the film _Our Times_（我的少女時代）, the TV drama _Back to the Good Times_（花甲男孩轉大人）etc.\n\nThese cultural touchstones could all be said to contribute to an iconic image of  contemporary Taiwan popular culture. Not only has each attracted its own set of fans, but they also represent a selection of the diverse local vibes and subcultural scenes in Taiwanese society, and hint at the ways variations in taste, are never independent from issues of class, and ethnic identity.\n\n \n\n**Course Goals**\n\nIn past 30 years Taiwanese society has experience the rapid development of democracy and the growth of a consumer society. As part of these cultural and political shifts, an endless proliferation of pop culture symbols, idols, and icons have largely replaced the authoritarian ideology of the ROC state. (Re)producing new personal identities and shifting collective identities from a collage of these consumer products has already become part and parcel of Taiwanese daily life. In so far as these consumer-capitalist practices have been essential to the successful establishment of Taiwanese democracy, one can also say that examining them is crucial if we want to understand the attendant emergence and construction of Taiwanese ethnic and nationalist identities.\n\nCulture can be regarded as infinite, fluid, made by and for the people and essentially a work ‘in progress’ that is constituted by everyday practices. It follows that the study of popular culture must also keep an ear to the pulse of the latest trends.\n\nThus, this class doesn’t quite fit within the conventional frameworks of courses in Taiwanese cultural or political history, (these often tend to focus on the Taiwanese bourgeoisie's so called \"high culture” and its state-funded manifestations) instead, we will shift our focus to the most commonplace (one might say vulgar or ‘low’) forms of popular culture which are present in Taiwanese daily life and popular consumer culture.\n\nTogether, we will take another look at a range of quintessentially ‘Taiwan’ pop cultural phenomena such as night-markets, shopping and brand-loyalist queueing culture, betel nut girls, itinerant erotic dance trucks, Taiwanese appropriation of Japanese pop culture (porn/erotica, ACG, idol dramas) baseball, pulp fiction, Taiwanese \"kawaii\" culture…etc…all of which are so familiar to Taiwanese people that we often take them for granted as we go about our daily routines. In our reexamination of popular culture, we will connect our analyses of disparate objects using the following five themes: 'Cultural Commodities'; 'Bodily performance and Representation(s)'; 'Cultural crossover and Consumption Practices', 'Identity and Democracy', 'Cultural Hybridity—Made in Taiwan.' We will return to these themes regularly in our weekly discussions.\n\nThrough detailed analysis of some of Taiwan’s most iconic pop cultural phenomena, this course doesn’t presume to provide a comprehensive survey of Taiwan pop culture, nor will it teach students the ‘right way’ to read pop culture; instead it seeks to offer students to embrace new and more critical way of thinking, viewing and engaging with Taiwan pop culture.\n\nAfter taking this course, hopefully you will be able to establish your own grassroots perspective on Taiwanese civil society, sharpen your perceptions of cultural phenomena you're interested in, and apply these insights to your future research and/or everyday practices.\n\nStudents will work with the instructor to accomplish the following goals⏤\n\n1.  Understand how 'Taiwaneseness' is (re-)produced, circulated, practiced, and consumed in Taiwan’s popular culture.\n2.  Recognize the essential fluidity of concepts such as 'Identity' and 'Culture' as they are articulated through daily practices. Understand the relationship between 'popular cultural practice' and the 'Taiwanese democratization.'\n3.  Practice applying cultural studies theories in research and everyday life.\n4.  Develop a critical perspective on contemporary Taiwanese social and cultural life.\n\n**Teaching Methods and Strategies**\n\nTo participate in this course, you are expected to read all assigned readings and primary source documents and participate in all class discussions. Before every class you shall read the books/ documents selected in Weekly Required Reading which we will discuss in the first period Seminar/ Discussion hour where the small-group on duty for that week will present their insights on the week’s main themes. This will be followed by a Lecture given by professor (period two), which will lead into a final discussion session. Each group is asked to produce a mini film to be turned in at mid-term week, and each group will complete an open-book final exam together. Although much of the coursework is conducted in groups, throughout the course, you are expected to develop and share your own opinions and critical thoughts about Taiwanese popular culture.\n\n**Classroom Activities & Evaluation Standards**\n\nI. Mid-term Mini Film Project (15%)\n\nEach group is expected to produce a mini film about a Taiwan popular cultural phenomenon of their choice. The project could be inspired by your own daily life, materials from the course or your observation. The film should introduce the phenomenon, share your views of it, analyse and criticize it by applying theories or perspectives from the class.\n\nThe film could be documentary or drama, genre is not restricted, but it must convey your group’s unique perspective and original thoughts on Taiwanese society. Evaluation is according to the creativity, production quality, and the theoretical/critical rigor of the film.\n\nII. Individual Mid-term Reflection Essay (10%)\n\nThis assignment should consist of two parts:\n\n1.  Course Evaluation: in 150-300 words share your thoughts and opinions about main themes of the course thus far.\n\nInclude: \n\n1.  How has the course changed your perspective on pop cultural texts and objects and/or your everyday engagement with pop culture?\n2.  a self-evaluation about your group’s mid-term film production process and the contributions of each member.\n\n1.  Cultural Event Attendance & Reflections: a crucial objective of the course is to get students to develop a critical understanding of everyday life. Thus, much of your learning should happen outside the classroom, as you reconsider minute details of daily life. In the first half of the semester you are expected to attend a concert, a speaking event, theatrical performance or film screening, and record your critical reflections on it. (the Instructor will recommend upcoming films, concerts and other cultural events during the weekly course.)\n\nIII. Group Open-book Final Exam & Individual Final Report\n\n1\\. Open-book final exam (15%)\n\nThe Final exam will be open-book, each group should work together to complete the test. The questions are related to the contents of each week’s themes and to current popular culture phenomenon, you are asked to discuss and answer the questions by using theories and perspectives introduced in classes and/or by consulting additional relevant sources such as those available at the NTNU library. (Detailed exam regulations will be explained in class.)\n\n2\\. Individual course report (5%)\n\nIn 150-300 words share:\n\n1.  your reflections on the course as a whole. What did you learn? What are your opinions on materials covered, assignments, readings, the pacing of the course, format and quality of instruction etc.\n2.  your thoughts about the final group exam, your group’s division of labor and the contributions of each member, and your own self-evaluation.\n\n3\\. Group Presentation (20%):\n\nEach study group will select one of the weekly main themes and be responsible for presenting, and taking questions from classmates. Presentations should be 35 minutes and must involve the participation of every group member. The TA will ring a bell every 7 minutes during the presentation. 1 point will be deducted from every group member for each minute exceeding the limit.\n\n4\\. Class Participation (25%)\n\nStudents will be evaluated according to attendance and speaking up in class.\n\nStudents who fail to attend during the first week of class will lose 10 points on their semester participation grade. All other absences will be docked 5 points per missed roll call. Upon a third absence, students will receive 0 points for participation. (See full description of the attendance policy in Attached File 1)\n\n5\\. Commenting on Course Website and Weekly Lecture Notes (10%)\n\n* * *\n\n[\\*](#_ftnref1) Yin C. CHUANG has a PhD in Sociology from Lancaster University, UK and is an Associate Professor at the Department of Taiwan Culture, Languages and Literature at Taiwan Normal University (NTNU), in Taipei, Taiwan. Dr. Chuang is also the Deputy Director at the International Taiwan Studies Center, NTNU, and the President of East Asian Popular Culture Association. Her research interests are nationalism and national identities, democratization, everyday practices and popular culture.",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": ""
        },
        {
            "type": "Group discussion",
            "note": ""
        },
        {
            "type": "Problem base learning",
            "note": ""
        },
        {
            "type": "Cooperative learning",
            "note": ""
        },
        {
            "type": "Media, audio, visual materials",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "Final exam",
            "weight": 20,
            "note": "Group Open-book Final Exam & Individual Final Report\n\n1. Open-book final exam (15%)\n\nThe Final exam will be open-book, each group should work together to complete the test. The questions are related to the contents of each week’s themes and to current popular culture phenomenon, you are asked to discuss and answer the questions by using theories and perspectives introduced in classes and/or by consulting additional relevant sources such as those available at the NTNU library. (Detailed exam regulations will be explained in class.)\n\n2. Individual course report (5%)\n\nIn 150-300 words share:\n\nyour reflections on the course as a whole. What did you learn? What are your opinions on materials covered, assignments, readings, the pacing of the course, format and quality of instruction etc.\nyour thoughts about the final group exam, your group’s division of labor and the contributions of each member, and your own self-evaluation."
        },
        {
            "type": "Class discussion involvement",
            "weight": 25,
            "note": "Class Participation (25%)\n\nStudents will be evaluated according to attendance and speaking up in class.\n\nStudents who fail to attend during the first week of class will lose 10 points on their semester participation grade. All other absences will be docked 5 points per missed roll call. Upon a third absence, students will receive 0 points for participation. (See full description of the attendance policy in Attached File 1)"
        },
        {
            "type": "Presentation",
            "weight": 20,
            "note": "Group Presentation (20%):\n\nEach study group will select one of the weekly main themes and be responsible for presenting, and taking questions from classmates. Presentations should be 35 minutes and must involve the participation of every group member. The TA will ring a bell every 7 minutes during the presentation. 1 point will be deducted from every group member for each minute exceeding the limit."
        },
        {
            "type": "Shows/ Exhibitions",
            "weight": 25,
            "note": "Mid-term Mini Film Project (15%)\n\nEach group is expected to produce a mini film about a Taiwan popular cultural phenomenon of their choice. The project could be inspired by your own daily life, materials from the course or your observation. The film should introduce the phenomenon, share your views of it, analyse and criticize it by applying theories or perspectives from the class.\n\nThe film could be documentary or drama, genre is not restricted, but it must convey your group’s unique perspective and original thoughts on Taiwanese society. Evaluation is according to the creativity, production quality, and the theoretical/critical rigor of the film.\n\nII. Individual Mid-term Reflection Essay (10%)\n\nThis assignment should consist of two parts:\n\nCourse Evaluation: in 150-300 words share your thoughts and opinions about main themes of the course thus far.\nInclude: \n\nHow has the course changed your perspective on pop cultural texts and objects and/or your everyday engagement with pop culture?\na self-evaluation about your group’s mid-term film production process and the contributions of each member.\nCultural Event Attendance & Reflections: a crucial objective of the course is to get students to develop a critical understanding of everyday life. Thus, much of your learning should happen outside the classroom, as you reconsider minute details of daily life. In the first half of the semester you are expected to attend a concert, a speaking event, theatrical performance or film screening, and record your critical reflections on it. (the Instructor will recommend upcoming films, concerts and other cultural events during the weekly course.)"
        },
        {
            "type": "other:",
            "weight": 10,
            "note": "Commenting on Course Website and Weekly Lecture Notes (10%)"
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}