{
    "year": 110,
    "term": 2,
    "name": "愛情學",
    "teachers": [
        "高松景"
    ],
    "department": "GU",
    "code": "03UG034",
    "credit": 2,
    "serial": 910,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 18
    },
    "schedule": [
        {
            "day": 3,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "誠402"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "「愛情」是一種高度的心靈活動，亦是人性中的最後一項奧秘;「婚姻」則是一輩子的承諾，「家庭」更是由兩個人因著愛而結合的最親密組織，不論是生理上合一的生育行為，或是心理上合一的彼此互屬，都與「全人的性」（sexuality）有著密切的關係。當傳統的婚姻與家庭已隨著社會變動而遭解構時，我們該如何重新定義呢？在自由戀愛下，婚姻已不再是不再由父母支配，希望自由婚配能夠讓自我更為整全，已取為愛而結婚。在後現代社會「愛情、婚姻、家庭」等與親密關係相關的議題，已非只是單純的個人關係，而是重要的社會公共政策，更是現代民主社會每個人都必須學習的功課。但由於愛情議題高度複雜性，需採取跨學科跨領域的統整探究，始能一窺其真實面貌。\n    國際間性教育課程已經歷五代發展的演變，於2010年歐洲性教育標準所倡導的「全人性教育」（Holistic Sexuality Education）正是採取跨學科的課程設計，可用來引導學生探究真實生活的「愛情」議題的統整課程設計理念。全人性教育是一種「愛的教育」,係教導健康親密關係；全人性教育也是一種「品格教育」，其教導的重點不只是在「性知識」，而是與性有關的「價值」，以及實踐價值所需要的「能力」。全人性教育是要發揚「人性」，教人成人。\n   「不婚」、「高離婚率」與「少子化」是當前國內重要的社會議題，大學「愛情學」跨學科通識課程的開設，可召喚大學生重新思考與定義「愛情、婚姻、家庭」的新價值與自我實現。本課程設計以學習者為中心，在探究、發表、論證、與PBL實作中淬練學生協作性的學習；在理論與實務之間，引導學生後設性思考，期望能培育學生具備經營愛情相關議題之健康親密關係所需的知識、價值與能力，並成為倡議以「愛」為基礎的婚姻與家庭公民行動轉化型知識份子。",
    "goals": [
        "增進學生對愛情相關議題（愛情、婚姻與家庭）能從「全人性教育」人性學的統整觀點，產生跨學科的理解。",
        "發展學生探究現代民主社會愛情相關議題的分析方法，透過多元觀點的對話，產生觀點取替，並認識當前國內社會低生育率及高離婚率的深層問題。",
        "培養學生經營愛情相關議題之健康親密關係所需的知識、價值與能力，並成為倡議以「愛」為基礎的婚姻與家庭公民行動轉化型知識份子。"
    ],
    "syllabus": "一、課程名稱：愛情學\n\n二、課程簡介：\n\n愛情，是愛情，推動著世界的發展；或許維吉爾是對的，推動著世界發展的，是愛情。那什麼是愛情呢?從「全人性教育」（sexuality education）的觀點：「愛情」是一種高度的心靈活動，是人性中的最後一項奧秘，也是一生中最浪漫的修行。「婚姻」則是一輩子的承諾，「家庭」是由兩個人因著「愛」而結合的最親密組織。不論是生理上合一的生育行為，或是心理上合一的彼此互屬，都與「全人的性」（sexuality）有著密切的關係。\n\n當傳統的婚姻與家庭已隨著社會變動而遭解構時，我們該如何重新定義呢？在自由戀愛下，婚姻已不再是不再由父母支配，希望自由婚配能夠讓自我更為完整，以及為實現彼此的「愛」而結婚的婚姻觀。在後現代社會「愛情、婚姻、家庭」等與親密關係相關的議題，已非只是單純的個人關係，而是重要的社會公共政策，更是現代民主社會每個人都必須學習的功課。但由於愛情議題高度複雜性，需採取跨學科跨領域的統整探究，始能一窺其真實面貌。\n\n    「愛情學」是一門探討愛情理論與實務的跨領域整合學問，愛情學的理論基礎包含愛情生理學、愛情心理學、愛情社會學、愛情哲學與愛情病理學; 而愛情學實務則是以關係發展的五個歷程為主軸（浪漫期、權力衝突期、整合期、承諾期與共同創造期），聚焦探討「我們要從愛情獲得什麼」這個核心問題, 來拆解愛情的五個原理：投射原理、收回投射原理、溝通原理、創造性原理及自性化原理。\n\n   本課程設計採取「全人性教育」跨學科的課程設計，來引導學生探究真實生活中的「愛情」議題。全人性教育強調性教育是一種「愛的教育」,係教導健康親密關係；也是一種「品格教育」，其教導的重點不只是在「性知識」，而是與性有關的「價值」，以及實踐價值所需要的「能力」；是要發揚「人性」，教人成人。\n\n    「不婚」、「高離婚率」與「少子化」是當前國內重要的社會議題，大學「愛情學」跨學科通識課程的開設，是希望能召喚大學生重新探索與定義「愛情、婚姻、家庭」的新價值。本課程教學法係以學習者為中心，在探究、發表、論證、與問題導向學習PBL實作中淬練學生協作性的學習；在理論與實務之間，引導學生後設性思考，期望能培育學生具備經營健康親密關係所需的知識、價值與能力，並成為倡議以「愛情」為基礎的婚姻與家庭公民行動\n\n轉化型知識份子。\n\n**三、教學進度與主題【16+2週】**\n\n1.2月16日：相見歡、課程簡介、作業與評量說明\n\n**《****破解愛情--愛情的模樣****》**\n\n2.2月23日：愛情學的基本概念(一) 婚姻制度會消失嗎？為何要推動「愛情學」\n\n  --從「人類性學」談三次性革命【影片賞析：金賽性學教室、上課前請先行觀看】\n\n3.3月2日：愛情學的基本概念(二)人為何要結婚？實踐彼此的愛--全人性教育「人\n\n  性學」觀點【辨論賽】\n\n4.3月9日：愛情學的基本概念(三)不要相信愛情!我們需要拆解「愛情原理」\n\n  【心理測驗】\n\n**《狩獵愛情：愛情的開始》**\n\n5.3月16日：愛情學議題（一）如何脫魯呢？開啟一段關係【導入問題導向學習PBL】\n\n  【建立期末PBL小組】\n\n6.3月23日：愛情學議題（二）愛無能世代---找回愛的能力【影片賞析：後來的我\n\n  們】【角色扮演】\n\n7.3月30日：愛情學議題（三）愛情是怎樣發生的呢？愛上一個人是一種投射\n\n  【配對體驗活動】【邀請同性戀夥伴分享感情經驗】\n\n8.4月6日：愛情學議題（四）從「模擬約會」探討大學生愛情困擾議題,小組擬定期\n\n  末愛情學PBL所要探究的「主題與問題」,並撰寫「問題陳述/情境」（開放空間會議\n\n  +蘇格拉底對話）\n\n**《眷養愛情：愛情的經營》**\n\n9.4月13日：愛情學議題（五）當激情浪漫消退時愛情還再？談親密關係的發展歷程\n\n【影片賞析--愛情平衡木、Kiss 情人】\n\n1.  月20日：愛情學議題（六）親密關係為何會有「衝突」? 真愛始於收回投射\n\n4.  月27日：愛情學議題（七）情侶吵架怎麼辦？為何對方總是不瞭解我？\n5.  【互動式遊戲教學】【小組期末PBL分析問題並展開探究問題】\n\n12.5月4日：愛情學議題（八）「性行為、同居、劈腿」愛情選擇題--健康的親\n\n   密關係中的「性自主權」【「人間四月天」角色扮演座談會】\n\n**《回歸愛情：愛情的結束與承諾》**\n\n13.5月11日：愛情學議題（九）無法自拔的戀情--愛情病理學愛\n\n  【影片賞析--令人討厭的松子的一生、分組合作學習--拼圖法】\n\n14.5月18日：愛情學議題（十）起飛之前先學降落—好好分手\n\n15.5月25日：愛情學議題（十一）談戀愛一定要走入婚姻嗎？愛情的承諾與創造\n\n16.6月1日：愛情學期末PBL結案口頭發表（採開放空間會議方式進行報告、評量方 式：自評與互評）\n\n17.月8日：小組自主學習：進行小組PBL結案書面報告\n\n18.6月15日：小組自主學習：完成小組PBL結案書面報告",
    "methodologies": [
        {
            "type": "講述法",
            "note": "配合學習單並ppt簡報，有系統論述愛情學的基本概念及愛情學重要議題內容"
        },
        {
            "type": "討論法",
            "note": "依教學目標，適切採取六六討論法、小組討論、世界咖啡館、開放空間等討論方法，以促進學生間互動、對話，交流觀點"
        },
        {
            "type": "問題解決教學",
            "note": "採問題導向學習PBL的小組合作學習，針對大學生關心的感情困擾與愛情學議題進行觀點交流與觀點取替，共同探討解決問題方案"
        },
        {
            "type": "合作學習",
            "note": "採問題導向學習PBL的小組合作學習，針對大學生關心的感情困擾與愛情學議題進行觀點交流與觀點取替，來促進學生對話與學習。"
        },
        {
            "type": "實驗/實作",
            "note": "1.學生個別進行模擬約會，2.分組依所關心感情問題，進行PBL探究與實作活動，讓學生獲得對生活中愛情議題的實際問題的理解，有效引導學生探究。"
        },
        {
            "type": "媒體融入教學",
            "note": "播放DVD影片、自製PPT等輔助媒體"
        },
        {
            "type": "其他",
            "note": "邀請愛情學議題相關的各領域專家擔任資源人物，來到課堂與學生做面對面對話。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "1.配合課堂進度所播放影片觀後心得與作業\n2.出場卷（瞭解學期中同學的學習情形及瞭解同學的疑惑, 以提供老師教學改進意見）"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "學習的產生來自於彼此聆聽、對話與分享，因此課堂積極參與課堂進行的學習活動，是課堂美麗風景的呈現。"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "請假同學請務必於課前告知，出席情形佔10%"
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "期中模擬約會—踏出大學生感情生活的第一步（4/6前透過moodle繳交）（進行方式與報告格式老師提供）。"
        },
        {
            "type": "專題",
            "weight": 25,
            "note": "期末愛情學PBL結案報告（25%）--採問題導向學習（Problem-based learning, PBL）小組分組合作方式完成，這項報告分三階段完成。第一階小組設計完成PBL的「問題陳述/情境」,並決定各小組所要挑戰的問題（4/20），也就是各組所設計的PBL問題情境是由別組來挑戰, 然後展開「問題分析」與「問題探究」。第二階段是小組經探究問題後，再度面對問題, 研擬解決問題的方案，並於期末做口頭ppt報告（6/1）。第三階段是透過期末世界咖啡館做口頭報告後, 進行增修, 完成期末PBL結案書面報告（報告格式老師提供、並請於6/19前繳交）。此部份評量採同學「自評與互評」,評量分問題情境設計及PBL口頭報告。"
        },
        {
            "type": "其他",
            "weight": 15,
            "note": "期末個人整體學習心得15%（報告格式老師提供、6/19前繳交）"
        }
    ],
    "prerequisite": "",
    "general_core": [
        "社會科學"
    ]
}