{
    "year": 110,
    "term": 2,
    "name": "創意設計與發明",
    "teachers": [
        "陳美勇"
    ],
    "department": "GU",
    "code": "06UG022",
    "credit": 2,
    "serial": 984,
    "group": "",
    "quota": {
        "limit": 34,
        "additional": 1
    },
    "schedule": [
        {
            "day": 5,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "工209"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本課以創意、創造及想像力為主題，初期課程安排活動教學，引導學生拋棄本位思維、發揮同理心、體會連續性與非創意性創意思考、體驗團隊創造與想像。次之，授以創意技法，輔以創意成品案例分享，加上創意商品化之概念，下半學期則鼓勵學生進行創意發想，並引導學生嘗試專利撰寫，讓本課程修畢學生在創新、創意、創造之能力有所提升，且課程結束能有申請專利之經驗，更佳者則能帶走一份專利在身。\n\n【上半學期】\n具體而言，上半學期前十週課程在於培養學生具備創意的基本人格特質及能力，如同理心、連續創意思考、非創意性創意思考等。而在想像創新能力方面，授以TRIZ、SCAMPER、情境分析等創意法；第三階段則提供機構、感測器、六項發明類別設計案例分享。\n1.\t創意思維─去除本位與同理心訓練\n2.\t創意思維─連續性與非創意性創意思考\n3.\t創意思維─團隊創造與想像\n4.\t創思技法─TRIZ\n5.\t創思技法─SCAMPER\n6.\t創思技法─情境分析\n7.\t機構設計與發明\n8.\t感測器設計與發明\n9.\t發明案例分享\n【下半學期】\n下半學期課程則安排學生進行專題發想，以綜合檢視上半學期有關創意發明特質及想像創新能力培育之成果，並安排專利練習。\n1.\t專題發想\n2.\t專利練習\n3.\t成果發表\n4.\t發明專利化",
    "goals": [
        "能與同儕以小組合作方式設計出一項創意專題設計。",
        "能以多種角度描述、分析、比較與批判既有商品或專利之異同。",
        "能設計出以使用者體驗為中心的專題設計。",
        "能有效應用模擬工程軟體、工程製圖軟體或專利查詢引擎等資訊工具協助專題發想，並具實現及商品化的可行性。",
        "養成主動探究商品意涵、功能、機構設計及科學原理的終身學習習慣。",
        "能思考如何以創意及同理心的角度解決生活問題，及完成創意發想專題。",
        "能在專題發想中，實踐社會關懷及環境意識。"
    ],
    "syllabus": "【授課方式：16+2週】，即「16週＋2週彈性教學（第17、18週）」\n\n本通識課程內容針對同學在實習場域之工作有關，故不建議本學期未在業界工廠實習的同學選修。謝謝!!!\n\n第一~十六週:專題式演講與討論  \n第十七~十八週:彈性數位教學時間\n\n**第一週(2/18) : 課程大綱及創意思維─去除本位同理心訓練&連續性與非創意性創意思考**  \n首次課程將說明課程整體規劃，並進行去除本位與同理心訓練。課程安排不同組別學生以不同規則進行撲克牌點數遊戲，並要求各組成員輪調至不同組別去進行遊戲，全程不得以言語溝通，藉以引導學生感受個體本位衝突及同理心的重要，再進一步分析同理心在創意設計及發想中的重要性及使用者中心相關成品分享。**連續性與非連續性創意思考的**活動設計，以「雙盲」及「具脈絡」創意元素的組合，讓學生體會連續性及非連續性創意思考的思維差異。前者藉由引導學生小組成員撰寫無厘頭文章，輪流賦予小組文章新意義，再以具脈絡性質自創賦予新意義，體會連續創意思考及非連續創意思考在思考邏輯上根本的差異，再進一步分享非連續創意思考相關成品及其構思過程。\n\n**第二週(2/25)**  **創意思維─團隊創造與團隊想像**  \n以小組為單位，各成員選擇代表色後，應用海報紙及色筆，共同輪流於海報紙上創作抽象畫，期間各成員間不得互相溝通，完成團體抽象畫創作，並輪流對抽象畫作命名，並分享命名名稱過程及共同或相異想法之處。第二輪則給予團隊成員溝通的機會，完成抽象畫作及命名後，同樣分享共同或相異想法之處。藉以引導學生了解小組成員於各創作想像歷程中，與他人溝通交流想法重要之處。\n\n**第三週 (3/4)** **創思技法─SCAMPER)**  \nSCAMPER為檢核表技術的一種，為Substitute（取代）、Combine（合併）、Adapt（調適）、Modify（修改）、Put to another use（其他用途）、Eliminate（消除）及Reverse（反轉）七種創思技法的合稱。SCAMPER提醒個體於創作發明時，能掌握七種不同的思考角度，更全面檢視成品規劃。課程將安排學生對於各項成品以SCAMPER分析各項技法與元素，再基於現有產品，以SCAMPER進行改版設計，培養學生體驗、評比及同理等想像設計素養。\n\n**第四週(3/11)**  **創思技法─情境分析**  \n情境分析是基於「事出有因」，認為事物成因是由於多項高度不確定性的因素所造成的。因此，情境分析強調使用者透過分析及推演各項變數，模擬分析各種不同情境中，各變數間之影響，再針對整體各項變數之一致性作檢視。課堂中，藉由確定使用目的、辨別關鍵因素、釐清情境設定、推演情境邏輯、分析情境意涵等步驟，引導學生發現真實情境中可能的創新角度。\n\n**第五週(3/18)** **機械設計與創新發明展案例分享**  \n想像創新後，下一階段個體將面臨的問題便是如何設定有效的機構、具體實現發明品及實現設計目的。因此，引導學生認識多樣化的機構設計將更有助於學生創新設計。本堂課將以機械設計角度層遞性分析各項發明品零件、結構、系統、成品等，再進一步引導學生結合SCAMPER及情境分析法，思考不同機構的新用途及創意發想。\n\n**第六週(3/25)實習工廠案例討論**\n\n每位同學針對各自實習工廠的工作內容與使用之設備做5分鐘之報告，並提出該工作或設備有待改進之處，課堂上一起討論並回饋。\n\n**第七週(4/1)** **感測器與物聯網之應用**  \n基於學生對於機構的認識，將進一步引導學生認識各項感測器，為下半學期想像創意發明專題設計奠定基礎。本課程單元將著重介紹感測器偵測物理量、化學量或生物量之功能，再進一步說明感測器所偵測到之訊號，應用於物聯網感知層之應用情形。\n\n**第八週 (4/8)~第十一週(4/29)** **實作訓練課程**  \n在機構設計與感測器理論課程後，本週開始連續四週將教導同學控制器之應用與機構之實現。由於班級人數眾多，為加強同學在實作上之學習成效，將採取分A、B Group雙週分班輪流授課的方式進行課程之教學：  \n(1)控制器與感測器之應用：將於工教系TA210電腦教室進行Arduino之程式設計，學習微控制器之輸入與輸出設定，顯示模組與感測模組之整合應用。(A Group第八及九週、B Group第十及十一週)  \n(2)機構設計與應用：將於科技系TB301創客教室進行機構之組裝與測試，學習多種機構之組成與應用場合。(B Group第八及九週、A Group第十及十一週)\n\n**第十二週 (5/6)** **綠能創新發明與應用實例分析**  \n台灣自古以農立國，在過去台灣農業全盛時期，於各農戶家中皆可見到牛車、水車、磨坊等農業技術痕跡。承襲這種與自然共生的理念，配合近年興起的環境意識、環境保護及永續經營等觀念，綠能產品也被逐漸重視。因此，本週安排綠能科技創新發明進行分享，對環境保護、廢物利用有幫助之發明，發明者須以同理心解決使用者之使用需求，以規劃發明品設計。\n\n**第十三週 (5/13)** **智慧發明專家講座**  \n經本課程第一部分，了解發明思維及發明技法後，本週將邀請各發明競賽具代表性之發明者、Maker、領隊教師、裁判評審等，前來分享其發明設計歷程，以提供同學最直接及直觀的經驗傳承。\n\n**第十四週(5/20) 專題激盪與發想與專題系統規劃**  \n自本堂課程開始，教師將強化過往以來以學習者為中心的課程設計，引導學生以小組為單位進行專題主題初步發想，再以之前學到的思考技法周延相關設計，作為專題發展之基礎。系統性規劃即將零碎的功能重新組織，使成品的使用更有效率、更經濟。此外，系統規劃成品的過程，將有助於個體重新思索各功能間的相關性及整合性，使整體設計架構更為簡潔精煉及具備完整性。因此，本堂課將引導學生對於其專題設計進行系統化規劃，並就各機能間之關聯、整體與統整性等進行檢視並完成專題設計。\n\n**第十五週 (5/27)期末專題發表**\n\n於期末最後一堂課，將安排專題成果發表，發表形式得採簡報、模型展覽、多媒體影片展示等，就各組設計理念、發想過程、系統規劃、機構設計及及感測控制器重點等上台分享，用以檢視本課程學習成果。\n\n**第十六週 (6/3)** **端午節**",
    "methodologies": [
        {
            "type": "講述法",
            "note": "講授創意技法，輔以以多種角度描述、分析、比較與批判既有商品或專利之異同。"
        },
        {
            "type": "討論法",
            "note": "能思考如何以創意及同理心的角度解決生活問題，及提出創意發想專題。"
        },
        {
            "type": "問題解決教學",
            "note": "養成主動探究商品意涵、功能、機構設計及科學原理的終身學習習慣。"
        },
        {
            "type": "合作學習",
            "note": "能設計出以使用者體驗為合作中心的專題設計。"
        },
        {
            "type": "專題研究",
            "note": "能與同儕以小組合作方式設計出一項創意專題設計。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 40,
            "note": "PBL導向式作業"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "能於課堂上充分討論及發表意見"
        },
        {
            "type": "專題",
            "weight": 50,
            "note": "創意專題設計"
        }
    ],
    "prerequisite": "",
    "general_core": [
        "自然科學"
    ]
}