{
    "year": 110,
    "term": 2,
    "name": "一般醫學常識",
    "teachers": [
        "彭書韻"
    ],
    "department": "GU",
    "code": "06UG027",
    "type": "通",
    "grade": null,
    "credit": 2,
    "serial": 986,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 0
    },
    "schedule": [
        {
            "day": 4,
            "from": 6,
            "to": 7,
            "campus": "公館",
            "classroom": "理圖003"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "",
    "goals": [
        "Discussions will include current medical issues to help students think critically and present their views.",
        "Students will work in groups to present an international topic of their choice and be prepared to respond to critiques from their classmates.",
        "Students will be equipped with the skills to carry out lifelong learning to keep abreast of current medical issues in society.",
        "Students will become aware of unhealthy lifestyle habits as well as trending healthy fads and good living choices."
    ],
    "syllabus": "Week 1 – Class introduction\n\nWeek 2 - Cardiovascular System\n\n        Students will learn about diseases in the cardiovascular system, risk factors, protective habits and good lifestyle choices.\n\nWeek 3 – One group will present an issue on the cardiovascular system for the class to participate in feedback, critique and debate. Topic suggestion: regulation on unhealthy ingredients in junk food.\n\nWeek 4 – Gastrointestinal Tract \n\n        Students will learn about the digestive tract, common infections, and genetic factors in causing disease.\n\nWeek 5 - One group will present an issue on the gastrointestinal system for the class to participate in feedback, critique and debate. Topic suggestion: What resources can be utilized when you encounter a belly pain.\n\nWeek 6 – Genitourinary Tract \n\n        Students will learn about common diseases and infections of the genitourinary tract as well as protective factors.\n\nWeek 7 – One group will present an issue on the genitourinary tract for the class to participate in feedback, critique and debate. Topic suggestion: Should the family doctor of an under-aged patient tell his/her family of a diagnosis of a sexually transmitted disease?\n\nWeek 8 – Skin, hair and Nails \n\n        Students will learn about the integumentary system, the common unsightly conditions and preventative measures.\n\nWeek 9 - One group will present an issue on the integumentary system for the class to participate in feedback, critique and debate. Topic suggestion: Why is there a stigma surrounding obvious diseases of the skin?\n\nWeek 10 – The Head and Neck\n\n        Student will learn about common disease of the eyes, ears, nose and throat, as well as conditions of the face and neck.\n\nWeek 11 - One group will present an issue on the head and neck for the class to participate in feedback, critique and debate. Topic suggestion: Imagine losing your eyesight for a week, how do you think you will cope?\n\nWeek 12 – Musculoskeletal System \n\n        Students will learn about problems with the bones and muscles, and how to prevent them.\n\nWeek 13 - One group will present an issue on the musculoskeletal system for the class to participate in feedback, critique and debate. Topic suggestion: How do you feel about athletes who take enhancement to improve their performance?\n\nWeek 14 – The Respiratory System\n\n        Students will learn about common infections and diseases of the respiratory system, how to keep the system healthy and treatment.\n\nWeek 15 - One group will present an issue on the respiratory system for the class to participate in feedback, critique and debate. Topic suggestion: Reflections on COVID-19.\n\nWeek 16 – Cancers\n\n         Students will learn about the most common cancers, their pathology, treatment options and prognoses.\n\nWeek 17 - One group will present an issue on cancers for the class to participate in feedback, critique and debate. Topic suggestion: What things can you say and do to help a cancer patient in their battle against disease?\n\nWeek 18 – Oral presentation (Term report due) \n\n       Students will give group presentations on a topic discussed during the semester.\n\nTerm report: One A4 page on views of a health related topic.",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "Teacher brief at start of class on the body system of the week."
        },
        {
            "type": "Group discussion",
            "note": "Critique, feedback and debate from classmates on the weekly group presentation."
        },
        {
            "type": "Problem base learning",
            "note": "Discussion on problems encountered researching the weekly presentation topic."
        },
        {
            "type": "Cooperative learning",
            "note": "Group work in presentation preparation and delivery."
        },
        {
            "type": "Media, audio, visual materials",
            "note": "Online videos related to the weekly topic will be selectively utilized."
        },
        {
            "type": "Case studies",
            "note": "Topics of discussion will encourage students to think critically on the body system of the fortnight."
        }
    ],
    "grading": [
        {
            "type": "Midterm Exam",
            "weight": 30,
            "note": ""
        },
        {
            "type": "Class discussion involvement",
            "weight": 20,
            "note": ""
        },
        {
            "type": "Attendances",
            "weight": 20,
            "note": ""
        },
        {
            "type": "Presentation",
            "weight": 30,
            "note": ""
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}