{
    "year": 110,
    "term": 2,
    "name": "星星月亮太陽－天文漫談",
    "teachers": [
        "橋本康弘"
    ],
    "department": "GU",
    "code": "06UG004",
    "credit": 2,
    "serial": 972,
    "group": "B",
    "quota": {
        "limit": 107,
        "additional": 30
    },
    "schedule": [
        {
            "day": 3,
            "from": 3,
            "to": 4,
            "campus": "公館",
            "classroom": "Ｅ202"
        }
    ],
    "programs": [
        "天文重力學程"
    ],
    "comment": "",
    "restrict": "◎地科系（學）不得選修 ◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "",
    "goals": [
        "This course will provide students a general understanding of modern astronomy and will introduce them to the most recent scientific developments. This course will help students to appreciate the importance of the modern science and its application to the daily life and to the entire Universe."
    ],
    "syllabus": "\\[16+2 \\] flexible weeks remark: on-line self learning\n\n\\[About the registration code\\]\n\nIf you need a registration code for Introduction to Astronomy, fill the form  \nhttps://forms.gle/k5fiDSf8Mw7qtXkQA  \nStudents who fill the form before the first day of the lecture will have a priority. If the number exceeds the available codes, then we will conduct a random-drawing and the result will be emailed to you after the first day of the lecture.\n\n\\-----------------------------------------------------------------------------------------------------------------------------------------------------------\n\nAstronomy is an ancient science that crosses all borders and all cultures. The evolution of astronomy is taking its sources from a cultural and historical knowledge from the past in the form  of, such as,  calendar, astrology, and religion.  Astronomy is, however, also in the world of today; one of the fastest growing topics of research. Discoveries in astronomy make regularly the front page of the scientific newspapers. It is because, observing the sky through telescopes and our quest for the truth of the Universe can shed light on our understanding of astrophysics but also bring answers to the most fundamental questions: what are the origin of life and the Universe. Modern astronomy is a fascinating gateway for people to access modern science in general.\n\nThis course will provide students a general understanding of modern astronomy and will introduce them to the most recent scientific developments. This course will help students to appreciate the importance of  the modern science and its application to the daily life and to the entire Universe.",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "Handouts will be distributed at the start of the semester. Each class of 2h is self-contained. Interactions between students and teacher are encouraged during the class. Recent discovery or events (eclipses, meteoroid showers, …) will be discussed in real time."
        },
        {
            "type": "Media, audio, visual materials",
            "note": "Professional astronomical pictures, movies and other hypermedia support will be used during the class."
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 40,
            "note": "Two assignments will be given. Questions are related to the class and will help the students understanding the class."
        },
        {
            "type": "Midterm Exam",
            "weight": 30,
            "note": "A closed-book exam will be based on the topics discussed in class, with an overlap with the questions developed in homework."
        },
        {
            "type": "Final exam",
            "weight": 30,
            "note": "A closed-book exam will be based on the topics discussed in class, with an overlap with the questions developed in homework."
        }
    ],
    "prerequisite": "◎Exclusive of students within Department of Earth ◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}