{
    "year": 110,
    "term": 2,
    "name": "中華文化探索",
    "teachers": [
        "謝秀卉"
    ],
    "department": "GU",
    "code": "0HUG251",
    "credit": 2,
    "serial": 1017,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 5
    },
    "schedule": [
        {
            "day": 5,
            "from": 3,
            "to": 4,
            "campus": "公館",
            "classroom": "Ｓ102"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本文化探索課程的具體內容，乃從生命禮儀、歲時節慶與廟會慶典三大文化信仰領域，探究中華文化經移民傳播之台灣地區的歷史傳承與創新演變的情形，以及目前在台灣常民生活中所表現的禮儀形式與內涵意義。期待生於斯、長於斯的學生們，能具備瞭解此部分文化信仰的正確觀念，進而充實相關歷史、語言、文學與藝術的人文涵養。",
    "goals": [
        "能正確瞭解中華文化中的生命禮儀，在台灣所表現的禮儀形式與內涵意義。",
        "能正確瞭解中華文化中的歲時節慶，在台灣所表現的禮儀形式與內涵意義。",
        "能正確瞭解中華文化中的廟會慶典，在台灣所表現的禮儀形式與內涵意義。",
        "能具備文化信仰的正確觀念，充實相關歷史、語言、文學與藝術的人文涵養。"
    ],
    "syllabus": "### **前言：進入「中華文化探索」這門課，你可以先知道的事…(16週+2週彈性課程)**\n\n     考古與人類學家張光直先生曾說：「中華文明中很重要的現象，即天人合一的宇宙觀。」人類從來不是一種孤獨的存在，可以說，人與自我、他者以及天地，恆常處於一種溝通交流的狀態。人類、鬼神和萬千事物共構的多層次群生世界，正是古代中國留予今人的一生機沛然的世界觀。在這種認識中，眾庶群生與天地宇宙原就是一活潑潑有機整體，而，節日、儀式與慶典正是促成彼此溝通往來的重要媒介，亦是中華文化淵遠流長與燦爛輝煌的重要部分。從遠古中國以迄今日臺灣民間社會，常新地展現其旺盛蓬勃的生命力，並且，伴隨著儀式實踐、口頭傳承、圖像器物，以承載著各代傳述族群所共同肯認的象徵、隱喻與文化意涵，而為特定時間、地域、種族、性別、宗教的人們提供安身立命的意義與依據。本課程即採取文化（學）人類學的視角與思路，引導學生由民俗、神話、傳說認識自身的文化傳統，在討論、觀察、辨析中，鍛鍊思辨力與表達力，並體悟感知蘊涵其中的生命溫度與情感智慧，學習詩意地接納生命中所遭逢之偶然與必然所帶來的啟示與祝福。本課程將藉由閱聽文本及影像讓學生親近感知中華文化、臺灣文化以及兩者所交會的豐厚、瑰麗與新變，使風土人情成為回返自我與群體共有的精神之根的指引，進而從中找到滋養與茁壯生命的資源與力量。\n\n**第一單元  有溫度的小日子：日常生活與民俗活動**\n---------------------------\n\n**【****QT****討論主題】：文字、圖像、儀式的文化（學）人類學意義思索與闡釋**\n\n**第****1****週**\n\n**課程介紹：走！一起在文化思路旅行：**以人為中心的文化（學）討論課\n\n**（第一講）****鯖魚，掰～：你知道南方澳有一場以鯖魚為名的祭典嗎？**\n\n**【閱讀與討論篇章】**：徐惠隆：〈敬，鯖魚做為一個節慶〉\n\n**第****2****週**\n\n**（第二講）脫單不保證攻略－月老怎麼拜？拜拜要傳蝦米？心誠為何不靈驗？**\n\n**【閱讀與討論篇章】**：（唐）李復言：〈定婚店〉\n\n**【考古與民俗篇】食物與怪物**\n\n**★****思路列車第１站：從人類的基本欲求出發，去思考所有文化現象的發生動力！**\n\n       歡迎你搭上中華文化探索的思路列車。在你正式進入閱讀前，請先想一想，你進入文本的視野與角度是什麼？你曾學過的方法可能很多，但這堂課，我帶你使用的是文學（化）人類學的觀看角度。瞭解這個方法的原則後，請你試著從這個角度重新看待過去、現在與未來的事物。當然，我也歡迎你在課堂上提出不同的視野與詮釋角度，發掘文本的各種詮釋可能性，或者說，屬於你認識這個世界的不同角度。\n\n**第****3****週**\n\n**（第三講）這碗麵放得有點久──青海省民和縣喇家遺址那隻碗裏的秘密**\n\n**【閱讀與討論篇章】**：中國社科院考古研究所甘青工作隊等：〈青海民和縣喇家遺址2000年發掘簡報〉\n\n**第****4****週**\n\n**（第四講）吃了，再上路：除了腳尾飯之外，你還可以知道更多****……..**\n\n**【閱讀與討論篇章】：**王煜、謝亦琛：〈漢代蟬型口琀研究〉\n\n**第****5****週**\n\n**（第五講）****怪物宇宙的通過儀式：臺灣抓寶遊戲迷與熱愛《山海經》的郭璞**\n\n**【閱讀與討論篇章】：**袁珂：《山海經校注》\n\n**第****6****週**\n\n**（第六講）吃飯、喝酒、交朋友****：漢人宴飲活動的民俗小考察**\n\n**【閱讀與討論篇章】：**《史記》、《漢書》、《後漢書》篇章選讀\n\n**第二單元 山也神，水也靈，天地群生皆有情：與神同行的臺式carnival**\n----------------------------------------\n\n**【****QT****討論主題】：讓第一手的觀察與閱讀，帶領你發現問題，鍛鍊問題意識與創意思考**\n\n**【廟會慶典篇】：遶境、藝陣、信仰**\n\n**★****思路列車第****2****站：培生問題意識：注意那些令你感興趣的現象，細想、琢磨、修整**\n\n      每篇完成的論文或研究報告，或有刻意為之者，或有偶然觸發者，然而，當你進入思考的深水區或著手寫作時，必然會碰到必須劃定研究範圍的問題，這是很難的一部分，因為，太小會使思路受侷限或卡住，太大則容易失焦。引人入勝的寫作或研究，經常是能夠藉由第一手閱讀或實地考查，圈定研究範圍、確認研究對象、選定研究角度，然後，極盡所能地搜羅材料證據來證成自己的觀點。以下幾週，將以繞境、藝陣、信仰等民俗活動、宗教信仰的影像閱讀與實際田野調查為主，訓練或培養學生觀察文化現象的敏銳度，同時，也加深學生對臺灣本土民俗文化的認識與理解。\n\n第7週\n\n**（分組報告）跟著女神遊臺灣：****三月瘋媽祖（刈火、刈香）**\n\n【閱讀與討論篇章】：影像文本\n\n**專題討論：彰化南瑤宮與新港奉天宮的＂會香＂活動**\n\n**（第一組）（第二組）（第三組）（分組報告）**\n\n**【討論主題：會香的意義是什麼？它與刈火、刈香的差別為何】**\n\n第8週\n\n**（分組報告）與神同行，香客與臺客的街頭電音派隊：****媽祖廟會繞境的藝陣與車隊**\n\n**【閱讀與討論篇章】：**影像文本\n\n**專題討論：藝陣大追查（來源、組成、演變）**\n\n**分組報告（第四組）（第五組）（第六組）（分組報告）**\n\n**【討論主題：藝陣考研】：自選民間藝陣，分組報告**\n\n第9週\n\n**期中思辨寫作：民俗文化觀察暨省思（第１篇）**\n\n第10-11週\n\n**（第七講）像極了愛情,希望從上輩子就開始：新港奉天宮媽祖十八庄遶境起源年代追溯**\n\n**【閱讀與討論篇章】：教師投影片**\n\n**第三單元 似水流年莫等閒：那些記錄生命成長的通過儀式**\n------------------------------\n\n**【生命禮儀篇】：關於坐月子、成年禮、喪禮的多向性思考**\n\n**★****思路列車第****3****站：生命禮俗，做為社會史與心靈史的研究課題**\n\n       為什麼婦女生產完要做月子？經過成年禮的青少年，真的就變＂成熟＂了嗎？在你的印象中，臺灣版本的送行者包含哪些人呢？你知道這個行業可以養活多少人嗎？你能想像此行業中的職人樣貌嗎？撿骨師、孝女白琴、土公仔、西索米樂團….，只要還活著，除了吃飽穿暖外，生而為人，或多或少皆需要意義來做為我們生存的理由。迎生送死，年光流轉，生命如斯光彩，然而，化為風煙，散入虛空，也是必然。由是，在尋常平凡的日子裏，總有一屬於你我的特殊生命時刻，使我們在儀式性更新後再次融入所在的社群或環境，繼續完成人生未竟的任務與義務。以下所閱讀文本多與人生禮儀相關，學生將在討論中，凝視、省思自我的生活、生存與生命，而在有品質的對話中（Quality Talk），對於自我與中華文化、臺灣文化的聯結，擁有更寬廣深遠的詮釋視域。\n\n**【****QT****討論主題】：通過儀式的象徵意涵及其社會功能思辨**\n\n第12週\n\n**（第八講）誰的眼淚在飛****：職業孝子與孝女白琴**\n\n**【閱讀與討論篇章】：**《生命禮儀：哭喪師》\n\n第13週\n\n**（第九講）這一刻，我成年，我驕傲****：臺南開隆宮「七娘媽生，做十六歲」**\n\n**【閱讀與討論篇章】：彭美玲：**〈臺俗「做十六歲」之淵源及其成因探討〉\n\n**第四單元 創造與再造：村落信仰、敘事與慶典活動**\n---------------------------\n\n**【民俗研創篇】節日慶典與社區營造**\n\n**★****思路列車第４站：知己知彼，用「他者」視域，以陌生化之眼光，省思自身之文化**\n\n      人類學者黃應貴曾指出，文化人類學的知識，乃是建立在文化差異的本體論假設上，而文化差異之得見，就是與他者接觸而得生。對於自身的文化，同樣，可以採取這種「他者」式的觀看，也就是說，能對那些習焉而不察的人事物投以一種新眼光。這種新眼光，可以逆著想、倒著想、挖深想、放寬想，乃至參照域外觀點來設想，因之，本單元乃以今日臺灣在地動物神信仰及其節日慶典的發展實況為討論焦點，包含：如何以節日慶典來營構旅人對城市或鄉村之印象，又對於那些在今日被發明出的傳統或慶典，如何理性審視看待之。學生必須對此加以批判剖析，梳理優缺點及其利弊得失，並進而思索改進之法與創造新論述與新觀點的可能性。\n\n**【****QT****討論主題】：批判現狀，深度剖析，建立新觀點**\n\n \n\n第14週\n\n**（第十一講）村落裏的動物神：義犬、虎爺、豬母娘娘、旗魚神的信仰、祭典與傳說**\n\n**【閱讀與討論篇章】：教師投影片**\n\n第15週\n\n**期末思辨寫作：民俗文化觀察暨省思（第2篇）**\n\n第16週\n\n端午節放假\n\n \n\n第17週\n\n**(第12講) 小島捕魚：臺灣島內淡水漁法介紹（補充教學影片）（非同步教學影片）**\n\n【閱讀篇章】：教師投影片\n\n第18週\n\n**期末總回顧：點滴累積，自強不息！願諸君此去，時時有好風相伴，日日常新！(自主學習)**",
    "methodologies": [
        {
            "type": "講述法",
            "note": "教師講授"
        },
        {
            "type": "討論法",
            "note": "深度討論教學法"
        },
        {
            "type": "合作學習",
            "note": "小組討論"
        },
        {
            "type": "專題研究",
            "note": "文化觀察與批判思考"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 50,
            "note": "民俗文化觀察暨批判省思2篇(每篇2000字)"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "課堂討論"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "出缺席"
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "分組口頭報告(專題報告)"
        }
    ],
    "prerequisite": "",
    "general_core": [
        "人文藝術"
    ]
}