{
    "year": 108,
    "term": 1,
    "name": "身體活動心理學之研究典範與批判",
    "teachers": [
        "季力康"
    ],
    "department": "AD30",
    "code": "PED0072",
    "credit": 3,
    "serial": 7,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 4,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "體育館一2樓會議室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "身體活動心理學之研究典範與批判",
    "goals": [
        "瞭解競技與健身運動心理學的研究典範",
        "瞭解學術期刊的同儕審查過程及審查技巧",
        "培養批判及獨立思考的能力"
    ],
    "syllabus": "Paradigm and Critique of Research in Sport and Exercise Psychology Syllabus Course objectives: 1. To understand the paradigms of research in the field of sport and exercise psychology. 2. How to read a journal article in psychology of physical activity 3. To understand the processes of journal papers reviewing 4. To develop the ability to critique research papers in sport & exercise psychology 5. To develop the skills to be the reviewer or editor for journal paper. Course Topics & Schedule: 1 Introduction 2 How to read a journal article 3 Trends in research paradigms, designs, methods, and settings 4 Academic writing 5 Ethical issues 6 Impact factor 7 Measurement & statistics issues 8 Journal editing & manuscript review 9 Journal editing & manuscript review 10 Journal editing & manuscript review 11 Paper review, critique, and discussion 12 Paper review, critique, and discussion 13 Reviewer's report 14 Paper review, critique, and discussion 15 Paper review, critique, and discussion 16 Reviewer's report 17 Oral presentation 18 Oral presentation Course Description: 1. Discussion 70% 2. Lecture 30% Grading: 1. Class participation in discussion 20% 2. Reviewer report30% 3. Research paper 30% 4. Oral presentation20% Reading articles: Introduction Martens, R. (1987). Science, knowledge, and sport psychology. The Sport Psychologist, 1, 29-55. Jordan, C.H., & Zanna, M.P. (1996). How to read a journal article. The Self in Social Psychology, 461-470. Research paradigm Weiss, M.R., & Gill, D.L. (2005). What goes around comes around: Re-emerging themes in sport and exercise psychology. Research Quarterly for Exercise and Sport, 76, Supplement to No. 2, S71-S87. Academic writing Weiss, M.R. Characteristics of good research articles. American Psychological Association (2001). Publication manual of the APA (5th Ed.), pp.3-30. Journal of Sport Science editorials Ethical issues American Psychological Association (2001). Publication manual of the APA (5th Ed.), pp.345-357. Journal of Sport Science editorials Thomas, J.R., & Nelson, J.K. (1996). Research methods in physical activity, Chapter 5, pp.74-87. Impact factor Amin, M., & Mabe, M. (2000).Impact factors: use and abuse. Taborsky, M. (2007). Impact factor statistics and publication practice: What can we learn. Ethology, 113, 1-8. Measurement & statistics issues Journal of sport science editorials Handbook of sport psychology (2007). Chapter 14.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 20,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 30,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}