{
    "year": 107,
    "term": 1,
    "name": "閱讀專題討論",
    "teachers": [
        "陳秋蘭"
    ],
    "department": "LD21",
    "code": "END3005",
    "credit": 3,
    "serial": 1568,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 2,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "雲204"
        }
    ],
    "programs": [],
    "comment": "上課教室在雲和街大樓二樓，地址為雲和街1號(位於雲和小火鍋斜對面、Cafe a la mode正對面)，從師大側門右轉看見Starbucks右轉進入巷子步行約2分鐘(130公尺)，右手邊就會看到雲和街大樓，亦可使用Google Maps APP查詢位置。請同學使用學生證感應，進出雲和街上課教室。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course aims at helping students become familiar with reading theories, research, and practices in L1 and L2. Students will review existing reading research extensively and critically to formulate research/teaching ideas as well as develop research skills and teaching philosophy in reading. We will review research on how children learn to read, how adults read in their first language, and how second language learners read in a second language. A reading packet, which includes articles on different reading models, various types of reading studies, and different instructional approaches, will be compiled as the core text for this course. There are three parts in this reading packet, including L1 reading processes and models, reading in L2, and instruction and assessment issues in L2 reading. We will read, analyze, and discuss a couple of articles per week. Lectures will be kept to the minimum. Your discussion on the issues presented in the reading materials will be the major activity in class. For the midterm project, you will submit a critique of one of the studies read. For the final project, a proposal for a reading research design should be presented orally and submitted in writing. You are also expected to attend graduate lecture series or conference sessions related to ELT and reading. Final grades will be assigned based on the following criteria: Participation & presentation of articles: 30%, Midterm project 30%, Final project 40%.",
    "goals": [
        "This course aims at helping students become familiar with reading theories, research, and practices in L1 and L2."
    ],
    "syllabus": "**Syllabus (Tentative)**\n\nWeek  Content\n=============\n\n    Wk1  Overview of the course\n\n         Key Studies in L1 reading. W. Grabe and F. Stoller (2002), In Teaching and researching reading pp.97-124. Longman.\n\nPart I. Reading Processes and Reading Models\n============================================\n\nWk2    1\\. Children’s Language and World: Initial Encounters with Print. By J Harste, C Baker, V   \n\n       Woodward, in _Theoretical models and Processes of reading_, (4th edition), pp. 48-69, 1994, IRA\n\n2.   To Err Is Human: Learning about Language Processes by Analyzing Miscues. Y Goodman and K Goodman, in _Theoretical models and processes of reading_, (5th edition), pp. 620-639, 2004, IRA\n\nWk3  1\\. Toward a Theory of Automatic Information Processing in Reading, Revisited, S. J. Samuels, in  \n\n        _Theoretical models and processes of reading,_ (5th edition), pp. 1127-1148, 2004, IRA\n\n          2.Toward an Interactive Model of Reading, D. Rumelhart, in _Theoretical models and processes of_\n\n         _reading_, (5th edition), pp. 1149-1179, 2004, IRA\n\n          3\\. A Theory of Reading: From Eye Fixations to Comprehension. By M.A Just and P. Carpenter. in _Theoretical models and processes of reading_, (5th edition), pp. 1182-1218, 2004, IRA\n\n    Wk4  1\\. The Transactional Theory of Reading and Writing, L Rosenblatt, in _Theoretical models and processes of reading_, (5th edition), pp. 1363-1398, 2004, IRA\n\n           2.Reading as a Meaning-construction Process: The Reader, the Texts and the Teacher, By R. Ruddell and N. Unrau. In _Theoretical models and processes of reading_, (5th edition), pp. 1462-1521, 2004, IRA\n\n     WK 5  1.Vocabulary Knowledge and Comprehension: A Comprehension-Process View of Complex Literacy Relationships, M. Ruddell, in _Theoretical models and processes of reading_, (4th edition), pp. 414-447, 1994, IRA\n\n           2\\. Role of the Reader’s Schema in Comprehension, Learning and Memory, R. Anderson, in _Theoretical models and processes of reading_, (5th edition), pp. 594-606, 2004, IRA\n\nWk6  1\\. Young Children’s Regulatory Talk: Evidence of Emerging Metacognitive Control over Literacy \n\n        Products, B. Cox, in _Theoretical models and processes of reading_, (4th edition), pp. 733-756, 1994, IRA\n\n2\\. Becoming A Strategic Reader, S. Paris, M. Lipson, K. Wixson, in _Theoretical models and processes of reading_, (4th edition), pp. 788-810, 1994, IRA\n\n2\\. A Historical Perspective on Reading Research and Practice. By P. Alexander and E Fox. In _Theoretical models and processes of reading_, (5th edition), pp. 33-68, 2004, IRA.\n\n**Part II Reading in Second Language**\n\nWk7  1\\. The Nature of Reading Abilities, W. Grabe and F. Stoller (2002), In _Teaching and researching reading_ pp.9-39_._ Longman.\n\n      2\\. Theoretical Underpinnings. K. Koda. In _Insights into Second Language Reading: A cross-linguistic Approach_ pp. 13-25.\n\n3\\. Key Studies in L2 Reading. W. Grabe and F. Stoller (2002), In _Teaching and researching reading_ pp.125-152_._ Longman\n\nWk8  1\\. Comparing L1 and L2 Reading. W. Grabe and F. Stoller (2002), In _Teaching and researching reading_ pp.40-63_._ Longman.\n\n2\\. See How They Read: Comprehension Monitoring of L1 and L2 readers. Block, E. (1992) _TESOL Quarterly_, 26(2):319-343.\n\n       3\\. The Lexical Plight in Second Language Reading: Words You don’t Know, Words You Think You \n\n         Know, and Words You Can’t Guess, Batia Laufer, In J. Coady, T Huckin, S_econd language_\n\n         _vocabulary acquisition,_ pp. 20-34, 1997, Cambridge University Press.\n\n**(Midterm project Due)**\n\nWk9  1\\. Derivative Word Forms: What Do Learners Know? N. Schmit & S. B. Zimmerman, _TESOL Quarterly_, 36(2002):145-171\n\n      2\\. Reading and Vocabulary Development in A Second Language: A Case Study, W. Grabe and F.\n\n        L. Stoller, In J. Coady, T Huckin, _Second language vocabulary acquisition pp. 98-122, 1997,_ \n\n        Cambridge University Press.\n\n        3\\. Fine Brush and Freehand: The Vocabulary-Learning Art of Two Successful Chinese EFL Learners. By Peter Yongqi Gu. _TESOL Quarterly_, 37:73-104  \n\nWk10  1. The Effects of Induced Schemata on the “Short Circuit” in L2 Reading: Non-decoding Factors in L2 Reading Performance, T. Hudson, In P. Carrell, J. Devine, D Eskey, _Interactive approaches to second language reading_, pp. 183-205,1989, Cambridge University Press.  \n\n       2\\. The Relative Contribution of L2 Language Proficiency and L1 Reading Ability to L2 Reading Performance: A Test of the Threshold Hypothesis in an EFL Context. Lee, J., Schallert, D. (1997). _TESOL Quarterly,_ 31(4): 713-739.\n\n       3\\. Cultural Representations of Rhetorical Conventions: The Effects on Reading Recall. By H.J. Chu, J.     \n\n         Swaffer, and D. Charney. TESOL Quarterly, 36:511-541.\n\nWk11   1\\. Two Types of Input Modification and EFL Reading Comprehension: Simplification versus Elaboration. _TESOL Quarterly,_ 35: 69-96\n\n       2.Pre-reading Materials from Subject Matter. Texts---Learner choices and the Underlying Learner Characteristics. Huang, SC, Cheng, Y.S., and Chern, C.L. (2006). Journal of English for Academic Purposes, 5: 193-206.\n\n       3\\. Effect of Frequency and idiomaticity on Second Language Reading. By R. Martinez, V. Murphy. TESOL Quarterly, 2011\n\nWk12  1\\. Effects of Comic Strips on L2 Learners’ Reading Comprehension. By J. Lin. _TESOL Quarterly,_ 38:225-243.\n\n       2\\. Deeper Processing for Better EFL Reading Comprehension. B. Oded, J. Walters. _System,_ 29(2001): 357-370.\n\n3\\. Cultural Familiarity in Inferential and Literal Comprehension in L2 Reading. Alptekin, C. (2006). System, 34: 494-508.\n\nWk13  1.The Journey Toward English Reading Literacy for Professional Purposes. By B. Lee\\\\and C Chern (2010). English Teaching and Learning (2010 Special Issue) 99-139\n\n      2\\. EFL Learners’ Use of Online Reading Strategies and comprehension of text. Huang, H., Chern, C., Lin, C. (2006). _Computers and Education_.52:13-26.\n\n      3\\. Clarifying the Differences in Learning EFL Reading Strategies: An analysis of Portfolios. Ikeda, M and Takeuchi, O. (2006). System, 34:384-398.\n\nWk14  1\\. Predictors of Reading Literacy for First and Second Language Learners. A. Netten, M. Droop, L. Verhoven (2011). Read Writ (2011): 24:413-425..\n\n2\\. A Dynamic Metacognitive Systems Account of Chinese University Students’ Knowledge About EFL Reading. L. Zhang (2010). TESOL Quarterly, 320-353.\n\n      3\\. Beyond Comprehension Exercises in the ESL Academic Reading Class. (1992). _TESOL Quarterly_ 26(2): 289-318.\n\nWk15  1\\. Beyond Reading and proficiency assessment: The rational cloze procedure as stimulus for integrated reading, writing, and vocabulary instruction and teachers-students interaction in   ESL, Lee, Siok H. (2008). System, 642-600.\n\n2.       Reading to learn and reading to integrate: New tasks for reading comprehension tests? Trites, L., and McGroarty (2005). Language Testing 22(2): 174-210.\n\n3.       Preparing Teachers of Second Language Reading. Janzen, J. (2007). TESOL Quarterly, 41:707-729.\n\nWk17.  Presentation of Final Projects\n\nWk17  Final Project due",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "報告",
            "weight": 30,
            "note": "Participation & presentation of articles"
        },
        {
            "type": "專題",
            "weight": 40,
            "note": "Final project 40%"
        },
        {
            "type": "其他",
            "weight": 30,
            "note": "Midterm project 30%"
        }
    ],
    "prerequisite": "",
    "general_core": []
}