{
    "year": 109,
    "term": 1,
    "name": "物理教材教法 （IB）",
    "teachers": [
        "陳育霖"
    ],
    "department": "EU",
    "code": "IBU0004",
    "credit": 1,
    "serial": 676,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 16,
            "to": 10,
            "campus": "公館",
            "classroom": "Ｓ407"
        }
    ],
    "programs": [
        "國際教師學程-物理"
    ],
    "comment": "",
    "restrict": "◎第一階段限 國際教師學程-物理◎限國際教師學程-物理選修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 1,
    "description": "Physics is an international enterprise, which plays a key role in the future progress of humankind. The support of physics education continue to drive the economic engines of the world. Physics is an essential part of the educational system and of an advanced society.\nScience stems from human curiosity or need around life. Humans study various phenomena and changes in nature via observation, and cleverly use science to solve problems, to adapt to the environment, and to live a better life. Science knowledge continues to accumulate in the process of civilization evolution. \nLiving in the modern age, our surroundings are full of innovative technological products, a wealth of information, and environmental and ecological issues derived from resource development. Our nationals also need to have scientific literacy, such as understanding the contribution and limitations of science, making good use of scientific knowledge and methods, being able to deal with all kinds of daily science-related problems in a rational and positive manner and with innovative thinking, comments, judgments and actions. At the same time, we need to cultivate future scientific personnel to lay a solid foundation for human civilization and social and economic development.\nThe core literacy of 12-year National Basic Education course in natural science includes: \n(1) Inquiry Skills, providing students with opportunities to explore learning and problem-solving and to develop relevant; \n(2) Scientific Attitude and Nature of Science, assisting students to understand the ways in which scientific knowledge is produced and developing scientific thinking and the habit of inquiry; \n(3) Core Concept, guiding students to learn scientific knowledge. \nBy practicing the above three connotations, cultivating students to achieve the goal of whole-person development.\nThe core literacy of natural sciences focuses on scientific process skills including observation, logical thinking, reasoning and judgment, and students can use them as their basis to gain knowledge and planning experiments in order to solve problems, which corresponds to TOK of IBDP. \nThe 3 phases and 9 items of the General Outline of 12-year National Basic Education are listed in the table below",
    "goals": [
        "透過本課程的介紹，使學生認識哲學的基本概念及各種教育思想的特點。"
    ],
    "syllabus": "Physics is an international enterprise, which plays a key role in the future progress of humankind. The support of physics education continue to drive the economic engines of the world. Physics is an essential part of the educational system and of an advanced society.\n\nScience stems from human curiosity or need around life. Humans study various phenomena and changes in nature via observation, and cleverly use science to solve problems, to adapt to the environment, and to live a better life. Science knowledge continues to accumulate in the process of civilization evolution.\n\nLiving in the modern age, our surroundings are full of innovative technological products, a wealth of information, and environmental and ecological issues derived from resource development. Our nationals also need to have scientific literacy, such as understanding the contribution and limitations of science, making good use of scientific knowledge and methods, being able to deal with all kinds of daily science-related problems in a rational and positive manner and with innovative thinking, comments, judgments and actions. At the same time, we need to cultivate future scientific personnel to lay a solid foundation for human civilization and social and economic development.\n\nThe core literacy of 12-year National Basic Education course in natural science includes:\n\n(1) Inquiry Skills, providing students with opportunities to explore learning and problem-solving and to develop relevant;\n\n(2) Scientific Attitude and Nature of Science, assisting students to understand the ways in which scientific knowledge is produced and developing scientific thinking and the habit of inquiry;\n\n(3) Core Concept, guiding students to learn scientific knowledge.\n\nBy practicing the above three connotations, cultivating students to achieve the goal of whole-person development.\n\nThe core literacy of natural sciences focuses on scientific process skills including observation, logical thinking, reasoning and judgment, and students can use them as their basis to gain knowledge and planning experiments in order to solve problems, which corresponds to TOK of IBDP.\n\nThe scientific process skills acquired in the curriculum of studying natural science are the common needs of talents in various fields. Natural science such as physics and chemistry are required courses for secondary school students in Taiwan. Inheriting the tradition of natural sciences, teacher candidates in related fields must be familiar with describing natural phenomena in scientific languages. \n\nThis course links pre-service teachers' learning and cognition from the viewpoint of the history and the nature of science. It mainly explores instructional strategies, laboratory investigation and the trend of physics education to help pre-service teachers conduct practical curriculum analysis and development. Cases of physics education in DP courses within the IB course system are introduced. The alignment of IB course system and 12-year National Basic Education in Taiwan are also introduced. The pedagogy of the course, Teaching Materials and Methods: Physics, is designed to demonstrate the pedagogy shown on the Syllabus. The 3 terms of core literacy, Inquiry Skills, Scientific Attitude and Nature of Science, and Core Concept are originated from the nature of science. \n\nThe strategy of Understanding by Design (UbD), backward design, is utilized to instruct pre-service teacher, prior to curriculum and courses design, to conduct literacy-oriented, assessment corresponding to the core literacy of nature science and general outline of 12-year National Basic Education\n\nWe provide case study, group discussion and presentation in class to experience authentic science research community operation. Pre-service teachers are asked to convince all their peers in a scientific manner corresponding to the symmetry of physical laws. In addition, Creativity, Action, and Service are emphasized in each classes, such as Social Participation course and brain-storming or design thinking curriculum design with high school teachers.\n\nClass Meetings\n\n\\[1\\]\n\nTopic: The local and global role and vision of physics education in modern society \n\nActivities: Read the well-known report below find its main idea, present own idea, and review peers’. Focus on the current literacy of science education, Theory of knowledge, TOK-oriented instruction\n\n\\[2\\]\n\nTopic: The local and global trends of physics education in 21st-Century\n\nActivities:\n\nPre-service teachers read the article below together, use the Focused Conversation Method (ORID) to identify the key points, and write abstracts.\n\n\\[3\\]\n\nTopic: The nature of science and the history of science/physics (I)\n\nActivities\n\nWhy did those physicists, Wolfgang Pauli, Paul Adrien Maurice Dirac and Murray Gell-Mann, all say “solid state physics is dirty”? How do you think about that?\n\n\\[4\\]\n\nTopic: The nature of science and the history of science/physics (II)\n\nActivities\n\nThomas Kuhn’s Paradigm shift\n\n\\[5\\]\n\nTopic: The nature of science and the history of science/physics (III)\n\nTheory and Experiment?\n\nActivities\n\nHow can we find the Neptune in the sky via analyzing the theoretical and observational results of the Uranus' orbit? That is an important success story of Newton’s mechanics. Original observational data provided for class discussion and presentation/review in groups.\n\n\\[6\\]\n\nTopic: The nature of science and the history of science/physics (IV)\n\nSymmetry of the laws of physics and international cooperation in science community\n\nActivities\n\n(a)ALMA & LHC International cooperation in construction, pre-service teachers discuss in groups before giving a  presentation on how the international cooperation construction program ALMA & LHC divides labor.\n\n(b)How to design an International Astronomical Observatory Project, hopefully the telescopes will take observations on the same continuous astronomical phenomenon. Echo the nature of science and IBDP on International-mindedness.\n\n\\[7\\]\n\nTopic: The nature and history of science with inquiry-based instruction and backward design of UbD (I)\n\nActivities\n\nWhy Scientists need to “measure”? Literacy-based and TOK-oriented instruction.\n\n\\[8\\]\n\nTopic: The nature and history of science with inquiry-based instruction and backward design of UbD (II)\n\nActivities\n\nAuthentic court case of car speeding, raw data of position with respect to time of a car. Pre-service teachers utilize brainstorming, design thinking and teamwork in groups to design course for instantaneous velocity and average velocity using basic concept of mean value theorem of calculus, including assessment and course design.\n\n\\[9\\]\n\nTopic: The nature and history of science with inquiry-based instruction and backward design of UbD (III)\n\nActivities\n\nAlmost three centuries ago Charles Coulomb (1736 -1806) discovered that kinetic friction does not depend on the sliding velocity. Coulomb’s book “Theorie des machines simple” (1821). Coulomb designed a clever experiment, and presented the original experimental data.\n\n(a)Play as a student: Conduct an experiment to measure kinetic friction. \n\n(b)Play as a teacher: Design the course of kinetic friction for high school/DP student using brainstorming, design thinking in groups, and then present to the class\n\n\\[10\\]\n\nTopic: Objective of physics/science curriculum and materials of National Basic Education in Taiwan, IBDP physics, NGSS, and UNESCO documents\n\nActivities\n\nUtilize Focused Conversation Method, Objective, Reflective, Interpretive, and Decisional (ORID) to get the core literacy of high-school physics/science.\n\n\\[11\\]\n\nTopic: Pedagogy and learning of physics and physical science (I)\n\nDeductive and Inductive Reasoning for inquiry-based teaching and differentiated teaching strategies. “If, as teachers, we increase our understanding of who we teach and what we teach, we are more likely to be flexible in how we teach”. \\[Tomlinson, Eidson, 2003\\]\n\nActivities\n\nNature of science with behavioristic psychology and Cognitivism Psychology\n\n(a)Deductive-Reasoning: Newton’s law of motion\n\n(b)Inductive-Reasoning: Newton’s law of motion\n\nPresent the Problem-based and Inquiry-based teaching and learning of our topic(s).\n\n\\[12\\]\n\nTopic: Pedagogy and learning of physics and physical science (II)\n\nActivities\n\nConservation of mechanical energy, design the course in groups through brainstorming and design thinking by applying one of the following strategies.\n\n(a)5E creative inquiry learning cycle (Engage, Explore, Explain, Elaborate/Extend, Evaluate)\n\n(b)Inquiry and practice\n\n(c)Problem-Based Learning\n\n(d)POE (Prediction, Observation, Explanation)\n\n(e)Physics Experiment Demonstration\n\n(f)Peer Instruction\n\n(g)Mobile Learning\n\n\\[13\\]\n\nTopic: Pedagogy and learning of physics and physical science (III)\n\nActivities\n\nHow “did” we study electromagnetism before?\n\n(a)Deductive-Reasoning oriented: Maxwell’s equation to cases.\n\n(b)Inductive-Reasoning oriented: electromagnetic phenomenon to Maxwell’s equation.\n\nPresent the Problem-based and Inquiry-based teaching and learning teaching follow (a) and (b).\n\n\\[14\\]\n\nTopic: Learning assessments of physics course corresponding to the objective of 12-year basics education and IBDP\n\nAssessment is an integral part of teaching and learning. There are two types of assessment identified by the IB. \n\n(a) Formative assessment informs both teaching and learning.\n\n(b) Summative assessment gives an overview of previous learning and is concerned with measuring student achievement.\n\nActivities\n\nHeat and Specific heat\n\nUnderstanding by Design (UbD), backward design: following the sequence\n\n(a)Identify Desired Results/Outcome (objective of core literacy of science course of 12-year basic education, IBDP physics)\n\n(b)Assessment Evidence (Performance Tasks and Other Evidence)\n\n(c)Create the Learning Plans\n\n\\[15\\]\n\nTopic: Learning assessments of physics course corresponding to the objective of 12-year basics education and IBDP\n\nIB assessments are criterion-referenced, not norm-referenced. This means that the method of assessment judges each student in relation to identified standards and criterion rather than against the work of other students.\n\nActivities\n\nLiteracy-oriented assessments including formative and summative assessment will emphasize on Edward Thorndike and Robert S. Woodworth’s “Transfer of learning”, which is the dependency of human conduct, learning, or performance on prior experience.\n\n\\[16\\]\n\nTopic: Science Inquiry and Practice compulsory course of 12-year Basic Education and Inquiry-based learning of IBDP physics\n\nPre-service teachers shall  be able to know about Internal assessment (IA)\n\n(a)outline the nature and purpose of experimental work\n\n(b)distinguish the different components of the Practical Scheme of Work (PSOW)\n\n(c)develop a PSOW\n\n(d)define and describe the nature and content of the IA investigation\n\n(e)recognize and apply the five IA investigation criteria\n\n(f)outline the roles and responsibilities of the student and the teacher during the investigation research\n\n(g)plan and operate a Group 4 Project\n\nActivities\n\nScience Inquiry and Practice compulsory course: 4-credit course design via group brainstorming and design thinking using the piezoelectric material study of a lighter.\n\n(a) List desired scientific process skill  (corresponding to the core literacy of science course of 12-year basic education)\n\n(b) Assessment Evidence\n\n(c) Create the Learning Plans\n\nConsider:\n\n(1)What would physics be without experimental investigation?\n\n(2)How is experimental investigation related to the IB Learner profile?\n\n(3)Write your thought first.\n\n(4)Write down the rationale for IB practical work\n\n(5)Plan your practical scheme of work (PSOW). Pre-service teachers are free to formulate their own practical work schemes and choose practical activities according to the outlined requirements basing on levels and options taught, the needs of their students, available resources, teaching styles, and national safety issues \\[guidelines developed for the International Council of Associations for Science Education (ICASE) Safety Committee by The Laboratory Safety Institute (LSI)\\]\n\n(6)PSOW: Time allocation, PSOW requires dedicating 25% of the total hours to the teaching of physics.\n\n\\*40 hours at standard level (SL) and 60 hours at higher level (HL)\n\n\\*Total time includes hours for the Group 4 project (G4P) and 10 hours for IA investigation.\n\n\\*Deadline, in the IB exam year, is mid-April for Northern hemisphere and mid-October for Southern hemisphere.\n\n\\[17\\]\n\nTopic: Science Inquiry and Practice compulsory course of 12-year Basic Education and Inquiry-based learning of IBDP physics\n\nPre-service teachers shall be able to recognize the role of assessment objectives in the design of examination papers, compare and contrast actual questions presented in the papers, and apply their knowledge to some IB questions and appraise the markscheme. Pre-service teachers need to design assessment tasks and associated rubrics that support the achievement of IB Diploma Programme aims and objectives\n\nActivities\n\n(1)The Physics Data Booklet scavenger hunt, suggested reading path:\n\n\\*What are the main headings?\n\n\\*Is the list under Unit conversion page 6 extensive?\n\n\\*Are topics and sub-topics identified?\n\n\\*Looking at the Fundamental constants page 4, do you recognize how complex units are written?\n\n(2)Assessment in the IBDP-associated rubrics that support the achievement of IB Diploma Programme aims and objectives\n\nReference\n\nDiploma Programme assessment Principles and practice, IBO\n\n(3)Rubrics\n\nThe grade descriptors of Group 4 (science) \\[Appendix III\\] are intended to help teachers explain the academic requirements of the IB diploma programme to students, undertake formative assessment, report progress and prepare predicted grades. \n\n\\[18\\]\n\nTopic: Curriculum Design\n\nActivities\n\nPresent the course design of one UNIT in group, including course concept description, formative assessment, and summative assessment.",
    "methodologies": [
        {
            "type": "講述法",
            "note": "自然科學發展歷史與發展本質、自然科學領域跨科特性、取樣、科學論證等重要概念內容。"
        },
        {
            "type": "討論法",
            "note": "團隊聚焦討討論法、透過課程問題設計思考、團隊共創方式，以小組討論及全班討論方式，發散、聚焦的過程來探究與實作，釐清跨科概念及探究與實作課程之相關議題。"
        },
        {
            "type": "問題解決教學",
            "note": "透過課程問題設計思考、團隊共創方式，以小組討論及全班討論方式，發散、聚焦的過程來探究與實作，釐清跨科概念及探究與實作課程之相關議題。"
        },
        {
            "type": "合作學習",
            "note": "呼應科學本質進行同儕評論與討論。"
        },
        {
            "type": "實驗/實作",
            "note": "學生實地進行探究或實作主題，並進一步進行課程設計。"
        },
        {
            "type": "實地考察、參訪",
            "note": "場域實地探究與實作。"
        },
        {
            "type": "媒體融入教學",
            "note": "輔以資訊平台引導學習及行動載具等資訊科技設備。"
        },
        {
            "type": "專題研究",
            "note": "問題與專題計畫導向設計實作與發表。"
        },
        {
            "type": "其他",
            "note": "翻轉課堂、自主學習"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 10,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 20,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 20,
            "note": ""
        },
        {
            "type": "成果展覽",
            "weight": 20,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 10,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}