{
    "year": 109,
    "term": 1,
    "name": "課程發展與設計（IB）",
    "teachers": [
        "葉怡芬"
    ],
    "department": "EU",
    "code": "IBUE001",
    "credit": 3,
    "serial": 678,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 16,
            "to": 11,
            "campus": "本部",
            "classroom": "誠206"
        }
    ],
    "programs": [
        "國際教師學程-國際"
    ],
    "comment": "",
    "restrict": "◎第一階段限 國際教師學程-國際◎限國際教師學程-國際選修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course aims to equip pre-service teachers with competence in designing quality inquiry-based curriculum with International Baccalaureate (IB) philosophy underpinning the development of the curriculum. Principles of curriculum development and IB philosophy including the IB mission statement and the Learner Profile are introduced before pre-service teachers are guided to create unit plans for concept-driven curriculum, inquiry-based learning, contextualized understanding and school-based curriculum. Pre-service teachers will learn how to unpack IB philosophy and nation-wide curriculum guidelines, set educational aims for students, design and organize relevant learning activities and resources, and design and implement proper assessments. They will develop a solid understanding and a firm grasp of international education and the Learner Profile while creating unit plans and learning material through collaborated group work. They will demonstrate their understanding of the IB curriculum design through presentations in two Curriculum Exhibitions during the course. They are required to explore discipline-specific skills (of the subject group they select) and develop ability in inter-disciplinary thematic unit planning.",
    "goals": [
        "Demonstrate the competence in designing lessons.",
        "Design lessons with considerations of curriculum guidelines, benchmarks, and/or MYP/DP focuses.",
        "Ensure the knowledge content delivered by teachers or self-learned by students follow the principles of spiral curriculum.",
        "Embed a mechanism of differentiated learning or scaffolds in unit plans.",
        "Maintain good interactions and communications with group members; leave critical and constructive comments to peers’ works."
    ],
    "syllabus": "This course aims to equip pre-service teachers with competence in designing quality inquiry-based curriculum with 1) 12-year mandatory education curriculum guidelines and 2) International Baccalaureate (IB) philosophy underpinning the development of the curriculum. Students will learn how to unpack nation-wide and IB philosophy curriculum guidelines, set educational aims for students, design and organize relevant learning activities and resources, and design and implement proper assessments. They will demonstrate their understanding of the IB curriculum design through presentations in two Curriculum Exhibitions during the course. \n\nWeek\n\nTopic\n\nAssignment\n\n\\[1\\]\n\nFactors that contribute to good courses\n\n\\[2\\]\n\nCurriculum and assessment\n\n\\[3\\]\n\nApproaches to Learning & Teaching\n\n\\[4\\]\n\nCurriculum guideline unpack\n\n\\[5\\]\n\nLiteracy-focused curriculum design (A)\n\n\\[6\\]\n\n\\[no class\\] lesson plan by appointment (A)\n\nSubmit lesson plan draft\n\n\\[7\\]\n\nUnderstanding by Design I (B)\n\n\\[8\\]\n\nUnderstanding by Design II (B)\n\n\\[9\\]\n\nSchool-based curriculum\n\n\\[10\\]\n\nCurriculum Exhibition\n\nGroup presentation\n\n\\[11\\]\n\nIBMYP: From Principles to Practices\n\nSubmit finalized lesson plan\n\n\\[12\\]\n\nIBMYP: Subject Guide unpack\n\n\\[13\\]\n\nVertical and horizontal benchmark alignment\n\n\\[14\\]\n\nWorkshop I: Key concepts, Statement of Inquiry\n\n\\[15\\]\n\nWorkshop II: Objectives, Assessments, ATL\n\n\\[16\\]\n\nWorkshop III: IDU\n\nSubmit unit plan\n\n\\[17\\]\n\nQuiz and Reflections\n\n\\[18\\]\n\n\\[no class\\] school’s final week",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Instructor will introduce principles of curriculum development."
        },
        {
            "type": "討論法",
            "note": "This course requires students to discuss and reflect on indicated issues."
        },
        {
            "type": "問題解決教學",
            "note": "Students need to construct several curriculum plans."
        },
        {
            "type": "合作學習",
            "note": "Students need to complete course works in group."
        }
    ],
    "grading": [
        {
            "type": "期末考",
            "weight": 15,
            "note": "quiz"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "group work"
        },
        {
            "type": "報告",
            "weight": 50,
            "note": "lesson plans"
        },
        {
            "type": "成果展覽",
            "weight": 25,
            "note": "curriculum exhibition"
        }
    ],
    "prerequisite": "",
    "general_core": []
}