{
    "year": 108,
    "term": 2,
    "name": "薪酬管理研究",
    "teachers": [
        "葉俶禎"
    ],
    "department": "IM86",
    "code": "IWM0047",
    "credit": 3,
    "serial": 1321,
    "group": "",
    "quota": {
        "limit": 40,
        "additional": 15
    },
    "schedule": [
        {
            "day": 1,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "誠104"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "Compensation Management deals with employees’ salary, benefits, and other reward systems, and is perhaps the most essential function of a company’s human resource management. This course focuses on managing employee compensation in contemporary organizations. Topics that will be particularly emphasized include: application of compensation principles to achieve organizational objectives; strategic use of compensation systems for attracting, motivating, and retaining employees; and managerial aspects of paying employees at all organizational levels. This course will also examine the current state of compensation decision making and how recent theoretical and research developments inform compensation decisions. It will be taught using a combination of lectures, discussions, and experiential exercises/applications to offer students an opportunity to develop competencies in compensation management.",
    "goals": [
        "Discuss the strategic importance of compensation to the achievement of organizational goals.",
        "Discuss the role of compensation in attracting, motivating, and retaining a high-quality workforce.",
        "Explain how job analyses and evaluations shape internal compensation structure.",
        "Discuss how external competitiveness and market forces influence compensation.",
        "Acquire basic competencies required for the development and management of compensation systems, e.g., job evaluation, salary survey, etc.",
        "Design an appropriate compensation structure taking into consideration both internal equity and external competitiveness.",
        "Discuss the effectiveness of benefit programs, incentive plans and pay-for-performance.",
        "Discuss recent theoretical and practical developments in the area of compensation and benefits."
    ],
    "syllabus": "**Week**\n\n**Topic**\n\n**Note**\n\n1\n\nCourse introduction\n\nSyllabus overview\n\n2\n\nChapter 1. The Pay Model\n\nChapter 2. Strategy: The Totality of Decisions\n\n3\n\nChapter 3. Defining Internal Alignment\n\nChapter 4. Job Analysis\n\nTeam list due\n\n4\n\nChapter 5. Job-Based Structure and Job Evaluation\n\n5\n\nChapter 6. Person-Based Structures\n\n6\n\nChapter 7. Defining Competitiveness\n\n7\n\nGroup presentation - Final project progress report I\n\nDraft progress report I due\n\n8\n\nChapter 8. Designing Pay Levels, Mix, and Pay Structures\n\n9\n\nChapter 9. Pay-for-Performance: The Evidence\n\nChapter 10. Pay-for-Performance Plans\n\nChapter 11. Performance Appraisal\n\n10\n\nChapter 12. The Benefits Determination Process\n\n11\n\nChapter 13. Benefit Options\n\n12\n\nGroup presentation - Final project progress report II\n\nDraft progress report II due\n\n13\n\nChapter 16. International Pay Systems\n\n14\n\nChapter 17. Government and Legal Issues\n\n15\n\nFinal examination\n\n16\n\nGroup presentation - Final project progress report III\n\nDraft progress report III due\n\n17\n\nFinal project report work session\n\n18\n\nFinal project report work session\n\nFinal project report due",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Lectures will introduce students to the central topics of Compensation Management in the organization."
        },
        {
            "type": "討論法",
            "note": "Class discussion will cover issues, trends and controversies of pay, incentives and benefits."
        },
        {
            "type": "問題解決教學",
            "note": "Students will apply subjects learned to a real-life company in a final project."
        },
        {
            "type": "合作學習",
            "note": "Students, in groups, will conduct a final project to develop the compensation system for a case company."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "Class Exercises, Quizzes or Assignments"
        },
        {
            "type": "期末考",
            "weight": 25,
            "note": "Final exam will cover subject matters introduced in the class."
        },
        {
            "type": "課堂討論參與",
            "weight": 15,
            "note": "Students are encouraged to actively participate in classroom discussion."
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Attendance is required."
        },
        {
            "type": "專題",
            "weight": 30,
            "note": "Final project requires students to develop a compensation system for a case company."
        }
    ],
    "prerequisite": "",
    "general_core": []
}