{
    "year": 108,
    "term": 2,
    "name": "國際性非營利組織人力資源專題研究",
    "teachers": [
        "張雯"
    ],
    "department": "IM86",
    "code": "IWM0061",
    "credit": 3,
    "serial": 1330,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 12
    },
    "schedule": [
        {
            "day": 1,
            "from": 3,
            "to": 5,
            "campus": "本部",
            "classroom": "人資所會議室"
        }
    ],
    "programs": [],
    "comment": "所辦會議室(或師大路研究室)",
    "restrict": "◎必須先修過【IWM0073  書報討論（二）】 ◎課程不開放上修",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "Understand human resource issues in non-profit oriented organizations in global context. Conduct study about human resource issues in International nonprofit organizations. Gain knowledge about human resource challenges in International nonprofit sectors. Understand strategies for studying and managing human resource issues in international nonprofit sectors.",
    "goals": [
        "Understand human resource issues in non-profit oriented organizations in global context.",
        "Conduct study about human resource issues in International nonprofit organizations.",
        "Gain knowledge about human resource challenges in International nonprofit sectors.",
        "Understand strategies for studying and managing human resource issues in international nonprofit sectors."
    ],
    "syllabus": "This course uses a project-oriented approach and provides an introduction to the fundamental value questions about human resource practice in nonprofit sectors, also including educational, governmental, and non-governmental organizations.\n\nEach student will conduct a research project (e.g. thesis, conference paper, or other publications) that involves human resource issues in nonprofit, educational, and governmental organizations. Students will receive instruction individually with regard to their research projects. Through the course readings, discussion, and project implementation, students will have the opportunity to learn how to study human resource issues in nonprofit, educational, governmental, and nongovernmental sectors.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 30,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 40,
            "note": ""
        }
    ],
    "prerequisite": "◎必須先修過【IWM0073  書報討論（二）】",
    "general_core": []
}