{
    "year": 108,
    "term": 2,
    "name": "人力資源招募與甄選研究",
    "teachers": [
        "盧承杰"
    ],
    "department": "IM86",
    "code": "IWM0044",
    "credit": 3,
    "serial": 1320,
    "group": "",
    "quota": {
        "limit": 40,
        "additional": 15
    },
    "schedule": [
        {
            "day": 4,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "誠104"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "Upon successful completion of this course, the student will be able to: 1. Demonstrate an understanding of HR recruiting and selection concepts. 2. List the strategic and planning issues of employee staffing. 3. Conduct a task-based job analysis. 4. Explain the importance of job descriptions and jobspecifications 5. Devise a plan to recruit needed employees using appropriate recruitment channel. 6. Develop a structured selection interview. 7. Report and discuss legal and ethical dilemmas as they emerge during the process.",
    "goals": [
        "Demonstrate an understanding of HR recruiting and selection concepts.",
        "List the strategic and planning issues of employee staffing.",
        "Conduct a task-based job analysis.",
        "Explain the importance of job descriptions and job specifications.",
        "Devise a plan to recruit needed employees using appropriate recruitment channel.",
        "Develop a structured selection interview.",
        "Report and discuss legal and ethical dilemmas as they emerge during the process."
    ],
    "syllabus": "Week 1\n\nCourse Introduction, Syllabus Review\n\nWeek 2\n\nStaffing Models and Strategy\n\nWeek 3\n\nPlanning\n\nWeek 4\n\nLegal Compliance\n\nWeek 5\n\n**Case 1&2 presentation: Staffing Strategy and Planning**\n\nWeek 6\n\nJob Analysis & Rewards\n\nWeek 7\n\nRecruitment (External and Internal)\n\nWeek 8\n\nExternal Selection I (Initial Assessment)\n\nWeek 9\n\n**Case 3 presentation: Recruiting**\n\nWeek 10\n\nExternal Selection II (Substantive)\n\nWeek 11\n\nInternal Selection\n\nMeasurement\n\nWeek 12\n\nDecision Making\n\nWeek 13\n\n**Case 4 presentation: Measurement and Validation**\n\nWeek 14\n\nFinal Match\n\nWeek 15\n\n**Case 6 presentation: Interview**\n\nWeek 16\n\nStaffing System\n\nWeek 17\n\nIn-class activity: interview simulation\n\nWeek 18\n\n**Final Exam**",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Text book, PowerPoint slides and video clips will be used to introduce the topics relevant to HR recruitment and selection"
        },
        {
            "type": "討論法",
            "note": "Students will be divided into groups. Each group will discuss assigned cases derived from Tanglewood casebook and present their answers to the whole class for class discussion."
        },
        {
            "type": "合作學習",
            "note": "Students will collaborate on a group project to analyze respectively assigned cases from Tanglewood casebook."
        },
        {
            "type": "專題研究",
            "note": "Students will be divided into groups. Each group will discuss assigned cases derived from Tanglewood casebook and present their answers to the whole class for class discussion."
        }
    ],
    "grading": [
        {
            "type": "期末考",
            "weight": 30,
            "note": "At the end of the semester, a final exam will be given to evaluate students’ comprehension of the course materials. The test format will include multiple choice and short essay questions."
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "Students are expected to attend each class, prepare discussed readings and assignments and actively participate in class discussions."
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Class attendance is required. Please come to the class on time and notify the instructor ahead of time if you will be late or absent for a class."
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "Cases will be assigned as a group project. Each group will present an integrating case and their answers to case questions in class."
        },
        {
            "type": "專題",
            "weight": 20,
            "note": "Students will complete cases chosen from Tanglewood project. First, all groups will write “briefer” memos for Cases 1 and 2.  Then, all groups will do longer memos for Case 3, 4 and 6.  These memos should be at least three pages in length, and should answer all questions raised in the case instructions. The grade for this project depends on the in-class presentation and the written report."
        }
    ],
    "prerequisite": "",
    "general_core": []
}