{
    "year": 109,
    "term": 2,
    "name": "科技輔助協同合作",
    "teachers": [
        "袁千雯"
    ],
    "department": "EM15",
    "code": "ISC8009",
    "credit": 3,
    "serial": 526,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 3
    },
    "schedule": [
        {
            "day": 4,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "圖資所研討室A"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "數位科技在過去的數十載中經歷了驚人的變化與發展。社群網站、多人線上遊戲、（微）部落格、維基、直播串流、行動科技上的各種應用軟體、人工智慧、虛擬與擴增實境等（重新）形塑了我們對於溝通互動的認知與實踐，並（重新）定義了社群、人際關係、公共與私人空間。另外，以科技為載具，不同的傳播訊息展現了不同主體或社群觀看事件、社會的角度。在這堂課中我們將會討論不同的新科技，並從個人層面、群體層面、社會層面檢視當代科技的影響，及其是否真如許多學者所述徹底改變人類的生活方式。透過本課程，我們將會討論以下幾個議題：\n•\t新媒體科技是否會取代傳統媒介，如面對面傳播或是大眾、電訊傳播等，作為主要溝通的工具？\n•\t新媒體科技如行動資訊科技如何影響社會？\n•\t由於科技的發展與網路的普遍性，是否導致現代社會更為疏離？",
    "goals": [
        "透過相關理論或主題瞭解人類行為以及社會發展",
        "培養批判分析的能力，以及如何應用理論檢視社會現象的技巧",
        "了解不同研究方法的利弊，並有能力鑑別媒介與其內容"
    ],
    "syllabus": "I.課程概述本課程將會介紹人機互動（human-computer interaction）中重要領域—科技輔助協同合作與社群運算的基本概念、相關理論與應用。並將透過不同科技中介傳播工具，如即時通訊軟體、社交軟體、行動科技、機器人等來了解CSCW領域的相關研究與所涵蓋的主題。本課程的主要目的是希望能讓同學了解CSCW如何影響人際溝通與不同形式的合作，透過本課程培養批判思考、獨立研究、科技設計的能力。II.學習目標本課程將會從多元的角度涵蓋相關主題，以符合修課學生的不同背景與目的：•了解CSCW領域的相關理論，熟悉常見或是新興的資訊科技工具•練習在理論的框架下，如何找到有趣、並值得研究的題目• 了解CSCW的相關應用，並且學習如何與自己的研究興趣、主題相連結III.課程要求指定閱讀：課程大綱列出每週學習重點以及相關指定閱讀，學生可在課程網站上下載所有指定閱讀文章。為了在課堂中能夠充分學習並參與討論，學生必須按照課程大綱中每週所列出的指定閱讀文章，在課堂前完成預習。課堂參與: 為了能習得本課程所列出的學習目標，並且規劃報告，學生必須按時出席並與成員互動。 課堂發言: 本課程重視教師與學生之間的互動，課堂參與也能幫助教師了解學生的學習情況。作業規定: 每項作業繳交時間為作業截止日上課前，課後繳交將被扣1分，逾期一天加扣1分，以此類推至分數扣完為止。1. 作業 (40 %)：本學期將有四篇短篇作業，每篇字數約1000字上下，每篇作業各佔學期總成績10%。作業內容為分析並綜述傳播科技與社會相關主題，請利用課堂所學知識分析論述各個主題。學生必須在作業截止日的課堂前完成並email作業，以利進行課間活動。課後繳交將被扣1分，逾期一天加扣1分，以此類推至分數扣完為止。2. 課堂導讀與報告 (25 %)：每位同學必須進行課堂口頭報告，請在選定報告日期前兩週與老師討論題目與報告形式。報告時間為50分鐘，報告內容為：•20-25分鐘口頭報告：形式不拘（可以是Wiki、影片、海報、投影片等媒介），內容包括與該堂課相關主題的研究（不可以是指定閱讀），報告內容須在報告前兩週與教師進行討論。•15-20分鐘課堂活動：需設計課堂活動與其他同學互動。•5-10分鐘問與答3. 論文大綱 (25 %)：每人最後將提交論文大綱並進行口頭報告（30頁以內，雙行間距，不包括參考書目；口頭報告每人30分鐘）。論文大綱需包含以下三個章節：•論文題目介紹與研究動機•相關文獻回顧•預計使用的研究方法 4. 課堂參與發言 (10 %)：如上所述，每週課堂中會有許多活動，學生必須按時出席，與其他同學分享經驗與想法，或是對該課堂閱讀文章的心得或感想。發言內容的質與量將成為評判成績標準。IV.評量方式 學期總成績將根據每項課程要求獲得的評分累計。 A+90-100 B73-76 C-60-62A85-89 B-70-72 D50-59A-80-84 C+67-69 E 01-49B+77-79 C 63-66 X0V.其他相關規範•本課程每週上課教材的PPT檔，將上傳到學校教學系統，同學可自行下載參考。•如無法到校上課，需向老師提出請假，獲准兩次以內不扣分(事假需事先請，並提出相關證明；病假需有掛號收據或看病證明，並需在缺課一週之內完成請假手續)。•如對課程內容或授課方式有任何意見，歡迎隨時與我聯絡。•學術倫理與抄襲規範：本堂課中所有的作業均須是學生自己的努力成果，如有引用學者或是相關人員的作品，請用正確格式引用。 請同學勿違反學習上的不當行為，例如造假與抄襲書籍、研究期刊、網路資料等，目前有許多偵測抄襲的軟體可以檢視是否有違規情事，如被發現，本堂課成績以不及格計。另請同學尊重智慧財產權，使用正版教科書，不得非法影印，以免觸犯智慧財產權相關法令。",
    "methodologies": [
        {
            "type": "講述法",
            "note": "詳見課程大綱"
        },
        {
            "type": "討論法",
            "note": "詳見課程大綱"
        },
        {
            "type": "專題研究",
            "note": "詳見課程大綱"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 40,
            "note": "詳見課程大綱"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "詳見課程大綱"
        },
        {
            "type": "報告",
            "weight": 25,
            "note": "詳見課程大綱"
        },
        {
            "type": "專題",
            "weight": 25,
            "note": "詳見課程大綱"
        }
    ],
    "prerequisite": "",
    "general_core": []
}