{
    "year": 110,
    "term": 1,
    "name": "高等有機化學專論",
    "teachers": [
        "林文偉"
    ],
    "department": "SD42",
    "code": "CMD0147",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 2647,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 2,
            "to": 4,
            "campus": "公館",
            "classroom": "Ｆ318"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course is intended for students who have completed the courses of organic chemistry in their master studies and wish to expand their understanding of structure and reaction mechanisms in organic chemistry. The students are assumed to have the background of organometallic chemistry in advanced undergraduate level. The students also need to have the basic knowledge of physical and inorganic chemistry at the advanced undergraduate level.",
    "goals": [
        "This course is intended for students who have completed the courses of organic chemistry in their master studies and wish to expand their understanding of structure and reaction mechanisms in organic chemistry.",
        "The students are assumed to have the background of organometallic chemistry in advanced undergraduate level.",
        "The students also need to have the basic knowledge of physical and inorganic chemistry at the advanced undergraduate level."
    ],
    "syllabus": "This course will include: a) chemical bonding and structure; b) principles of stereochemistry; c) conformational, steric, and stereoelectronic effects; d) study and description of organic reaction mechanism; e) nucleophilic substitution, polar addition and elimination reactions; f) carbanions and other nucleophilic carbon species; g) reactions of carbonyl compound; h) aromaticity and aromatic substitution; i) concerted pericyclic reactions; j) free-radical reactions; k) photochemistry; l) alkylation of nucleophilic carbon intermediates; m) reaction of carbon nucleophiles with carbonyl groups and their derivaties; n) functional group interconversion by nucleophilic substitution; o) electrophilic additions to carbon-carbon multiples; p) reduction; q) cycloaddition, unimolecular rearrangements, and thermal elimination; r) organometallic compounds of the group I, II, and III, and transition metals chemistry; s) carbon-carbon bond-forming reactions of compounds of boron, silicon, and tin; t) reactions involving carbocations, carbenes, and radicals as reactive intermediates; u) oxidation; v) planning and execution of multistep synthesis.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 40,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 40,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 20,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}