{
    "year": 108,
    "term": 2,
    "name": "永續觀光管理",
    "teachers": [
        "莫家俊"
    ],
    "department": "LU23",
    "code": "GEU0199",
    "credit": 3,
    "serial": 1836,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 5
    },
    "schedule": [
        {
            "day": 5,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "正206"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "3",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "Given that tourism worldwide is a huge economic sector, this course poses the overarching question: what are the effects of tourism on sustainable development? Sustainable tourism is needed as increasing flows of tourists and investments in tourism have both positive and negative impacts on both local and global scales. The course will be specifically useful to students interested in understanding the types and impacts of tourism from a sustainability perspective. Lectures, a field trip, and student-led tutorials will be used to understand how tourism affects landscapes, environments and societies as a whole. This course allows students to appreciate geographers’ contributions to sustainable tourism management studies. Students will be able to approach various facets of sustainable tourism, including: ecotourism; urban tourism; community-based tourism; tourism planning, management and policy; and the future of sustainable tourism. A multifaceted understanding of tourism allows students to critically evaluate and apprehend tourism policies and activities on economic, social, and environmental domains.",
    "goals": [
        "Analyze and apprehend the positive and negative impacts of tourism on the landscape, environment and society as a whole.",
        "Understand and apply current frameworks and theories on sustainable tourism management.",
        "Develop an integrated approach to evaluate tourism policies, management and planning from a sustainability perspective.",
        "Incorporate lessons learned from a case study within the broader historical, sustainability and contemporary tourism context."
    ],
    "syllabus": "Week 1. Lecture: Introduction to the Course (3/6)  \nWeek 2. Lecture: What is Tourism? (3/13)\n\nWeek 3. Lecture: What is Sustainable Development? (3/20)\n\nWeek 4. Lecture: Tourism and Globalization (3/27)\n\n**Week 5: No class (4/3)**  \nWeek 6. Lecture: Tourism, Development, and Sustainability (4/10)  \nWeek 7. Lecture: Sustainable Tourism Management Frameworks (4/17)  \nWeek 8. Lecture: Tourism Marketing, Tour Operators and Evaluation (4/24)\n\nWeek 9. Lecture: Community-based and Eco-Tourism (5/1)\n\nWeek 10. Lecture: Preparation fieldtrip (5/8) & Fieldtrip (counts for 3 classes)\n\nWeek 11. Lecture: Slow tourism and backpack tourism+ preparation presentations (5/15)\n\nWeek 12. Tutorial: Student-led Seminars I (5/22)\n\nWeek 13. Tutorial: Student-led Seminars II (5/29)\n\nWeek 14. Tutorial Student-led Seminars III (6/5) + **practicing the exam**\n\nWeek 15. Lecture: Sustainable urban tourism + wrap up lecture (6/12)  \n**Week 16. Final Exam (6/19)**  \n**Week 17. No class (6/26)**\n\nWeek 18: No class but Feedback opportunity (7/3)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Lectures are divided into three parts: theory, selected topics, and evaluation. Until Week 7, we will discuss the major theories and frameworks related to sustainable tourism management. From Week 9 until Week 15 we adopt a topical approach. Finally, we finalize the course with evaluating tourism management and policy, and we include a lecture on ethics and tourism. Week 16 will be the final exam for this course."
        },
        {
            "type": "討論法",
            "note": "Students are required to present findings of their group-project during student-led tutorials: Choose a country in the Global South, analyze the types of tourism in that country, study the effects of tourism on the country and society (using a sustainability framework), and come up with policy recommendations. The output of this group-project include a presentation + discussion, and a group-report (note for the presentation + references)."
        },
        {
            "type": "實地考察、參訪",
            "note": "We will organize a fieldtrip to Houtong or another destination in Taipei (to be announced later) in Week 13."
        },
        {
            "type": "媒體融入教學",
            "note": "We will make ample use of media and visual materials during formal lectures."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": "Group report: notes for the presentation + references (10%)\nPhoto or media-based report field trip (20%)"
        },
        {
            "type": "期末考",
            "weight": 40,
            "note": "Final exam on all lectures, assignments, and required readings."
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Attending the lecturers and seminars is compulsory, unless you have a valid reason not to come."
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "In-class presentation (20 min. including Q&A)"
        }
    ],
    "prerequisite": "",
    "general_core": []
}