{
    "year": 109,
    "term": 2,
    "name": "產業創新與策略研究",
    "teachers": [
        "黃啟祐"
    ],
    "department": "HD70",
    "code": "IED0129",
    "credit": 2,
    "serial": 1082,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 10,
            "to": 11,
            "campus": "本部",
            "classroom": "研討一"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "Innovation is combinations of knowledge that result in new products, processes, input and output markets, or organizations which include not only technical innovations, but also organizational and managerial innovations, new markets, new sources of supply, financial innovations, and new combinations. Innovation is a critical factor in enhancing a nation's competitiveness. National governments have pursued planning in innovation policies to improve their nation's growth. In a knowledge-based economy, innovation through the creation, diffusion and use of knowledge has become a key driver of economic growth. \n\nIndustrial innovation includes technical design, manufacturing, management and commercial activities involved in the marketing of a new (or improved) product or the first commercial use of a new (or improved) process or equipment. The factors required for industrial innovation include technical knowledge, manpower, market information, management skills, financial resources, R&D environments, a domestic market, and an international market. Industrial innovation, indeed, can increase overall economic development.\n\nIn this course, fundamental concepts as well as advances in modern innovation and strategic management theories as well as methods will be introduced for serving as the foundation for Ph.D. students’ future researches. Students will be requested to analyze problems based on the innovation theories and define corresponding strategies based on real world problems for verifying their real understanding of the methods.",
    "goals": [
        "協助學生瞭解產業創新與策略理論",
        "協助學生瞭解產業創新與策略分析方法",
        "培養產業創新與策略之研究能力"
    ],
    "syllabus": "1.    Introduction\n\n2.    Theory building logic\n\n3.    Open  innovation\n\n4.    Innovation network\n\n5.    Product and service innovation\n\n6.    Diffusion  and adoption of innovation\n\n7.    Knowledge and innovation\n\n8.    Business   model & value    capture\n\n9.    Building capability and organization\n\n10. Innovation system\n\n11. Leading strategic innovation\n\n12. Technological Discontinuities\n\n13. Path Dependency, Ambidexterity\n\n14. Strategically innovative entrepreneurship\n\n15. Managing the potential of discontinuous technologies\n\n16. Ecosystems\n\n17. The platform economy\n\n18. Final Examination",
    "methodologies": [
        {
            "type": "講述法",
            "note": "由授課教師講解新產品企劃理論與分析方法"
        },
        {
            "type": "討論法",
            "note": "由授課教師講解新產品企劃理論與分析方法"
        },
        {
            "type": "專題研究",
            "note": "期末學生需要以介紹之理論與方法進行專題研究"
        }
    ],
    "grading": [
        {
            "type": "期末考",
            "weight": 50,
            "note": "期末考內容涵蓋本學期介紹之理論與分析架構"
        },
        {
            "type": "專題",
            "weight": 50,
            "note": "以本學期介紹之理論與分析架構分析新興議題"
        }
    ],
    "prerequisite": "",
    "general_core": []
}