{
    "year": 108,
    "term": 2,
    "name": "專題討論（四）",
    "teachers": [
        "葉孟宛"
    ],
    "department": "SM44",
    "code": "ESM0197",
    "credit": 1,
    "serial": 2601,
    "group": "F",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 2,
            "from": 8,
            "to": 9,
            "campus": "公館",
            "classroom": "Ｓ101"
        }
    ],
    "programs": [],
    "comment": "海洋組",
    "restrict": "◎限碩二修習 ◎課程不開放上修",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本課程定期邀請國內外地球科學領域之學者專家進行專題演講，包含地質、地球物理、海洋、大氣與太空等次領域，介紹其近期研究內容與結果，並進行學術討論。",
    "goals": [
        "透過當代不同領域學者之講演使學生學習本系各相關學術領域的最新進展，並從而規劃相關研究題材。"
    ],
    "syllabus": "**This course is a seminar in interdisciplinary subjects of Earth Sciences. For the first half of the semester,the course invites multiple top notch researchers within Taiwan Academics or international visiting researchers to provide speech and lessons regarding to the most advanced research results and developments. For the second half of the semester, the graduate students are expected to prepare and present their research results  to the department and fellow students. This course provides an opportunity for senior students to learn from professional researchers to present their research findings. Which is a crucial skill not provided by other courses. By shearing their case studies and lessons learned on pertinent professional subjects.This course introduces the new findings of geoscience research studies.**\n\n**課程教學目標：****前半段課成為邀請目前國內外尖端研究人員進行專題演講與授課，而後半段之課程則為訓練學生就自身的研究成果進行專題演講。藉由聽講，提問的，上台演講，被提問等循環訓練學生發掘問題、尋找相關的資料、將資料在短時間內理解消化，去蕪存菁、或延伸追求相關更深入的學問。此外，由眾多的資訊整理出一些清晰的概念，甚至於創造出新的見解、將整理出來概念的形諸文字，並且在一定的時間內在眾人面前生動地表達、在別人的報告中找出問題，並且以簡潔的語言清楚地提出問題、由別人的問題，在極短的時間裡給予充分的回答。**\n\n**教學進度：****期中考前：邀請目前國內外尖端研究人員進行專題演講與授課。****期中考後：在教師的指導下，由一群學生組成的非正式討論會。討論的題目由老師指定或學生自行決定。學生輪流使用多媒體報告他的研究成果，由其他參與同學老師提問/討論。**\n\n**教學方式與成績評量：出席，上課禮貌及儀容 10 % ，每次專題演講後之報告內容及應答70 %，個人研究之專題書面報告20 %**",
    "methodologies": [
        {
            "type": "講述法",
            "note": "邀請目前國內外尖端研究人員進行專題演講與授課"
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": "學生就自身的研究成果進行專題演講"
        }
    ],
    "grading": [
        {
            "type": "出席",
            "weight": 10,
            "note": "出席，上課禮貌及儀容"
        },
        {
            "type": "報告",
            "weight": 70,
            "note": "每次在聽完演講後，學生需由眾多的資訊整理出一些清晰的概念，甚至於創造出新的見解、將整理出來概念的形諸文字寫成簡短報告"
        },
        {
            "type": "專題",
            "weight": 20,
            "note": "學生就自身的研究成果進行專題演講"
        }
    ],
    "prerequisite": "",
    "general_core": []
}