{
    "year": 110,
    "term": 1,
    "name": "森林生態學",
    "teachers": [
        "林登秋"
    ],
    "department": "SU43",
    "code": "BIC0170",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 2969,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 7,
            "to": 9,
            "campus": "公館",
            "classroom": "Ｃ302"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "9",
    "dept_group": "",
    "hours": 3,
    "description": "Forest ecosystems are important natural resources globally and are of particular importance in Taiwan because they cover approximately 58% of the land area of Taiwan. Forest ecosystems host the highly diverse animals, plants, and microbes in Taiwan including many endemic species. In addition, a healthy forest cover is essential for soil and water conservation of our steep and fragile island. A good knowledge of forest structure, function, and dynamics is the foundation for understanding the biodiversity and ecological characteristics of Taiwan. As a sub-discipline of ecology, forest ecology focuses ecological discussion within forest ecosystems. In addition to learning basic and fundamental knowledge of forest ecology, I hope to provide you in situ understanding of forest ecosystems. \nThis course is designed for advanced undergraduate students and graduate students that are interested in working in forests. I hope the information you learn from this course will stimulate your interest in forest ecology related research. I consider this course to be a heavy one. We will read 10 papers and make two field trips with reports afterwards so I expect that all enrolled students are enthusiastic in forest ecology.",
    "goals": [
        "具備森林生態學的基礎核心概念",
        "能熟讀並呈現森林生態學重要文獻",
        "能提描述分析森林生態系結構功態與變動，並深入探討其驅動力",
        "建構關心森林生態的情懷"
    ],
    "syllabus": "Week 1 Introduction: Forests as ecosystems, global forest distribution\n\nWeek 2 Community ecology perspectives\n\nWeek 3 Landscape ecology perspectives\n\nWeek 4 Decomposition\n\nWeek 5 Nutrient cycling\n\nWeek 6 Forests and global change interactions\n\nWeek 7 Field trip to Yangminshan National Park\n\nWeek 8 Discussion on structure and function of Yangminshan (I)\n\nWeek 9 Discussion on structure and function of Yangminshan (II)\n\nWeek 10 Analysis of ecological data of Yangminshan Forest\n\nWeek 11 Presentation on ecology of Yangminshan Forest\n\nWeek 12 Field trip to Fushan Forest Ecosystem\n\nWeek 13 Discussion on structure and function of Fushan Forest Ecosystem (I)\n\nWeek 14 Discussion on structure and function of Fushan Forest Ecosystem (II)\n\nWeek 15 Analysis of ecological data of Fushan Forest Ecosystem\n\nWeek 16 Presentation on ecology of Yangminshan Forest\n\nWeek 17 Student presentations on comparisons between Fushan and Yangminshan Forest Ecosystems (I)\n\nWeek 18 Student presentations on comparisons between Fushan and Yangminshan Forest Ecosystems (I)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "講述教育研究重要概念與理論"
        },
        {
            "type": "討論法",
            "note": "分析討論田野觀察及森林生態文獻"
        },
        {
            "type": "專題研究",
            "note": "透過討發表陽明山與福山森林生態系的之比較：結構、功能、變動及其驅力"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": "出席並參與田野觀察及課堂討論"
        },
        {
            "type": "報告",
            "weight": 70,
            "note": "主題文獻報告35% 生態系比較報告35%"
        }
    ],
    "prerequisite": "",
    "general_core": []
}