{
    "year": 109,
    "term": 1,
    "name": "數學教學解題（一）（IB）",
    "teachers": [
        "游森棚"
    ],
    "department": "SU40",
    "code": "MAC9027",
    "credit": 3,
    "serial": 2798,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 6,
            "to": 8,
            "campus": "公館",
            "classroom": "數學館M210"
        }
    ],
    "programs": [
        "國際教師學程-數學"
    ],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "9",
    "dept_group": "",
    "hours": 3,
    "description": "This course trains perspective high school teachers in problem solving in mathematics. The problems are selected from competition levels, so as to facilitate discussion and thinking on key concepts. Teacher candidates are required to compose test papers, preferably one set for a group in order to promote collaboration and group work. Finally, one groups’ test papers will be criticized by the other groups in lessons. Feedback will be collected and reviewed in order to improve the quality of the work.",
    "goals": [
        "Knowledge of major mathematics problems, including background and mathematical contents.",
        "Recognition of mathematical contents in problems.",
        "Composition of a balanced, well-covered set of test papers.",
        "Reflection and communication on improvements of works."
    ],
    "syllabus": "The goal of this course is to bridge the gap between secondary school mathematics and university mathematics. Material needed for upper-tier students but not taught in standard university classes, e.g. trilinear coordinate, combinatorial arguments, will be also compensated if time is allowed.\n\nWe will introduce various topics via a collection of problems. Students are required to solve, discuss and study the theory involved. No textbooks are required, textbooks used in the first 3 years are useful. \n\nActive presentation and active discussion in class are highly anticipated. \n\nA independent project is required at the end of the semester.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 25,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 25,
            "note": "含期中考"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 40,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}