{
    "year": 109,
    "term": 2,
    "name": "文物保存科技與典藏維護議題研究",
    "teachers": [
        "張元鳳"
    ],
    "department": "TM60",
    "code": "ATC8040",
    "credit": 3,
    "serial": 3042,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "美506"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "1.探究國際文物保存修復的倫理原則與專業發展\n2.暸解國際文物保存修復聯合國教科文組織等相關憲章、規範與宣言\n3.探討文保相關執行目的、技術與任務\n4.教育推廣與跨領域人才培育的環境探討\n5.藝術行政管理與執行的正確性與重要性",
    "goals": [
        "文保專業的理解與認識",
        "文保跨領域的追求與探索",
        "藝術美學與修復美學的討論",
        "藝術與科學的新美學結合"
    ],
    "syllabus": "**課程重點**\n\n1.探究國際文物保存修復的倫理原則與專業發展\n\nTo explore and development the ethics and principles of international conservation and restoration of cultural relics.\n\n2.暸解國際文物保存修復聯合國教科文組織等相關憲章、規範與宣言\n\nTo understand international organizations e.g. UNESCO’s charter, declaration and protocol on conservation and restoration of cultural relics.\n\n3.探討文保相關執行目的、技術與任務\n\nTo discuss conservation and restoration related purposes, techniques and tasks in application\n\n4.教育推廣與跨領域人才培育的環境探討\n\nTo discuss education promotion and the environment to cultivate interdisciplinary human resources.\n\n5.藝術行政管理與執行的正確性與重要性\n\nTo address the correctness and importance of execution in administration and management of conservation and restoration of cultural relics.\n\n第 1 週 課程說明、依人數分組\n\n第 2 週 全球文物保存修復科技研究的倫理原則與概論\n\n第 3 週 台灣文保相關執行任務與特殊人才培育發展\n\n（第四週開始5～6次講座-國內外相關專家學者，暫定如下：依課程需求內容變更）\n\n第 4 週 專題講座：文物典藏管理與創作材料技法-藝術藏品欣賞與材料技法解析\n\n第 5 週 專題講座：文保科技研究與發展要論-東方繪畫、檔案修復與材料技法\n\n第 6 週 專題講座：文保科技研究與發展要論-木造建築修復（庭園）與材料技法\n\n第 7 週 專題講座：文保科技研究與發展要論-油畫、照片修復與材料技法\n\n第 8 週 專題講座：文保科技研究發展-非破壞檢測與分析\n\n第 9 週 專題講座：藝術行政管理-文保執行與推廣職責\n\n第 10 週 同上：檢視登錄的重要性與方法(實物登錄演習)\n\n第 11～15 週【活動】專題研究與小組討論、分享\n\n第 16 週【繳交小組作業】觀察、訪談或實務（依專業組別、課程進度變動）\n\n第 17~18 週 自主學習，期末報告繳交\n\nWeek 1, Course Overview\n\nWeek 2, Introduction and Ethical Principles on Technology Research of Global Conservation and Restoration of Cultural Relics\n\nWeek 3, The Cultivation and Development of Conservation and estoration related Tasks and Specialists in Taiwan\n\n(From week 4, special topics are lectured by invited International and Taiwanese professional specialists and scholars.)\n\nWeek 4, Special Topic- The Development of Collection Management of Cultural Relics, Techniques and Materials- Preventive Maintenance.\n\nWeek 5 Special Topic- The Overview of the Research and Development of Science and Technology on Conservation and Restoration of Cultural Relics- Painting Conservation\n\nWeek 6 Special Topic- The Overview of the Research and Development of Science and Technology on Conservation and Restoration of Cultural Relics-- Architecture Conservation\n\nWeek 7 Special Topic- The Overview of the Research and Development of Science and Technology on Conservation and Restoration of Cultural Relics-- Forensic Science\n\nWeek 8 Special Topic- The Overview of the Research and Development of Science and Technology on Conservation and Restoration of Cultural Relics- Non- destructive analysis\n\nWeek 9 Special Topic- Administration Management of Conservation and Restoration of Cultural Relics- Execution and Promotion\n\nWeek 10 Same as Week 9\n\nWeek 11- 15 Group activities- Research on special topics, Group discussion and sharing.\n\nWeek 16 Group Work Submission including observation, interviews or practices (varied by professional groups) and the presentations of term papers.  Term papers submission\n\nWeek 17~18  Final report, self-directed learning.",
    "methodologies": [
        {
            "type": "講述法",
            "note": "課堂說明與ppt"
        },
        {
            "type": "討論法",
            "note": "分組探討收集資料"
        },
        {
            "type": "問題解決教學",
            "note": "實作、實物藝術作品欣賞、修復方針分析與任務"
        },
        {
            "type": "實驗/實作",
            "note": "檢視登錄實作"
        },
        {
            "type": "實地考察、參訪",
            "note": "修復中心、修復現場、實驗教室等依課程需求"
        },
        {
            "type": "其他",
            "note": "配合各領域學生提供相關咨詢與探討議題"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 40,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 30,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}