{
    "year": 110,
    "term": 2,
    "name": "諮商與心理治療之效能",
    "teachers": [
        "Joshua.K.",
        "Swift."
    ],
    "department": "EM01",
    "code": "PCC8023",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 405,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "教500"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "The overall purpose of this graduate course is to help students gain knowledge about the evidence regarding counseling and psychotherapy processes and outcomes. This includes knowledge about the latest findings in the field, knowledge about how to conduct counseling and psychotherapy process and outcome research, and knowledge about how to critically evaluate counseling and psychotherapy process and outcome research.",
    "goals": [
        "Students will be able to demonstrate knowledge of existing findings in counseling and psychotherapy research, including the overall efficacy and effectiveness of psychotherapy, the client in psychotherapy, the therapist in psychotherapy, relationship factors, and process factors.",
        "Students will be able to demonstrate knowledge of different methods frequently used in counseling and psychotherapy research.",
        "Students will be able to show an ability to critically evaluate studies and findings in counseling and psychotherapy research.",
        "Students will be able to show an ability to design a counseling or psychotherapy research study that is appropriate to a particular research question."
    ],
    "syllabus": "**Dates**\n\n**Topics & _Assignments_**\n\n**Readings**\n\nFeb 14\n\nSyllabus & Introductions\n\nHistory of Process and Outcome Research\n\nRead the syllabus\n\nHandbook (Chapter 1)\n\nTompkins & Swift (2015)\n\nFeb 21\n\nMeasuring Change\n\nHandbook (Chapter 4)\n\nFeb 28\n\nPeace Memorial Day (no classes)\n\nMar 7\n\nMethod and Design\n\n_Article Review:_\n\nHandbook (Chapter 2)\n\nMar 14\n\nQualitative Research\n\n_Article Review:_\n\nHandbook (Chapter 3)\n\nMar 21\n\nPractice-oriented Research\n\n_Article Review:_\n\nHandbook (Chapter 6)\n\nMar 28\n\nEfficacy and Effectiveness\n\n_Article Review:_\n\nHandbook (Chapter 5)\n\nApr 4\n\nChildren’s Day (no classes)\n\nApr 11\n\nThe Client\n\n_Article Review:_\n\nHandbook (Chapter 7)\n\nNorcross & Wampold (2018)\n\nApr 18\n\nThe Client: Culture & Religion\n\n_Article Review:_\n\nSoto et al. (2018)\n\nCaptari et al. (2018)\n\nApr 25\n\nThe Client: Preferences & Expectations\n\n_Article Review:_\n\nSwift et al. (2018)\n\nConstantino et al. (2018)\n\nMay 2\n\nTherapist Effects\n\n_Article Review:_\n\nHandbook (Chapter 9)\n\nMay 9\n\nIn Class Help on Method Paper\n\nMay 16\n\nThe Process\n\n_Article Review:_\n\nHandbook (Chapter 8)\n\nNorcross & Lambert (2018)\n\nMay 23\n\nThe Relationship: Alliance & Repair\n\n_Article Review:_\n\nFluckiger et al. (2018)\n\nEubanks et al. (2018)\n\nMay 30\n\nThe Relationship: Empathy & Collaboration\n\n_Article Review:_\n\nTryon et al. (2018)\n\nElliott et al. (2018)\n\nJun 6\n\nThe Relationship: Immediacy & Feedback\n\n_Article Review:_\n\nHill et al. (2018)\n\nLambert et al. (2018)\n\nJun 13\n\n_Final Exam (in class)_\n\n_Method Paper due_\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=540f864d6c004a8b8eeb9c250c8f95dc&fno=fd9aa2688fac4a339350e0f4a03af644)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Each week (except for the Flex week and the Final Exam) will include a formal lecture by the Instructor on the assigned topics. The lectures will take up about ½ of the class time."
        },
        {
            "type": "討論法",
            "note": "Each week (except for the Flex week and the Final Exam) will include some group discussions. These will include large group discussions (entire class) as well as small group discussions (3 to 5 students). Group discussions will take up about ¼ of the class time."
        },
        {
            "type": "合作學習",
            "note": "See case study section below. The case study activities will be completed in groups, thus cooperative learning will occur."
        },
        {
            "type": "專題研究",
            "note": "During some weeks, students (in groups) will be assigned a case study scenario to review. They will be asked to solve a problem within the case, based on the lecture topic for the week. Case studies will take up about 1/8th of the class time."
        },
        {
            "type": "其他",
            "note": "Each week a different student will be asked to review an article for the class. Students will be given several potential articles to choose from. They will be asked present a summary of the study to the class, identify limitations with the study, and discuss the implications for counseling and psychotherapy. Presentations will take up about 1/8th of the class time."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": "Students will be asked to write a method paper for a potential study on the effectiveness of counseling and psychotherapy. This paper should be between 8 and 14 double spaced pages."
        },
        {
            "type": "期末考",
            "weight": 25,
            "note": "Students will be asked to complete a final exam including multiple choice, short answer, and essay questions on the topics covered in the course."
        },
        {
            "type": "課堂討論參與",
            "weight": 15,
            "note": "Students will be graded on their involvement in the class. This includes involvement in the class lectures (asking and answering questions), engaging in group discussions, and actively participating in the case studies."
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "Students will be asked to review two relevant research articles, present a summary of them to the class, including a presentation of limitations, and implications for counseling and psychotherapy."
        }
    ],
    "prerequisite": "",
    "general_core": []
}