{
    "year": 111,
    "term": 1,
    "name": "專題討論（一）",
    "teachers": [
        "管一政"
    ],
    "department": "SM44",
    "code": "ESM0194",
    "type": "必",
    "grade": 1,
    "credit": 1,
    "serial": 2720,
    "group": "D",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 6,
            "to": 7,
            "campus": "公館",
            "classroom": "Ｓ101"
        }
    ],
    "programs": [],
    "comment": "天文組",
    "restrict": "◎限本系(含雙主修)、輔系修習  ◎限碩一修習 ◎課程不開放上修",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "",
    "goals": [
        "The objectives of this course are to provide graduate students with the knowledge and understanding of recent development and research trends in the field of earth sciences."
    ],
    "syllabus": "Faculty members in charge of this course regularly (typically once a week) invite scholars and researchers, in the field of earth sciences (including its sub-fields such as geology, geophysics, astronomy, atmospheric sciences, and oceanography), from other universities and institutes in Taiwan or overseas to offer lectures on their recent research and latest results. Discussions will also take place after the lectures. The objectives of this course are to provide graduate students with the knowledge and understanding about recent development and research trends in the field of earth sciences.\n\nWeek 1:       Introduction.\n\nWeek 2-16:  Colloquium talks given by invited speakers and graduate students on research topics related to earth sciences.\n\n(The actual schedule of colloquium talks can be found at [https://web.ntnu.edu.tw/~chenlw/ntnuescolloq.html](https://web.ntnu.edu.tw/~chenlw/ntnuescolloq.html) after the semester begins.)",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "Colloquium talks given by invited speakers and graduate students"
        }
    ],
    "grading": [
        {
            "type": "other:",
            "weight": 100,
            "note": "Two written reports: one on an astronomy-related talk and the other on a non-astronomy talk. Both talks must be given by invited speakers."
        }
    ],
    "prerequisite": "◎Exclusive for students within this department(including dual degree program) ◎Exclusive for students taking minor within this department   ◎Exclusive for first year of graduate school ◎Unavailable for M.A. program students (M.A. program courses excepted) and B.A. program students.",
    "general_core": []
}