{
    "year": 111,
    "term": 1,
    "name": "專題討論（一）",
    "teachers": [
        "謝奈特"
    ],
    "department": "SM44",
    "code": "ESM0194",
    "type": "必",
    "grade": 1,
    "credit": 1,
    "serial": 2718,
    "group": "B",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 6,
            "to": 7,
            "campus": "公館",
            "classroom": "Ｓ101"
        }
    ],
    "programs": [],
    "comment": "地質組",
    "restrict": "◎限本系(含雙主修)、輔系修習  ◎限碩一修習 ◎課程不開放上修",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "",
    "goals": [
        "The objectives of this course are to provide graduate students with the knowledge and understanding of recent development and research trends in the field of earth sciences."
    ],
    "syllabus": "Objectives: Earth Science Seminar aims to help students familiar with the emerging issues in Earth Science, engage students in cross disciplinary conversations that explore Earth Science issues by divergent perspectives.  Faculty members in charge of this course regularly (typically once a week) invite scholars and researchers, in the field of earth sciences (including its sub-fields such as geology, geo-physics, astronomy, atmospheric sciences, and oceanography), from other universities and institutes in Taiwan or overseas to offer lectures on their recent research and latest results. Discussions will also take place after the lectures. The objectives of this course are to provide graduate students with the knowledge and understanding about recent development and research trends in the field of earth sciences.  \n  \nSchedule:\n\nWeek 1. Introduction  \nWeek 2-12 Invited guest speakers on different disciplines  \nWeek 13-16 Student presentation",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "There will be a two-hour face-to-face speech each week, which is also available online. Details of speaker and\ntopics will be provided by Prof. Lin-Wen Chen, which will be also available on the course website."
        },
        {
            "type": "Group discussion",
            "note": "Communicate ideas with speakers and students in a succinct and clear manner."
        },
        {
            "type": "Lab/Studio",
            "note": "Students present his/her own research. Practicing and improving the technique of presentation."
        }
    ],
    "grading": [
        {
            "type": "other:",
            "weight": 100,
            "note": "Score is graded based on the regulations of the NTNU and Earth Department"
        }
    ],
    "prerequisite": "◎Exclusive for students within this department(including dual degree program) ◎Exclusive for students taking minor within this department   ◎Exclusive for first year of graduate school ◎Unavailable for M.A. program students (M.A. program courses excepted) and B.A. program students.",
    "general_core": []
}