{
    "year": 111,
    "term": 1,
    "name": "使用者經驗設計",
    "teachers": [
        "袁千雯"
    ],
    "department": "EM15",
    "code": "ISM0802",
    "credit": 3,
    "serial": 511,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 0
    },
    "schedule": [
        {
            "day": 2,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "圖資所研討室A"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "本課程設計分為課程基本概念介紹，設計思考介紹、團隊建立，接下來是設計流程的四大模組(Discovery, Define, Develop, Deliver)與成果展覽，深入探討了這種創造性方法的基礎知識，讓學生沉浸在動態討論，相關閱讀和團隊練習中。學生將於本課程中透過分組合作的方式學習使用者經驗相關理論以及實作。學生將學習如何理解最終使用者的需求和動機，提出解決問題的大量想法，磨練正確的價值主張，並開始對新產品與互動、服務系統進行原型設計。本課程可能的應用領域包含互動設計、空間設計、服務設計以及產品設計。學生將有能力完成使用者研究設計、評估、施行、以及質化與量化分析測量。",
    "goals": [
        "瞭解使用者經驗工程 (usability engineering, UE) 是反覆疊代的過程：設計者必須根據系統設計的脈絡與背景，決定使用哪些UE方法， 並且在每個步驟做出正確且仰賴充分資訊的決定。",
        "確切分析使用者需求：設計者必須充分瞭解系統設計的生命週期，使用者在各個階段有何不同的需求，並且根據該需求來選擇應用不同的設計方法。",
        "學習使用情境導引式設計（scenario-based design）來瞭解使用者需求以及如何量測系統適用性 。",
        "學習並釐清各個設計方法的優缺點並加以整合，以符不同情境所需。"
    ],
    "syllabus": "設計思維是一種應用創造力的創新科學方法，為棘手的問題提出新穎的解決方案與評估。設計思維是讓自己沉浸在問題空間，圍繞痛點和機會領域進行創造性思考，然後迭代地（iteratively）對全新解決方案進行原型（prototype）探索與設計的過程。設計思維專注於傾聽，使用者同理心，全腦思維，合作和實驗與實作。它可以應用於任何團隊和任何領域 - 從建築與設計到醫療保健與產品開發。從“好神拖”到“Tesla: 電動車”到“銀青共創”的一切都是設計思維的結果。設計思維的技巧、科學和工具也可以應用於非營利組織和公共部門的問題。本課程將要求同學們提出自己有興趣的議題，合作學習與思考解決真實世界各種問題與實作解答。\n\n其中，現代科技系統開發的過程中須考慮使用者經驗設計，其中包含了以下幾項重點：系統必須容易使用、學習、簡單操作、達到使用者所需之目的等。本課程將從使用者的角度出發，確保最佳的使用者經驗。課程內容包含使用者經驗設計的基礎、使用者研究量測的內涵與方法、如何收集質化與量化的使用者資料並分析、資訊設計、互動設計、使用經驗、使用性測試等。\n\n本課程將透過課堂上課、討論、以及實作的方式，介紹使用者研究的實際案例、評估模式、團隊合作方法、設計與評估工具、實踐思維、挑戰、以及實際執行的程序。本課程主要評量方式為小組合作計畫，各課程單元的閱讀資料、個人作業、以及課程活動等。每堂課的內容均與小組計劃相關。學生將按照步驟，以學期為時間單位，學習如何擬定、安排小組計劃。在過程當中也將學習如何預測與分析使用者的使用行為。本課程期望學生能透過自主學習、與小組成員合作等方式解決各項設計與開發問題。",
    "methodologies": [
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "實驗/實作",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 50,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 30,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}