{
    "year": 110,
    "term": 2,
    "name": "IB哲學與實作（IB）",
    "teachers": [
        "劉美慧",
        "范雅筑"
    ],
    "department": "EU",
    "code": "IBU0001",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 609,
    "group": "",
    "quota": {
        "limit": 35,
        "additional": 0
    },
    "schedule": [
        {
            "day": 2,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "誠106"
        }
    ],
    "programs": [
        "國際教師學程-華語文",
        "國際教師學程-數學",
        "國際教師學程-物理",
        "國際教師學程-國際"
    ],
    "comment": "",
    "restrict": "◎第一階段限 國際教師學程-華語文 國際教師學程-數學 國際教師學程-物理 國際教師學程-國際◎限國際教師學程-華語文、國際教師學程-數學、國際教師學程-物理、國際教師學程-國際選修 ◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "Know IB programme models, standards, and the curriculum coherence.",
        "Demonstrate the competence in designing learning activities that are embedded with IB philosophy.",
        "Be able to communicate and collaborate with peers within different teacher communities.",
        "Appreciate how teaching and learning are done in IB schools and reflect to their own instruction.",
        "Construct several unit plans which allow students to inquire knowledge independently."
    ],
    "syllabus": "**NOTICE:** \n\n1\\. Capacity of IB Philosophy and Practices Course is with NO EXCEEDING TO 35 LEARNERS. NO DISTRIBUTION OF EXTRA AUTORIZATION. If you failed to sign up successfully within the 1st & 2nd registration stages, please log in the system periodically for any vacancies of possible withdrawing. \n\n2\\. All course takers (including provisional signups) MUST SHOW THE PRESENCE in the 1st class. Absence will be regarded as a DROP OF COURSE. \n\n3\\. A REQUIRED one-day workshop will be held on ＿＿＿＿＿＿. Please consider signup for the next term if you are not able to fully attend. \n\n**Course Description:** \n\nThis course engages pre-service teachers to explore contemporary educational theories and IB education pedagogy. Course sessions introduce perspectives and approaches to develop school-aged students “inquiring, knowledgeable and caring young people” and “active, compassionate and lifelong learners.” To ensure that pre-service teachers acquire both theoretical and practical sense of IB education, the course invites IB practitioners (experienced teachers) to share their experiences and engage pre-service teachers to critically reflect on related educational issues. \n\n**Pre-requisites, Co-requisites and Prohibited Combination**\n\nThis course is a required course for four IBEC programs at NTNU. \n\n**Course Credits / Course Requirements**\n\nThis is a 3-credit course. To preview the assigned reading is required, since each session extensively engage pre-service teachers to discuss or complete tasks. The in-class activities are set as group work, which include in-class discussions and design of instructional plans. Individual work requires each pre-service teacher to write a “Theory and Praxis of IB philosophy” essay and reflective learning journals on workshops.\n\n**Topics** \n\n1\\. IB Philosophy and IB Mission\n\n2\\. Learner Profile and International Mindedness\n\n3\\. IB standards and Practices & Programme Models\n\n4\\. Conceptual Understanding and Contextual Learning\n\n5\\. Approaches to Learning & Approaches to Teaching\n\n6\\. Assessment Objectives and Criteria\n\n7\\. Formative Assessment and Inclusion\n\n8-10. Workshop : From Theory to Practice\n\n11\\. MYP Projects and EE\n\n12\\. MYP Service and Action CAS\n\n13\\. MYP Interdisciplinary Unit\n\n14\\. DP Theory of Knowledge\n\n15-16. Workshop: From Theory to Practice\n\n17\\. IB School Visit\n\n18\\. Final Presentation",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": ""
        },
        {
            "type": "Group discussion",
            "note": ""
        },
        {
            "type": "Field work",
            "note": ""
        },
        {
            "type": "Media, audio, visual materials",
            "note": ""
        },
        {
            "type": "Case studies",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 40,
            "note": "Unit Plans"
        },
        {
            "type": "Class discussion involvement",
            "weight": 20,
            "note": "Workshop performance"
        },
        {
            "type": "Presentation",
            "weight": 30,
            "note": "MYP and DP analysis paper"
        },
        {
            "type": "other:",
            "weight": 10,
            "note": "Review Journal"
        }
    ],
    "prerequisite": "◎First phase Exclusive for students within Programmes of International Baccalaureate Educator Certificate-Chinese Language Education Programmes of International Baccalaureate Educator Certificate-International  Mathematics  Education Programmes of I◎限Programmes of Intern、Programmes of Intern、Programmes of Intern、Programmes of Intern ◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}