{
    "year": 109,
    "term": 2,
    "name": "觀光與社會變遷",
    "teachers": [
        "賴嘉玲"
    ],
    "department": "IM82",
    "code": "ETM0076",
    "credit": 3,
    "serial": 1352,
    "group": "",
    "quota": {
        "limit": 20,
        "additional": 1
    },
    "schedule": [
        {
            "day": 2,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "博404"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course aims to introduce the new emergent issues of tourism studies under current great social transformation. It includes the discussion on the ‘mobility turn’ in tourism studies, which emphasis on the issues such as the inseparability of tourists from migrants and residents. When society can no longer ignore its underpinning base upon the changing environment, tourism is also now affected heavily by different unpredictable natural disasters, from Tsunami to Volcanic Eruption. The current complex society also urges the society under new surveillance and control. New technology is not only highly intermediated with the imagination and destination-making within tourism, but also creates virtual tourism and leads to the post-tourism. Current tourism concentrates less on authenticity and exoticism than extending itself into many unexpected dimensions, from creative tourism to dark tourism. Gender and ethnicity are still important parts of tourism, nevertheless, the postcolonial tourism no longer simply emphasized the power relationship but transform and rearticulate the colonial elements into the new asset of tourism-making. Sex tourism has not diminished but transformed into multiple forms, from gay tourism, stag tourism to new hedonism. However, safety, security and sustainability rather turns to be a significant issue for tourism. Many new tourist practices thus need to adapt to the emergent complex society, from the travel insurance provision to sorting tourism under surveillance society.",
    "goals": [
        "To understand the emergent  phenomenon on tourism",
        "To understand tourism under the context of social transformation",
        "To cultivate the critical capacity to organize and arrange new tourism attraction",
        "To form cosmopolitan vision in appreciate tourist cultures"
    ],
    "syllabus": "This course aims to introduce the new emergent issues of tourism studies undercurrent great social transformation. It includes the discussion on the‘mobility turn’ in tourism studies, which emphasis on the issues such as theinseparability of tourists from migrants and residents. When society can nolonger ignore its underpinning base upon the changing environment, tourism isalso now affected heavily by different unpredictable natural disasters, fromTsunami to Volcanic Eruption. The current complex society also urges thesociety under new surveillance and control. New technology is not only highlyintermediated with the imagination and destination-making within tourism, butalso creates virtual tourism and leads to the post-tourism. Current tourismconcentrates less on authenticity and exoticism than extending itself into manyunexpected dimensions, from creative tourism to dark tourism. Gender andethnicity are still important parts of tourism, nevertheless, the postcolonialtourism no longer simply emphasized the power relationship but transform andrearticulate the colonial elements into the new asset of tourism-making. Sextourism has not diminished but transformed into multiple forms, from gaytourism, stag tourism to new hedonism. However, safety, security andsustainability rather turns to be a significant issue for tourism. Many newtourist practices thus need to adapt to the emergent complex society, from thetravel insurance provision to sorting tourism under surveillance society.\n\n二、教材內容：\n\n**Week 1 (2/23) Tourism in the age of mobility I: An Introduction** \n\n**Week 2 (3/2) Tourism in the age of mobility II: From Tourist Gaze to Multiple Mobilities**\n\nUrry, John. 2011. _Tourist Gaze 3.0._ London: Routledge. Ch1.9.\n\nUrry, John. 2007. _Mobilities_. London: Polity. Ch 1, 2, 3. \n\n**Week 3 (3/9) Volunteer Tourism: Beyond the dualism of work and leisure**\n\nWearing, Stephen and Jess Ponting. 2010. ‘Breaking down the system: how volunteer Tourism contributes to new ways of viewing commodified tourism’, in Jamal, Tazim and Mike Robinson, edited, _The Sage Handbook of Tourism Studies._ London: Sage. Pp. 254-268.\n\nConran, Mary. 2011. ‘They Really Love me! Intimacy in Volunteer Tourism’, _Annals of Tourism Research_. 38 (4): 1454-1473.\n\n**Week 4 (3/16) From Migration to Tourism: When and where is a tourist? (‘**Mundane Tourism’: everyday life and tourism)\n\nO'Reilly, Karen. 2003, ‘When is a tourist? : The articulation of tourism and migration in Spain's Costa del Sol’, _Tourist Studies_ 2003 3: 301\n\nHui, Allison, 2008. ‘Many homes for tourism : Re-considering spatializations of home and away in tourism mobilities’, _Tourist Studies_ 2008 8: 291\n\n**Week 5 (3/23) Invited speeches:** \n\n**葉秀燕教授（東華族群文化係）原住民飲食文化行動研究**\n\n**Week 6 (3/30) Hospitality and tourism: friendship, exchange, host/guest relationship**(Derrida and tourism)\n\nBell, David. 2010. ‘Tourism and Hospitality’, in Jamal, Tazim and Mike Robinson, edited, _The Sage Handbook of Tourism Studies._ London: Sage. Pp. 19-34.\n\nPaul Lynch, Jennie Germann Molz, Alison McIntosh, Peter Lugosi and Conrad Lashley. 2011. ‘Editorial: Theorizing hospitality’, _Hospitality & Society,_ 1(1)\n\n**Week 7 (4/6) spring vacation**\n\n**Week 10 (4/13) Creative tourism** \n\nSmith, Melanie, 2003. ‘Creative tourism’, in _New Issue of Culture Tourism._ London: Routledge. Ch 6,7\n\nRichards, Greg. 2011. ‘Creativity and Tourism: the state of the art’, _Annals of Tourism Research_. 38(4):1225-1253. \n\n**Week 9 (4/20) Mid-term paper submission**\n\n**Week****10****(4/27) Post tourism: From virtual tourism to cinematic tourism** \n\n(歐文週電影節：Annie Varda and JR)\n\nGibson, Sarah. 2006. A seat with a view: tourism, (im)mobility and the cinematic-travel glance. _Tourist Studies_,6 (2): 157-178.\n\nLee, Christina.2012. ‘ “Have Magic, Will Travel”: Tourism and Harry Potter’s United (magical)Kingdom’, _Tourist Studies_, 12: 52-69.\n\n**Week 11 (5/4) invited speeches:** **會展協會會長林冠文教授（疫情下的會展觀光）**\n\n**Week 12 (5/11) Smart tourism**: New technology/ANT and tourism\n\nUrry, John and Anthony Elliott. 2011. _Mobile Lives._ Ch2 ‘New technologies, new mobilities’, London: Routledge.\n\nJennie Germann Molz 2006. \\`Watch us wander': mobile surveillance and the surveillance of mobility, _Environment and Planning A_, 38: 377-393.\n\n**Week 13 (5/18) Tourism and sex/gender****＋****Post-colonial tourism and ethnic tourism**(Gay/lesbian tourism, stag tourism, sex tourism)\n\nThurnell-Read, Thomas. 2011. ‘Off the Leash and Out of Control: Masculinities and Embodiment in Eastern European Stag Tourism’, _Sociology_45: 977.\n\nObrador-Pons, Pau. 2007. ‘A haptic geography of the beach: naked bodies, vision and touch’, _Social& Cultural Geography,_ 8(1): 123-141.\n\nJohnston, Lynda. 2007. ‘Mobilizing pride/shame: lesbians, tourism and parades’, _Social & Cultural Geography_, 8(1):29-45.\n\n**Week 15 (****5****/25) Complexity and tourism I: Risk/ danger and dark tourism, sorting tourism**（Tourism under climate disasters: Volcano eruption in Iceland Complexity and tourism/Dark and disaster tourism）\n\nSharpley, Richard and Philip R. Stone. 2009. _The Dark Side of Travel: the Theory and Practice of Dark Tourism._ Bristol: Channel View Publications. Ch 1, 2\n\nBudd, Lucy et al. 2011. ‘A Fiasco of Volcanic Proportions? Eyjafjallajokull and the Closure of European Airspace’, _Mobilities_, 6 (1): 31-40.\n\nAdey, Peter. 2008. ‘Airports, mobility and the calculative architecture of affective control’, _Geoforum,_39: 438–451 \n\nref:\n\nMorgan, Nigel and Annette Prichard. 2005. ‘Security and social “sorting”: \n\nTraversing the surveillance-tourism dialectic’, _Tourist Studies_, 5 (2): 115-132.\n\nUrry, John. 2003. _Global Complexity._ London: Routledge. Ch 1.\n\n**Week 15 (6/1) invited speech:** **環境教育所所長方偉達：環境永續與觀光**\n\nref: Holden, Andrew. 2007. _Environment and Tourism 2_. London: Routledge. Ch6.\n\nUrry, John 2011. _Climate Change._ London: Routledge. Ch8.\n\n**Week 16 (6/****8****) Conclusion: Final Project submission and presentation** \n\n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=36b9aaa0b5594ab9b63704130ee17833&fno=e73fd33bacde4a9c988e871cd99d283b)",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "實地考察、參訪",
            "note": "一次課外參訪"
        },
        {
            "type": "專題研究",
            "note": "期末報告"
        },
        {
            "type": "其他",
            "note": "一次所外專家專題演講"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 50,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}