{
    "year": 109,
    "term": 2,
    "name": "愛爾蘭文學及其再現",
    "teachers": [
        "梁孫傑"
    ],
    "department": "IM82",
    "code": "ETM0084",
    "credit": 3,
    "serial": 1354,
    "group": "",
    "quota": {
        "limit": 20,
        "additional": 1
    },
    "schedule": [
        {
            "day": 5,
            "from": 3,
            "to": 5,
            "campus": "本部",
            "classroom": "博404"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "The primary objective of this class is to familiarize students with the development of Irish literature. The students will have the opportunity to explore their individual interests while reading abundant literary works by major Irish writers in the modern era. Specific emphasize will be on the global and local interaction presented in the works of these Irish writers. In addition, the re-presentation of the literary work in other forms (painting, film, sculpture, architecture, etc.) will also be integrated in the discussion along with the literary work in the Irish cultural context.",
    "goals": [
        "The constant questioning of the ambiguity of the speculative is the basic requirement for academic research.",
        "The ability of communication is indeed the crucial component for human beings to understand the speculative.",
        "The mode of philosophical and ethical inquiry is the way to develop capacities for independent judgment, critical thinking, and ethical reasoning.",
        "The goal of this course is the ultimate concern of the other through the speculative mode of thinking"
    ],
    "syllabus": "Irish Literature and Its Representation\n\nSpring 2021\n\nInstructor: Sun-chieh Liang                                   Office: 博405\n\nEmail: sun-chieh Liang                       Office Hours: 14-16 (Wednesday, Thursday)\n\nOffice Phone: 77341790\n\n1.  Objectives\n\nThe primary objective of this class is to familiarize students with the development of Irish literature after modernism. The students will have the opportunity to explore their individual interests while reading literary works by major Irish writers in the modern era. Specific emphasis will be on the cultural revival, genre development, social change, and contemporary issues, in comparison with their counterparts in different form of representations (e.g., paintings, sculptures, recitations, etc.).\n\n1.  Required Texts\n\nA course packet will be provided by the instructor.\n\nOnline materials.\n\n1.  Classroom Policy\n\nStudents are required to share their responses to the required reading of the week before the instructor officially starts the lecture.\n\nEach student is required to give an oral presentation by the end of the semester. The presentation will be monitored by the instructor along the semester in the individual/group conferences. The length of the presentation is yet TBA. Submit the written assignments of the presentation at least two days (i.e., Wednesday) before the class meeting.\n\n*   For each day late, 5 points will be deducted from the total points of the submitted work.\n\n1.  Tentative Schedule\n\n1.  Orientation Meeting\n\nTransitions: From the Victorian to the modern\n\n1.  W. B. Yeats: Selected Poems\n2.  J. M. Synge: _The Playboy of the Western World_\n3.  James Joyce: “Eumaeus” (_Ulysses_)\n\n1.  Group Discussion: The semester project\n2.  Spring Break\n3.  Individual conference 01\n\nDevelopments after 1930\n\n1.  Samuel Beckett: _Waiting for Godot_\n2.  Flann O’Brien: _The Third Policeman_\n\n1.  Individual conference 02\n\nDebating social change after 1960\n\n1.  William Trevor: Selected short stories\n\nContemporary issues\n\n1.  Brian Friel: _Translations_\n2.  Seamus Heaney: Selected Poems\n3.  Emma Donoghue: _Room_\n\nFinal Presentations\n\n1.  Presentation 01\n2.  Presentation 02\n\nFinal Papers\n\n1.  Consultation\n2.  Consultation\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=10d2cffcaedf49c480b74560c35829fb&fno=7d6e56889bcb4c46bdcf2fd02831a006)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "The instructor will conduct mostly interactive lectures."
        },
        {
            "type": "討論法",
            "note": "Questions will be prepared for the students to discuss."
        },
        {
            "type": "合作學習",
            "note": "Students will be teamed up to do the oral presentation."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": "Response paper and the final term paper"
        },
        {
            "type": "課堂討論參與",
            "weight": 40,
            "note": "Students’ contribution to the class discussion"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Being present in the class means to share their\nopinions with the participants"
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "Oral presentation"
        }
    ],
    "prerequisite": "",
    "general_core": []
}