{
    "year": 107,
    "term": 2,
    "name": "分子營養學",
    "teachers": [
        "蘇純立"
    ],
    "department": "SU51",
    "code": "NSC9002",
    "credit": 2,
    "serial": 2962,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 2,
            "from": 1,
            "to": 2,
            "campus": "本部",
            "classroom": "誠101"
        },
        {
            "day": 4,
            "from": 1,
            "to": 2,
            "campus": "本部",
            "classroom": "誠101"
        }
    ],
    "programs": [],
    "comment": "◎數位課程",
    "restrict": "",
    "form_s": "",
    "classes": "9",
    "dept_group": "",
    "hours": 2,
    "description": "This is a co-taught course among Mississippi State University (MSU), National Taiwan University (NTU), National Pingtung University of Science and Technology (NPUST), and National Taiwan Normal University (NTNU). Faculty and students in these universities will participate in the course via videoconferencing. The emerging discipline of molecular nutrition encompasses nutritional biochemistry, nutritional genomics, nutritional metabolomics, and epigenetics. The course focuses on the effects of diet and nutrients on an individual’s genome and metabolism, and how the molecular events affect human health. This course is a lecture course designed to acquaint senior undergraduate and graduate students with current concepts, knowledge and strategies for understanding molecular nutrition.",
    "goals": [
        "The student will know the areas of molecular nutrition.",
        "The student will learn the mechanisms by which nutrients and dietary components regulate gene expression at genomic, transcriptional, and translational levels",
        "The student will be familiar with the nutritional control on optimal human health",
        "The student will be aware of the impact of nutrients and dietary components on human genetic diseases"
    ],
    "syllabus": "",
    "methodologies": [
        {
            "type": "",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "",
            "weight": null,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}