{
    "year": 110,
    "term": 1,
    "name": "英文（一）",
    "teachers": [
        "陳秋梅"
    ],
    "department": "CU",
    "code": "00UB7A4",
    "credit": 2,
    "serial": 287,
    "group": "I",
    "quota": {
        "limit": 35,
        "additional": 0
    },
    "schedule": [
        {
            "day": 5,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "誠206"
        }
    ],
    "programs": [],
    "comment": "教育學院(教育系、教院不分系、心輔系、社教系、衛教系、人發系、公領系、特教系、學習科學學士學位學程)、企管系、競技系、東亞系、華語系(應華組)、音樂學院(音樂系、表演藝術學士學位學程)",
    "restrict": "◎第一階段需人工加選◎第二階段需人工加選◎加退選階段需人工加選",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "共同科英文（一）課程為一學年課程，每學期兩學分，係為非英語系學生所開設的課程。目標在幫助大一學生活用中學時期所累積的英語知識，提昇英語聽、說、讀、寫整體的溝通能力。為達此目標，本課程要求教師盡量用英語上課，努力營造一個豐富的英語環境，讓學生不但有充分機會以英語參與課堂活動，且樂於使用英語與同學及老師溝通。",
    "goals": [
        "增進學生英語溝通表達能力",
        "透過參與課程活動促進團隊精神",
        "透過多面向英語閱讀促使學生了解多元文化，拓展學生國際化視野",
        "透過課堂討論培養批判精神",
        "提升學生英語學習動機及自主學習興趣"
    ],
    "syllabus": "Instructor: Janet Chen\n\nE-mail and TEL: [t22040@ntnu.edu.tw](mailto:t22040@ntnu.edu.tw)  23638974\n\nOffice: 本部誠八樓805號研究室\n\n **_English I (for Non-English Majors)_**\n\nFall, 2021\n\n**Course Description**\n\nThis course aims to develop student’s English proficiency regarding all four language skills. Students are expected to increase their reading and writing literacy along with listening comprehension and communication competence through a variety of in-class and out-of-class activities.\n\n**Textbook**\n\nMacintyre, Paul & Bohlke, David.  (2015).  _Reading Explorer: Book 2 (Second Edition)._  National Geographic Learning.\n\n**Requirements and Rules**\n\n1.  **Punctual attendance**, **lesson preparation** and **active participation** are required. Participation also includes teamwork and group discussion.\n\n*   All absences will be classified as excused or unexcused.\n*   Absences for the following reasons will be _excused_ if there is timely verification (within 1 week) of such reasons provided to the instructor:\n\n*   Illness or medical emergency\n*   Family emergencies\n*   Pre-arranged medical appointments.\n*   Pre-arranged school-sponsored activities, such as field trips.\n\n*   A Notification of Absence Form has to be submitted online (學生請假系統) within 1 week. Verification document (hard-copy) should also be handed in to the instructor within 1 week. Late submission will not be accepted.\n*   Students who are more than 30 minutes late to class will be considered absent.\n*   Students will fail this course if there are more than 3 unexcused absences.\n*   Students will fail this course if they miss more than 5 meetings the whole semester.\n\n1.  **Plagiarism and cheating on quizzes or exams** is absolutely forbidden. If someone is found cheating on an exam, he/she will fail that exam.\n\n1.  **Textbook** is a must. Violation of this rule will cost you 2 points (out of your final score) each time.\n\n1.  You cannot use your laptop or smart phone in class without the teacher’s permission. Violation of this rule will cost you 2 points each time.\n\n1.  Before every meeting, you must preview the reading. Look up the words that you don’t know in the dictionary and write down their meanings. Then read the paragraphs out loud. Try to get the main point of each paragraph. I’ll check whether you have done all the preview tasks in class. Those who fail to do what is required will lose one point each time.\n\n1.  The whole class will be divided into 6 groups. Each group picks one person who is competent and responsible to be their leader. In every meeting, the leader checks his group members’ textbooks for me to see if each of them has looked up the new words in the dictionary and written their meanings on the book. Then he goes over the text to see if each one understands everything. After that, some students will be randomly called to read aloud or translate the text and answer the comprehension questions. If they cannot do the task well, they’ll get some assignment to do after class. Then some follow-up questions will be raised for further discussion. Each discussion session will last 20 minutes. Exchange your opinions within your group and contribute your ideas. Each time the group must assign one member to give a report of their discussion and his/her report will constitute 5 points of his/her final score.\n\n1.  This semester you have to turn in an autobiography (with at least 100 words) and a written reflection on the assigned Lexile reading. Print them out on an A4 paper and submit them to me as scheduled.\n\n1.  A speaking activity – **Show and Tell: My Favorite X** \\-- will be held on 10/18. Share one of your favorite topics with your classmates. You can use multimedia and all kinds of resources (props, costumes, photos, etc.) to make your presentation interesting to the audience. It must be done in English and last at least 2 minutes. An example is given in the appendix.\n\n1.  This semester we won’t have a written midterm exam. Instead, we’ll have an oral report of a study you do about the topics discussed in class. Choose one of the topics and do some research about it. Then present your study to the class. In your presentation, tell the class what motivates you to do such a study, what is your study method, what are your major findings and what suggestions you can provide. Your report should be about 3 minutes long.\n\n1.  In order to improve your extensive reading skills and discussion skills, one Lexile book will be assigned as an outside reading for you to practice discussing on 12/13. Before the event, the teacher will briefly introduce the essence of quality talk and the most frequently used 6 types of questions. Each student must try to ask as many questions as possible, proving that they really understand how to ask questions in order to elicit important information and stimulate further thoughts. They write down their questions on a paper before coming to class. In class, they take turns asking their group members the questions. While doing the task, they work together, thinking about which questions are important and inspiring enough to be included. After that, they hand in a paper with all the questions fitting the 6 categories and their answers on it. This assignment is due on 12/20 and constitutes 5 points. Then each student writes down his/her thought about the book on an A4 paper and submit it to me on 12/20 too. This will constitute another 5 points.\n\n1.  At the end of the term, the leader rates his/her group members’ degree of engagement in the discussion and their overall contribution on a 0–5 scale. In addition, in order to push the students to enlarge their word bank, a vocabulary test will be held to see how many important words the students have learned. The test result constitutes 10 points. Now that the vocabulary is singled out and tested beforehand, the final exam will be intended to test only their reading ability and writing ability. Likewise, there will be a reading-aloud test in order to push the students to open their mouths and read English out loud. Every student will be required to read aloud a paragraph chosen from the readings in the textbook. Their performance in the test will constitute 5 points.\n\n1.  **Check Moodle 2.8 and email frequently**\n\nI assume that you check your email and the course site frequently. It’s your responsibility to make sure you register with the correct email address on Moodle 2.8. **Not receiving a notice is NOT an excuse for any late submission. Late submission will be penalized 10% per day.**\n\nGrading Policies\n\nAttendance and Participation  10%\n\nShow and Tell: My Favorite X   10%\n\nVocabulary Test   10%\n\nAutobiography & Reflection on the Lexile Reading  10%\n\nReading Aloud  5%\n\nReport of the Discussion  5%\n\nQuestions for the Outside Reading and Their Answers   5%\n\nPeer Evaluation (1/03 degree of involvement and contribution)  5%\n\nOral Presentation of Your Study   20%\n\nFinal Exam   20%\n\n**Bonus Points (for those who can’t get 60 points in the Final Exam)**\n\n1.  Time spent on the multimedia lab樸101 or chatroom may help you earn some bonus points.\n2.  Extra points will be given if you participate in activities that help improve your English ability, such as Spelling Bee, Reading Aloud Competition, 3-minute presentations competition, E-book competition, listening to English talks, i-read or language exchange, etc. How many points you’ll get depends on the length of time and efforts you spend on them.\n3.  Summaries of the Lexile outside readings.\n\n**Schedule**\n\n_Week             Content_                                                   \n=============================================================================\n\n1        Introduction\n\n2        Introduction of **_Quality Talk_**\n\n3        Unit 1-A.  _Sweet Love_\n\n4        Unit 1-A.  _Sweet Love_\n\n5        **Show and Tell: My Favorite X**\n\n6        Unit 1-B.  _Food for the Future_  **(autobiography due)**\n\n7        Unit 1-B.  _Food for the Future_ \n\n8        Unit 2-B.  _Dogs in a Human World_\n\n9        **Oral** **Presentation of Your Study**\n\n10      **School Athletic Meet (No class)**\n\n11      Unit 5-B.  _New York’s Underside_\n\n12      Unit 5-B.  _New York’s Underside_ Unit 4-B.  \n\n13      Unit 4-B.  _The Changing Face of Kung Fu_\n\n14      **Group Discussion of the Lexile Reading**\n\n15      Unit 6-A.  _Cites Beneath the Sea_  **(questions and reflection due)**\n\n16      Unit 6-A.  _Cites Beneath the Sea_ \n\n17      Test of Vocabulary and Reading Aloud  **(Peer Evaluation)**\n\n18       **Final Exam (Units 4-B, 5-B, and 6-A )**",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 10,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 30,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 20,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 20,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}