{
    "year": 109,
    "term": 2,
    "name": "電影與翻譯",
    "teachers": [
        "李根芳"
    ],
    "department": "LM25",
    "code": "TIC0062",
    "credit": 3,
    "serial": 1649,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "譯505"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "This course aims to help students familiarize cinematic languages and investigate how various layers of translation are conducted in films. Throughout the course, we will watch some films related to translator/interpreters and look at how a film can travel around the world and become accessible and intelligible to other cultures. The objective is to help students to see how translation is at work in film production and consumption. Furthermore, it is hoped that the course can sensitize students to the logic of audio/visual/linguistic systems cross different cultures.",
    "goals": [
        "To help students familiarize cinematic languages and investigate how various layers of translation are conducted in films",
        "To help students to see how translation is at work in film production and consumption",
        "To sensitize students to the logic of audio/visual/linguistic systems cross different cultures"
    ],
    "syllabus": "\\# 1     Introduction: the course topic at the  \nintersection of three disciplines.\n\n\\# 2    Holiday\n\n\\# 3  Analysis of _Citizen Kane_ & Analysis of _Strike_\n\n\\# 4  Stuart Hall, excerpts from _Representation_ \n\n\\# 5   talk\n\n\\# 6  Dinda L. Gorlée, excerpts from _On Translating Signs: Exploring Text and Semio-Translation_ \n\n\\# 7  Holiday\n\n**_\\*\\*proposal submission: one page in length with a working title, brief description of your topic, methodology, and bibliography_**\n\n\\# 8  Laura Mulvey, “Visual Pleasure and Narrative Cinema”\n\n\\# 9   Yves Gambier, “Challenges in AV Translation,” Agnieszka Szarkowska “The Power of Film Translation”\n\n\\# 10  John Mowitt, “The Hollywood Sound Tract,” B. Ruby Rich, “To Read or Not to Read” in Egoyan & Balfour's _Subtitles: Of Foreignness of Film_\n\n\\# 11  Abé Mark Nornes, “Introduction: Translating Traffic” & “For An Abusive Subtitling” in _Cinema Babel_\n\n\\# 12  K. Kaindl, “Going Fictional! Translators and Interpreters in Literature and Film,” A. Casarini, “Magical Mediator: The Role of Translation and Interpreting in the Narrative World of Harry Potter,” both in _Transfiction_\n\n\\# 13  Linda Hutchon, Ch. 5 of _A Theory of Adaptation_; Lawrence Venuti, “Adaptation, Translation, Critique”\n\n\\# 14  Felicitas Baruch, “Transnational Fandom: Creating Alternative Values and New Identities through Digital Labor,”, Hye-Kyung Lee, “Participatory Media Fandom: A Case Study of Anime Fansubbing ”\n\n\\# 15  Michael Cronin, Intro. in _Translation Goes to the Movies_;\n\n\\# 16  Toby Miller et. al. Intro. _Global Hollywood 2_",
    "methodologies": [
        {
            "type": "講述法",
            "note": "We’ll discuss a specific topic every week and articulate this topic with the film we watch. Students should read the article thoroughly and participate fully in class discussion."
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": "We’ll organize film screening every week outside our scheduled class time. The chosen films are related to our weekly topic and it is strongly suggested that students participate in those film screenings."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 20,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 50,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}