{
    "year": 109,
    "term": 2,
    "name": "口譯研究方法專論",
    "teachers": [
        "陳子瑋"
    ],
    "department": "LM25",
    "code": "TIC0050",
    "credit": 3,
    "serial": 1647,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "譯506"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "The aim of this course is to help students gain a fundamental understanding of research methodologies used in interpreting studies. As the field of interpreting studies has become more diversified in recent years in terms of the use of methodologies, it is important for researchers in the field to understand the nature of the approaches on which these methodologies are based. However, this course is not a methodology course per se. It is more about understanding how the methodologies are applied to real interpreting research. A case study approach is used in this course as different methodologies and their applications are examined and discussed using published empirical studies. About 50 articles of interpreting studies published from 2003 and 2008 in different international journals will be read and discussed throughout the semester. Class discussions will be particularly focused on the theme, approach and framework used, variables or constructs analyzed, properties in research methodology, and on practices in reporting research results.",
    "goals": [
        "A case study approach is used as different methodologies and their applications are examined and discussed using published empirical studies.",
        "About 50 articles of interpreting studies in different international journals will be read and discussed throughout the semester.",
        "Class discussions will be focused on the theme, approach and framework used, variables or constructs analyzed, properties in research methodology."
    ],
    "syllabus": "主題\n\n教科書章節\n\n第一週\n\n課程說明與緒論\n\n第一章\n\n第二週\n\n文獻回顧\n\n第二章\n\n第三週\n\n研究設計\n\n第八章\n\n第四週\n\n問卷 (一)\n\n第三章\n\n第五週\n\n問卷 (二)\n\n第三章\n\n第六週\n\nSPSS 軟體 (一)\n\n第七週\n\nSPSS 轉體 (二)\n\n第八週\n\n小問卷結果報告\n\n第九週\n\n質性分析方法 (一)\n\n第四章\n\n第十週\n\n質性分析方法 (二)\n\n第四章\n\n第十一週\n\n文本分析方法\n\n第五章\n\n第十二週\n\nMaxQDA 軟體 (一)\n\n第十三週\n\nMaxQDA 軟體 (二)\n\n第十四週\n\n實驗研究法\n\n第六章\n\n第十五週\n\n教學研究與品質評量\n\n第七章\n\n第十六週\n\n撰寫期末報告",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "實驗/實作",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 40,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 40,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}