{
    "year": 110,
    "term": 1,
    "name": "科學教育學術論文寫作",
    "teachers": [
        "吳心楷"
    ],
    "department": "SM45",
    "code": "SEC8012",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 2747,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 2,
            "to": 4,
            "campus": "公館",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "學生需具備科學教育背景。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "Develop skills to review a research paper and evaluate the quality of the research.",
        "Develop confidence, skills, and strategies for writing a scholarly paper in English.",
        "Realize the ethical issues and follow APA ethical principles."
    ],
    "syllabus": "Course Overview\n---------------\n\nThis course is designed for graduate students who are interested in writing scholarly papers for conference presentation or journal publication. We will discuss common structures of research papers in science education, submission and review processes of conference proposals and journal articles, and basic strategies for scholarly writing.\n\nStudents who take this course are expected to complete a conference proposal or a research paper in English at the end of the semester. You need to have some research ideas and data before enrolling for this course. We will have a series of activities to help you write up your research ideas, make arguments, and present findings. We will have opportunities to share, discuss, and review each other’s papers. We will use each other’s writing experience and knowledge as resources to support the writing process. Because this course is not a methodology one, we will not go through the details about how to do research and how to analyze data.\n\nIn this semester, students will have opportunities to establish a community of practice with graduate students from University of Johannesburg. Two to three online sessions of at least one hour each will be held in September and October. It is hoped that students from diverse contexts exchange and share their research. It will extend the academic horizon of students and broaden their academic worldview\n\nCourse Objectives\n-----------------\n\n*   Develop confidence, skills, and strategies for writing a scholarly paper in English.\n*   Develop skills to review a research paper and evaluate the quality of the research.\n\nCourse Requirements and Assessment\n----------------------------------\n\nAll the assignments need to be uploaded to Moodle before the deadlines. \n\n*   Assignments (40%)\n\n*   Final Paper (40%)\n\n*   Participation (20%)\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=ce8a3ceb594c4507b0c6d482fe0ed197&fno=c5535ffa182b4770bb2b9c47c70209bc)",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": ""
        },
        {
            "type": "Group discussion",
            "note": ""
        },
        {
            "type": "Case studies",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 40,
            "note": ""
        },
        {
            "type": "Attendances",
            "weight": 20,
            "note": ""
        },
        {
            "type": "Presentation",
            "weight": 40,
            "note": ""
        }
    ],
    "prerequisite": "◎Unavailable for M.A. program students (M.A. program courses excepted) and B.A. program students.",
    "general_core": []
}