{
    "year": 109,
    "term": 2,
    "name": "跨文化素養導論",
    "teachers": [
        "張雯"
    ],
    "department": "I",
    "code": "I0M0001",
    "credit": 3,
    "serial": 1345,
    "group": "",
    "quota": {
        "limit": 38,
        "additional": 0
    },
    "schedule": [
        {
            "day": 2,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "誠105"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "面對全球化與多元化之社會變遷，青年需要具備與不同文化背景族群互動交流之能力。本課程主要在於發展學生之跨文化素養，提昇文化敏感度與平等包容之意識，培養多元溝通與互動的能力。課程主要透過文字教材、媒體影像、參訪活動、專題計畫等設計，讓學生瞭解多元社會之意涵，充實所需具備的態度及素養，以期發展跨文化互動的能力。核心內涵包括\n1. 跨文化差異的觀察與理解\n2. 跨文化的互動與對話\n3. 多元文化價值的體現與運用",
    "goals": [
        "建立對跨文化素養之認知",
        "提昇文化敏感度與尊重之素養",
        "培養文化認識之動機與反思能力",
        "發展跨文化互動與交流之能力"
    ],
    "syllabus": "**Course Description**\n\nWith the development of technology and transportation, interactions of people from different countries and cultures increases significantly, which creates more diversity in organizations and societies. Such diversity brings new opportunities for people to exchange ideas and collaborate; however, it also brings new challenges, such as misunderstandings and intercultural conflicts. \n\nFaced with this trend, intercultural competence has been identified as one of the core competencies for people in the 21st century to successfully build personal lives and contribute to the society. OECD (2019) also proposes the Global Competence Framework for the young generation, which emphasizes the importance of intercultural competence in the four aspects, including knowledge, values, skills, and attitudes. \n\nThis course is designed to provide an introduction of intercultural competence. Through reading, lecture, case study, and projects, students will understand the definition and application of intercultural competence.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "實地考察、參訪",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 25,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 25,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 25,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 25,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}