{
    "year": 108,
    "term": 2,
    "name": "英語口語發表",
    "teachers": [
        "多德"
    ],
    "department": "ZU92",
    "code": "PGUK007",
    "credit": 2,
    "serial": 3116,
    "group": "",
    "quota": {
        "limit": 35,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 1,
            "to": 2,
            "campus": "本部",
            "classroom": "誠304"
        }
    ],
    "programs": [
        "榮譽英語學程"
    ],
    "comment": "",
    "restrict": "◎第一階段限 榮譽英語學程",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "介紹各種基本演說技巧（如語調、肢體語言等）及發表策略（如視聽媒體的運用），協助學生能在職場會議與研究所課堂發表簡易的專題報告。",
    "goals": [
        "強化學生英語文閱讀、聆聽的策略與能力，協助獲取專業領域新知",
        "提昇英語文口語、寫作的表達能力，期盼學生能於工作職場及學術研究領域展現英語專業涵養。",
        "協助學生深入瞭解國際社會的多元文化，培養國際觀，對特定文化現象進行分析、比較，激發學生之批判性思考能力。"
    ],
    "syllabus": "**Overview**\n\nThis is a task-based course aimed at improving oral English and presentation skills. The instructor will provide input, guidance and feedback as appropriate, necessary and upon request.\n\n  \n\n**Course Components**\n\nThe course is divided into the following components.\n\n  \n\n1\\. Instruction\n\nInstruction will be given on presentation skills, the importance and value of comprehensible input, connected speech and extending one’s vocabulary.\n\n  \n\n2\\. Presentation Skills\n\nStudents will be introduced to the skills needed to prepare and give an effective presentation. The section will culminate with each student giving a presentation on a topic of personal interest or contemporary concern.\n\n  \n\n3\\. Conversation Groups\n\nStudents will take turns to lead conversation groups. They will be required to prepare engaging material for discussion and take responsibility for effectively leading their group to ensure a positive learning experience for all concerned.\n\n  \n\n4\\. Debates\n\nStudents will debate self-selected topics in teams using a modified ‘Mace’ debate format.\n\n  \n\nA weekly schedule will be arrived at through negotiation between instructor and students.\n\n  \n\n**Evaluation**\n\nActive Participation and attendance: 30%\n\nPresentations: 30%\n\nLeading Conversation Groups: 20%\n\nDebates: 20%\n\n  \n\n**Notes**\n\nAssigned tasks must be done on time. Late submissions will be penalized.\n\nAttendance is required. Being over 30 minutes late will be treated as an absence. \n\nGrades are not negotiable.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "其他",
            "weight": 70,
            "note": "presentations, debates, leading conversation groups"
        }
    ],
    "prerequisite": "",
    "general_core": []
}