{
    "year": 111,
    "term": 1,
    "name": "喬伊斯專題研究",
    "teachers": [
        "梁孫傑",
        "未定"
    ],
    "department": "LM21",
    "code": "ENC1036",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 1618,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "雲201"
        }
    ],
    "programs": [],
    "comment": "教室位於雲和街大樓2樓（地址：雲和街1號），外系及外校學生需申請門禁權限。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "Studies in James Joyce"
    ],
    "syllabus": "STUDIES IN JAMES JOYCE \n\nFALL, 2022\n\nINSTRUCTORS: Prof. Sun-chieh Liang, and Prof. Enrico Terrinoni\n\nCLASS MEETING: 13:20-16:20, TUESDAY\n\nEMAIL: Sunchieh.liang@gmail.com\n\nenrico. terrinoni@unistrapg.it\n\nPHONE: 77491790\n\nOFFICE HOURS: MF 10:00-11:00 and by appointment\n\nCOURSE OBJECTIVES: \n\nJames Joyce’s Ulysses has been unanimously acclaimed as the greatest English novel in the twentieth century. Ever since its publication, almost every aspect of the human life has been tremendously influenced even up to this date. No wonder Joyce prophetically claims that “I've put in so many enigmas and puzzles that it will keep the professors busy for centuries arguing over what I meant, and that's the only way of insuring one's immortality.” Translation, in this matter, is pedagogically the most effectively feasible method when it comes to the unravelling of enigmas and puzzles. This course will focus on four major goals: (1) students will familiarize themselves with contemporary literary translation theories, together with critical essays on the translation of Joyce’s texts; (2) students will have a general survey of the world created in Ulysses in the cultural context of Irish modernism; (3) students will be exposed to the intricate dialogues between an imagined Joyce and his Chinese and Italian translators; (4) students will be required to work on translation projects, not so much a way to vacillate between the past and the present, or the Irish culture and the Taiwanese culture, or the pre-modern and the post-human, as a way to approach a life of the other via translation.\n\nEXPECTATIONS:\n\nFirst, all students are expected to both attend and participate in every class. Missed classes not only make it difficult for you to keep up with the material, but also influence the overall success of the course. If you are absent from class your participation grade will be affected (unless you have the permission for class absences). A half of a letter grade (5 percentage points) will be deducted from your class participation grade for each absence. If you are absent from class more than 3 times (approx. ¼ of the semester) you will automatically fail the course. In addition, DO NOT show up to class late. It is disruptive and will not be tolerated.\n\nSecond, in case that you do miss a class, it is solely your responsibility to catch up on the material and to keep abreast of the assignments. I recommend this be done by copying the notes of a willing classmate. If necessary, come to see me. I will not, however, provide a summary of the class lecture. \n\nThird, it is essential that you come to class prepared. Being prepared means that you have read the assigned texts and have given thought to what you have read so that you can participate in class discussions. You must bring to class all course materials relevant for that day’s assignment.\n\nFourth, all assignments must be turned in on time. Departmental policy stipulates that all written work be submitted on the dates they are due. No excuses. Assignments that are not submitted on time will be lowered one third of a letter grade (3 percentage points) each day (including weekends) they are late. Any assignment submitted more than two weeks late can earn no more than 50% (an F).\n\nFifth, regarding the electronic submission of course assignments, students must obtain permission from the instructor before submitting written work electronically. The student bears the ultimate responsibility for ensuring that the written work has in fact been received. It is recommended that email submissions be sent using the “return receipt” function.\n\nFinally, a grade of “incomplete” will be awarded only when a student, having completed 75% of the work for the class, is unable to com¬plete the final project due to ex¬traor¬di¬nary circumstances. The instructor must be con¬tacted and ap¬prised of the emergency, and it is the student's responsi¬bility to take care of the paperwork. An incom¬plete must be made up within six weeks of the begin¬ning of the next semester.\n\nTEXTS:\n\nBenjamin, Walter. “The Task of the Translator.” Selected Writings: 1913-1926. Ed. Maurice Bullock and Michael B. Jennings. Vol 1. Cambridge: Harvard UP, 1996. 253-263.\n\nBosinelli, Rosa Maria Bollettieri and Ira Torresi. “(Re-)reforegnising the Foreign: Notes on the Italian Retranslations of James Joyce’s Ulysses.” Retranslating Joyce for the 21st Century. Ed. Jolanta Wawrzycka, and Erika Mihálycsa. Leiden: Rodopi, 2020. 258-270.\n\nCheu, Hoi Fung. “Translation, Transubstantiation, Joyce: Two Chinese Versions of ‘Ulysses’.” James Joyce Quarterly 35.1 (Fall, 1997): 59-70.\n\nDerrida, Jacques. “What Is a ‘Relevant’ Translation?” The Translation Studies Reader. Ed. Lawrence Venuti. 3rd ed. New York: Routledge, 2012. 365-388.\n\nGalvão, Elena Zagar. “Joyce's Italian Translations: A Reassessment of the Joycevidacovich Collaboration.” Máthesis (1998): 219-230.\n\nGula, Marianna. “’Wavewhite wedded words’: The Soundspace of the Canonical Hungarian Translation of Ulysses (1974) and Its Remake (2012).” Retranslating Joyce for the 21st Century. Ed. Jolanta Wawrzycka, and Erika Mihálycsa. Leiden: Rodopi, 2020. 87-102.\n\nJin, Di. \"Translating Ulysses, East and West.\" Joyce in Context. ed. Vincent Cheng and Timothy Martin. Cambridge: Cambridge UP, 1992. 270-284.\n\nJoyce, James. Ulysses. Intro. Declan Kiberd. New York: Penguin, 1992.\n\nKlitgård, Ida. “The Translation of Wordplay in James Joyce’s Ulysses.” Target 17:1 (2005): 71-92.\n\nKosters, Onno. \"Interlingual Metempsychosis: Translating Intertextuality in James Joyce's Ulysses.\" Nordic Journal of English Studies 8.2 (2009): 57-76.\n\nPeeters, Kris and Guillermo Sanz Gallego. “Translators’ Creativity in the Dutch and Spanish (Re)translations of ‘Oxen of the Sun’: (Re)translation the Bakhtinian Way.” Retranslating Joyce for the 21st Century. Ed. Jolanta Wawrzycka, and Erika Mihálycsa. Leiden: Rodopi, 2020. 221-241.\n\nSlote, Sam. “Derrida and the Phantom Yeses of Ulysse.” Retranslating Joyce for the 21st Century. Ed. Jolanta Wawrzycka, and Erika Mihálycsa. Leiden: Rodopi, 2020. 308-318.\n\nTee, Carlos G. “Fear and Strategy: Xiao Qian and Wen Jieruo’s Chinese Translation of Ulysses.” Spectrum: Studies in Language, Literature, Translation, and Interpretation 15.2 (2020): 17-38.\n\nTerrinoni, Enrico. “Beyond Mutability and Change. Translating Joyce’s Ulysses: A Study in Ambiguity.” Scientia Traductionis 12 (2012): 45-56.\n\nTerrinoni, Enrico. “Who’s Afraid of Translating Ulysses?” Translation and Literature 22 (2013), 240-248.\n\nTerrinoni, Enrico. “Translating Ulysses: How and Why”, in Parallaxes: Virginia Woolf Meets James Joyce. Ed. Sara Sullam and Marco Canani. Newcastle: Cambridge Scholars Publishing, 2014. 167-77.\n\nUrsa, Andra-Iulia. “Collocation and Connotation in Chapter ‘Scylla and Charybdis’ of James Joyce’s Ulysses: An Analytical Study of the Romanian Translation.” Swedish Journal of Romanian Studies 3.1 (2020): 152-167.\n\nVenuti, Lawrence. “Genealogies of Translation Theories.” The Translation Studies Reader. Ed. Lawrence Venuti. 3rd ed. New York: Routledge, 2012. 483-502\n\nWang, Qing. “Looking for Translator’s Fingerprints: A Corpus-Based Study on Chinese Translations of Ulysses.” Literary and Linguistic Computing 27.1 (2012):  81-93.\n\nZanotti, Serenella. “By Way of France and Beyond: Joyce Translations into Italian.” Scientia Traductionis 8 (2010): 109-121.\n\nTRANSLATIONS OF ULYSSES\n\nTerrinoni, Enrico, trans. Ulysse. By James Joyce. Dual language ed. Bompiani: Milano, 2021.\n\n金隄 譯。《尤利西斯》。詹姆士．喬伊斯著。三版。臺北：九歌，2016。\n\n刘象愚 译。《尤利西斯》。詹姆士．乔伊斯着。上海：上海译文，2021。\n\n蕭乾和文潔若 譯。《尤利西斯》。詹姆士．喬伊斯著。三版。臺北：時報，1995。\n\nON TRANSLATION OF JOYCE’S WORKS INTO CHINESE\n\nChuang, Hsin-cheng. “The Problems of Translation in the Last Chapter of Ulysses.” Conference on Translations of Foreign Literature. Taipei, Taiwan, 1994.\n\nChuang, Hsin-cheng. “Three Clarifications: Response to Lin Yu-chen’s Review on Two Chinese Translations of Ulysses.”〈三點澄清—回應林玉珍「評「尤利西斯」中譯兩種」〉Chung Wai Literary Monthly. 25.4 (Sept. 1996): 143-144.\n\nChuang, Kun-liang. “Review on Ulysses, by James Joyce, translated by Jin Di.” James Joyce Quarterly. 32.3-4 (1995): 761-765.\n\nJin, Di.“Introduction to Ulysses by James Joyce.”〈一個四十呎深的洞穴〉 Unitas. 13.3 (Jan.1997): 152-156.\n\nLi, Sher-shiueh. “On the Parodic Rendition of Classical Literary Styles in Chapter 14 of Di Jin’s Chinese Ulysses.”〈挪轉文體乾坤的孫悟空--評金隄《尤利西斯》第十四章古體仿譯商榷〉Contemporary Monthly. 3.121 (Sept. 1997): 127-141.\n\nLi, Sher-shiueh. “‘Proteus’ Revisited: A Critical Note on the Stylistics of Jin Di’s Chinese Ulysses.” James Joyce Quarterly. 36:2 (1999): 262-9.\n\nLin, Yu-chen. “Review on Two Chinese Translations of Ulysses.”〈評《尤利西斯》中譯兩種〉Chung Wai Literary Monthly. 24.12 (1996): 165-170.\n\nLin, Yu-chen. “The Return of the (Un)repressed: On Jin Di’s Literary Translation.” James Joyce Literary Supplement. 19.2 (Fall 2005): 12-13.\n\nLin, Yu-chen. “Who Has the Last Right to Speak? Response to Chuang Hsin-cheng’s ‘Three Clarifications.’”〈誰有最後的發言權？—答莊信正〈三點澄清〉〉Chung Wai Literary Monthly. 26.5 (1997): 117-118.\n\nTseng, Li-ling. “Mist-/My-stification of the Source Text: Dynamic Ambivalence in the Chinese Ulysses.” James Joyce Quarterly. 36.2 (1999): 251-61.\n\nTseng, Li-ling. “On Di Jin’s Complete Rendition of Ulysses.”〈霧中看花花自媚—評金隄譯全本《尤利西斯》〉 Chung Wai Literary Monthly. 25.08 (Jan. 1997): 151-159.\n\nASSIGNMENTS:\n\nThis seminar course requires students (1) to submit a substantial translation project (10-page selected Chinese/Italian translation of Ulysses, together with an introduction to the theoretical hypothesis employed in the translation); and (2) to prepare reading responses for four class sessions; and (3) to prepare translation exercises for four class sessions. Proper citation of all sources is absolutely required. See the Chicago Manual of Style for guidance. As with all assignments, plagiarism is considered a most serious offense and will be treated as such. \n\n1\\. READING RESPONSES AND TRANSLATION EXERCISES:   The purpose of these assignments is both to give you time to reflect on the readings for each class and to give me a sense of how well you have grasped the material. They need not incorporate outside sources, nor do I expect you to generate a unique thesis. I merely want you to put into your own words the material you have read for the class—of course, you will not be able to incorporate everything you read, but choose what you feel is most essential and, in writing about it, make it your own. \n\n• 4 READING RESPONSES: 2 pages, due 2 days before the designated class session\n\n• 4 EXERCISE TRANSLATIONS: due 2 days before the designated class session\n\n2\\. TRANSLATION PROJECT:   This course is designed with one tangible outcome in mind, namely, that\n\neach student produces a graduate level translation project on the selected episodes of Joyce’s Ulysses. This is no simple task, but from the first day forward we will work together to achieve this end. Consequently, you will be expected to begin your “final” project early in the semester. A substantial draft of the project will be prepared, and these drafts will then be edited and work-shopped in collaboration with your classmates. The final version of the project should demonstrate both a grasp of the material as well as your own unique perspective concerning that material. I encourage and highly recommend that you prepare for the project by doing research that goes beyond our class discussions. The translated Ulysses episode for this project will be of your own choosing (around 10 pages from one chapter). What you choose to translate, however, has to be approved by the instructors.\n\n• DRAFT: 10 pages, due Week 11\n\n• PROJECT: 15 pages, due Week 18\\*\n\n\\* All final papers must be submitted both electronically and in hard copy. \n\nGRADING:\n\nAll paper assignments will be graded in accordance with the standards set by philosophy program’s grading rubric. The grading rubric can be found on the philosophy program’s website.\n\n• PARTICIPATION,  ATTENDANCE & ORAL REPORT 10%\n\n• 4 READING RESPONSES 20% (5% EACH)\n\n• 4 TRANSLATION EXERCISES 20% (5% EACH)\n\n• DRAFT (ORAL PRESENTATION) 20%\n\n• TRANSLATION PROJECT 30%\n\nTENTATIVE SCHEDULE:\n\n1\\. 09/06 Orientation Meeting \n\nGeneral Introduction to the Chinese Translation of Ulysses\n\n2\\. 09/13 The “Proteus” chapter of Ulysses and its Chinese translation\n\n3\\. 09/20 The “Calypso” chapter of Ulysses and its Chinese translation\n\n4\\. 09/27 The \"Hades\" chapter of Ulysses and its Chinese translation\n\n5\\. 10/04 The “Cyclops” chapter of Ulysses and its Chinese translation\n\n6\\. 10/11 The “Penelope” chapter of Ulysses and its Chinese translation\n\n7\\. 10/18 Individual Conference (with Prof. Liang)\n\n8\\. 10/25 Re-visiting the “Proteus” chapter of Ulysses \n\n9\\. 11/01 Re-visiting the “Calypso” chapter of Ulysses\n\n10\\. 11/08 Re-visiting the “Cyclops” chapter of Ulysses\n\n11\\. 11/15 General Introduction to Finnegans Wake and its Chinese translation\n\n12\\. 11/22 The St. Patrick and the Archdruid episode of Finnegans Wake (609.24-613.26)\n\nand its Chinese translation\n\n13\\. 11/29 Re-visiting the St. Patrick and the Archdruid episode of Finnegans Wake \n\n14\\. 12/06 Re-visiting the “Penelope” chapter of Ulysses\n\n15\\. 12/13 Individual Conference (with Prof. Terrinoni)\n\n16\\. 12/20 Individual Conference (with Prof. Liang)\n\n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=433154d04ffc44c6b8892ab7b99d3b77&fno=9b6e785d8ca348bca83007d0573a222d)\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=5fa20d7195f84f26893c106c247b8cea&fno=6a76fe07e2ab4e3aa52175b1027dbccc)\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=80511ca5aca34eaab1c1d0585657f6a9&fno=af181158832942cbbade64db5e49e186)",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": ""
        },
        {
            "type": "Group discussion",
            "note": ""
        },
        {
            "type": "Media, audio, visual materials",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "Class discussion involvement",
            "weight": 30,
            "note": ""
        },
        {
            "type": "Presentation",
            "weight": 20,
            "note": ""
        },
        {
            "type": "Case study reports",
            "weight": 50,
            "note": ""
        }
    ],
    "prerequisite": "◎Unavailable for M.A. program students (M.A. program courses excepted) and B.A. program students.",
    "general_core": []
}