{
    "year": 111,
    "term": 1,
    "name": "記憶研究",
    "teachers": [
        "路愷宜"
    ],
    "department": "LM21",
    "code": "ENC1123",
    "credit": 3,
    "serial": 1621,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "雲201"
        }
    ],
    "programs": [],
    "comment": "教室位於雲和街大樓2樓（地址：雲和街1號），外系及外校學生需申請門禁權限。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "To familiarize students with key debates and concepts in memory studies.",
        "To offer students in-depth knowledge of the historical moments and forms of memorialization discussed, as well as their social, political ramifications",
        "To give students familiarity with forms of memorializations and their affective implications (trauma, mourning and grief) as well as their implications at national, regional and global scale.",
        "To enable students read critically representations of history and memory in a variety of texts, analyze the representations in visual arts of the topics discussed."
    ],
    "syllabus": "Memory Studies\n\nFall 2022\n\nThe course focuses on memory and forms of memorialization in the 20th and 21st centuries as well as a variety of media of memory. It discusses landmark historical moments and the varied forms of memorialization that historical events imply, together with their cultural and political consequences. The case studies and different media of memory entail a discussion of the affective implications of tragic events and catastrophes upon individuals or entire communities. \n\nFocusing on the Holocaust, the atomic bomb, the Vietnam War, the Chernobyl disaster, 9/11 as well as more recent events, the course examines forms and media of memory, activism and the ethical turn that contemporary texts present us with. The course also traces critical positions/interventions and different media of memory.\n\nBy introducing students to various media of memory (literary texts, documentaries, comics, films, monuments, historical documents, newspaper articles,) the course familiarizes them with key concepts in history, memory and affect studies while at the same time it undertakes a close reading of the case studies presented.\n\n**W 1 Introduction**\n\n**W 2 Definitions, terms and concepts**\n\n**W 3-W4 The Holocaust**  \n\n**W5 Hiroshima**\n\n**W6-7  Memory, Film, Re/mediation**\n\n**W 8-9 The Vietnam War**\n\n**W 10 Documentaries and Memory**\n\n**W 11- 12 Chernobyl**\n\n**W 13 9/11**\n\n**W14 Memory and Justice**\n\n**W15 New Media of Memory**\n\n**W 16** **Mini conference paper 12-13 minutes presentation followed by 15 min Q&A**",
    "methodologies": [
        {
            "type": "Cooperative learning",
            "note": "Team work, class and after class group assignments. Students’ cooperation in class and home assignments, written  and oral responses to class activities."
        },
        {
            "type": "Field work",
            "note": "Students’ visit of possible exhibitions in Taipei related to the topic when these are available, students and teacher attending academic talks related to the course at NTNU/ NTU/Academia Sinica"
        },
        {
            "type": "Media, audio, visual materials",
            "note": "Moodle activity, film/documentary/news clips showed and discussed in class. Teacher’s power point presentations, students’ interactive presentations"
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 10,
            "note": "Moodle activity 10%"
        },
        {
            "type": "Class discussion involvement",
            "weight": 20,
            "note": "class participation 20%"
        },
        {
            "type": "Presentation",
            "weight": 20,
            "note": "Individual presentations & feedback on colleagues’ papers"
        },
        {
            "type": "Case study reports",
            "weight": 50,
            "note": "Final paper 50%"
        }
    ],
    "prerequisite": "◎Unavailable for M.A. program students (M.A. program courses excepted) and B.A. program students.",
    "general_core": []
}