{
    "year": 111,
    "term": 1,
    "name": "學科與語言整合教學",
    "teachers": [
        "孔繁偉"
    ],
    "department": "LM21",
    "code": "ENC3053",
    "credit": 3,
    "serial": 1634,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "雲201"
        }
    ],
    "programs": [],
    "comment": "教室位於雲和街大樓2樓（地址：雲和街1號），外系及外校學生需申請門禁權限。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "Students will be able to expand the understanding and awareness of biliteracy and multiliteracy development and practices, language and cultural issues critical to the effective methodology and instructional approaches to CLIL",
        "Students will be able to review and critically analyze the roles of L1 and L2  or L3 acquisition process for CLIL",
        "Students will be able to become familiar with and critically examine current research and theories of CLIL",
        "Students will be able to develop and implement process-oriented biliteracy and multileracy activities, and appropriate methods of assessment and evaluation of CLIL"
    ],
    "syllabus": "This course examines the different theories and practices in teaching ELLs at beginning, intermediate and advanced levels within the framework of Content and Language Integrated Learning (CLIL). This course will introduce a critical frame that recognizes how CLIL is discursively constructed by policymakers and practitioners while still remaining a continual site of struggle. Approaches to CLIL will be explored, using theories, research, and current methods for bilingual and biliteracy development. We will also examine the role of cultural and social practices in the development of biliteracy and multiliteracy for CLIL to be implemented. Students will evaluate their practices in light of the course content, generate new approaches, and draft appropriate outcomes for literacy instruction for more critical awareness of CLIL before it is implemented fully. Aside from the theories identified, empirical implications of CLIL will be highlighted throughout.\n\n**Learning objectives:**\n\n1\\. Students will be able to expand the understanding and awareness of biliteracy and multiliteracy development and practices, language and cultural issues critical to the effective methodology and instructional approaches to CLIL;\n\n2. Students will be able to review and critically analyze the roles of L1 and L2  or L3 acquisition process for CLIL;\n\n3. Students will be able to become familiar with and critically examine current research and theories of CLIL;\n\n4. Students will be able to develop and implement process-oriented biliteracy and multileracy activities, and appropriate methods of assessment and evaluation of CLIL\n\n**Class schedule:**\n\nWeek 1.      Introduction\n\nWeek 2.      How language varies: everyday registers and academic registers\n\nWeek 3.      Analyzing academic texts\n\nWeek 4.      Disconnects in bilingual education settings and research traditions \n\nWeek 5.      Curriculum mapping and bridging pedagogies I \n\nWeek 6.      Curriculum mapping and bridging pedagogies II\n\nWeek 7.      Midterm presentation \n\nWeek 8.      Assessment issues I \n\nWeek 9.      Assessment issues II \n\nWeek 10.    Programming for CLIL \n\nWeek 11.    Critical perspectives\n\nWeek 12.    Sports Day\n\nWeek 13.    Directions for future research and the way forward\n\nWeek 14.    Directions for future research locally and internationally\n\nWeek 15.    Final presentation I \n\nWeek 16.    Final presentation II",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "Weekly thematic lecture"
        },
        {
            "type": "Group discussion",
            "note": "Discussion-based learning among peers and teacher"
        },
        {
            "type": "Cooperative learning",
            "note": "Collaborative learning for weekly thematic discussion"
        },
        {
            "type": "Case studies",
            "note": "Research reading demonstrating critical perspectives"
        }
    ],
    "grading": [
        {
            "type": "Midterm Exam",
            "weight": 30,
            "note": "Midterm presentation"
        },
        {
            "type": "Final exam",
            "weight": 40,
            "note": "Final presentation & work"
        },
        {
            "type": "Attendances",
            "weight": 20,
            "note": "Attendance"
        },
        {
            "type": "Presentation",
            "weight": 10,
            "note": "Observation report"
        }
    ],
    "prerequisite": "◎Unavailable for M.A. program students (M.A. program courses excepted) and B.A. program students.",
    "general_core": []
}