{
    "year": 111,
    "term": 1,
    "name": "英文寫作與研究方法（一）",
    "teachers": [
        "狄亞倫"
    ],
    "department": "LM21",
    "code": "ENM1057",
    "credit": 2,
    "serial": 1608,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 7,
            "to": 8,
            "campus": "本部",
            "classroom": "雲201"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "",
    "goals": [
        "There are two aims of this course: (1) to conduct their own small scale research, and (2) the main aim is to get them familiarized with techniques and methods of selecting topics, developing questions, collecting and analyzing data, preparing the research paper. The ultimate goal is for the students to produce a presentable research paper."
    ],
    "syllabus": "**English Writing and Research Methods I-II\\***\n\n**Fall 2022 – Spring 2022**\n\n**Classroom: Yun 201**\n\n[https://meet.google.com/cya-civn-xpv](https://meet.google.com/cya-civn-xpv)\n\n**Instructors:**\n\nAaron Deveson: [aaron.c.deveson@gmail.com](mailto:aaron.c.deveson@gmail.com) (I)\n\nJustin Prystash: [jprystash@hotmail.com](mailto:jprystash@hotmail.com) (II)\n\nBrena Tai: [yuchentai@gapps.ntnu.edu.tw](mailto:yuchentai@gapps.ntnu.edu.tw) (II)\n\n**Texts:**\n\n1.  _MLA Handbook for Writers of Research Papers_ (8th Ed) & materials in the copy center on Shida Road.\n2.  Students will read primary and secondary texts in consultation with their instructors.\n\n**Course Description and Objectives:**\n\nThis two-semester seminar is designed to help MA students become better academic writers. We will develop several different skills that are necessary for academic writing at the MA level: (1) interpreting literature, or “primary sources,” through close reading; (2) interpreting academic scholarship or “secondary sources”; (3) conducting research and documenting sources; and (4) bringing together interpretations of primary and secondary sources into a well-organized academic essay. This course takes a team-based approach, with students working together with professors and peers to improve their writing through several different writing-based activities and workshops. In the first semester, students will complete several short writing assignments with the ultimate goal of writing a very short academic paper; in the second semester, students will work toward writing (or substantially revising) a complete academic essay and sharing their work in a conference presentation.\n\n**Requirements:**\n\n1.  Grading policy for the fall semester:   \n    Attendance & participation 10%; Writing assignments 90%.  \n    Two assignments of 850 words and the final assignment of 1800 words, a mini academic paper.\n2.  Punctuality in turning in your homework is required. 5 points per day will be deducted (from “raw” mark out of 100) for late submissions.\n3.   Any student who plagiarizes will fail the course. This includes self-plagiarism: you can _revise_ an essay/assignment that you have written for another course, but you cannot pass it off as a _new_ essay/assignment.\n\n*   You are required to attend two workshops and have one individual consultation.\n*   You are strongly encouraged to make another appointment with Robert or ask for feedback on your work via email.\n\n**Appointments with Aaron and Io**\n\nYou are required to have two individual consultations with the instructor (see schedule).\n\nWe encourage you to email us and make other appointments/ask for help when you find it necessary.\n\n* * *\n\n**Fall Semester Schedule**\n\n**Introduction**\n\nWeek 1\n\n9/8 (Thurs)\n\nIntroduction to the course **Aaron**\n\n**Introduction to Academic Essay Structure**\n\n*   What are some key components of an academic essay in humanities/literary studies?\n*   Focus on coherence, transitions, tone, and register\n*   Writing a commentary on a short primary text\n*   How to identify/locate the central arguments of an academic essay?\n\n(e.g. abstract, introduction, conclusion)\n\n*   How to respond to and/or evaluate an academic essay?\n*   Structure of an academic paper\n*   MLA citations style\n\nWeek 2\n\n9/15\n\nReading for coherence/cohesion in primary and secondary texts (including first secondary text on Claudia Rankine\n\nHomework for 9/22: print and read first part of Rankine’s _Citizen:_ _An American Lyric_\n\nWeek 3\n\n9/22\n\nClose reading of primary and secondary texts contd.\n\nHomework for 9/29: print and read second secondary text on Rankine—an article available online (title TBA)  \n\nWeek 4\n\n9/29\n\nClose reading of said article via Chapter 12 of _Writing Research Papers:_ _A Complete Guide_ by James D. Lester and James D. Lester, jr.; MLA; focus on introductions   \n\nWeek 5\n\n10/6\n\nStructure of and transitions within main body of article; question and guidance for assignment #1 (comparison of two secondary texts on Rankine)\n\nWeek 6\n\n10/13\n\nThe sense of an ending (the rhetoric of conclusions); writing an abstract\n\nWeek 7\n\n10/20\n\nOne-to-one tutorials in preparation for assignment #1 (a sign-up sheet will be circulated in week 5 but _please mark your calendars_) (required individual consultation: bring first draft of assignment #1)\n\nWeek 8\n\n10/27\n\nLibrary tour NTNU Library 2/F 資訊素養教室,\n\nMs. Chen 陳宜琳\n\n(more details will follow about the library tour/lecture)\n\n**Revised assignment #1 due at 11.58pm on Wed Nov 9th (submit on Moodle AND by email to aaron.c.deveson@gmail.com)**\n\n**Finding Your “Niche,” Finding Your “Voice”: Doing a Literature Review and Engaging in Close Reading**\n\n*   Close reading\n*   How to join a scholarly conversation on a topic? Or what does it mean to “join a scholarly conversation” when writing an academic essay?\n*   What is the purpose of the annotated bibliography?\n*   What is the role of a literature review?\n*   To quote or not to quote? Summarizing, paraphrasing, quoting\n*   Structure of an academic paper\n*   MLA citation style\n\n(the weekly readings for the second half of the semester will be posted in week 8)\n\nWeek 9\n\n11/03\n\nAaron\n\nWeek 10\n\n11/10\n\nAaron\n\nWeek 11\n\n11/217\n\nAaron\n\nWeek 12\n\n11/24\n\nAaron\n\nWeek 13\n\n12/1\n\nAaron\n\nWeek 14\n\n12/8\n\nAaron\n\n**Assignment #2 (literature review) due on Wed Dec 14th at 11.58 pm on Moodle AND by email to aaron.c.deveson@gmail.com**\n\nWeek 15\n\n12/15\n\nAaron\n\nWeek 16\n\n12/22\n\nAaron one-to-one tutorials in preparation for assignment #3 (a sign-up sheet will be circulated in week 12 but _please mark your calendars_) (required individual consultation: bring first draft of assignment #3)\n\n**Deadline for assignment #3 (date and title TBA) (submit on Moodle AND by email to aaron.c.deveson@gmail.com)**\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=a0bead1f4e654a2dbb979619790c4f10&fno=353d024a6a2f44ba9ef4c2f8d4db0ad6)",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "This two-semester seminar is designed to help MA students become better academic writers. We will develop several different skills that are necessary for academic writing at the MA level: (1) interpreting literature, or “primary sources,” through close reading; (2) interpreting academic scholarship or “secondary sources”; (3) conducting research and documenting sources; and (4) bringing together interpretations of primary and secondary sources into a well-organized academic essay."
        },
        {
            "type": "Group discussion",
            "note": "This course takes a team-based approach, with students working together with professors and peers to improve their writing through several different writing-based activities and workshops."
        },
        {
            "type": "Problem base learning",
            "note": ""
        },
        {
            "type": "Lab/Studio",
            "note": "In the first semester, students will complete several short writing assignments with the ultimate goal of writing a very short academic paper; in the second semester, students will work toward writing (or substantially revising) a complete academic essay and sharing their work in a conference presentation."
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 90,
            "note": "Two assignments of 850 words and the final assignment of 1800 words, a mini academic paper. Punctuality in turning in your homework is required. 5 points per day will be deducted (from “raw” mark out of 100) for late submissions."
        },
        {
            "type": "Class discussion involvement",
            "weight": 10,
            "note": ""
        }
    ],
    "prerequisite": "◎Unavailable for M.A. program students (M.A. program courses excepted) and B.A. program students.",
    "general_core": []
}