{
    "year": 111,
    "term": 1,
    "name": "文學與文化研究實作專題（一）",
    "teachers": [
        "李秀娟"
    ],
    "department": "LM21",
    "code": "ENM1060",
    "credit": 2,
    "serial": 1609,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 7,
            "to": 8,
            "campus": "本部",
            "classroom": "雲201"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "",
    "goals": [
        "to compose the MA booklist",
        "to complete the proposal hearing",
        "to plan the chapter structure of the MA dissertation",
        "Offer insight and guidance to students’ writing and research methodology"
    ],
    "syllabus": "Course Description\n\nThis course is designed to prepare students for starting their MA thesis research project. Before taking this course, students have to complete “English Writing and Research Methods I and II.” Specifically, this course will guide students through the process of finding a research topic of the scope of a Master’s thesis, compose a reading list (at least 10 books or articles of equal quantity (4 articles = 1 book), read materials included in the reading list, write a rationale for the reading project, and prepare to revise the rationale for a tentative thesis proposal.\n\nWe expect the class to be small (preferably less than 10 students). Every participant will receive individual attention/guidance from the instructor, and the class will work as a group to share, listen to and help each other’s reading and research through class presentations/discussions and via Moodle participation. Students are expected to present a number of times through the semester, which might include sharing their research topics, leading discussions of their major reading materials, and presenting their peer reviews and research rationales. We expect to see the development of every student’s research project through the process and hope that by the end of the semester, students have acquired the conceptual skills and accumulated useful adequate references, notes, and writing materials to proceed with the writing of their MA thesis proposal.\n\n**To students:**\n\n**While the research project undertaken in this course does not need to be the project that you will eventually propose for your MA thesis, you are encouraged to work on similar or related topics so that your work in this course could lead you smoothly to your thesis research. Also, though not required, you are encouraged to find a thesis adviser before or while taking this course and include the adviser’s advice to your work for this course.**\n\nTentative Schedule\n\nWeek\n\nContents\n\n1\n\n(1)  Orientation\n\n(2)  Research topic worksheet samples provided by the instructor\n\n2\n\nIndividual consultation: research topic brainstorming worksheet due one day before the class (no whole class meeting)\n\n3\n\nObserved holiday\n\n4\n\nPresentations1: selected readings (secondary references or theoretical texts)\n\nDue: Reading note entry 1\n\n5\n\nPresentations2: selected readings (secondary references or theoretical texts)\n\nDue: reading note entry 2\n\n6\n\nPresentations3: selected readings (secondary references or theoretical texts)\n\nDue: reading note entries 3 + 4\n\n7\n\nPresentations4: selected readings (secondary references or theoretical texts)\n\nDue: reading note entry 5\n\n8\n\nPresentations5: selected readings (secondary references or theoretical texts)\n\nDue: reading note entries 6 + 7\n\n9\n\nRationale samples (provided by the instructors)\n\nDue: Reading Project Preparation Worksheet Due\n\n10\n\nPresentations 6: selected readings (primary texts)\n\nDue: reading note entries 8 + 9\n\n11\n\nPresentations7: selected readings (primary texts)\n\nDue: reading note entry 10\n\n12\n\nRationale draft: individual consultation (no whole class meeting)\n\n13\n\nRationale draft: Individual writing/consultation (no whole class meeting)\n\n14\n\nRationale draft due for peer review due on Dec. 24\n\npeer review oral presentations\n\n15\n\nThesis proposal samples (provided by the instructor)\n\n16\n\nOral presentations of Reading projects (reading list + rationale)",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": ""
        },
        {
            "type": "Group discussion",
            "note": ""
        },
        {
            "type": "Problem base learning",
            "note": ""
        },
        {
            "type": "Cooperative learning",
            "note": ""
        },
        {
            "type": "Lab/Studio",
            "note": ""
        },
        {
            "type": "Case studies",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 40,
            "note": "reading notes"
        },
        {
            "type": "Class discussion involvement",
            "weight": 25,
            "note": "Class presentation and participation"
        },
        {
            "type": "Attendances",
            "weight": 5,
            "note": "Regular attendance"
        },
        {
            "type": "Case study reports",
            "weight": 30,
            "note": "finalized reading list and rationale"
        }
    ],
    "prerequisite": "◎Unavailable for M.A. program students (M.A. program courses excepted) and B.A. program students.",
    "general_core": []
}