{
    "year": 107,
    "term": 2,
    "name": "數學教材教法研究（一）",
    "teachers": [
        "林福來"
    ],
    "department": "SM40",
    "code": "MAC0185",
    "credit": 3,
    "serial": 2608,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 8,
            "to": 10,
            "campus": "公館",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "1. To know studies on contents and methods of teaching mathematics\n2. To know theoretical frameworks of competence for teaching mathematics\n3. To develop and conduct a study on contents or methods of teaching mathematics",
    "goals": [
        "了解數學教材教法研究文獻的內容及方法",
        "了解數學教學能力的理論框架",
        "延伸且發展數學教學內容或方法的研究"
    ],
    "syllabus": "Studies in Contents and Methods of Teaching Mathematics (I) Instructor: Kai-Lin Yang I.Purpose 1.To know studies on contents and methods of teaching mathematics 2.To know theoretical frameworks of competence for teaching mathematics 3.To develop and conduct a study on contents or methods of teaching mathematics II.Outline 1.Introduction 2.Lehrer, R., & Schauble, L. (2007). Contrasting emerging conceptions of distribution in contexts of error and natural variation. In M. C. Lovett & P. Shah (Eds.), Thinking with data (pp. 149-176). Mahwah, NJ: Lawrence Erlbaum Associates. 3.Paparistodemou, E., & Meletiou-Mavrotheris, M. (2008). Developing young students' informal inference skills in data analysis. Statistics Education Research Journal, 7(2), 83-106. 4.Chance, B., del Mas, R., & Garfield, J. (2004). Reasoning about sampling distribitions. In The challenge of developing statistical literacy, reasoning and thinking (pp. 295-323). Springer, Dordrecht. 5.Aguinis, H., & Branstetter, S. A. (2007). Teaching the concept of the sampling distribution of the mean. Journal of Management Education, 31(4), 467-483. 6.Hong, E., & O'neil, H. F. (1992). Instructional strategies to help learners build relevant mental models in inferential statistics. Journal of Educational Psychology, 84(2), 150-159. Koerber, S., Mayer, D., Osterhaus, C., Schwippert, K., & Sodian, B. (2015). The development of scientific thinking in elementary school: A comprehensive inventory. Child Development, 86(1), 327-336. 7.Biehler, R., Ben-Zvi, D., Bakker, A., & Makar, K. (2012). Technology for enhancing statistical reasoning at the school level. In Third international handbook of mathematics education(pp. 643-689). Springer, New York, NY. 8.Ruthven, K. (2009). Towards a naturalistic conceptualisation of technology integration in classroom practice: The example of school mathematics. Éducation et didactique, 3(1), 131-159. 9.Midterm presentation 10.Ruthven, K. (2014). Frameworks for analysing the expertise that underpins successful integration of digital technologies into everyday teaching practice. In The mathematics teacher in the digital era (pp. 373-393). Springer, Dordrecht. Thomas, A., & Edson, A. J. (2017, March). A Framework for Mathematics Teachers' Evaluation of Digital Instructional Materials: Integrating Mathematics Teaching Practices with Technology Use in K-8 Classrooms. In Society for information technology & teacher education international conference (pp. 11-18). Association for the Advancement of Computing in Education (AACE). 11.Schoenfeld, A. H. (2014). What makes for powerful classrooms, and how can we support teachers in creating them? A story of research and practice, productively intertwined. Educational Researcher, 43(8), 404-412. Wittwer, J., & Renkl, A. (2008). Why instructional explanations often do not work: A framework for understanding the effectiveness of instructional explanations. Educational Psychologist, 43(1), 49-64. 12.Groth, R. E. (2007). Toward a conceptualization of statistical knowledge for teaching. Journal for Research in Mathematics Education, 38(5), 427-437. Lachner, A., Jarodzka, H., & Nückles, M. (2016). What makes an expert teacher? Investigating teachers’ professional vision and discourse abilities. Instructional Science, 44(3), 197-203. 13.Lee, H. S., & Hollebrands, K. F. (2011). Characterising and developing teachers’ knowledge for teaching statistics with technology. In Teaching statistics in school mathematics-challenges for teaching and teacher education (pp. 359-369). Springer, Dordrecht. Madden, S. R. (2014, July). Designing technology-rich learning environments for secondary teachers to explore and prepare to teach statistics. In Sustainability in Statistics Education. Proceedings of the Ninth International Conference on Teaching Statistics (ICOTS9), Flagstaff, Arizona, USA. Voorburg: International Association of Statistics Education. 14.Dyer, E. B., & Sherin, M. G. (2016). Instructional reasoning about interpretations of student thinking that supports responsive teaching in secondary mathematics. ZDM, 48(1-2), 69-82. McDuffie, A. R., & Mather, M. (2009). Middle school mathematics teachers’ use of curricular reasoning in a collaborative professional development project. Mathematics teachers at work: Connecting curriculum materials and classroom instruction, 302-320. 15.Remillard, J. T. (2005). Examining key concepts in research on teachers’ use of mathematics curricula. Review of educational research, 75(2), 211-246. 16.Final Presentation 17.Final Presentation 18.Final Report III.Evaluation Method Discussion: 40% Presentation: 30% Paper report: 30% IV.Final report: (As a journal paper, 4000 words in English or 8000 words in Chinese) Research Questions/Review Purposes Brief Literature Review Method Results Moderator of Each Week Posing three critical questions for understanding the articles one week before you moderate class discussion. Preparing ppt structuring the content of the discussion materials. Participants Briefly posing your ideas one day before participating class discussion. Posing and elaborating one interesting problem for further investigation during classroom discussion.",
    "methodologies": [
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 40,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 30,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 30,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}