{
    "year": 110,
    "term": 2,
    "name": "弦樂音樂研究（二）",
    "teachers": [
        "廖珮如"
    ],
    "department": "MU90",
    "code": "MUU0388",
    "credit": 2,
    "serial": 2192,
    "group": "A",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "音210"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "教材內容:\n1.弦樂的音樂範圍涵蓋小、中、大、低音提琴等樂器的獨奏、重奏和合奏等類別。\n2.本課程依循音樂史的演進,講解上述弦樂的形成和發展。\n3.就上述類別各舉出具有代表性的作品,從其歷史意義、音樂結構、特質以及演奏詮釋等作為講述的重點。\n實施方式:\n1.本課程著重講解、分析以及討論\n2.配合教學內容,另提示精選的視聽資料以利教學\n3.期末提報研究心得",
    "goals": [
        "1.\t引導學生暸解弦樂在音樂史上的發展和演變 ,並明瞭各曲纇的特質, 以期對弦樂有體系上的認知。",
        "2.\t專業學識的提昇,有助於學生畢業後在演奏活動以及從事音樂教育工作上 的推動與運用。"
    ],
    "syllabus": "16週實體課程，第17、18週為教師彈性補充教學週\n\n 教學目標:\n\n1.  引導學生暸解弦樂在音樂史上的發展和演變 ,並明瞭各曲纇的特質,\n\n以期對弦樂有體系上的認知。\n\n1.  專業學識的提昇,有助於學生畢業後在演奏活動以及從事音樂教育工作上\n\n的推動與運用。\n\n教材內容:\n\n1.     弦樂的音樂範圍涵蓋小、中、大、低音提琴等樂器的獨奏、重奏和合奏等類別。\n\n2.     本課程依循音樂史的演進,講解上述弦樂的形成和發展。\n\n3.     就上述類別各舉出具有代表性的作品,從其歷史意義、音樂結構、特質以及演奏詮釋等作為講述的重點\n\n實施方式:\n\n1.     本課程著重講解、分析以及討論\n\n2.     配合教學內容,另提示精選的視聽資料以利教學\n\n3.     期末提報研究心得\n\nI. Teaching Objectives: 1.Through the study of string music, students can better understand the background and style characteristics of the repertoire, and then be able to better understand the main connotations of each repertoire in terms of actual operation. 2.Through the study of string music, students can strengthen their professional knowledge in string music, and thus in Music education can have a richer knowledge of music. II. Content of Teaching Materials: 1. The content of the textbook is mainly based on the small, medium, large and double bass solo repertoire, supplemented by chamber music and ensemble repertoire. 2. The main teaching materials take the history of musical evolution as the main framework, and the main representative composers and works of the contemporary generation are the main focus of the narration. Third, the mode of implementation: 1. The teaching implementation method is mainly based on teaching analysis, supplemented by students' group discussion on stage reports. 2.Mix with a variety of different teaching media to help students better understand the connotation of music. 3. Students are required to submit the research content in writing at the end of the term 4. Bibliography: (Respect intellectual property rights, please do not photocopie textbooks at will)",
    "methodologies": [
        {
            "type": "實驗/實作",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}