{
    "year": 110,
    "term": 2,
    "name": "科學英文寫作",
    "teachers": [
        "莫家俊"
    ],
    "department": "LM23",
    "code": "GEC8034",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 1611,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 5
    },
    "schedule": [
        {
            "day": 1,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "地理系研討室五"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "Students are able to write in academic English.",
        "Students are able to analyze and evaluate academic English texts.",
        "Students develop their skills in order to submit to and publish in international journals.",
        "Students can use academic English in research and daily life."
    ],
    "syllabus": "**【16+2 weeks teaching mode description】**\n\nThis course is a series of workshops on how to write scientific English in human geography and social sciences. You will be trained to write an academic publication, in which we pay particular attention to: article structure, logical reasoning, most commonly made mistakes in English writing, presentation of your results, and linking your findings to the broader literature. This course is useful for students who would like to pursue a career in academia, but who do not have the skills (or confidence) yet to write scientifically, or for students who are curious about how to write a scientific article, or students who have already published and are interested in additional tips and tricks.  All students are welcome, whether you are Taiwanese or native English speaker, as you will be provided individual coaching based on your writings, which is adapted to your own (English) skills and writing experience. This will be a unique chance to understand how the publishing system works, and how to “hack” an academic article in the social sciences/human geography. This course will be taught in English, but you will get individual feedback on your work. Therefore, do not worry about the level of English as hopefully this course will help you improve it, both orally and written.\n\n\\*You are recommended to bring your laptop to class.\n\n\\*This class will provide you coffee and tea, bring your own cup.\n\n\\* You are not required to provide proof of English proficiency, but be prepared that as an EMI course, the entire course will be taught in English (so this will be an excellent opportunity to improve your English).\n\nClass Schedule:\n\nIn week 1-8, we will discuss all the important aspects of writing an academic article. In these weeks, you have to start to think about your own article (you decide the word count), the topic you choose (can be based on your current research or another topic), and your writing schedule. In week 9-14, everyone will start writing, and you will get extensive feedback on your article from me and your peers. On week 15, you will review someone else’s work, as if it is a real journal publication process. In week 16, everyone will present their article. We will compile all articles as a collection of papers. If you are interested in publishing your article in a real journal, you will be provided some extra support to do so (but it is not compulsory).\n\nWeek 1: Introduction to the course and getting to know each other\n\nWeek 2: An introduction to scientific writing, and discussing various types of articles\n\nWeek 3: How to write the perfect introduction to your article.\n\nWeek 4: Literature review: tips and tricks\n\nWeek 5: Methods section, and why it is important\n\nWeek 6: Results section: how to present your results clearly and to the point?\n\nWeek 7: Discussion and conclusion: linking your research to the broader literature\n\nWeek 8: Abstract, layout, title and references\n\nWeek 9:  Grammar and spelling: commonly made mistakes and how you can avoid them\n\nWeek 10: Choosing the right journal, the review process, and how to get published\n\nWeek 11: Write your own article I\n\nWeek 12: Write your own article II\n\nWeek 13: Write your own article III\n\nWeek 14: Write your own article IV\n\nWeek 15: Peer review and final presentations\n\nWeek 16: Final class: receiving feedback on your works.\n\nWeek 17: Reading week (no class)\n\nWeek 18: Reading week (no class)",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "Lecture"
        },
        {
            "type": "Group discussion",
            "note": "Discussing structure and logic of the sample cases"
        },
        {
            "type": "Problem base learning",
            "note": "Creating writing sample/templates for particular usages"
        },
        {
            "type": "Cooperative learning",
            "note": "Writing practice through peer review process"
        },
        {
            "type": "Lab/Studio",
            "note": "Writing practice on-site"
        }
    ],
    "grading": [
        {
            "type": "Class discussion involvement",
            "weight": 20,
            "note": "All lectures are discussion-based."
        },
        {
            "type": "Attendances",
            "weight": 10,
            "note": "Attendance is compulsory, unless you have a valid reason not to come"
        },
        {
            "type": "Presentation",
            "weight": 70,
            "note": "Your article is graded as follows: your article (30%); your learning process (20%), final presentation (10%) and peer-review (10%)"
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}