{
    "year": 111,
    "term": 1,
    "name": "固定收益證券",
    "teachers": [
        "阿曼德"
    ],
    "department": "OM55",
    "code": "MBM0088",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 2461,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "雲608"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "Understand the fundamentals of fixed income in the context of investment and trading",
        "Analyze the risk and returns of a wide variety of fixed income products",
        "Understand how fixed income products relate to other structured products",
        "Work collaboratively and efficiently in teams to complete tasks related to fixed income product"
    ],
    "syllabus": "**For 16~18 Weeks Course Arrangement**\n\n**Topic**\n\n**Chapter**\n\n**Week**\n\nSyllabus Class/Introduction\n\nCh.1\n\nW1\n\nIntroduction to fixed income securities\n\nChapter 1, 9\n\nW2\n\nTreasury, municipal and corporate bonds\n\nChapter 6, 7, 8\n\nW3\n\nBond pricing and yields\n\nChapter 2, 3\n\nW4:\n\nDuration and convexity\n\nChapter 4\n\nW5\n\nTerm structure of interest rates\n\nCh.5\n\nW6\n\nTutorial Question- Midterm Exam Review\n\nAll covered materials\n\nW7\n\n**MID-TERM EXAM**\n\nAll covered materials\n\nW8\n\nBonds with embedded options\n\nChapter 18, 20\n\nW9\n\nBond portfolio management (I)\n\nChapter 24, 25\n\nW\n\nBond portfolio management (II)\n\nChapter 26\n\nW11\n\nInterest rate derivatives\n\nChapter 29, 30\n\nW12\n\nSwaps and credit default swaps\n\nChapter 31, 32\n\nW13\n\nCredit risk analysis\n\nChapter 21, 22\n\nW14\n\nMortgage-backed securities\n\nChapter 11, 12, 13\n\nW15\n\nGroup Project Presentation\n\nAssigned group project\n\nW16\n\nFinal Exam Review\n\nAll covered materials\n\nW17\n\n**Final Exam**\n\nAll covered materials\n\nW18",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "The course is based on a combination of readings from the text, lectures delivered via the course website (by instructor and guest lecturers), articles, readings, videos and discussions on the course discussion board. For each section, students are expected to read the assigned chapters and lecture notes, view any assigned slides and/or videos, actively participate in the online discussion, and complete required assignments and exercises. Please consult the course plan that accompanies this syllabus and the Blackboard or Canvas site for this course to see a list of class preparation assignments by topic.\n\nAdditional readings, lecture notes, and problem sets will be posted on the course web (Blackboard or Canvas). Students are required to check this site periodically for updates."
        },
        {
            "type": "Group discussion",
            "note": "\tGroup discussion\tInteraction on the discussion is a significant and required part of this class. As with any course, the more the class participates in the discussion, the more interesting and valuable the course will become. Since our primary means of group discussion is the class discussion board, this area becomes a critical portion of the course.\n\nAs a business school class, I anticipate a high level of interaction. Five percent of your grade includes your discussion and the points you add to the class discussion, your role in class and overall participation."
        },
        {
            "type": "Problem base learning",
            "note": "I will assign material to read for each class (in addition, you should follow along in the syllabus and read the materials that each class will cover).  If a problem set/ data analysis is assigned, it is the responsibility of each student to complete it and turn it in on time.  Late assignments are not accepted."
        },
        {
            "type": "Media, audio, visual materials",
            "note": "I will be sharing with you some examples from media clips, music, \nnews articles, and students’ own experiences that would make our class more exciting and more comfortable. To personalize the class to student experiences, I might ask a student or two about their jobs and use those examples to discuss finance concepts like decision making under uncertainty. I truly believe if students do not see a variety of ways in which finance concepts can be applied to the real world they will fail to see how it matters to them."
        },
        {
            "type": "Case studies",
            "note": "Each team is required to write a tutorial paper on a topic relevant to the course. Some topics will be given on the task sheet, but the students can also work on topics agreed with the lecturer.\n\nPeer Assessment Review (PAF) will be used for feedback purpose. You would need to complete the PAF to receive the final mark for Team Assessments (Problem Sets and Tutorial Paper). More information about PAF is discussed in the Assessment Guideline on BB."
        },
        {
            "type": "Other:",
            "note": "I reserve the right to add deliverables, quizzes, assignments, data analysis, cases, etc. where I believe it serves the class"
        }
    ],
    "grading": [
        {
            "type": "Midterm Exam",
            "weight": 25,
            "note": ""
        },
        {
            "type": "Final exam",
            "weight": 35,
            "note": ""
        },
        {
            "type": "Attendances",
            "weight": 10,
            "note": ""
        },
        {
            "type": "Presentation",
            "weight": 15,
            "note": ""
        },
        {
            "type": "other:",
            "weight": 15,
            "note": "Problem Sets"
        }
    ],
    "prerequisite": "◎Unavailable for M.A. program students (M.A. program courses excepted) and B.A. program students.",
    "general_core": []
}