{
    "year": 111,
    "term": 1,
    "name": "整合行銷溝通",
    "teachers": [
        "洪秀瑜"
    ],
    "department": "OM55",
    "code": "MBM0040",
    "credit": 3,
    "serial": 2452,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "雲508"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "Develop an understanding of the role of advertising and promotion within the context of a balance of theoretical and practical perspectives through the integration of various concepts/theories and practical applications.",
        "Analyze a specific IMC campaign, including media strategy, target market selection, message content and evaluation criteria",
        "Apply IMC concepts in developing a limited promotional campaign that includes message development and media selection for a company’s product or service.  Develop and understanding of the overall marketing process and the role of the promotional mix in the marketing mix and strategy.",
        "Demonstrate project management skills as they work cooperatively on a team project.",
        "Determine the role of the promotional mix in the development of strategic/ tactical marketing plans so as to understand how the marketing communication process influences consumer decision making."
    ],
    "syllabus": "Week 1 (2/17): Introduction to IMC course and overview the role of advertising and promotion in marketing\n\n Find your group members. We will form 6 groups in this course.\n\n Homework: Read-through the case 1, preparing next week’s case discussion.\n\nWeek 2 (2/24): The role of advertising and promotion in marketing with attention to the various elements of marketing mix and how they interact with advertising and promotion strategy\n\n **Case 1 in class discussion, leaded by group 1**  \n\n Written assignment: write your reflections of case 1\n\n **Submit your written assignment by 3/2 PM11:59**\n\nWeek 3 (3/3): The promotional program situation analysis. Understand how firms organize for advertising and promotion.\n\n **Case 2 in class discussion, leaded by group 2** \n\n Written assignment: write your reflections of case 2\n\n **Submit your written assignment by 3/9 PM 11:59**\n\nWeek 4 (3/10): The promotional program situation analysis. Understand consumer behaviors and examine the stages of the consumer decision making process including both the internal psychological factors and the external factors.\n\n **Case 3 in class discussion, leaded by group 3** \n\n Written assignment: write your reflections of case 3\n\n **Submit your written assignment by 3/16 PM 11:59**\n\nWeek 5 (3/17): The communication process. Examine various communication theories and models of how consumers respond to ad messages and other forms of marketing communication.\n\n **Case 4 in class discussion, leaded by group 4** \n\n Written assignment: write your reflections of case 4\n\n **Submit your written assignment by 3/23 PM 11:59**\n\nWeek 6 (3/24): The communication process. Provide a detailed discussion of source, message and channel factors.\n\n **Case 5 in class discussion, leaded by group 5**\n\n Written assignment: write your reflections of case 5\n\n **Submit your written assignment by 3/30 PM 11:59**\n\nWeek 7 (3/31): Consider how firms develop goals and objectives for their IMC programs and determine how much money to spend and where to spend it in trying to achieve them.\n\n **Case 6 in class discussion, leaded by group 6** \n\n Written assignment: write your reflections of case 6\n\n **Submit your written assignment by 4/6 PM 11:59**\n\n**Week 8 (4/7) Mid-Term Exam**\n\nWeek 9 (4/14): Examine the various promotional-mix elements that form the basis of the IMC program. Discuss the ad creativity and focuses on the creative processes, the planning and development of the creative strategy.\n\n **Each group will demonstrate** **your video assignment of management school of NTNU in class**\n\nWeek 10 (4/21): Examine the various promotional-mix elements that form the basis of the IMC program. Execute the creative strategy and discuss various options for execution of the message\n\n **Paper 1 in class discussion, presented by group 1** \n\n Written assignment: write your reflections of paper 1\n\n **Submit your written assignment by 4/27 PM11:59**\n\nWeek 11 (4/28): Examine the various promotional-mix elements that form the basis of the IMC program. Cover the media strategy and planning and the various advertising media\n\n **Paper 2 in class discussion, presented by group 2** \n\n Written assignment: write your reflections of paper 2\n\n **Submit your written assignment by 5/4 PM 11:59**\n\nWeek 12 (5/5): Examine the various promotional-mix elements that form the basis of the IMC program. Examine other promotional tools that are used in the IMC process including direct marketing, Internet, digital/social media, sales promotion, and publicity/public relations in IMC.\n\n **Paper 3 in class discussion, presented by group 3** \n\n Written assignment: write your reflections of paper 3\n\n **Submit your written assignment by 5/11 PM 11:59**\n\nWeek 13 (5/12): Examine the various promotional-mix elements that form the basis of the IMC program. Examine other promotional tools that are used in the IMC process including direct marketing, Internet, digital/social media, sales promotion, and publicity/public relations in IMC.\n\n **Paper 4 in class discussion, presented by group 4** \n\n Written assignment: write your reflections of paper 4\n\n **Submit your written assignment by 5/18 PM 11:59**\n\nWeek 14 (5/19): Measure the effectiveness of various elements of the IMC program.\n\n **Paper 5 in class discussion, presented by group 5** \n\n Written assignment: write your reflections of paper 5\n\n **Submit your written assignment by 5/25 PM11:59**\n\nWeek 15 (5/26): Measure the effectiveness of various elements of the IMC program and examine the global marketplace and the tole of advertising and other promotional-mix variables such as sales promotion, public relations, and the Internet in international marketing.\n\n **Paper 6 in class discussion, presented by group 6**\n\n Written assignment: write your reflections of paper 6\n\n **Submit your written assignment by 6/1 PM11:59**\n\n**Week 16 (6/2) Final Project Competition**",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "For the first two hours, the instructor will give you class lecture related to the major topic each week"
        },
        {
            "type": "Group discussion",
            "note": "During the first two hours, students are encouraged to actively participate in class discussion. Integrated marketing requires collaborating with others and sharing ideas. For this course, participation takes place in class. You will be evaluated on the value of your participation in case discussion and in team project presentation. Please come to class prepared to discuss the readings and ready to participate.  \nIn the third hour, we will have either case discussion or paper presentation. Be sure to read the assigned materials prior to class, be open to suggestions and ready to take a side if necessary. All students should be ready to actively discuss readings as well as current events as it pertains to the course. The strengths of your background experience--either your working experience or academic emphasis-- are highly encouraged. Simply put, if you are a metrics person who sees things in numbers please bring this insight and expertise to the class. IMC is a multi-disciplinary strategy."
        },
        {
            "type": "Problem base learning",
            "note": "Problem base learning"
        },
        {
            "type": "Cooperative learning",
            "note": ""
        },
        {
            "type": "Media, audio, visual materials",
            "note": "Media, audio, visual materials"
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 20,
            "note": "PR / Social Video Assignment for the Management School of NTNU"
        },
        {
            "type": "Midterm Exam",
            "weight": 20,
            "note": "Mid Term Exam"
        },
        {
            "type": "Class discussion involvement",
            "weight": 30,
            "note": "Cases and Paper Assignments"
        },
        {
            "type": "other:",
            "weight": 30,
            "note": "Final Project Competition"
        }
    ],
    "prerequisite": "◎Unavailable for M.A. program students (M.A. program courses excepted) and B.A. program students.",
    "general_core": []
}