{
    "year": 109,
    "term": 2,
    "name": "書報討論（二）",
    "teachers": [
        "林怡君"
    ],
    "department": "IM86",
    "code": "IWM0073",
    "credit": 1,
    "serial": 1394,
    "group": "",
    "quota": {
        "limit": 38,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "正106"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎必須先修過【IWM0072  書報討論（一）】 ◎課程不開放上修",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "This course aims to develop students’ knowledge and skills regarding the field of human resource development and management. It provides a platform for students to discuss issues and research related to workplace. This course is delivered through an overview of past and current research that has being done in the related fields, and a series of activities such as speeches, student presentations, classroom activities, and group discussion.",
    "goals": [
        "describe new trends related to HR",
        "describe the competence of an HR professional",
        "exhibit a proactive attitude toward learning and service",
        "improve HR research skills",
        "improve HR professional skills"
    ],
    "syllabus": "This course aims to develop students’ knowledge and skills regarding the field of human resource development and management. It provides a platform for students to discuss issues and research related to workplace. This course is delivered through an overview of past and current research that has being done in the related fields, and a series of activities such as speeches, student presentations, classroom activities, and group discussion. The purpose of these activities is to help enhance student competence in human resource development and management, specifically in the following ability or skills:\n\n*   oral communication skills and public speaking,\n*   sensing and evaluating different trends related to human resources\n*   responding to different perspectives and approaches in the workplace\n*   searching necessary information about study field\n*   summarizing and communicating the essence of an article\n*   summarizing and communicating the development of a topic",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        },
        {
            "type": "其他",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": "Resume & Cover letter"
        },
        {
            "type": "出席",
            "weight": 20,
            "note": "Class attendance is absolutely essential. Please come to the class on time. Notify the instructor ahead of time if you will be late or absent for a class."
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "Research sharing reflection"
        },
        {
            "type": "其他",
            "weight": 20,
            "note": "Job interview practice"
        }
    ],
    "prerequisite": "◎必須先修過【IWM0072  書報討論（一）】",
    "general_core": []
}