{
    "year": 109,
    "term": 2,
    "name": "國際合作規劃與管理研究",
    "teachers": [
        "李浡"
    ],
    "department": "IM86",
    "code": "IWM0057",
    "credit": 3,
    "serial": 8093,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 10,
            "to": 12,
            "campus": "本部",
            "classroom": "誠104"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This curriculum is aim to instruct the students to recognize the concept of management of International Development Cooperation. In addition to providing overviews of the evolution of development doctrine and the role of aid, this curriculum provides new empirical evidence on the effectiveness of aid. This evidence challenges key elements of the existing conventional wisdom, leading to more balanced policy conclusions. Fresh insights into the use of the various aid modalities, which are in a complex process of reform, are also offered. Taking stock and reflecting on how aid should be designed in the future to promote economic development (with a focus on growth, poverty alleviation and social justice) are core themes. To this come reviews of the past, present and future of aid as it emerges from analyses by political scientists. Finally, while much of what is said refers to a variety of poor countries in different regions of the world, particular attention is paid to the development challenges of Africa.",
    "goals": [
        "To recognize the concept of management of International Development Cooperation",
        "To provide overviews of the evolution of development doctrine and the role of aid, and new empirical evidence on the effectiveness of aid",
        "Taking stock and reflecting on how aid should be designed in the future to promote economic development",
        "A variety of poor countries in different regions of the world, particular attention is paid to the development challenges of Africa"
    ],
    "syllabus": "1.    Global Education Policy and International Development  \n2.    Gender Inequality in Education  \n3.    Financial and Resources Invested in Education  \n4.    The Output of Educational Institutions and The Impact of Learning  \n5.    Global High Education Development in OECD Countries  \n6.    TVET and Development: A Human Capability and Social Justice Approach  \n7.    International Adult Education and Development  \n8.    Teacher Training for Education Development  \n9.    Pedagogy, Curriculum, Teaching Practices and Teacher Education in Developing Countries  \n10.     Students, Computers, and Learning: making the connection  \n11.     Global Talent Management: Necessity, Challenges, and the Roles of HRD   \n12.     School Health and Nutrition Programs in Practice  \n13.     Low-Performance Students: Dilemma and Measures  \n14.     Children in Conflict Area   \n15.     Teaching Excellence through Professional Learning and Policy Reform: Lesson from around the World  \n16.     Education in Emergencies   \n17.     Access to Education, Participation and Progression  \n18.     Ensure Inclusive and Equitable Quality Education and Promote Lifelong Learning Opportunities for All  \n19.     Making Education a Priority in the 2030 Sustainable Development Agenda  \n20.     An Assessment of Global Competence: in the 2018 PISA Assessment",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 30,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 40,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}