{
    "year": 109,
    "term": 2,
    "name": "嬰幼兒認知發展研究",
    "teachers": [
        "王馨敏"
    ],
    "department": "EM06",
    "code": "HGC8007",
    "credit": 3,
    "serial": 478,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "勤102"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "1. 瞭解嬰幼兒認知發展之涵義與重要議題 2. 認識腦發展之新近研究方法與發現及其與嬰幼兒認知發展的關係 3. 探討嬰幼兒認知發展重要層面之相關研究與發現認知科學取向關於嬰幼兒認知發展探究之方法與結果 4. 針對嬰幼兒認知發展重要施測方式進行實地研究",
    "goals": [
        "瞭解嬰幼兒認知發展之涵義與重要議題",
        "認識腦發展之新近研究方法與發現及其與嬰幼兒認知發展的關係",
        "探討嬰幼兒認知發展重要層面之相關研究與發現認知科學取向關於嬰幼兒認知發展探究之方法與結果",
        "針對嬰幼兒認知發展重要施測方式進行實地研究"
    ],
    "syllabus": "**課程內容描述(Course Description)**\n\n嬰幼兒如何獲取關於這個世界的知識? 他們的認知能力如何隨著時間發展? 這是一門關於嬰幼兒認知發展的入門課程同時也是進階課程，旨在協助學生了解不同的認知發展主題，包含孩子如何理解物理世界、孩子如何從外界獲取知識、孩子在記憶力、注意力、心智理論面向的發展、雙語習得如何影響孩子的思維與大腦運作、生活經驗如何形塑大腦的發展，以及可用以了解嬰幼兒大腦發展與學習的新工具( 如: fNIRS和LENA)。\n\nHow do infants and young children acquire knowledge about the world? How do their cognitive abilites developed across time? This is a both entry and advanced level of course aiming to help students understand various themes in cognitive development including children's understanding of the physical world, children’s ability of extracting and learning information from the world, children’s memory and attention, children’s ability to understand others’ mind, how being a bilingual affects children’s mind and brain, how children’s brain is shaped by their daily experience, and the new techniques (e.g., fNIRS and LENA) to understand children's brain development and learning.  \n\n這門課課程內容包含兩大部分: **導論**(入門部分)以及**期刊論文導讀**(進階部分)。每一個單元主題都會先由教師進行導論，接著由學生輪流針對指定期刊論文進行導讀並帶領課堂討論。修課學生要於課前閱讀這些指定期刊論文、參與每週課堂討論並於期末繳交一篇期末報告。\n\nThis class is organized into two parts: Overview (entry-level part) and Paper Discussion (advanced-level part). For each topic, there will be a teacher’s lecture to guide students into this new topic (Overview), followed by one or two paper discussions led by students in turn (Paper Discussion). Students are expected to read and comment on these articles, to participate in weekly discussions, and complete a final term paper.\n\n**課程主題(Topics)**\n\n1\\. 課程介紹 (Introduction to Course) \n\n2\\. 何謂發展心理學? 我們為何要研究發展心理學? 要如何研究? (What's Developmental Psychology? Why and How?)\n\n3\\. 嬰兒期發展概論--搖籃裡的科學家 (Overview of Infant Development - The Scientist In the Crib)\n\n4\\. 實驗典範--我們如何知悉嬰兒所知? (Exp. Paradigm - How Do We Know What Infants Know?)\n\n5\\. 嬰幼兒如何獲取知識--統計學習能力 (How Children Acquire Knowledge - Statistical Learning)\n\n6\\. 記憶力發展 (Memory Development)\n\n7\\. 注意力發展 (Attention Development)\n\n8\\. 心智理論 (Theory of Mind)\n\n9\\. 雙語思維與大腦 (The Bilingual Minds and Brains)\n\n10. 經驗如何形塑大腦 **(**How Experience Shapes Children’s Brain)\n\n11.了解嬰幼兒大腦發展與學習的新工具--fNIRS和LENA (Using fNIRS and LENA to Understand Brain Development and Leaning in Infancy and Ealry Childhood)",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "實驗/實作",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "Writing Assignments"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "Read and Comment on Papers"
        },
        {
            "type": "專題",
            "weight": 30,
            "note": "Short Term Paper"
        }
    ],
    "prerequisite": "",
    "general_core": []
}