{
    "year": 108,
    "term": 2,
    "name": "職業訓練制度比較研究",
    "teachers": [
        "陳聰勝"
    ],
    "department": "HM70",
    "code": "IEM0354",
    "credit": 2,
    "serial": 1054,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 1,
            "from": 7,
            "to": 8,
            "campus": "本部",
            "classroom": "研討二"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "1.本課程規劃考量的背景因素：\n(1).全球化及知識經濟強調知識及創新價值，以及人才的重要性。\n(2).我國無天然資源，人力資源成為我國國際競爭力之所寄。\n(3).各國職業訓練制度皆具特色，值得研究與借鏡。\n(4).本研究所著重技職教育綜合性研究，本課程可發揮二者相輔相成功效。\n2.職業訓練制度係巨型的議題，牽涉一個國家經濟、社會、教育、文化、人口等層面，且是一個國家施政目標、法規政策、軟硬體資源、人力及組織運作的綜合體，面向多元性質複雜，故本課程擬藉用已經成熟的相關理論，如人力資本論，個人需求理論，就業安全理論等，暨研究架構如系統理論架構、公共政策分析架構等來做系統化的探討，同時培養同學學術研究能力。\n3.職業訓練制度是具體運作的實體，貴在能有效運行、創造人才培訓效果，故除鑽研文獻資料外，更宜瞭解其實際運作的模式、資源投入、組織運作、肆應挑戰、合作結盟等，也要走出室外，參訪及了解政府主管機關、事業單位，學校等實際作為，故規劃三場請益學習之行，延伸研究的面向，期許理論與實務相印證與結合，創造最大學習效果。\n4.職業訓練培訓一個國家建設發展所需的各種人才，不論是未開發國家、開發中國家或是已開發國家，都有其合用並具特色的制度在運行。一個國家在不同的發展階段，也都會採行不同的制度和模式來培訓其所需的人才，故本課程將探討亞、歐、美等職業訓練制度較成熟的國家之作法及特色，吸取其優點，且適合我國條件者，而收他山之石可以攻玉之效。\n5.職業教育與職業訓練的連結、配合、互動與互補，是各國培育人才的重要途徑，綜觀世界各國與我國實施之經驗，有四種重要模式:\n(1).職業教育+公共訓練(學訓合作)。\n(2).職業教育+企業訓練(產學合作)。\n(3).公共訓練+職業教育+企業訓練(產學訓合作)。\n(4)公共訓練+企業訓練(產訓合作)。\n本課程將以四種模式運作的(1)各主體可用的資源。(2)實施的方式。(3)各種模式的優點與挑戰。(4)各種模式成敗的關鍵因素，其在我國實施的案例與經驗、啟示等做探討與評析。",
    "goals": [
        "探討職業訓練的相關理論，以厚植比較研究分析評述的能力。",
        "探討職業訓練制度的研究架構及方法論，以增進研究方法論的運用能力。",
        "研析與比較代表性國家（英國、德國、美國、加拿大、日本、韓國、新加坡、澳大利亞及我國等）職業訓練制度的重要內涵，析述個別國家的特色及優點，發揮相互借鏡之效。",
        "探討我國當前職業訓練制度的重要課題，以及面對的挑戰與對策，強化優點，改進弱點，以提升人力培訓的競爭力。",
        "利用分工合作與職業訓練議題報告討論的方式，以及造訪職業訓練主管機關、成功企業、高職學校的請益與對話活動，培養團隊合作精神與重視實務，掌握問題的學習態度，暨表達、溝通、協調、整合的能力。",
        "今日是重視人才及爭取人才的時代，職業訓練則是培育專業人才的重要機制，此關涉良好制度、有效策略、可行作法及專業倫理培養等要素的建構，本課程即以此為鵠的。"
    ],
    "syllabus": "第1週：1.同學自我介紹。  \n           2.了解同學對本課程之建議及期許。  \n           3.提供主要國家職業訓練制度研讀的資料。  \n第2-3週：1.介紹職業訓練制度的研究架構及其內涵。  \n              2.介紹我國當前職業訓練的重要議題（重要性及其探討重點）。  \n第4週：介紹研究職業訓練相關的理論（人力資本理論、個人需求理論、就業安全理論、人力發展理論）。  \n第5週：介紹研究職業訓練制度相關的方法論（系統理論、公共政策理論、SWOT）。  \n第6週: 個別同學提出擬探討的職業訓練重要議題的題目（發展為學期報告），以及分組同學提出各國職業訓練制度間單一事項之比較題目 （例如職業訓練師資培育、職業訓練組織體制、或我國與日本職業訓練制度之比較等）。  \n第7-8週:老師介紹  \n            1.我國職業訓練發展的重大變革。  \n            2. 當前我國職業訓練的重要挑戰與對策。  \n第9-11週:參訪勞動部勞動力發展署、一所高工職校、一所事業單位。  \n第12-14週:同學提出各國職業訓練制度間單一事項之比較（例如以中日兩國職業訓練師資培育為例）短篇報告。  \n第15-18週：個別同學提出職業訓練重要議題的學期報告，同學討論、老師評述。",
    "methodologies": [
        {
            "type": "講述法",
            "note": "1.介紹職業訓練制度的研究架構及其重要內涵。 2.介紹研究職業訓練制度的相關理論及方法論。 3.介紹我國職業訓練的發展沿革及重大影響因素。"
        },
        {
            "type": "討論法",
            "note": "1.討論影響一個國家職業訓練制度發展的重要因素。 2.討論當前我國職業訓練發展的重要挑戰與對策。 3.就同學提出的研究報告內容做討論。"
        },
        {
            "type": "問題解決教學",
            "note": "1.就我國公共職業訓練中心現存角色功能與產業界期許之落差問題做討論。 2.就我國職業教育與職業訓練二體系現行運作機制上，討論其互動與角色扮演關係。"
        },
        {
            "type": "合作學習",
            "note": "同學分組就所負責的題目蒐集、整理、分析資料、合作研提研究成果報告。"
        },
        {
            "type": "實地考察、參訪",
            "note": "規劃參訪勞動部動力發展署、台北市職能發展學院、事業單位請益學習。"
        },
        {
            "type": "專題研究",
            "note": "同學就所擬定的職業訓練制度相關重要議題寫成學期報告，經師生討論後充實之，並發展成可投稿學術研討會或期刋的論文。"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "對職業訓練制度相關資料之蒐集整理運用，以及研究結果於課堂上討論參與的程度。"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "上課出席情形"
        },
        {
            "type": "報告",
            "weight": 50,
            "note": "學期報告研究成果的表現。"
        },
        {
            "type": "專題",
            "weight": 20,
            "note": "各國職業訓練制度間單一事項之比較口頭報告"
        }
    ],
    "prerequisite": "",
    "general_core": []
}