{
    "year": 109,
    "term": 1,
    "name": "組織行為研究",
    "teachers": [
        "葉俶禎"
    ],
    "department": "IM86",
    "code": "IWM0040",
    "credit": 3,
    "serial": 1455,
    "group": "",
    "quota": {
        "limit": 36,
        "additional": 15
    },
    "schedule": [
        {
            "day": 3,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "誠104"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course includes both theory and practical application of organizational behavior in organizations. Organizational behavior is the study of how individuals and groups impact the behaviors within an organization. It is a field of systematic study that focuses on improving productivity and other areas of performance improvement. No previous study of Organizational Behavior is assumed.",
    "goals": [
        "Describe the basic knowledge and theories of organizational behavior and identify the occurrences of them in organizations",
        "Describe current research in organizational behavior and identify how they can be applied to workplace settings",
        "Understand how application of OB concepts can enhance individual, group, and organizational effectiveness"
    ],
    "syllabus": "Week 1  **Introduction of OB and course overview**\n\nWeek 2  **Foundations of individual behavior, Diversity in Organizations**\n\nWeek 3  **Attitudes and Job Satisfaction**\n\nWeek 4  **Emotions and Moods**\n\nWeek 5  **Personality and Values**\n\nWeek 6  **Perception and Individual Decision Making**\n\nWeek 7  **Basic Motivation Concepts**\n\nWeek 8  **Motivation**\n\nWeek 9  **Review of research topics in OB**\n\nWeek 10  **Foundations of Group Behavior**\n\nWeek 11  **Miderm**\n\nWeek 12  **Understanding Work Teams**\n\nWeek 13  **Communication**\n\nWeek 14  **Leadership**\n\nWeek 15  **Power and Politics**\n\nWeek 16  **Conflict and Negotiation**\n\nWeek 17  **The Organizational System, Organizational Culture**\n\nWeek 18  **Final Exam**",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Important issues and trends in OB studies will be introduced"
        },
        {
            "type": "討論法",
            "note": "Students will discuss related issues and trends introduced by the instructor and research topics presented by fellow students"
        },
        {
            "type": "媒體融入教學",
            "note": "Audio visual materials will be used to introduce phenomenon in organizations."
        },
        {
            "type": "專題研究",
            "note": "Students will carry out case studies of current problems in OB."
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 20,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 20,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 15,
            "note": "Read texts and other supplementary materials before class and actively participate in class discussions to enrich the learning."
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Attendance is required. 5 points out of the total 100 points toward attendances will be deducted for each unapproved absence."
        },
        {
            "type": "報告",
            "weight": 15,
            "note": "Students are required to introduce and present the case study report in class."
        },
        {
            "type": "專題",
            "weight": 20,
            "note": "Students will carry out a case analysis of a current problem in an organization. Students are required to present the project orally in class and submit the completed written research report."
        }
    ],
    "prerequisite": "",
    "general_core": []
}