{
    "year": 107,
    "term": 2,
    "name": "小說敘事的美學與倫理",
    "teachers": [
        "邵毓娟"
    ],
    "department": "LU21",
    "code": "ENC1114",
    "credit": 3,
    "serial": 1756,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 1,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "誠107"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大四 ◎限碩一碩二碩三以上修習",
    "form_s": "",
    "classes": "9",
    "dept_group": "",
    "hours": 3,
    "description": "​This course is to introduce students to a number of philosophical treatises on the aesthetics and politics of literature so as to explore what the novel does and how the novel thinks. Reading these philosophical treaties alongside selected novels, this course aims to re-think the art of the novel and the ways novelistic narratives perform ethical acts and yet at once expose the limit of the ethical demands and the ethical vision of aesthetic expression.",
    "goals": [
        "This course is to provide students with a philosophical framework on the nature of the novel so as to re-think the intricate relations in between the aesthetic and ethical dimensions as exposed in novelistic narrative."
    ],
    "syllabus": "Aesthetics and Ethics in Novelistic Narratives\n\n小說敘事的美學與倫理\n\nSpring 2019  \n\nInstructor: Jessie Shao 邵毓娟                  Email: [ycshao@ntnu.edu.tw](mailto:ycshao@ntnu.edu.tw)\n\nOffice: Cheng 808                             Tel: 77341786\n\n**I. Goals:**\n\nThis course is to introduce students to a number of philosophical treatises on the aesthetics and politics of literature so as to explore what novels do and how novels think. Reading these philosophical treaties alongside selected novels, this course aims to re-think the art of the novel and the ways novelistic narratives perform ethical acts and yet at once expose the limit of the ethical demands and the ethical vision of aesthetic expression. \n\n**II. Required Textbooks:**\n\n1.  _Disgrace_ by J. M. Coetzee.\n2.  _The Narrow Road to the Deep North_ by Richard Flanagan\n3.  Assigned readings in the course pack.\n\n**II. Tentative Syllabus:**\n\n**Week 1 (Feb. 18):** Orientation\n\n“What Aesthetics Means” by Jacques Rancière; “What We Talk about When We Talk about Ethics” by Lawrence Buell;\n\n**Week 2 (Feb. 25):**\n\nTopic: Realistic Fiction and The Distribution of the Sensible\n\nAssigned Readings: “The Distribution of the Sensible: Politics and Aesthetics” by Jacques Rancière; “The Ethical Turn of Aesthetics and Politics” by Jacques Rancière\n\n**Week 3 (March 4):**\n\nTopic: Realistic Fiction and The Distribution of the Sensible\n\nAssigned Readings: _Disgrace_ by J. M. Coetzee (Chapters 1-8); “Is History a Form of Fiction” by Jacques Rancière\n\n**Week 4 (March 11):**\n\nTopic: The Ethics of Writing and Reading\n\nAssigned Readings: _Disgrace_ by J. M. Coetzee (Chapters 9-14); “Disgrace, Desire, and the Dark Side of the New South Africa” from _J. M. Coetzee and Ethics_\n\n**Week 5 (March 18):**\n\nTopic: The Ethics of Writing and Reading\n\n_Disgrace_ by J. M. Coetzee (Chapters 15-24); “Age of Bronze, State of Grace” from _J. M. Coetzee and the Ethics of Reading_ (by Derek Attridge)\n\n**Week 6 (March 25):**\n\nTopic: Mimesis and Modernity\n\nAssigned Readings: Excerpts from _A Portrait of Artist as a Young Man_ by James Joyce; “Artistic Regimes and the Shortcomings of the Notion of Modernity” by Jacques Rancière\n\n**Week 7 (April 1):**\n\nTopic: What does the Novel Do?\n\nAssigned Readings: “The Depreciated Legacy of Cervantes” and “Dialogues on the Art of the Novel” by Milan Kundera (From _The Art of the Novel_); Parts I & II from _The Unbearable Lightness of Being_ by Milan Kundera\n\n**Week 8 (April 8):**\n\nTopic: How do Novels Think?\n\nAssigned Readings: “How Novels Think” by Nancy Armstrong; “Right and Wrong Political Uses of Literature” by Italo Calvino\n\n**Week 9 (April 15):**\n\nTopic: The Aesthetic Unconscious\n\nAssigned Readings: “What Freud Has to Do with Aesthetics;” “The Aesthetic Revolution;” “The Two Forms of Mute Speech;” “From One Unconscious to Another” by Jacques Rancière\n\n**Week 10 (April 22): Midterm Exam**\n\n**Week 11 (April 29):**\n\nTopic: Sentimentalism and Ethics\n\nAssigned Reading: “Friedrich Schiller and the Aestheticizing of Sentiment” and “Victorian Sentimentality: The Dialectic of Sentiment and Truth of Feeling” from _Sentimentalism, Ethics, and the Culture of Feeling_ (by Michael Bell)\n\n**Week 12 (May 6): Midterm Journal Due**\n\nTopic: Sentimentalism and Ethics\n\nAssigned Readings: “Feeling as Illusion: Rousseau to Proust” and “Modernism and the Attack on Sentiment” from _Sentimentalism, Ethics, and the Culture of Feeling_ (by Michael Bell)\n\n**Week 13 (May 13):**\n\nTopic: Testimony and Literature\n\nAssigned Readings: “Chapter 1 Education and Crisis (by Felman)” and “Chapter 2 Bearing Witness or the Vicissitudes of Listening (by Dori Laub, M.D.)” from _Testimony: Cries of Witnessing in Literature, Psychoanalysis, and History_.\n\n**Week 14 (May 20):**\n\nTopic: Speaking the Unspeakable\n\nAssigned Readings: “Literature in Secret: Crossing Derrida and Blanchot” By Ginette Michaud; Part I of _The Narrow Road to the Deep North_ (pp.3-52)\n\n**Week 15 (May 27):**\n\nTopic: Ethical Ambivalence\n\n“Social Bonds and Psychical Order: Testimonies” by Susannah Radstone; Part II of _The Narrow Road to the Deep North_ (pp. 54-156)\n\n**Week 16 (June 3):**\n\nTopic: A Complete Witness? What Does the Novel See?\n\nAssigned Reading: Part III of _The Narrow Road to the Deep North_ (pp. 159-270)\n\n**Week 17 (June 10):**\n\nTopic: A Complete Witness? What Does the Novel See?\n\nAssigned Reading: Parts IV & V of _The Narrow Road to the Deep North_ (pp. 273-397)\n\n**Week 18 (June 17): Term Paper/Project Due (No class)**\n\n**V. Requirements:**\n\n1\\. Finish assigned readings in advance of each class meeting.\n\n2\\. Follow basic classroom etiquette rules: punctual attendance, and sending a notice in advance when you cannot attend a class meeting.\n\n3\\. Individual Work: Online forum, midterm exam, oral presentation, and term paper/project.\n\n**VI. Grading Policy**: Your grade will be given based on your performance on the following aspects:\n\n1\\. Attendance and participation: online forum and class discussion 40%\n\n2\\. Oral presentation 20%\n\n3\\. Midterm Exam 20 %\n\n4\\. Term Paper/Project 20%\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=923aff63b684499a8cd0281bf05f6e8c&fno=69c6b440a1094461aee4c90aaa7e7a32)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "The lecture will follow the selected topics and points listed on the lecture outline."
        },
        {
            "type": "討論法",
            "note": "From time to time students will be asked to work with their class members on given topics."
        },
        {
            "type": "合作學習",
            "note": "Students have to work their group members on the group presentation."
        },
        {
            "type": "媒體融入教學",
            "note": "Materials from the media will be incorporated in the lecture."
        },
        {
            "type": "其他",
            "note": "Students are encouraged to work on a project that better fulfills their competence and vision. Undergraduate students may choose to work on an academic paper or creative writing to fulfill the requirement of a term project."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 50,
            "note": "Moodle Forum and Term Project"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "Group Project"
        }
    ],
    "prerequisite": "",
    "general_core": []
}