{
    "year": 107,
    "term": 2,
    "name": "行動文學：腳本寫作及其應用",
    "teachers": [
        "楊健威",
        "宋明達"
    ],
    "department": "LU21",
    "code": "ENC9001",
    "credit": 3,
    "serial": 1757,
    "group": "",
    "quota": {
        "limit": 40,
        "additional": 16
    },
    "schedule": [
        {
            "day": 4,
            "from": 8,
            "to": 10,
            "campus": "本部",
            "classroom": "勤301"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "9",
    "dept_group": "",
    "hours": 3,
    "description": "The goals of “Literature in Action” are as followed:\n1. To introduce reflective practice and develop critical thinking; \n2. To engage with and experience a variety of literature and literary activities;\n3 To foster an enthusiasm for literature and provide an insight into the benefits of literacy engagement outside of academia.\n\n“Literature in Action: Writing and Its Applications” is designed to introduce students to the methods of creating scripts for different genres. Students will begin to learn the general guidelines to scriptwriting, followed by three teaching modules. The first module is \"Three Spots\": Public Service Announcements, Program Promotions, and Commercials, all of which emphasize concise and precise writing. The second module is \"Video-game Writing\": The games today attract a growing number of adults, and this means games must offer more than simple plots with only repetitive violence and naive gender stereotypes; the scriptwriting of the video game story will emphasize the needs of the adult players, and at the same time maintain the fun and entertainment of what a game essentially is. The third module is \"Play Writing\": producing a play for performance on stage.",
    "goals": [
        "To write precisely and concisely",
        "To write a good video game story with marketable values and educational purposes",
        "To write a play script"
    ],
    "syllabus": "",
    "methodologies": [
        {
            "type": "",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "",
            "weight": null,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}