{
    "year": 107,
    "term": 2,
    "name": "小說選讀",
    "teachers": [
        "林秀玲"
    ],
    "department": "LU21",
    "code": "ENU0024",
    "credit": 3,
    "serial": 1780,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 1,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "誠701A"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "The aim of this fiction selection course is to provide a general survey of the representative works of fiction by some major British novelists.  In addition to traditional discussion of characterization and plot, we will focus on the historical, social contexts of these works.   For example, Elizabeth Gaskell`s North and South, besides interweaving intriguing twisting plots of traditional romance, provides an acute social criticism of industrialization, class discrepancy, the discrepancy between mill owner and the workers, between the rich and the poor.   We will also pay particular attention on the depiction of London in the nineteenth and early twentieth centuries, especially represented in the works by Charles Dickens, Sir Arthur Conan Doyle, and Oscar Wilde.",
    "goals": [
        "to provide a general survey of the representative works of fiction",
        "focus on the historical, social contexts of these works"
    ],
    "syllabus": "The aim of this fiction selection course is to provide a general survey of the representative works of fiction by some major British novelists.  In addition to traditional discussion of characterization and plot, we will focus on the historical, social contexts of these works.   For example, Elizabeth Gaskell\\`s North and South, besides interweaving intriguing twisting plots of traditional romance, provides an acute social criticism of industrialization, class discrepancy, the discrepancy between mill owner and the workers, between the rich and the poor.   We will also pay particular attention on the depiction of London in the nineteenth and early twentieth centuries, especially represented in the works by Charles Dickens, Sir Arthur Conan Doyle, and Oscar Wilde.  \n\n  \n\nWe will discuss the following works:\n\nElizabeth Gaskell, _North and South_. \n\nCharles Dickens,  _Our Mutual Friend_. \n\n\\-----.  _The Mystery of Edwin Drood_. \n\nOscar Wilde, _The Picture of Dorian Gray_. \n\nSir Arthur Conan Doyle, _The Lost World_. \n\n\\-----.  _The Narrative of John Smith_.   \n\n  \n\nA more detailed syllabus will be announced in the class.  You may start to read these works in the winter break to prepare for the class.",
    "methodologies": [
        {
            "type": "講述法",
            "note": "lecture"
        },
        {
            "type": "討論法",
            "note": "discussion, group discussion, group presentation."
        },
        {
            "type": "專題研究",
            "note": "thematic studies"
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 30,
            "note": "midterm paper"
        },
        {
            "type": "期末考",
            "weight": 30,
            "note": "final paper"
        },
        {
            "type": "課堂討論參與",
            "weight": 15,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 15,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 10,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}