{
    "year": 107,
    "term": 2,
    "name": "高級英語聽講（二）",
    "teachers": [
        "柯珍宜"
    ],
    "department": "LU21",
    "code": "ENU0286",
    "credit": 2,
    "serial": 1826,
    "group": "B",
    "quota": {
        "limit": 25,
        "additional": 20
    },
    "schedule": [
        {
            "day": 2,
            "from": 1,
            "to": 2,
            "campus": "本部",
            "classroom": "誠701A"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大三修習◎必須先修過【ENU0285  高級英語聽講（一）】、【ENU0283  中級英語聽講（一）】、【ENU0284  中級英語聽講（二）】",
    "form_s": "3",
    "classes": "2",
    "dept_group": "",
    "hours": 2,
    "description": "This course focuses on developing and advancing students’ verbal and aural communication skills needed in academic settings. Main areas covered in class include: academic listening, critical thinking, critical listening, listening strategies applications and lecture note taking skills. During this semester, students will listen to and watch a variety of authentic visual and audio materials on various topics. In addition, the course seeks to develop students’ English discussion abilities and verbal communication skills in academic settings.",
    "goals": [
        "focuses on developing and advancing students’ verbal and aural communication skills needed in academic settings.",
        "seeks to develop students’ English discussion abilities and verbal communication skills in academic settings."
    ],
    "syllabus": "**ADVANCED LISTENING—Spring Semester 2019**\n\n**Instructor:**  Jean E. Curran, Office: 誠714\n\n**Office Hours:** Tuesdays, 16:30 – 18:20; Wednesdays, 16:30 – 18:20    \n\n**Email: curran.jean@gmail.com**\n\nGoals  \n  \nThe goal of this course is to build upon the listening skills you have developed in both your basic and intermediate listening classes. These skills include predicting, listening for the main idea, listening for details, critical listening, and vocabulary development. During the course we will listen and watch a variety of authentic materials. A particular focus this year will be the development of notetaking skills for academic lectures.  \n  \nRequirements  \n  \n1\\. Attendance and Preparation  \nIt is very important that you attend class on a regular basis and that you prepare the necessary homework assignments. If you are absent for class on more than two occasions, you will fail the course. Please arrive for class on time. If you are late, points will be deducted from your final grade for the course.  \n  \n2\\. Participation  \nAlthough this class focuses on the development of listening skills, it is also expected that you will be an active participant in the learning process. You should be a critical listener, and contribute to any classroom discussions of the listening topics. 3. Listening—Outside the Classroom  \nYou will be asked to listen to an English program, news broadcast, part of a lecture, film, etc. each week, and write a journal about the program you have listened to. You will be asked to make a listening contract to determine the number of listening journals you will complete this semester. See handout for detailed guidelines.   \n  \nContacting your Instructor: Office hours, Tuesdays, 16:30 - 18:20 and Wednesdays, 16:30 - 18:20, or by appointment. If you prefer to contact me by email, on your message please indicate your name, student number, that you are a student in Advanced Listening, and your concern or question.\n\nSYLLABUS  \nWeek 1:    Orientation to the Course; NorthStar Unit 5: \\`Business Not as Usual\\`  \nWeek 2:    NorthStar Unit 5: \\`Business Not as Usual\\`\n\nWeek 3:    NorthStar Unit 5: \\`Business Not as Usual\\`  \nWeek 4:    Listening to Academic Lectures  \nWeek 5:    NorthStar Unit 6: \\`Together Alone\\`   \nWeek 6:    NorthStar Unit 6: \\`Together Alone\\`    \nWeek 7:    Holiday--Spring Vacation--No Class \n\nWeek 8:    Listening to Academic Lectures   \nWeek 9:    MIDTERM EXAM  \nWeek 10:  NorthStar Unit 7: \\`Learning Through the Arts\\`   \nWeek 11:  NorthStar Unit 7: \\`Learning Through the Arts\\`  \nWeek 12:  Listening to Academic Lectures   \nWeek 13:  \\`Warriors Without Weapons\\`  \nWeek 14:  \\`Spiritual Renewal\\`  \nWeek 15:  \\`Spiritual Renewal\\`  \nWeek 16:  NorthStar Unit 8: \\`Changing Lives for $50\\`   \nWeek 17:  NorthStar Unit 8: \\`Changing Lives for $50\\`   \nWeek 18:  FINAL EXAM",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 60,
            "note": ""
        },
        {
            "type": "期中考",
            "weight": 20,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 20,
            "note": ""
        }
    ],
    "prerequisite": "◎必須先修過【ENU0285  高級英語聽講（一）】、【ENU0283  中級英語聽講（一）】、【ENU0284  中級英語聽講（二）】",
    "general_core": []
}