{
    "year": 107,
    "term": 2,
    "name": "英語語音學",
    "teachers": [
        "甯俐馨"
    ],
    "department": "LU21",
    "code": "ENU6024",
    "credit": 3,
    "serial": 1779,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 2,
            "from": 3,
            "to": 5,
            "campus": "本部",
            "classroom": "正305"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大一修習",
    "form_s": "1",
    "classes": "2",
    "dept_group": "",
    "hours": 3,
    "description": "本課程為語音學（聲音的研究）的入門課程。其主要目的是，透過介紹英語語音學的主要概念，來增加學生對英語音素的認識、培養英語音素的轉錄能力、以及增進英語發音的準確性。本課程的另一個目的是，讓學生熟悉英語以外的其他語言的聲音，特別是台灣和其他亞洲國家使用的語言。課程主題包括發音語音學和描述語音所需的技術術語、音標和用於轉錄英語（和其他語言）的標記符號、語音學的主要概念、以及字母和聲音之間的關係。",
    "goals": [
        "To increase students’ knowledge of the English sounds",
        "To increase students’ ability to transcribe English sounds.",
        "To increase students’ accuracy of the English pronunciation.",
        "To familiarize the students with sounds in languages other than English."
    ],
    "syllabus": "**I. COURSE OVERVIEW**\n\nThe course serves as a general introduction to phonetics, the study of sounds. Its primary purpose is to increase students’ knowledge of the English sounds, ability to transcribe English sounds, and the accuracy of the English pronunciation through the introduction of main concepts of English phonetics. The other purpose of this course is to familiarize the students with sounds in languages other than English, especially those of languages/Chinese dialects spoken in Taiwan and other Asian countries. Topics include articulatory phonetics and the technical terms required for describing speech, phonetic transcription and symbols for transcribing English (and other languages), the main concepts of acoustic phonetics, and the relationship between alphabet and sounds.\n\nA significant portion of the course will utilize the Phonetics Laboratory. Laboratory sessions will consist principally of hands-on work using Praat. Praat will be briefly introduced insofar as it helps students with the class project. See Moodle for lecture slides and supplementary materials. Lab assignments will expose students to fundamental concepts for performing acoustic analysis in Praat.\n\n**II. COURSE EXPECTATIONS**\n\nStudents are expected to read assigned material, attend class, participate in class discussions, complete assignments, and make regular use of the online learning environment.\n\n**III. TEXTBOOK**\n\nPeter Ladefoged & Keith Johnson. (2011) _A Course in Phonetics_. 6th Ed. HBJ.\n\n(available at師大書苑：2F, #182-3, Hoping E. Rd. Taipei, 02-83695556)\n\n**IV. COURSE REQUIREMENTS / GRADING**\n\nThe final course grade will be based on class participation and attendance (10%), assignments (20%), quizzes (10%), midterm exam (20%), final exam (20%), and group project (20%).\n\n**a. Attendance** **(10%)**\n\n*   All student absences will be classified as excused or unexcused.\n*   Absences for the following reasons will be _excused_ if there is timely verification (within 1 week) of such reasons provided to the instructor:\n\n*   Illness or medical emergency\n*   Family emergencies\n*   Pre-arranged medical appointments.\n*   Pre-arranged school-sponsored activities, such as field trips.\n\n*   A Notification of Absence Form has to be submitted online (學生請假系統) within 1 week. Verification document (hard-copy) should also be handed in to the instructor within 1 week. Late submission will not be accepted. A Notification of Absence Form without a verified document will be regarded as an _unexcused_ absence.\n*   Students who are more than 15 minutes late to class will be considered absent.\n*   Students will fail this course if there are more than 3 unexcused absences.\n\n**b. Assignments** **(20%)**\n\nAssignments will consist of the transcription and annotation in Praat. **Late submission will** **be penalized 10% per day.**\n\n**c. Quizzes:**\n\nTwo quizzes will test your comprehension of material covered in class. **No make-up quizzes will be given under any circumstances.**\n\n**d. Exams:**\n\nA midterm exam and a final exam consisting of materials presented in the lectures will be administered in class. **Any student who cheats on an exam would fail the course.**\n\n**\\[Make-up Exam Policy\\]**\n\nThere will be NO make-up exams other than for unavoidable or emergency situations. Relevant documentation is necessary and you must notify me as soon as possible. Relevant documentation must indicate the reason for the absence (e.g., doctor’s note). Note that the instructor makes the official determination about whether to excuse the absence. Exams missed for unacceptable reasons (e.g., getting stuck in traffic, etc.) will be assigned a score of 0. Please note that the exams and your completed answer sheets are not your property. Both must be turned in as you leave the room or you will not receive credit for the exam or quiz.\n\n**e. Group project:**\n\nEach group will orally present a topic on English accent. Opportunities will be given to discuss your work briefly in class and receive comments from your colleagues. Each group should meet with the professor individually to discuss the project well in advance of the deadline.\n\n**V. CLASS SCHEDULE**\n\nYou are expected to do the readings before class on the day they are listed.\n\n**Week**\n\n**Date**\n\n**Content**\n\n**Assignment & Quiz**\n\nWeek 1\n\n2/27\n\nCourse overview\n\nWeek 2\n\n3/6\n\nChapter 1: Articulation and Acoustics\n\nWeek 3\n\n3/13\n\nChapter 1: Articulation and Acoustics\n\nWeek 4\n\n3/20\n\nChapter 2: Phonology and Phonetic Transcription\n\nWeek 5\n\n3/27\n\nChapter 3: The Consonants of English\n\nQuiz 1\n\nWeek 6\n\n4/3\n\nSpring break\n\nWeek 7\n\n4/10\n\nChapter 4: English Vowels\n\n_Lab tutorial_\n\nLab assignment\n\nWeek 8\n\n4/17\n\nChapter 5: English Words and Sentences\n\n_Lab tutorial_\n\nWeek 9\n\n4/24\n\n**Midterm exam**\n\nWeek 10\n\n5/1\n\nChapter 6: Airstream Mechanisms and Phonation Types\n\nWeek 11\n\n5/8\n\nChapter 6: Airstream Mechanisms and Phonation Types\n\n_Lab tutorial_\n\nWeek 12\n\n5/15\n\nChapter 7: Consonantal Gestures\n\n_Lab tutorial_\n\nLab assignment\n\nWeek 13\n\n5/22\n\nChapter 8: Acoustic Phonetics\n\nWeek 14\n\n5/29\n\nChapter 8: Acoustic Phonetics\n\nQuiz 2\n\nWeek 15\n\n6/5\n\nChapter 9: Vowels and Vowel-like Articulations\n\nWeek 16\n\n6/12\n\nChapter 10: Syllables and Suprasegmental Features\n\nWeek 17\n\n6/19\n\nGroup project presentation\n\nWeek 18\n\n6/26\n\n**Final exam**\n\nGroup project due",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Lectures will be given."
        },
        {
            "type": "討論法",
            "note": "In-class discussion is expected."
        },
        {
            "type": "實驗/實作",
            "note": "Lab tutorials will be provided"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "lab assignments"
        },
        {
            "type": "期中考",
            "weight": 20,
            "note": "Midterm exam will be provided"
        },
        {
            "type": "期末考",
            "weight": 20,
            "note": "Final exam will be provided"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Attendance is required"
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "group project"
        },
        {
            "type": "其他",
            "weight": 10,
            "note": "quiz"
        }
    ],
    "prerequisite": "",
    "general_core": []
}