{
    "year": 109,
    "term": 2,
    "name": "大鍵琴（二）",
    "teachers": [
        "張璿"
    ],
    "department": "MU90",
    "code": "MUU0366",
    "credit": 0,
    "serial": 2226,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 0,
            "from": -1,
            "to": -1,
            "campus": "",
            "classroom": ""
        }
    ],
    "programs": [],
    "comment": "此課為個別指導課需繳交個別指導費，需與老師協調上課時間",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 0,
    "description": "1.培養音樂表演專業人才及培養中等學校音樂師資 2.培養學生從事公開演奏(唱)或指導音樂活動之能力 3.協助提升音樂文化水準,擴大社教功能",
    "goals": [
        "彈奏大鍵琴獨奏曲目",
        "理解並活用符合不同時代與地區風格的觸鍵與演奏法",
        "學習大鍵琴數字低音彈奏，並能運用不同風格即興",
        "增進學生對大鍵琴及其對應時代的音樂風格認知"
    ],
    "syllabus": "●學習各種巴洛克時期重要舞曲\n\n  如：Gavotte、Bouree、Pavane、Chacinne、Rigaudon、Sonate等\n\n  並以研討、彈奏的方式做比較\n\n●學習CP.E.BACH的作品。\n\n  如：創意曲、Goldburg Variations選曲\n\n  從中深入學習、培養巴洛克音樂複音音樂的特殊詮解能力\n\n  並於彈奏中演練\n\n●學習G.Bass的伴奏能力\n\n  並與其它樂器合奏，體驗大鍵琴在巴洛克期伴演的角色\n\n注意事項：\n\n1) 開放非師大音樂系的學生，開學後以授權碼選課  \n2) 若沒有修過「大鍵琴(一)」，可修「大鍵琴(二)」\n\n3) 個別課上課時間於第一週前和授課教師聯繫。\n\n4) 上課地點為民族音樂研究所二樓客座教師研究室\n\n5)  學費的部分除了學雜費外，在選課同學在選課結束後註冊組會通知另外繳交0.5學分的個別指導學分費$ 4750\n\nHARPSICHORD SYLLABUS\n\nSTUDIO PRIVATE LESSON POLICIES AND COURSE REQUIREMENTS\n\nSPRING SEMESTERS, 2020\n\nHSUAN CHANG KITANO     \n\nhsuanchangkitano@gmail.com \n\nOffice Hour: T/TH 9a-12p\n\n COURSE POLICIES: \n\n*   There will be a minimum of 14 lessons over the course of the semester. \n*   A lesson missed by a student without providing 24 hours’ notice to the instructor will be regarded as an unexcused absence. In certain circumstances, exceptions to this rule may be made at the discretion of the instructor. Should you be unable to give 24 hours’ notice, you should still let your instructor know that you are not coming, as a matter of courtesy. \n*   The instructor is not obliged to make up unexcused absences. Excused absences will be arrangement at a mutually convenient time\n*   Regardless of notice, repeated cancellations and arrive late are unacceptable. You have an obligation to be at your lesson at the arranged time. \n*   Assessment will be based upon your level of performance, effort, and improvement over the course of the semester, as determined by your instructor. You are entitled to inquire as to your progress at any time. \n*   If you require assistance for a disability, contact the instructor and establish your eligibility for support services through the Office of Disability Services for Students. \n*   If an examination or assignment is scheduled on a religious holiday you observe, or conflicts with a School of Music ensemble engagement or a major professional obligation, please inform your instructor during the first two weeks of class so that reasonable accommodations can be made. \n\nEXPECTATIONS\n\n*   Students are expected to learn **at least** **three pieces in different styles** during the semester. Keep a practice journal and establish repertoire list. \n*   Attend studio class, play in guest master class, and attend student, faculty and professional musical performances.\n*   Use good edition, and refers to first edition and manuscript. \n*   Students should NEVER sight-read and unprepared for lessons. \n*   Write a self-evaluation at the end of the semester; submit an online course evaluation at the end of the semester, \n*   The typical practice obligation a minimum of four hours per week if you are registered for two credit hour, six hours per week if registered for three credits, or 8 hours per week if registered for four credits. If your level of practice does not meet your instructor’s expectations, it is advised that you have a conference about practice techniques and expectations.\n\nEVALUATION: \n\n*   All students should have juries at the end of this semester on **Thursday, June 10th**\n*   A writing assignment of **program notes** for your piece on recitals and presented in studio class. Program note is due 10 days before the jury/recital date. Please be aware that program notes can’t copy from websites or CD liners re the plagiarism policy ([https://www.indiana.edu/~tedfrick/plagiarism/index2.html](https://www.indiana.edu/~tedfrick/plagiarism/index2.html).) As a matter of courtesy, proofreadyour assignment before submit. Below is the general guideline for writing program notes:\n\n1.  Consist of 300–500 words. 2–3 paragraphs.\n2.  Background information on the composer (nationality, birth/death dates, other compositions, interesting career or personal information), context of the composition (where/why/where composed), important concurrent social/cultural/historic events.\n3.  Specific stylistic information about the composition: aspects of melody, harmony, texture, form, rhythm/meter \n4.  **Rhetorical context**—You are writing for a concert-going audience member who already loves the music. Your reader wants the information you provide to help better understand and appreciate the music performed. Your program notes should be informative and entertaining without undue use of musical jargon that your readers may not know. Excellent writing skills with no grammatical errors, misspellings, typos, etc., are important to your successfully communicating to your reader. \n\n*   Develop a repertory list for **at least three pieces in different styles** that shows on Repertory Record Sheet. A practice journal is helpful to keep track of short and long term goals and what to accomplish next. \n*   A pattern of unexcused absences, or general unreliability will affect your grade adversely. More than one unexcused absence will each lower the average grade. For example: for two unexcused absence, the final grade start on A-, three unexcused absence the highest final grade will be on B+. \n*   The semester grade constitutes 50% of the final grade; program note constitutes 10%, the other 40% comes from the jury/recital.\n\nHISTORICAL KEYBOARD INSTRUMENT \n\n*   A newly made Flemish double will be provide for this class\n\nLESSON PLAN\n\nwk 1: Feb. 23 intro _General Guideline: intro the harpsichord_\n\nwk 2: March 2 _slow mvt/early keyboard technique (fingering, articulation, phrase)_\n\nwk 3: March 9 Lesson _Louis Couperin Unmeasured Prelude_\n\nwk 4: March 16 _Prelude_\n\nwk 5: March 23\n\nwk 6: March 30 Bach\n\nwk 7: April 6th, holiday, class doesn’t meet\n\nwk 8: April 12 _theme undecided_\n\nwk 9: April 20 short presentation\n\nwk 10: April 27 studio class\n\nwk 11: May 4 decide pregram\n\nwk 12: May 11 program note due\n\nwk 13: May 18 lesson\n\nwk 14: May 25 lesson\n\nwk 15: June 1 and June 8 Jury week          \n\nFinal wk: June 15/ no lesson",
    "methodologies": [
        {
            "type": "講述法",
            "note": "一對一個別課，依照學生的程度與需求個別授課"
        },
        {
            "type": "討論法",
            "note": "於第一週討論出整學期的學習目標"
        },
        {
            "type": "實驗/實作",
            "note": "實際在2020年全新的Flemish雙鍵盤上實際演練"
        },
        {
            "type": "專題研究",
            "note": "不定時有studio class ，修課同學互相觀摩討論"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 40,
            "note": "學期可專注於一位作曲家風格，例如：巴哈、庫普蘭、法國巴洛克等。做深入的探討，或是接觸大鍵琴曲目。"
        },
        {
            "type": "出席",
            "weight": 40,
            "note": "需要上課出席才能彈的到最新調好音的大鍵琴"
        },
        {
            "type": "成果展覽",
            "weight": 20,
            "note": "學期末以studio class的方式呈現展演，或是錄製影片上傳"
        }
    ],
    "prerequisite": "",
    "general_core": []
}