{
    "year": 110,
    "term": 2,
    "name": "英美帝國的擴張",
    "teachers": [
        "林秀玲"
    ],
    "department": "LM21",
    "code": "ENC1090",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 1569,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 3,
            "to": 5,
            "campus": "本部",
            "classroom": "雲202"
        }
    ],
    "programs": [],
    "comment": "教室位於雲和街大樓2樓（地址：雲和街1號），外系及外校學生需申請門禁權限。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "Discuss the reflection  of imperial expansion on the British Empire"
    ],
    "syllabus": "The course in this semester will be entirely devoted to the expansion of the British Empire from the late eighteenth to the late nineteenth centuries, a pivotal era of British imperialism and Colonialism.   This course will also particularly focus itself on the connection of the British Expansionism and the rise of new scientific discoveries, including botany, zoology and other natural-biological expansion of new species in the newly acquired British colonies and territories.  A larger part of the discoveries of new species (in either plants and animals) in this period stems from naval expeditions, military and scientific.  For instance, the Royal Navy during the George III reign commissioned Captain Cook to travel around the globe to carry out, on the surface, a scientific mission to measure and calculate the Jupiter crossing the Sun, and went on to measure the coast of Austria, New Zealand, and discover the Southern Continent in Cook's first voyage.  Cook's first voyage resulted in the later claiming of Austria and New Zealand to be British colony, which became the exile ground for the criminals of the Britain.  For another instance, the Royal Kew Gardens, London, also dispatched several dozens of plant collectors to the remote places of the World to collect the seeds or the plants of rare or never-seen-before species to be sent back to the Kew.   Regent Parks Zoo Gardens also sent collectors to different corner of the world to collect and send back unusual animals or their speciemens back to the London Zoo.  Many of the Kew Gardens' dispatched plant collectors came to the Far East, including India, Japan, and China (including Hong Kong and Formosa at that time).  Especially after the Opium War, Britain established consulate offices in Hong Kong, Xiamen (Amoy, as spelled in the nineteenth century), Taiwan-fu (today's Tainan) and Tamsui in Formosa.  The British overseas civil servants who work as diplomats, or translators, or medical officers at various consulate offices in China also work as amateur naturalists, collecting specimens and shipping them back to various scientific institutes and establishments in London.  Hence, this semester we will look closely into how the center of the British Empire interacted closely with its peripheral, especially the far-away China regions, especially in this particular regard of the expansion of space (acquired lands and territories as a result of the expanding British military imperialism and economic colonialism) and the expansion of natural sciences (that is, botany, zoology, and marine biology).  \n\nThis rapidly expanded new frontier of the territories and the fastly-developed natural sciences combined together to lay the fertile ground for Charles Darwin's evolutionary theories.   In this class, we will also look closely into Darwin's writing and his cohorts and networking with the preeminent naturalists and scientists in Britain and in the Continent, and other parts of the World.  Darwin also carried out his correspondents with various plant and animal collectors sent out by varied organizations to far corners of the globe.  We will also look into their correspondences and see how the new discoveries contributed to Darwin's evolutionary theories.  \n\n一、     教材內容：內容將含括以下領域：\n\n(一) 科學與海洋探險對科學與進化論的影響。十九世紀下半葉，維多利亞時期，國力達到顛峰，隨著大英帝國的擴張，至各地旅遊探險的自然生物、生態學家、地質學、動、植物分類學、以及達爾文的進化論之影響，仍有待國內學者探討帝國擴張對大英帝國的反省與反思\n\n(二）Travelogues:  Travelogues of Captain Cook。\n\n(三) 達爾文的自然書寫選讀: Selected Readings from the natural writings of Charles Darwin\n\n(四）海洋探險與海盜小說. _Robison Crusoe_, _Treasure Island_, \n\n(五) 探險小說 (Adventure Stories): _Solomon's Treasures_ (Africa), _Around the World in 80 Days_. \n\n(六) 盗寶小說 (Stolen Treasures): _The Moon Stone_, and_The Sign of Four_ (India and London) and \"The Blue Carbuncle\" in the Sherlock Holmes series. \n\n(七) 熱帶病學的興起與熱帶病的小說 (Tropical Diseases) \"The Dying Detective,\" in Sherlock Holmes series. \n\nWeek 1: Introduction\n\nWeek 2: George III, the Independence of American Colony, Lord MaCartney Mission to China, and Captain Cook's three Naval and Scientific Expeditions around the Globe. \n\nWeek 3: Lord MaCartney Mission to China and Botany\n\nWeek 4: Captain Cook's Three Expeditions aroudn the World\n\nWeek 5: Joseph Banks, Botany, Economic Plants and the Royal Society\n\nWeek 6: Science Establishments and the Studies of Botany and Zoology in the late 18th and 19th Centuries: Royal Society, Zoological Gardens, Royal Botanic Kew Gardens, Chelsea Apothecary Gardens.  \n\nWeek 7: Kew Gardens.  History and Directors: Botanists--Sir William Hooker, and Sir Joseph Dalton Hooker.  \n\nWeek 8: Kew Garden Plant Hunters to China (including Hong Kong and Formosa), India, and Japan: Botanists--Robert Swinhoe, Henry Oldham, among others. \n\nWeek 9:  Charles Darwin: The Beagles.\n\nWeek 10-13: Charles Darwin: Selected Writings from his _Origin of Species_, _Orchids_, _Domestication of Animals_, _Expressions of Emotions_. \n\nWeek 14-15: Robert Swinhoe.  Selective Papers by Robert Swinhoe.  \n\nWeek 16: Group Project: Charles Darwin\n\nWeek 17: Presentation\n\nThis is a tentative schedule and syllabus, subject to change and modification after discussing with registered students.",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": ""
        },
        {
            "type": "Group discussion",
            "note": ""
        },
        {
            "type": "Cooperative learning",
            "note": ""
        },
        {
            "type": "Media, audio, visual materials",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "Attendances",
            "weight": 10,
            "note": ""
        },
        {
            "type": "Presentation",
            "weight": 20,
            "note": "Presentation"
        },
        {
            "type": "Case study reports",
            "weight": 70,
            "note": "Final paper"
        }
    ],
    "prerequisite": "◎Unavailable for M.A. program students (M.A. program courses excepted) and B.A. program students.",
    "general_core": []
}