{
    "year": 110,
    "term": 2,
    "name": "現代與當代英文詩選",
    "teachers": [
        "狄亞倫"
    ],
    "department": "LM21",
    "code": "ENC1096",
    "credit": 3,
    "serial": 1571,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 9,
            "to": 10,
            "campus": "本部",
            "classroom": "雲201"
        }
    ],
    "programs": [],
    "comment": "教室位於雲和街大樓2樓（地址：雲和街1號），外系及外校學生需申請門禁權限。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "introduce graduate students to some of the most important recent poetry by British, Irish and American writers",
        "provides students with some exceptionally helpful coordinates for their dealings with the poetry that came afterwards"
    ],
    "syllabus": "**MA Modern and Contemporary Poetry**\n\n**(ENC)**\n\nInstructor: Dr. Aaron Deveson\n\nContact time: three hours per week (plus office hours)\n\n**UNIT OUTLINE**\n\nThe purpose of the course is to introduce graduate students to some important modern and contemporary poetry in English. The course begins with an introduction to important developments from early in the twentieth century and reaches up to very recent work. In the case of some twentieth-century writers studied on the course, the poetry may be considered “recent” or “contemporary” by dint of the fact that it has only recently been “rediscovered.” Poets from the United States, England, Wales, (Northern) Ireland, Australia, Jamaica, and Saint Lucia, are featured on the course.\n\nThemes include:\n\n*   Developments in idiom and form\n*   Traditions and counter-reactions\n*   “Mainstream” vs. “innovative” poetries (in this version of the course there will be slightly more emphasis on the former)\n*   Cosmopolitanism\n*   Cultural authority and post-imperial conditions\n*   Satire and political critique\n*   New secular myths\n*   Ecological poetry and new pastorals\n*   The public and private functions of the poet (and what lies in between, including collaboration)\n*   Sexualities\n*   Poetics and mental health\n\n**TEXTS**\n\nStudents will be presented with a dossier of the poems to be discussed in class. Students will generally be required to read around fifteen pages of poetry in preparation for the class each week.\n\n**ASSESSMENT**\n\nAttendance is, as ever, essential for success.\n\nEssay\n\n(3000-3200 words; 70% of total mark)\n\nStudents will write an essay on the work of two to three poets studied in the course. Students are encouraged to write about poets who were not read together in the same week of the course. Students may devise their own essay title and are not required to cleave to any particular theoretical or methodological principle in their writing. The completed essay should be emailed to [aaron.c.deveson@gmail.com](mailto:aaron.c.deveson@gmail.com). In the case of late submissions, 5% will be deducted from the raw percentage mark for every day by which the assignment is late.\n\nOral and visual presentation\n\n(18-20 mins; 30% of total mark)\n\nThe presenting student will use but not simply read from Powerpoint slides. The presentation will typically introduce the life and work of a particular writer. It must refer in a general way to at least four poems and provide a detailed analysis of one of those poems. It must contain at least three images.\n\n**SCHEDULE**  \n\n**Weeks 1 and 2**\n\nT.S. Eliot\n\n**Week 3**\n\nNancy Cunard and Dylan Thomas\n\n**Weeks 4 and 5**\n\nW.H. Auden and Joan Murray\n\n**Weeks 6**\n\nJohn Berryman and Robert Lowell\n\n**Week 7**\n\nElizabeth Bishop and John Ashbery\n\n**Week 8**\n\n**HOLIDAY**\n\n**Week 9**\n\nW.D. Snodgrass, Sylvia Plath, Anne Sexton, and Sharon Olds\n\n**Weeks 10 and 11**\n\nGary Snyder, Robert Bly, James Wright, Galway Kinnell, A.R. Ammons, and W.S. Merwin\n\n**Week 12**\n\nAdrienne Rich and Les Murray\n\n**Week 13**\n\nFrank O’Hara and John Yau\n\n**Week 14**\n\nTed Hughes and Anne Stevenson\n\n**Week 15**\n\nSeamus Heaney and Eavan Boland (with a nod to W.B. Yeats)\n\n**Week 16**\n\nDerek Walcott and Ishion Hutchinson\n\n**Weeks 17 and 18**\n\nPersonal study\n\n(Electronically send copy of essay by deadline)",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": ""
        },
        {
            "type": "Group discussion",
            "note": ""
        },
        {
            "type": "Other:",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "Presentation",
            "weight": 30,
            "note": ""
        },
        {
            "type": "Case study reports",
            "weight": 70,
            "note": ""
        }
    ],
    "prerequisite": "◎Unavailable for M.A. program students (M.A. program courses excepted) and B.A. program students.",
    "general_core": []
}