{
    "year": 110,
    "term": 2,
    "name": "自傳文學",
    "teachers": [
        "路愷宜"
    ],
    "department": "LM21",
    "code": "ENC1051",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 1567,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 3,
            "to": 5,
            "campus": "本部",
            "classroom": "雲202"
        }
    ],
    "programs": [],
    "comment": "教室位於雲和街大樓2樓（地址：雲和街1號），外系及外校學生需申請門禁權限。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "This course explores the formation of autobiography as a genre and the construction and criticism of it in modern and post-modern eras."
    ],
    "syllabus": "**Life Writing/Narratives: Texts and Contexts**\n\nSpring 2022\n\n**Course description**\n\nThe genre of life writing has become more and more popular, complex and sophisticated over the past thirty years. It has become multi-disciplinary, incorporating multiple media and it also includes a broader range of contributors. Increasingly, therefore, life writing engages with social and political concerns, not only as subject matter but also as matters of style, narrative, and presentation. Focusing on 20th and 21st century texts, the course investigates the changing paradigms of the genre, the intersection of life-writing with other genres, its new media, and current social, political or affective potentialities. The course is also meant to familiarize students with important theoretical debates relevant for the history of the genre.\n\n**Course requirements**\n\nThe course is structured as a series of lecture-seminars, with an introductory talk followed by student presentations and class discussion, in which all students are expected to take part. Students are expected to be familiar with the required readings _prior_ to the seminar, post on Moodle (details will follow), prepare oral presentations focusing on a discussion theme for that week. One oral presentation will be developed into a 3000-4000 word essay in MLA citation style. Please check Moodle regularly, more details about mini response papers, the abstract, outline and annotated bibliography will be posted in due time.\n\nActive participation in class discussions, Moodle grade value: 45% Final paper 55%.\n\n**Academic Dishonesty**\n\nAcademic dishonesty is defined as but not limited to plagiarism, cheating, misrepresenting one’s work, and forging documentation. Academic dishonesty is a serious matter. I am savvy and vigilant in detecting students who use unattributed sources, citing references without indicating the sources or “collaborate” with fellow students during exams. Any student who plagiarizes or cheats will fail the course.\n\n**Readings**: Course pack & handouts on Moodle",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": ""
        },
        {
            "type": "Group discussion",
            "note": ""
        },
        {
            "type": "Cooperative learning",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "other:",
            "weight": 100,
            "note": "Active participation in class discussions, moodle grade value: 40% Final paper 60%."
        }
    ],
    "prerequisite": "◎Unavailable for M.A. program students (M.A. program courses excepted) and B.A. program students.",
    "general_core": []
}