{
    "year": 110,
    "term": 2,
    "name": "英語句法特論",
    "teachers": [
        "颯楊"
    ],
    "department": "LM21",
    "code": "ENC2054",
    "credit": 3,
    "serial": 1579,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 8,
            "to": 10,
            "campus": "本部",
            "classroom": "雲202"
        }
    ],
    "programs": [],
    "comment": "教室位於雲和街大樓2樓（地址：雲和街1號），外系及外校學生需申請門禁權限。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "At the end of the course, the course participants are expected to be able to:  Identify and explain basic terminologies and structural properties in English syntax.",
        "Analyze sentences in English using syntactic theories that have been discussed."
    ],
    "syllabus": "**Course description:**\n\nThis course is concerned with the analysis and understanding of syntactic phenomena, placing emphasis on how the same theoretical tools can be used to analyze different languages. Discussions will involve mostly English and Spanish to a lesser extent, although data from colloquial and non-standard varieties of English, Chinese, German, Japanese, Slavic languages, and other Romance languages will also be considered.\n\nBy the end of the course, students will have an understanding of how syntactic principles operate in English and in other languages and learn about both the variety and universality of these principles.\n\nA term paper (9-10 pages, double-spaced) is due at the end of the semester. Students need to choose a topic to work on in consultation with the instructor and choose between the two options below:\n\nOption one: Review an already published paper on the chosen topic, ideally also presenting original data that supports or provides evidence against the analysis in the article.\n\nOption two: Discuss a specific syntactic phenomenon from a comparative syntax perspective.\n\n**Goal:**\n\n1.  To gain deeper understanding of syntactic principles.\n2.  To help students get familiarized with the literature on syntactic theory and show them how understanding of syntax can improve their own English proficiency.\n3.  To understand how general syntactic tools can be used to analyze not only English but also other languages.\n\n**Schedule:**\n\n_Please note that the course adopts the 16-week schedule:_\n\nWeek 1: Presentation, syllabus discussion\n\nWeek 2: Review of basic concepts in syntax (i)\n\nWeek 3: Review of basic concepts in syntax (ii)\n\nWeek 4: A'-movement (i)\n\nWeek 5: A'-movement (ii)\n\nWeek 6: Head movement (i)\n\nWeek 7: Head movement (ii)\n\nWeek 8: Head movement (iii)\n\nWeek 9: A-movement (i)\n\nWeek 10: A-movement (ii)\n\nWeek 11: Control\n\nWeek 12: Other empty categories (i)\n\nWeek 13: Other empty categories (ii)\n\nWeek 14: Other empty categories (iii)\n\nWeek 15: Student presentations\n\nWeek 16: Term paper due",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "Lectures based on each week's topic."
        },
        {
            "type": "Group discussion",
            "note": "Discussion with students based on their questions about assigned readings."
        }
    ],
    "grading": [
        {
            "type": "Presentation",
            "weight": 70,
            "note": "Term paper (9-10 pages)."
        },
        {
            "type": "Shows/ Exhibitions",
            "weight": 30,
            "note": "Presentation of the term paper topic (5-10 minutes)."
        }
    ],
    "prerequisite": "◎Unavailable for M.A. program students (M.A. program courses excepted) and B.A. program students.",
    "general_core": []
}