{
    "year": 110,
    "term": 2,
    "name": "文化與英語教學",
    "teachers": [
        "孔繁偉"
    ],
    "department": "LM21",
    "code": "ENC3045",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 1583,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "樸105"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "Gain knowledge about some of the main issues in culture and politics discussed in the field of English language education.",
        "Understand theories, perspectives, and arguments related to the above issues.",
        "Explore how the theories, perspectives, and arguments can be incorporated in a potential research study of one’s own interest.",
        "Develop deeper awareness of the roles of Non-native English speaking professional in the ELT field."
    ],
    "syllabus": "### **COURSE DESCRIPTION:**\n\nThis graduate seminar will introduce and review the core issues of English language teaching (ELT) by taking an innovative “practice to theory” approach with a “back-to-front” structure. We will begin with real-world problems and issues, from critical discussion of intervention and how to engage with these salient concerns in the field, before eventually relate these practical issues to theoretical foundations. Students will be introduced to the field of ELT from an applied linguistics perspective including classroom interaction and management; method, post-method and methodology; learners’ issues; and the institutional frameworks and social contexts of ELT. We will identify key dilemmas and practices, as well as examine how teachers and other language teaching professionals intervene and address these concerns, and explore how such issues link to and inform ELT theory and practice these days. Students will be familiarized with the latest practical developments and theoretical insight into several essential issues of ELT such as teaching material, role of technologies, and the teaching of large classrooms in difficult circumstances in various local and international contexts with various cultural factors. Aside from the theories identified, practical and empirical implications will be highlighted throughout to give students more hands-on guidance and direction to localize and contextualize in their own unique teaching environments in today’s global era.\n\n**COURSE OBJECTIVES:**\n\n1\\.   Students will be able to critically understand and internalize the core issues of ELT theoretically\n\n2\\.   Students will be able to be familiar with the current issues and cultural factors in ELT and relate them to their own future practices\n\n3\\.   Students will be able to examine and review existing and upcoming literature in ELT critically and independently\n\n4.   Students will be able to address their own issues in language classrooms from our discussion based on the insight gleaned from the implications identified from the extant literature in ELT\n\n**Class schedule**\n\nWeek 1 Introduction and orientation\n\nWeek 2 The language classroom: roles, relationships and interactions \n\nWeek 3 Intervening in the language classroom: classroom management, interaction and learning opportunities \n\nWeek 4 The language classroom in theory and practice: complex, diverse and local \n\nWeek 5 Language, language learning and method: dilemmas and practices \n\nWeek 6 Language teaching methods: perspectives and possibilities \n\nWeek 7 Theoretical insights for a Postmethod era \n\nWeek 8 Midterm presentation\n\nWeek 9 Focus on the language learner: individual attributes and attitudes \n\nWeek 10 Learner diversity and development: considerations for the language classroom and beyond \n\nWeek 11 Images of language learners: from individual to social, and universal to specific \n\nWeek 12 From global trends to local contexts: language dilemmas in the ELT classroom\n\nWeek 13 Planning and organizing L2 learning and teaching: contexts and curriculum, possibilities and realities \n\nWeek 14 ELT in the world: education and politics, contexts and goals \n\nWeek 15 Review and discussion of current ELT issues in Taiwan \n\nWeek 16 Final presentation",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "Weekly thematic lecture"
        },
        {
            "type": "Group discussion",
            "note": "Discussion-based learning among peers and teacher"
        },
        {
            "type": "Cooperative learning",
            "note": "Collaborative learning for weekly thematic discussion"
        },
        {
            "type": "Case studies",
            "note": "Research proposal demonstrating critical perspectives"
        }
    ],
    "grading": [
        {
            "type": "Midterm Exam",
            "weight": 30,
            "note": "Midterm presentation"
        },
        {
            "type": "Final exam",
            "weight": 40,
            "note": "Final presentation and paper (15% & 25%)"
        },
        {
            "type": "Attendances",
            "weight": 10,
            "note": "Attendance"
        },
        {
            "type": "Presentation",
            "weight": 20,
            "note": "Observation report"
        }
    ],
    "prerequisite": "◎Unavailable for M.A. program students (M.A. program courses excepted) and B.A. program students.",
    "general_core": []
}