{
    "year": 107,
    "term": 1,
    "name": "十九世紀英國小說",
    "teachers": [
        "林秀玲"
    ],
    "department": "LM21",
    "code": "ENC1065",
    "credit": 3,
    "serial": 1602,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 3,
            "to": 5,
            "campus": "本部",
            "classroom": "雲203"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "本課程有系統地介紹十九世紀英國小說及相關社會、歷史與文化等議題。因為有部分學生可能已修過或將選修「十九世紀英國女作家」，因此本課程以男小說家的作品為主，而以女小說家的作品為輔。由於十九世紀英國小說家曾嘗試不同的小說型式，本課程也將逐一介紹這些不同的小說類型的特色，包括有歷史小說、感性小說、成長小說、哥德式小說、鄉土小說、童話小說、科幻小說、以及冒險與奇幻小說等。最後本課程也將介紹十九世紀與後現代的小說理論，以及小說家與小說作品在十九世紀與二十一世紀受歡迎的程度。本課程期望學生對十九世紀英國小說的發展能有通盤且深入的瞭解。 As the Victorian period is arguably the most complex, rapidly-changing and replete with the myriad of social problems and conflicts, such as gender, education, social welfare, poverty, industrialization, and crime, among others, the Victorian fiction reflects many social dimensions.  We hope to explore broadly and also in depth the representative novels of some major writers, such as Charles Dickens, Rudyard Kipling, Sir Arthur Conan Doyle, Wilkie Collins, and Joseph Conrad.   This “Nineteenth-Century Novels” course hopes to focus particularly on several major issues: British imperialism, London cosmopolitanism, crime and industrialization, urbanity, modernity, the genre of Gothic and Detective Fiction, the transition between Victorianism and Modernism.   The issue of transition between Victorianism and Modernism is fascinating.  Some perceive Victorian fiction as forerunner of Modern fiction.  For instance, Raymond Williams argues, that since industrialization and urbanization feature modernity, the dating of British Modernism should start from the Victorian period.  For him, the Victorian period was the beginning of modernism and modernity, and Charles Dickens should be considered as a forerunner of Modernist fiction.  Another major modernist writer, Joseph Conrad, often conceived as the father of Modern fiction, with his complex narratives, actually wrote and published some of his early novels in the late nineteenth century, such as Almayer’s Folly in 1895, An Outcast of the Islands, 1896; “An Outpost of Progress,” 1897; and Heart of Darkness, 1899.  Hence, we will reconsider the issue when Victorianism ends and when Modernism starts.  In the nineteenth century, especially during the Victorian reign, the imperial conflict between China and the British Empire, and two colonial military expeditions to China incurred by the Opium trade play a large part in the period.  Hence, one of the major issues we intend to explore in this course is the representation of China and opium in the Victorian fiction, especially in the novels by the Oscar Wilde, Charles Dickens, Wilkie Collins, and Sir Arthur Conan Doyle.   We will also explore the issues of London cosmopolitanism, as London being the epicenter of the British Empire.  We will investigate the connection between London as the capital of the British Empire and its peripherals and colonies, especially India and China.  Opium smoking in London seems to play a significant part in late Victorian writing.  Some of the novels by Dickens, Collins and Wilde in our reading list depict the opium dens in London’s East End, while Kipling’s stories depict the opium factory in India.",
    "goals": [
        "rovides students in the program with an in-depth introduction to the major novelists and related social and cultural issues in nineteenth-century England."
    ],
    "syllabus": "Male Novelists\n\nAuthors\n=======\n\nNovels\n======\n\nWalter Scott\n\n(1771-1832)\n\n_Waverley_ (1814)\n\n1830s\n\nCharles Dickens\n\n(1812-70)\n\n#### _David Copperfield_\n\n(1849-50)\n\n_Bleak House_ (1852-53)\n\n_Hard Times_ (1854)\n\n_A Tale of Two Cities_ (1859)\n\n  _Great Expectations_\n\n(1860-61)\n\n1850s\n\nWilliam Makepeace Thackeray (1811-63)\n\n_Vanity Fair_ (1848)\n\n1860s\n\nAnthony Trollope (1815-1882)\n\n_Orley Farm_ (1862)\n\n_The Small House of Allington_ (1864)\n\n_Phineas Finn_ (1869)\n\n1880s\n\nGeorge Meredith (1828-1909)\n\n_The Ordeal of Richard Feverel_ (1859)\n\n_The Egoist_ (1879)\n\nWalter Pater (1839-1894)\n\n_Marius the Epicurean_ (1885)\n\n1890s\n\nThomas Hardy (1840-1928)\n\n_Far from the Madding Crowd_ (1874)\n\n_The Return of the Native_ (1878)\n\n_Tess of the D’Urbervilles_ (1891)\n\n_Jude the Obscure_ (1896)\n\nOscar Wilde (1854-1900)\n\n### _The Picture of Dorian Gray_ (1891)\n\n  Female Novelists (輔助教材)\n\nAuthors\n\nNovels\n\nJane Austen (1775-1817)\n\n_Pride and Prejudice_ (1813)\n\n_Sense and Sensibility_ (1811)\n\nMary Wollstonecraft Shelley (1797-1851)\n\n_Frankenstein_ (1818)\n\n1840s\n\nCharlotte Brontë\n\n  (1816-55)\n\nEmily Brontë\n\n  (1818-48)\n\n_Jane Eyre_ (1847)\n------------------\n\n_Wuthering_ _Heights_ (1847)\n\n1870s\n\nGeorge Eliot (1819-80)\n\n_Adam Bede_ (1859)\n\n_The Mill on the Floss_ (1860)\n\n_Middlemarch_ (1871-72)\n\nBrantlinger, Patrick, and William B. Thesing, eds. _A Companion to the Victorian Novel_. Malden, Mass.: Blackwell, 2002.  \n  \n\nMajor Issues:\n\nPart I:  Historical Issues and Cultural Issues\n\n  Education, Literacy, and the Victorian Reader\n\n  Money, the Economy, and Social Class\n\n  Victorian Psychology\n\n  Empire, Race, and Victorian Novel\n\n  The Victorian Novel and Religion\n\n  Scientific Ascendancy\n\n  Technology and Developments: Accelerating Developments\n\n  Laws, the Legal World, and Politics\n\n  Gender Politics and Women’s Rights\n\n  The Other Arts: Victorian Visual Culture\n\n  Imagined Audiences: The Novelist and the Stage\n\n  Gender and Sexuality in the Victorian Novel\n\nPart II: Forms of the Victorian Novel\n\n  Newgate Novel to Detective Fiction\n\n  The Historical Novel\n\n  The Sensation Novel\n\n  The Bildungsroman\n\n  The Gothic Romance in the Victorian Period\n\n  The Provincial or Regional Novel\n\n  The “Industrial” or “Conditions of England” Novels\n====================================================\n\n  Children’s Fiction\n\n  Victorian Science Fiction\n\n  Victorian romance: romance and mystery\n\nNineteenth-century Adventure and Fantasy: James Morier, George Meredith, Lewis Carroll and Robert Louis Stevenson\n\nPart III: Victorian and Modern Theories of the Novel and the Receptions of Novels and Novelists Then and Now\n\n  The Receptions of Charlotte Brontë, Charles Dickens, George Eliot, and Thomas Hardy\n\n  Victorian Theories of the Novel\n\n  Modern and Postmodern Theories of Prose Fiction\n\n  The Afterlife of the Victorian Novel: Novels about Novels\n\n  The Victorian Novel in Film and Television",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 15,
            "note": "Midterm paper, 4 pages"
        },
        {
            "type": "課堂討論參與",
            "weight": 15,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 60,
            "note": "Final paper, 10 pages"
        }
    ],
    "prerequisite": "",
    "general_core": []
}