{
    "year": 107,
    "term": 1,
    "name": "傅柯與宗教",
    "teachers": [
        "王慧華"
    ],
    "department": "LM21",
    "code": "ENC1085",
    "credit": 3,
    "serial": 1603,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 5,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "雲204"
        }
    ],
    "programs": [],
    "comment": "上課教室在雲和街大樓二樓，地址為雲和街1號(位於雲和小火鍋斜對面、Cafe a la mode正對面)，從師大側門右轉看見Starbucks右轉進入巷子步行約2分鐘(130公尺)，右手邊就會看到雲和街大樓，亦可使用Google Maps APP查詢位置。請同學使用學生證感應，進出雲和街上課教室。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "本課程目標有三: 一為取徑於傅柯對宗教或宗教實踐的探討，來闡明其風靡學術界的概念; 二為揭露傅柯宗教研究中之基本信念或預設，並將他的預設，拿來和作為其研究對象之宗教實踐的預設，做相互參照; 三為指出傅柯對宗教實踐的系譜學式研究，對前現代之前的人文研究之啟發，並借重其他歷史學家對相同宗教實踐的歷史性研究，來評估其理論式剖析的利弊得失。\nThe aim of the course is threefold.  First, it attempts to illuminate key concepts in Foucault by highlighting his discussion of religion or religious practices.  The course proposes that it is partly, if not mainly, by way of these religious practices that Foucault makes his popular ideas tangible and elaboration of them possible.  The second purpose of the course is to unveil Foucault’s “beliefs” or assumptions as response to the major concerns of various religious denominations.  It is argued that Foucault, despite his questioning of our assumptions on, for example, power, truth, sexuality, cannot get away from assumptions, shifting as they can be in his works, to initiate his argument.  Finally, the course points out how Foucault inspires pre-modern studies of humanities by his genealogical study of religious practices.  His study is to be measured against some historians’ research on the same practices, in order that students may acquire a critical mentality in facing this academic guru.",
    "goals": [
        "First, it attempts to illuminate key concepts in Foucault by highlighting his discussion of religion or religious practices.",
        "The second purpose of the course is to unveil Foucault’s “beliefs” or assumptions as response to the major concerns of various religious denominations.",
        "Finally, the course points out how Foucault inspires pre-modern studies of humanities by his genealogical study of religious practices."
    ],
    "syllabus": "  \n \n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=fa48e1af21714dab841f72977b0c0a1c&fno=86047b7fb376431a8e38f951321e2058)",
    "methodologies": [
        {
            "type": "其他",
            "note": "請見教學進度與主題附件"
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": "請見教學進度與主題附件"
        }
    ],
    "prerequisite": "",
    "general_core": []
}