{
    "year": 107,
    "term": 1,
    "name": "城市文學專題",
    "teachers": [
        "蘇榕"
    ],
    "department": "LM21",
    "code": "ENC1112",
    "credit": 3,
    "serial": 1606,
    "group": "",
    "quota": {
        "limit": 20,
        "additional": 8
    },
    "schedule": [
        {
            "day": 3,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "雲203"
        }
    ],
    "programs": [],
    "comment": "上課教室在雲和街大樓二樓，地址為雲和街1號(位於雲和小火鍋斜對面、Cafe a la mode正對面)，從師大側門右轉看見Starbucks右轉進入巷子步行約2分鐘(130公尺)，右手邊就會看到雲和街大樓，亦可使用Google Maps APP查詢位置。請同學使用學生證感應，進出雲和街上課教室。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "This course highlights the interaction between urban space and the representations of urban specificities in the context of postmodern/postcolonial discourses.  It is designed to help students better understand such concepts as the city, space, and the flâneur. It is hoped that through a perusal of critical theories and in-depth textual practice, students have a thorough grasp of important issues in urban studies.\n     The course organization will include three interrelated parts.  First, we will begin with perusing critical discourses concerning the concept of the city, the configuration of space in the city, and the role the flâneur plays in the formation of urban landscape.  Secondly, the course will include a theoretical application of the above discourses to several novels and films.  We will discuss the relations among urban narratives, cultural production, and representation.  It is hoped that through a training of dialectical thinking, students can understand how the representations of urban lives and cultural production reflect off the heterogeneous spaces overlooked as well as how the urban representation provides a site of ideological wrestling.  Thirdly, students are also required to study a set of significant key terms often encountered in urban studies.  Equipped with a sound knowledge of urban studies, students are expected to synthesize the three parts and explore the interaction between urban narratives and contemporary cultural products.",
    "goals": [
        "To explore and investigate how urban lives and urban representations inflect with the output of cultural production and reflect off the heterogeneous spaces overlooked.",
        "To unravel how urban representations and configurations provide the specific sites of ideological wrestling.",
        "To critique and reevaluate the aesthetics and politics of urban representations by exploring the nuanced interaction between urban narratives and contemporary cultural products."
    ],
    "syllabus": "\\*為尊重智慧財產權，上課請勿錄影錄音\n\n**Textbooks &course organization:** \n\nAtentative syllabus based on the reference listed below will be distributed inthe first class meeting and may be slightly revised after discussing with thestudents.\n\nWeek\n\nDate\n\nReading assignment**/**Class Activity\n\nNote\n\n1\n\n9/12\n\nIntroduction\n\n介紹本學期課程及要求\n\n2\n\n9/19\n\nGottdiener, M. and Leslie Budd.  _Key Concepts in Urban Studies_.\n\n3\n\n 9/26\n\nSassen, Saskia. “Introduction: Whose City Is It? Globalization and the Formation of New Claims.”  _Globalization and Its Contents._ \n\n_Dirty Pretty Things_\n\n4\n\n10/03\n\nPoe, Edgar Allan. “The Man of the Crowd.”\n\nBaudelaire, Charles. “The Painter of Modern Life.” _The Painter of Modern Life and Other Essays._  chapter 1\n\n \n\n5\n\n10/10\n\nNational Holiday.\n\nThe school is closed for one day. No Class\n\n6\n\n10/17\n\nGuest Speaker\n\n (TBA)\n\n7\n\n 10/24\n\nBenjamin, Walter. “The Flâneur.” _Charles Baudelaire: A Lyrical Poet in the Era of High Modernism_.\n\n8\n\n10/31\n\nJenks, Chris.  “Watching Your Step: The History and Practice of the Flâneur.”  _Visual Culture._\n\n \n\n9\n\n 11/07\n\nGeorg Simmel, “Metropolis and Mental Life.” _Simmel on Culture_ and other essays.\n\n \n\n10\n\n11/14\n\nde Certeau, Michel. “Walking in the City.” _The Practice of Everyday Life_\n\n \n\n11\n\n11/21\n\nLively, Penelope. _City of the Mind_\n\n \n\n12\n\n11/28\n\nOrwell, George. _Down and Out in Paris and London_\n\n13\n\n12/05\n\nOrwell, George. _Down and Out in Paris and London_\n\n14\n\n12/12\n\nEileen Chang. “Love in a Fallen City”\n\n \n\n15\n\n12/19\n\nChu Tien-hsin. _The Ancient Capital_\n\n \n\n16\n\n12/26\n\nPai Hsien-yung. _Taipei People_\n\n \n\n17\n\n1/02\n\nFinal paper proposal presentation\n\n18\n\n1/09\n\nIndividual Conference\n\nFinal paper Due: Jan 9\n\n\\*Please make an appointment in Moodle in week 16.\n\n**Teaching method:**\n\nThecourse will be run as a seminar combined with lectures.\n\n**Grading Policy:**attendance, participation, oral presentations 40%\n\nmid-term 30% :(a one-two page proposal of your final paper)\n\n              final paper 30% : (awell-organized scholarly paper; the ideal length of the paper will be 10-15 ppfor MA students and 15-20pp for PhD students)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "The course will be run as a seminar combined with lectures."
        },
        {
            "type": "討論法",
            "note": "active participation in the in-class discussion is a must for every student."
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": "Multi-media teaching resources may be used."
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": "Grading Policy:attendance, participation, oral presentations 40%\n\nmid-term 30% :(a one-two page proposal of your final paper)\n\n              final paper 30% : (awell-organized scholarly paper; the ideal length of the paper will be 10-15 ppfor MA students and 15-20pp for PhD students)"
        }
    ],
    "prerequisite": "",
    "general_core": []
}