{
    "year": 107,
    "term": 1,
    "name": "英語科課程設計與教材評估",
    "teachers": [
        "葉錫南"
    ],
    "department": "LM21",
    "code": "ENC3033",
    "credit": 3,
    "serial": 1612,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "雲201"
        }
    ],
    "programs": [],
    "comment": "上課教室在雲和街大樓二樓，地址為雲和街1號(位於雲和小火鍋斜對面、Cafe a la mode正對面)，從師大側門右轉看見Starbucks右轉進入巷子步行約2分鐘(130公尺)，右手邊就會看到雲和街大樓，亦可使用Google Maps APP查詢位置。請同學使用學生證感應，進出雲和街上課教室。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "Course Description This course introduces major approaches to language course design with reference to major teaching methods, and principles/techniques.  It also discusses the English language syllabus/curriculum designs in Taiwan and some Asian countries.  Students will survey and compare various kinds of English teachings materials and will be provided with the guidelines for analyzing and evaluating EFL coursebooks.  They will also learn how to select, adapt and even write English teaching materials.   In sum, the objectives to be achieved in this course include: 1.\tproviding the theoretical background of syllabus design, 2.\tproviding an overview of the major types of syllabus design,  3.\tproviding guidelines for analyzing, evaluating and developing EFL materials, 4.\treviewing the English language syllabuses adopted in Taiwan, 5.\tevaluating some EFL teaching materials used in Taiwan, 6.\tdeveloping students’ competence in designing a curriculum or program, 7.\tdeveloping students’ competence in selecting, adapting, and writing EFL materials at a particular level, elementary, junior high, senior high, and so forth. In the first several weeks of this course, the instructor will lecture on, and lead discussion of, the curriculum development model/procedure proposed by J. C. Richards (2001). Then, students in turn will be responsible for the presentation of articles assigned by the instructor.  A term paper is required addressing any issues regarding curriculum development.  Besides, a group project (in groups of three people) will be needed evaluating any set(s) of local EFL materials from the perspectives of syllabus design.",
    "goals": [
        "探究課程規劃的理論；解析現有課程的規劃理念、架構與流程；根據理論，規劃小型課程。",
        "學習、探討教材編纂理論；解析現有課程的教科書內容、編纂理念與架構及流程；根據理論，比較不同版本教科書的特質、探究其理念；編寫微型教材。"
    ],
    "syllabus": "Course Description\n\nThis course introduces major approaches to language course design with reference to major teaching methods, and principles/techniques.  It also discusses the English language syllabus/curriculum designs in Taiwan and some Asian countries.  Students will survey and compare various kinds of English teachings materials and will be provided with the guidelines for analyzing and evaluating EFL coursebooks.  They will also learn how to select, adapt and even write English teaching materials.  A Guest speaker will be invited to share his/her first-hand experience in materials writing. \n\nIn sum, the objectives to be achieved in this course include:\n\n1.  providing the theoretical background of syllabus design,\n2.  providing an overview of the major types of syllabus design,\n3.  providing guidelines for analyzing, evaluating and developing EFL materials,\n4.  reviewing the English language syllabuses adopted in Taiwan,\n5.  evaluating some EFL teaching materials used in Taiwan,\n6.  developing students’ competence in designing a curriculum or program,\n7.  developing students’ competence in selecting, adapting, and writing EFL materials at a particular level, elementary, junior high, senior high, and so forth.\n\nIn the first several weeks of this course, the instructor will lecture on, and lead discussion of, the curriculum development model/procedure proposed by J. C. Richards (2001). Then, students in turn will be responsible for the presentation of articles assigned by the instructor.  A term paper is required addressing any issues regarding curriculum development.  Besides, a group project (in groups of three people) will be needed evaluating any set(s) of local EFL materials from the perspectives of syllabus design.\n\n**Textbook and Materials:**\n\n1.  Richards, Jack C.  2001.  Curriculum Development in Language Teaching.  Cambridge: Cambridge University Press.\n\n### 2\\. Course packet (With 28 articles inside).\n\n### TENTATIVE SYLLABUS\n\nWeek\n\n**Date**\n\n**Chapter**\n\n**Topic**\n\n1\n\n09/12\n\nIntroduction\n\n2\n\n09/19\n\nChaps. 1-2 (Richards)\n\n(1)  The origins of language curriculum development.\n\n(2)  From syllabus design to curriculum development\n\n3\n\n09/26\n\nChaps. 3 (Richards)\n\n(1)   Needs analysis\n\n4\n\n10/03\n\nChap. 4\n\n(1) Situation analysis\n\n5\n\n10/10\n\n \n\nNational Holiday\n\n6\n\n10/17\n\nChaps. 5-6 (Richards)\n\n(1) Planning goals and learning outcomes\n\n(2) Course planning and syllabus design\n\n7\n\n10/24\n\n#1-3 (Packet)\n\n**_(1) The evolution of syllabus design: Structural, situational, notional, functional-notional, analytic vs. synthetic_** **_(Yalden 1987, Chap. 2)_**\n\n_(2) Proportional approach_  _(Yalden 1987, Chap. 7)_\n\n_(3)Product(-oriented) syllabus  (Nunan 1988, Chap. 3)_\n\n8\n\n10/31\n\n#4-6 (Packet)\n\n_(1)Process(-oriented) syllabus  (Nunan 1988, Chap. 4)_\n\n_(2) Three approaches to task-based syllabus design_ _(Long & Crookes, 1992)_                      \n\n_(3) A critical analysis of the advocacy of the task-based syllabus (Sheen,1994,)_\n\n9\n\n11/07\n\n\\# 7, 31, 9 (Packet)\n\n_(_\n\n_(1) Content-based, Task-based, and Participatory Approaches_ _(Larsen-Freeman, 2000, Chap. 10)_\n\n_(2) **Learner-centeredness: An overview of trend**_  **_(Tudor ,1996, Chap.1)_**_)_\n\n_(3) Innovations in second and foreign language teaching_ _(Markee 1997_\n\n10\n\n11/14\n\n#10-13 (Packet)\n\n_(1) A historical perspective on ESP_  _(Dudley-Evans & St John, 1998, Chap.2)_\n\n_(2) English for specific purposes: Criteria for course design  (Widdowson, 1987)_\n\n_(3) Language issues in ESP_  _(Dudley-Evans & St John, 1998, Chap. 5)_\n\n**_(4) Creating a new language arts curriculum for high-ability learners_**  _(Vantassel-Baska, 1996)_\n\n11\n\n11/21\n\n \n\nWrap-up of curriculum development\n\nCase study of curriculum study in Taiwan: (1) Grades 1-9 Curriculum Guidelines; (2) Curriculum Guidelines for Senior High School English\n\n12\n\n11/28\n\nChaps. 7,9 (Richards)\n\n#14\n\n(1) Providing for effective teaching\n\n(2) _The domains of curriculum and their study_ _(Goodlad, 1979, Chap. 2)_ \n\n(3) Program evaluation\n\n13\n\n12/05\n\n#15, 16\n\nChap. 8 (Richards)\n\n(1) _Guidelines for the evaluation of language education_ _(Alderson &Beretta. III)_\n\n(2) **_Historical perspectives: Language program evaluation_ and applied linguistics** _(Kiely & Rea-Dickins, 2005 ,Chap.4)_\n\n(3) The role and design of instructional materials\n\n14\n\n12/12\n\n#17-19 (Packet)\n\n_(1) Appropriate design: the internal organization of course units_ _(Low, 1989, in Johnson ed. The second language curriculum)_\n\n_(2) A framework for materials writing_ _(Jolly & Bolitho, 1998, selected from Tomlinson. (ed.). Materials development in language teaching)_\n\n_(3) Designing instructional materials for teaching listening comprehension_ _(Richards 1990, Chap. 3)_\n\n15\n\n12/19\n\n#20-22 (Packet)\n\n_(1) Focusing on process: materials that deal with sociocultural appropriateness_   _(D& O, 1986, Chap. 7)_\n\n_(2)_ _Focusing on product: materials that deal with the reading skill (D& O, Chap. 9)_\n\n_(3) Coursebooks and conversational skills_  _(Cunningsworth, 1987)_\n\n16\n\n12/26\n\n#23-25\n\n#34\n\n(Packet)\n\n_(1) **Materials**_  _(Brown, 1995)_\n\n_(2) Authenticity in the language classroom_   _(Breen, 1985)_\n\n(3) _Materials adaptation: Why leave it all to the teacher?_  _(Clarke, David )_\n\n_(4) Introducing Change_  _(Nation & Macalister,2010, Chap.12)_\n\n17\n\n01/02\n\n#26-28 (Packet)\n\n_(1)Textbook selection and evaluation_   _(Skierso, 1991)_\n\n_(2)__五十多年來高中英文教材中文與英語角色之演變 (__柯宜中, 2011)_\n\n_(3)Differentiated Instruction (chaps. 1,2 & 11, C. A. Tomlinson, 2001)_\n\n18\n\n01/09\n\nPaper due\n\n**Note: Articles in italic are to be presented by students.** \n\n**REQUIREMENT**\n\n1\\. Oral presentation of assigned articles.  30%\n\n2\\. A term paper:                     30%\n\n (a) An empirical study: Designing a language program for a particular group of students (e.g., an adult English program at YMCA)\n\n (b) An empirical study: A needs analysis for an EFL program\n\n(c) A review of any topic related to curriculum development, e.g., authenticity of EFL materials, learner-centeredness, etc.)\n\n1.  Group project (groups of four): Analysis of two sets of senior high English textbooks (three sets for junior high) in terms of syllabus design          30%\n\n**\\* To be uploaded to Moodle for sharing (in place of oral presentation in class).**\n\n1.  Attendance and active participation during discussion in class.   10%",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 40,
            "note": ""
        },
        {
            "type": "成果展覽",
            "weight": 30,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}