{
    "year": 107,
    "term": 1,
    "name": "電腦與語言教學",
    "teachers": [
        "陳浩然"
    ],
    "department": "LM21",
    "code": "ENM3019",
    "credit": 3,
    "serial": 1599,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 2,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "雲202"
        }
    ],
    "programs": [],
    "comment": "上課教室在雲和街大樓二樓，地址為雲和街1號(位於雲和小火鍋斜對面、Cafe a la mode正對面)，從師大側門右轉看見Starbucks右轉進入巷子步行約2分鐘(130公尺)，右手邊就會看到雲和街大樓，亦可使用Google Maps APP查詢位置。請同學使用學生證感應，進出雲和街上課教室。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "A research topic list \n\n1. AIML \n2. Grammar checker evaluation- Several possible topics \n3. SynctoLearn evaluation \n4. TTS evaluation for Listening purposes \n5. ASR system evaluation like MyET or Else? \n6. Text ladder evaluation \n7. Evaluation of video conferencing systems for language learning \n8. evaluating Moodle as course platform \n9. evaluation of Collocation tool for v and writing \n10. evaluation of large corpus search engines? \n11. evaluation of Cell phone for language learning \n12. evaluation of Pocket PC for language learning \n13. evolution of laptop for language learning \n14. evaluation of online dictionaries for reading \n15. evaluation of CMC as tool of learning video or chartrooms \n16. cross cultural exchanges \n17. evaluating learning in second life \n18. evaluating a popular game for SL learners. \nMore can be added to the list here.",
    "goals": [
        "to have solid understanding about CALL."
    ],
    "syllabus": "Meeting 1. Overview of this course and hands-on moodle in the language lab  \nMeeting 1. CALL: Overview and CMS  \n  \n1\\. Brandl, C. (2005) ARE YOU READY TO \"MOODLE\"? Language Learning & Technology Vol. 9, No. 2, May 2005, pp. 16-23  \n2\\. Chapelle, carol (2001) Chapelle, C. (2001). Computer applications in second language acquisition: Foundations for teaching, testing, and research. Cambridge: Cambridge University Press.  \n  \nMeeting 2. CALL & vocabulary Lexicaltutor web site  \n1\\. Horst, M. et al. 2005. Expanding Academic Vocabulary With An Interactive On-Line Database Language Learning & Technology Vol. 9, Issue. 2, pp. 90-110.  \n2\\. Yoshii, M. (2006). L1 and L2 glosses: Their effects on incidental vocabulary learning. Language Learning and Technology, 10, 85-101  \n  \nMeeting 3. CALL and Listening VOA —CNN sync web site  \n1\\. Linda C. Jones (2006) Listening Comprehension in Multimedia Environments. In CALICO 2006 Monograph.  \n2\\. Grgurović, M. & Hegelheimer, V. (2007). Help options and multimedia listening: Students' use of subtitles and the transcript. Language Learning & Technology, 11(1), 45-66.  \n3\\. Fernando Rosell-Aguilar (2007) Top of the Pods﹘In Search of a Podcasting “Podagogy” for Language Learning  \nComputer Assisted Language Learning, Vol. 20, No. 5pp. 471-492.   \n  \nMeeting 4. CALL and Speaking I NTNU speech or MyET  \n1\\. Mary Grantham O'Brien (2006) Teaching Pronunciation and Intonation with Computer Technology. In CALICO 2006 Monograph.  \n2\\. Chiu, T.-L., Liou, H.-C., & Yeh, Y. (2007). A Study of web-based oral activities enhanced by Automatic Speech Recognition for EFL college learning Computer Assisted Language Learning, 20(3), 209-233.  \n3\\. Engwall, O., & Balter, O. (2007). Pronunciation feedback from real and virtual language teachers. Computer Assisted Language Learning, 20(3), 235-262  \n  \nMeeting 5 CALL and speaking II NTNU chatbot  \n1\\. Stewart, I. A. D., & File, P. (2007). Let's Chat: A conversational dialogue system for second language practice. Computer Assisted Language Learning, 20(2), 97 - 116.  \n2\\. David Coniam (2008) An Evaluation of Chatbots as Software Aids to Learning English as a Second Language. ReCALL 20 : 98-116 Cambridge University Press  \n3\\. Hardison D. Generalization of Computer-Assisted Prosody Training: Quantitative and Qualitative Findings. In. Language Learning and Technology, January 2004, ...  \n  \nMeeting 6 CALL and Reading CANDLE reading site  \n1\\. Dorothy M. Chun (2006) CALL Technologies for L2 Reading. In CALICO 2006 Monograph.  \n2\\. Cobb, Tom. 2007. “Computing the Vocabulary Demands of L2 Reading.” Language Learning and Technology. 11(3). pp.38-63.  \n  \nMeeting 7. CALL and Writing (I) E-rater samples  \n  \n1\\. Burstein, J., Chodorow, M., & Lea\\*\\*, C. (2004). Automated essay evaluation: The Criterion Online Writing Evaluation service. AI Magazine, 25(3), 27-36.  \n2\\. Chen, Chi-Fen Emily, & Wei-Yuan Eugene Cheng, (2008) \"Beyond the Design of Automated Writing Evaluation: Pedagogical Practices and Perceived Learning Effectiveness in EFL Writing Classes\" (V12N2)  \n  \n  \nMeeting 8 CALL and Writing (II) NTNU collocation tools  \n1\\. Chambers, A. 2005. 'Integrating corpus consultation in language studies'. Language Learning and Technology, 9 (2): 111-125. ...  \n2\\. Yoon, H., & Hirvela, A. (2004). ESL student attitudes toward corpus use in L2 writing. Journal of Second Language Writing, 13, 257-28  \n  \nMeeting 9. Computer mediated communications Moodle Dimdim and Gong  \n1\\. Zsuzsana I. Abrams (2006) From Theory to Practice: Intracultural CMC in the L2 Classroom. In CALICO 2006 Monograph.  \n2\\. Lara Lomicka (2006) Understanding the Other: Intercultural Exchange and CMC. In CALICO 2006 Monograph.  \n3\\. Chapelle C. (2004) Learning through online communication: Findings and implications from second language research. Draft online  \n  \nMeeting 10. CALL and Grammar (I) evaluation of feedback NTNU Grammar checker  \n1 .Junko Otoshi, An Analysis of the Use of Criterion in a Writing Classroom in Japan jaltcall.org/journal/articles  \n2\\. Wang, J., & Brown, M.S. (2007). Automated essay scoring versus human scoring: A comparative study. Journal of Technology, Learning, and Assessment, 6(2). ...  \n  \n  \nMeeting 11. CALL and Grammar (II) users  \n1\\. Liou Hsien-Chin, “Development of an English Grammar Checker A Progress Report”, CALICO Journal, vol. 9, No. 1, pp 57-70, Autumn 1991.  \n2\\. Hsien-Chin Liou, Samuel H. Wang, Yuli Hung-Yeh, 1992, \"Can grammatical CALL help EFL writing instruction?\" CALICO Journal 10: 23-44  \n  \nMeeting 12. CALL and Corpus The corpus search  \n1\\. Chan, T. P., & Liou, H. C. 2005. Effects of web-based concordancing instruction on EFL students’ learning of verb-noun collocations. Computer Assisted Language Learning, 18(3), 231-250  \n2\\. Yu-Chia Chang, Jason S. Chang, Hao-Jan Chen, and Hsien-Chin Liou. 2008. An automatic collocation writing assistant for Taiwanese EFL learners: A case of corpus-based NLP technology. Computer Assisted Language Learning, 21(3): 283-299.  \n  \nMeeting 13. =Virtual World in Second Life Second Life site  \n1\\. James Paul Gee (2006) Are Video Games Good for Learning? Keynote address at Curriculum Corporation 13th National Conference, Adelaide.  \n2\\. Marc Prensky (2003) Escape from Planet Jar-Gon Or, What Video Games Have to Teach Academics About Teaching And Writing. On The Horizon, Volume 11 No 3.  \n  \nMeeting 14. CALL and Natural Language Processing NTNU checker and TTS  \n1\\. Coniam, D. (2004). Using Language Engineering Programs to Raise Awareness of Future CALL Potential. Computer Assisted Language Learning, 17(2), 149-175.  \n2\\. Handley, Z and Hamel, M-J (2005). Establishing a Methodology for Benchmarking Speech Synthesis for Computer-Assisted Language Learning (CALL). Language Learning and Technology. 9 (3): 99-120.  \n3\\. Md. Jahangir Alam, Naushad UzZaman and Mumit Khan (2006) N-gram based Statistical Grammar Checker for Bangla and English  \n3-1 Jonas Sjobergh (2005)  \nChunking: an unsupervised method to find errors in text.  \n  \nMeeting 15. CALL and Mobile Learning. Mobile phone demo SMS  \n1\\. Thornton, P., & Houser, C. (2005). Using Mobile Phones in English Education in Japan. Journal of Computer Assisted Learning, 21, 217-228.  \n2\\. Stockwell, G. (2007). Vocabulary on the move: Investigating an intelligent mobile phone-based vocabulary tutor. Computer Assisted Language Learning, 20 (4), 365-383.  \n3\\. Kukulska-Hulme, Agnes and Shield, Lesley (2008) An overview of mobile assisted language learning: From content delivery to supported collaboration and interaction. ReCALL, 20 (3). pp. 271-289.  \n  \nMeeting 16. Final paper presentations:  \n  \nMeeting 17. Final paper presentations:",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": "Each person should be responsible for assigned readings (plus class and online discussion and participations)"
        },
        {
            "type": "報告",
            "weight": 40,
            "note": "A formal evaluation report/paper for a certain recommended topic. 40% topics will be assigned later. (about 10- 15 pages)"
        },
        {
            "type": "其他",
            "weight": 30,
            "note": "Moodle Courseware development- any language skills for high school or college levels of learners"
        }
    ],
    "prerequisite": "",
    "general_core": []
}