{
    "year": 111,
    "term": 1,
    "name": "生涯規劃與輔導研究",
    "teachers": [
        "李景峰"
    ],
    "department": "HD70",
    "code": "IED0083",
    "credit": 2,
    "serial": 1098,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 1,
            "to": 2,
            "campus": "本部",
            "classroom": "研討一"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "",
    "goals": [
        "Understand the relationship between education, society and work, and learn various ways and means to carry out a career.",
        "Understand yourself, cultivate a positive, optimistic attitude and good morals and values.",
        "Get to know the world of work and learn how to enhance basic skills for career development.",
        "Understand the general knowledge required in the world of work, cultivate independent thinking and self-reflection, and expand confidence in career development."
    ],
    "syllabus": "Week 1: The role of spiritual mentors in career planning. There are three kinds of mentors in life: Physician, lawyer and spiritual mentors.\n\nWeek 2: Discuss the importance of spiritual mentors.\n\nWeek 3: Philosophy of Career Counseling: Existentialist scholar Jean-Paul Sartre said: \"Humans first exist, then appear, then appear, and then define themselves.\" (Use scissors and essence to explain which comes first!)\n\nWeek 4: Yi Li Counseling Theory: According to the mental growth of \\[Male Eight and Female Seven\\], we should try to explore (find interest through reading), observe personality (introversion or extroversion), make friends (make friends of the same sex and the opposite sex, at what age do you start making friends of the opposite sex? How to make friends with the opposite sex? Contact?)  “False name”: not trapped by “false name.”\n\nWeek 5: Comparison of career planning in Taiwan and other countries: self-awareness, career exploration (probing), career preparation.\n\nWeek 6: **Name** (family-based): The teacher will take it together at the coming-of-age ceremony. Because the teacher's teaching process is \"watching the time, not talking, and keeping the heart\", it allows students to develop their aspirations and develop a spontaneous and spontaneous spirit.\n\nWeek 7: Chinese-style career counseling theories include:\n\n1\\. \"The Analects. Shu Er\": Don't explain until the students want to ask, don't counsel until they have been confusing.\n\n2\\. \"Book of Rites. \"Xue Ji\": The teacher does not disturb students’ learning until they found themselves. The teacher only observes them until the suitable opportunity showed up and teach them.\n\n3\\. Mozi's Theory of Knowledge: Hearing it, saying it, and experiencing it.\n\nWeek 8: **Grab things** (give items to grab is to test the child's nature: scholars, farmers, workers, or businessmen)\n\nWeek 9: Chinese-style counseling Guiguzi: \" Talking to a man with a man talk, relatively talking to a ghost with a ghost talk).\n\nWeek 10: Six Arts in Western Chou dynasty: Ritual, Music, Archery, Imperialism, Books, and Numbers. (50% of music, archery and imperialism are technology and entertainment: Live life through technology and entertainment! For example: share housework and keep pets to develop a sense of responsibility!) Does career counseling include financial  education? Eight aspects of educating children about money: 1) Time management; 2) Needs and wants; 3) List of family expenses; 4) Saving money = making money (such as saving water, saving electricity, sharing clothes, etc.); 5) List of children's expenses; 6) Leisure expertise = earning ability (getting scholarships, strengthening health and establishing good relationships with one stone); 7) Public resources = family resources (library, stadium, playground and swimming pool); 8) Bargaining power = earning power.\n\nWeek 11: **Giving a nickname** for a teenager (assessed by teachers, given in adult etiquette and custom) and choosing the right words will make people work towards their own sexual orientation and achieve adaptive development. There are two theories: Three mornings and four evenings,**《**Zhuangzi The Equality of Things (300 BC)**》**vs. anchoring effect **《**Tversky, A. & Kahneman, D.（1974）**》****.**\n\nWeek 12: It is not a dream for modern young people to live to be 100 years old \\[a new career planning\\]: To live, to learn, and to enjoy live till die.\n\nWeek 13: Mid-term evaluation -- Career planning issues\n\nWeek 14: Five important events after leaving school: marriage (cohabitation), childbirth (adopted child), buying a house (self-occupation, investment), buying a car (or renting a car as a means of transportation), buying insurance (medical care, long-term care, foreign passport), the only thing missing is Let go of \"retirement\", and only \"retirement\" is a compulsory course in a life!\n\nWeek 15: Retirement Planning and Counseling: Requires Career Change abilities. How to Find Your Interests in Retirement: Progressive retirement (how much time to invest in exploring retirement?) and semi-retirement.\n\nWeek 16: Part-time (progressive) or semi-retirement career exploration: Make good use of life experience and network. Giving is more useful than receiving: to live without having (substance is not for you), to do without relying on it(cannot hold it forever), and to be success without you(success is not because of you) \"Lao Tzu Chapter 2\" (The really happy life is to be willing to commit to giving, but not expecting anything in return!).",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "Explain Chinese careering theories and counseling theories."
        },
        {
            "type": "Group discussion",
            "note": "Discuss the comparison of career planning in Taiwan and other countries"
        },
        {
            "type": "Problem base learning",
            "note": "Solving retirement financial problem."
        },
        {
            "type": "Case studies",
            "note": "retirement life planning"
        }
    ],
    "grading": [
        {
            "type": "Midterm Exam",
            "weight": 20,
            "note": ""
        },
        {
            "type": "Class discussion involvement",
            "weight": 30,
            "note": ""
        },
        {
            "type": "Attendances",
            "weight": 30,
            "note": ""
        },
        {
            "type": "Case study reports",
            "weight": 20,
            "note": ""
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}