{
    "year": 109,
    "term": 1,
    "name": "中外文化議題探討",
    "teachers": [
        "許景順"
    ],
    "department": "ZU92",
    "code": "PGUK009",
    "credit": 2,
    "serial": 3274,
    "group": "",
    "quota": {
        "limit": 35,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "正304"
        }
    ],
    "programs": [
        "榮譽英語學程"
    ],
    "comment": "",
    "restrict": "◎第一階段限 榮譽英語學程 ◎必須先修過【英文（二）】",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "This course enables participants to become more effective intercultural communicators.\n\nIntercultural communication at its most basic refers to understanding how people from different cultures behave, communicate and perceive the world around them. Understanding this, we are better equipped to avoid conflict and misunderstandings.\n\nOver the duration of the course, students will be asked to reflect on how their own culture informs how they think, communicate and behave. Developing an understanding of how their own language and behaviour is informed by cultural values and assumptions will enable them to better understand others.\n\nStudents will be introduced to cultural dimensions such as individualism-collectivism, uncertainty avoidance, power distance, masculinity-femininity, long-term orientation and indulgence versus self-restraint. They will be led to understand how these dimensions inform everyday interactions.\n\nStudents are requested to arrive for class with enquiring minds.",
    "goals": [
        "強化學生英語文閱讀、聆聽的策略與能力，協助獲取專業領域新知",
        "提昇英語文口語、寫作的表達能力，期盼學生能於工作職場及學術研究領域展現英語專業涵養。",
        "協助學生深入瞭解國際社會的多元文化，培養國際觀，對特定文化現象進行分析、比較，激發學生之批判性思考能力。"
    ],
    "syllabus": "Studies in Cross-Cultural Issues (Fall 2020)\n\nSyllabus\n\nThis course will be taught in English.\n\nInstructor: Chingshun J. Sheu 許景順 ([cjsheu@ntnu.edu.tw](mailto:cjsheu@ntnu.edu.tw)).\n\nClass meetings: Wednesdays 1320-1510.\n\nObjectives: Through the exploration of cultural issues and the (mis)perception of cultural phenomena, students will gain a more comprehensive understanding of their own culture and the concept of culture in general.\n\nNondiscrimination policy: Every student will be treated the same regardless of identity or cultural background. In addition, accommodations can be made for disability.\n\nGrading:           40% Presentation\n\n                            32% Final exam\n\n16% Weekly quizzes\n\n12% Participation\n\nPresentation: Each group will give a freeform presentation on the diverse cultural backgrounds of the group members. The presentation should account in some way for the [six Hofstede Insights cultural dimensions](https://www.hofstede-insights.com/product/compare-countries/). The presentation must be in English, and may be live or prerecorded (or both). Creativity is highly encouraged. Each group will answer questions from the other groups after the presentation.\n\nFinal exam: Students will have one week to answer the open-book take-home exam. No late submissions. _Plagiarism will result in an exam grade of 0 (zero)._\n\nWeekly quizzes: Students should read the assigned texts _before class_ each week and answer the open-book repeatable weekly quiz online. During class, students will divide into groups to discuss questions from the instructor. They will then share their answers with the class. No makeup quizzes.\n\nParticipation: Participation includes two parts, both based on peer evaluations from fellow group members. The first part is how much each group member contributes to the presentation. The second part is how much each group member participates in deciding the questions that each group must ask each presenting group. Peer evaluations will not be directly translated into the participation grade, but will rather serve as indicators of participation.\n\nSchedule:\n\nWeek\n\nDate\n\nUnit\n\n1\n\n16-Sep\n\nIntroduction\n\n2\n\n23-Sep\n\nFrom Luke Eric Lassiter, _Invitation to Anthropology_\n\n3\n\n30-Sep\n\nFrom Jordan Paper, _The Spirits Are Drunk_\n\n4\n\n7-Oct\n\nFrom Søren Kierkegaard, _Fear and Trembling_\n\n**5**\n\n**14-Oct**\n\n**No class (instructor away)**\n\n6\n\n21-Oct\n\nFrom Walter F. Otto, _The Homeric Gods_\n\n7\n\n28-Oct\n\nFrom Roger T. Ames and Henry Rosemont, Jr. (translators), _The_ _Analects of Confucius_\n\n8\n\n4-Nov\n\nRalph Waldo Emerson, “Politics”\n\n9\n\n11-Nov\n\n_Di Zi Gui_弟子規\n\n10\n\n18-Nov\n\nFrom William G. Perry, Jr., _Forms of Intellectual and Ethical Development in the College Years_\n\n**11**\n\n**25-Nov**\n\n**Film**\n\n12\n\n2-Dec\n\nPresentation 1\n\n13\n\n9-Dec\n\nPresentation 2\n\n14\n\n16-Dec\n\nPresentation 3\n\n15\n\n23-Dec\n\nPresentation 4\n\n16\n\n30-Dec\n\nPresentation 5\n\n17\n\n6-Jan\n\nQuestion day\n\n**18**\n\n**13-Jan**\n\n**Final exam due (no class)**\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=d6a838f71dfd426ca87daa5de7c04afd&fno=77d9733706e748b1aaad21522b7c5cd0)",
    "methodologies": [
        {
            "type": "討論法",
            "note": "Group discussions"
        },
        {
            "type": "合作學習",
            "note": "Group presentations"
        },
        {
            "type": "實驗/實作",
            "note": "Final exam"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 16,
            "note": "Weekly quizzes"
        },
        {
            "type": "期末考",
            "weight": 32,
            "note": "Final exam"
        },
        {
            "type": "課堂討論參與",
            "weight": 12,
            "note": "Participation"
        },
        {
            "type": "報告",
            "weight": 40,
            "note": "Group presentations"
        }
    ],
    "prerequisite": "◎必須先修過【英文（二）】",
    "general_core": []
}