{
    "year": 107,
    "term": 2,
    "name": "美術館：歷史與建築",
    "teachers": [
        "Candida",
        "Syndikus"
    ],
    "department": "T",
    "code": "T0C8004",
    "credit": 3,
    "serial": 2969,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 3
    },
    "schedule": [
        {
            "day": 1,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "青田街藝史所教室",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "從古代以來，藝術品就被存放和展示在特定的場所。文藝復興時期的珍奇室、骨董花園，以及王子親王們的藝廊，都對藝術展示的發展起了重要作用。到了19世紀，這類私人收藏的展示開始轉換到公共教育機構，標誌了現代化收藏的開端。同時，建築師和藝術史家也開始討論新的形式觀點(如日光照明)，以及教育解說的模式。\n本課將會回顧美術館的演進，包過從最早的古物展示，到現代的美術館。課程將會探討的課題包括藝術收藏的歷史發展，以及美術館建築作為人造的實體展示框架。課程中也會進一步討論藝術品的展示方式，以及博物館教育的觀念發展。\n本課將視課程進度，安排若干博物館參訪，藉此瞭解本地博物館的實況。參訪選項包括故宮南院、國立臺灣博物館、奇美博物館、蘭陽博物館、亞洲大學現代美術館等。",
    "goals": [
        "To increase students’ knowledge of major museums all over the world.",
        "To convey methods of analysis of architectural concepts.",
        "To train students’ sensibility for a successful presentation of art works.",
        "To instruct students how to read and interpret primary sources and evaluate them with regard to the relevant art works.",
        "To promote students’ competencies to collect and interpret related literature and to encourage them to maintain a critical distance toward scientific opinions."
    ],
    "syllabus": "1.  Introduction: From the cabinet of curiosities to the modern art museum.—Discussion of topics for term papers.\n2.  Distribution of topics for term papers.—Earliest examples: Antiquity (sources), Medici Garden, Florence, and other Renaissance collections.\n3.  The concept of the “Wunderkammer”—Cabinet of curiosities.\n4.  Early art galleries: Architectural structure and presentation of the artefacts (Sabbioneta, Galleria degli Antichi, 16th c.; Munich, Residence, Antiquarium, 16th c.; Potsdam, Sanssouci, Gallery of Frederick II, 1755/56)\n5.  Early art museums: Kassel, Museum Fridericianum (1769–79); Rome, Villa Albani; Rome; Vatican Museums. The museum in times of revolution (projects).\n6.  Early public museums: London, British Museum; the early Louvre Museum and its antecedents; London, Crystal Palace (1851)\n7.  Finding of an aesthetic form—19th century: Leo von Klenze, Munich: Königsplatz with Glyptothek and collection of antiquities (Antikensammlung); Old Pinakothek.\n8.  Berlin, Museum Island: from K. F. Schinkel, Old Museum.\n9.  New approaches: Mies van der Rohe, Museum for a small city (1942); New National Gallery, Berlin (; Le Corbusier, 1957–59; Frank Lloyd Wright and the Guggenheim, New York.\n10.  Carlo Scarpa’s museums in Venice, Verona and Possagno, Italy.\n11.  Richard Rogers & Renzo Piano: Centre Pompidou, Paris—engine of creativity; Gae Aulenti, Musée d’Orsay, Paris.\n12.  Louis Kahn, Kimbell Art Museum, [Fort Worth](https://en.wikipedia.org/wiki/Fort_Worth), [Texas](https://en.wikipedia.org/wiki/Texas) (1972).\n13.  The postmodern museum: Sterling & Wilford, Stuttgart, Staatsgalerie (State Gallery, 1984); Hans Hollein, Mönchengladbach (1982); Robert Venturi, Sainsbury Wing, National Gallery, London, 1991.\n14.  The “Bilbao Effect”—Frank Gehry, Guggenheim Museum, Bilbao; Daniel Libeskind, Jewish Museum, Berlin.\n15.  University collections and museums.\n16.  Conversion of old buildings: Peter Zumthor, Kolumba Diocesan Museum, Cologne (2003–07)\n17.  Museums in Taiwan\n18.  Museums for the future. Conclusion.",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Ex cathedra teaching"
        },
        {
            "type": "討論法",
            "note": "Group discussion"
        },
        {
            "type": "實地考察、參訪",
            "note": "Field trip(s): Museums"
        },
        {
            "type": "媒體融入教學",
            "note": "ppt"
        },
        {
            "type": "專題研究",
            "note": "case studies"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 10,
            "note": "Homework: preparation of topics, weekly reading."
        },
        {
            "type": "課堂討論參與",
            "weight": 40,
            "note": "Discussion of art works and texts.\nca. 30 min. discussion after each presentation."
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "30–45 min. presentation with ppt about the topic of the term paper; ca. 30 min. discussion after each presentation."
        },
        {
            "type": "專題",
            "weight": 20,
            "note": "Term papers of ca. 15 pages to be submitted at the end of the semester"
        }
    ],
    "prerequisite": "",
    "general_core": []
}