{
    "year": 107,
    "term": 2,
    "name": "運動科學文獻分析",
    "teachers": [
        "林德嘉"
    ],
    "department": "AM30",
    "code": "PEC0104",
    "credit": 3,
    "serial": 21,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 5,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "體003"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "本課程旨在培養學生在國際研討會發表論文的能力。在教學上，將依照學生背景選擇文獻閱讀，並於課堂互相討論，學生可將自己的實驗報告或研究報告提供給其他同學參考閱讀，進而在研討會中發表。",
    "goals": [
        "培養學生參與國際研討會發表論文的能力"
    ],
    "syllabus": "The purpose of this course is intending to nurture students' ability in analytical thinking and be able to present their thinking in English.  Consequently, build up the confidence to use English for their presentation in future participation in International Conference and Symposium.\n\nThe content of the course will depend on the students' background knowledge and the level of comprehension in English.  Then select  appropriate articles relative to Sports Science to assign students to read and discuss in the class. To the great athletes, behind every successful technique is a fundamental scientific concept or natural law. To understand those basic principles can give an informed and intelligent athlete an edge; it can guide him/her to recognize his/her own weaknesses and limitations and to make the best of his/her abilities. Anyone who understands and can explain the reasons behind the techniques is better qualified to pass his/her knowledge along to others. In this course hopefully can possible to build up students abilities in those areas too. The students will be evaluated by showing up in the class and the abilities in their presentation.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}