{
    "year": 107,
    "term": 2,
    "name": "運動贊助策略研究",
    "teachers": [
        "王傑賢"
    ],
    "department": "AM30",
    "code": "PEM0100",
    "credit": 3,
    "serial": 13,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 4,
            "from": 3,
            "to": 5,
            "campus": "本部",
            "classroom": "體002"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "The global sport sponsorship market is estimated to be worth about US$57 billion dollars in 2020 with annual year growth rate of 4.74%. It has become of vital importance to any sport professional that is in sport industry. “Topics on Strategic Sport Sponsorship” is the first graduate course in Taiwan focusing on professional sport sponsorship and providing a comprehensive, multi-disciplinary analysis of this industry. Topics covered include the global trends and strategic nature of sport sponsorship after COVID 19 outbreak; motivation and benefits of corporate sport sponsorship, activation mix of sport sponsorship, international mega sport event sponsorship, individual athlete sponsorship, the development of effective sponsorship plan and methods of evaluation. Global Sport Sponsorship is essential competence for anyone involved in the practice or academic study of one of the world's largest industries. The characteristic of this course is to integrate the lecturer’s personal field experiences of the Olympics marketing and other major sport properties into his instruction, which will strengthen the student competitive competence in their job market.",
    "goals": [
        "To understand the fundaments of modern sport sponsorship and its importance of strategic applications in global sport business.",
        "To cultivate students ability of developing the effective sport sponsorship proposal and the ability to work with others (team work).",
        "To develop the essential capability of being an outstanding modern global sport industry leader who is able to deal with various challenges and issues successfully in the sport world."
    ],
    "syllabus": "",
    "methodologies": [
        {
            "type": "",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "",
            "weight": null,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}