{
    "year": 107,
    "term": 2,
    "name": "二十世紀美國重要作家",
    "teachers": [
        "高瑪麗"
    ],
    "department": "LM21",
    "code": "ENC1011",
    "credit": 3,
    "serial": 1592,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 1,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "雲201"
        }
    ],
    "programs": [],
    "comment": "上課教室在雲和街大樓二樓，地址為雲和街1號(位於雲和小火鍋斜對面、Cafe a la mode正對面)，從師大側門右轉看見Starbucks右轉進入巷子步行約2分鐘(130公尺)，右手邊就會看到雲和街大樓，亦可使用Google Maps APP查詢位置。請同學使用學生證感應，進出雲和街上課教室。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "In Major American Writers of the 20th century, students will study a wide range of fiction in different genres from the early twentieth century to the present. The course traces the formal and thematic developments of the novel in this period, focusing on the relationship between writers and readers, the conditions of publishing, innovations in the novel`s form, fiction`s engagement with history, and the changing place of literature in American culture.",
    "goals": [
        "study a wide range of fiction from 1930 to the present",
        "traces the formal and thematic developments of the novel in this period"
    ],
    "syllabus": "UPDATED FOR SPRING 2019\n\nIn Major American Writers of the 20th century, students will study a wide range of fictiont. The course traces the formal and thematic developments of the novel in this period, focusing on the relationship between writers and readers, the conditions of publishing, innovations in the novel\\`s form, fiction\\`s engagement with social changes and history, and the changing place of literature in American culture. \n\n**GRADUATE FICTION SPRING 2019**\n\n**ENC1011: Major 20th century American Writers /** **二十世紀美國重要作家**\n\n**高瑪麗****/Professor M. Goodwin** **[profgood@hotmail.com](mailto:profgood@hotmail.com)**\n\n**This course covers a wide range of American fiction over the span of the 20th century, tracing the formal and thematic developments of the novel in this period and focusing on the relationship between writers and readers, the conditions of publishing, innovations in the novel\\`s form, fiction\\`s engagement with history and social changes, and the changing place of literature in American culture. The reading list includes works by Edith Wharton, John Steinbeck, Ernest Hemingway, Thomas Pynchon, Amy Tan and Toni Morrison, well as theoretical and critical readings chosen by the instructor and class members.**\n\n**Required Texts**\n\nEdith Wharton, The Age of Innocence\n\nJohn Steinbeck, Of Mice and Men\n\nErnest Hemingway, A Farewell to Arms\n\nThomas Pynchon, The Crying of Lot 49\n\nToni Morrison, A Mercy\n\nAmy Tan, The Joy Luck Club\n\n**Evaluation**\n\n**Attendance and Participation: 15%**\n\n**Short Response Papers (3x10%): 30%**\n\n**Annotated Bibliography: 20%**\n\n**Final Presentation and Final Paper: 35%**\n\n  \n**Coursework** \n\n**Required work for the course includes careful reading of all assigned material and active participation in class discussions.  Please come to class prepared with questions and comments about the assigned reading for each day--the success of our seminar-style course depends on everyone’s involvement.**\n\n**Papers, Presentations**\n\n**Early in the semester, you will choose one of the books/authors on the syllabus.  Your annotated bibliography, class presentation and final paper will focus on this text.**  \n\n1.  **Short Response Papers (1-2 pages)**\n2.  **An annotated bibliography that summarizes at least 10 outside sources and two or three major strands of criticism concerning the book.  You will present your research findings to the class on the day we discuss the book.  Your final annotated bibliography will also be due that day.**\n3.  **Final research paper that will develop an original argument about some topic in the book, with your reading set in a relevant critical context.  A first draft of your research paper is due toward the end of the semester, sent by email/Moodle to all members of the class. All students will be reading and commenting on each other’s research.  Final versions of the research paper are due at the end of the semester.** \n\n**Plagiarism**\n\n**_Plagiarism, even a first offense, will earn you a failing grade in the course. Plagiarism is defined as “presenting, as one’s own, the work or the opinion of someone else.” Plagiarism is “copying material of some sort, either word for word or sense for sense”; ideas, conclusions, and ways of organizing material can also be plagiarized. Students are guilty of plagiarism when the words, sentences, ideas, conclusions, examples, and/or organization of an assignment are borrowed from a source (a book, an article, online sources, another student’s paper, etc.) without correctly acknowledging the source. If you have any question at all about how to cite sources, check first with the instructor or another faculty member or the MLA Handbook. UPDATE: New department policy is to require major papers to be uploaded into Turn It In, to check for plagiarism._**\n\n**Double Dipping**\n\n**Work presented for a grade in any other class, including the Writing and Research Class, may not also be turned in for a grade in this class. Check early with instructor on the topic of your planned project for the semester.**",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Lecture plus discussion"
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 35,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 10,
            "note": ""
        },
        {
            "type": "成果展覽",
            "weight": 15,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 20,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}