{
    "year": 107,
    "term": 2,
    "name": "城市˙身體˙文化創意",
    "teachers": [
        "蘇榕"
    ],
    "department": "LM21",
    "code": "ENC1101",
    "credit": 3,
    "serial": 1595,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "雲203"
        }
    ],
    "programs": [],
    "comment": "上課教室在雲和街大樓二樓，地址為雲和街1號(位於雲和小火鍋斜對面、Cafe a la mode正對面)，從師大側門右轉看見Starbucks右轉進入巷子步行約2分鐘(130公尺)，右手邊就會看到雲和街大樓，亦可使用Google Maps APP查詢位置。請同學使用學生證感應，進出雲和街上課教室。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "This course is designed as a sequential exploration of the topics we discuss in the course titled “Urban Literature,” in which most of the assigned readings feature in the essential theoretical concepts of urban studies and the critique of urban representations in some literary texts, or, by and large, in cultural production as a whole. Different from “Urban Literature,” however, this course, while guiding students into grasping the critical concepts of urban studies, the allocation of urban space, and their correlation with the state’s operation of bio-power, will survey western urban histories by observing how the history of the city was told through people’s bodily experience. Apart from a perusal of urban theories and a general survey of western urban histories with a special emphasis on the experience of the body, this course also attempts to examine and critique the idea of cultural creativity, which is nowadays often equated to or associated with a productivity which supposedly will create considerable economic benefit for the city and is firmly buttressed by the logic of capitalism.    \nIndeed, current ideas about reinvigorating cities place an increased emphasis on the creativity of densely populated urban areas. This idea was not just articulated by such US urban scholar as Richard Horida. It is becoming popular all over the world in the course of globalization. Yet, just like what Mark Gottdiener and Leslie Budd have pointed out in their observation of the said phenomenon, “whether urban development depends primarily on the creativity of the city population alone remains a thesis that still has to be proved, although no one can deny that artists, designers, computer innovators, and other creative people, such as those working in finance and trade, are critical to a nation’s economy” (9). Whether the idea of cultural creativity helps promote the so-called cultural enterprise, which is presumably meant for invigorating the city life, or, our current understanding of the idea on a quantitative level purposely invests the idea of creativity and originality with a nature of commercialism and highlights its use value, which, in turn, accelerates the commodification and vulgarization of urban culture, remains something worthy of further rumination. \nThe goal of this course, in the light of this emergent trend, aims at a critical exploration (and critique) of the correlations among the thriving of urban areas, the people who live in these regions, how the everyday life experiences in the city are enacted and shaped through the discipline and social differentiation of the body, and the cultural creativity stimulated by the city’s ceaseless need for its self-rejuvenation.   It is designed to help students grasp the basic concepts of urban studies, the relevance of urban space to the body, and the critical concept of creativity. We will read a select group of articles organized according to different topics, and, whenever appropriate, juxtaposing these articles with literary texts (e.g. works by Salman Rushdie, Hanif Kureishi, Kazuo Ishiguro, Peter Ackroyd, and Zadie Smith) or any suitable cultural products (e.g. films, or cultural events) for further critical reflections or debates.",
    "goals": [
        "The goal of this course, in the light of this emergent trend, aims at a critical exploration (and critique) of the correlations among the thriving of urban areas, the people who live in these regions, how the everyday life experiences in the city are enacted and shaped through the discipline and social differentiation of the body, and the cultural creativity stimulated by the city’s ceaseless need for its self-rejuvenation.",
        "It is designed to help students grasp the basic concepts of urban studies, the relevance of urban space to the body, and the critical concept of creativity."
    ],
    "syllabus": "This course is designed as a sequential exploration of the topics we discuss in the course titled “Urban Literature,” in which most of the assigned readings feature in the essential theoretical concepts of urban studies and the critique of urban representations in some literary texts, or, by and large, in cultural production as a whole. Different from Urban Literature, however, this course, while guiding students into grasping the critical concepts of urban studies, the allocation of urban space, and their correlation with the state’s operation of bio-power, will survey western urban histories by observing how the history of the city was told through people’s bodily experience. Apart from a perusal of urban theories and a general survey of western urban histories with a special emphasis on the experience of the body, this course also attempts to examine and critique the idea of cultural creativity, which is nowadays often equated to or associated with a _productivity_ which supposedly will create considerable economic benefit for the city and is firmly buttressed by the logic of capitalism.    \n\nIndeed, current ideas about reinvigorating cities place an increased emphasis on the creativity of densely populated urban areas. This idea was not just articulated by such US urban scholar as Richard Horida. It is becoming popular all over the world in the course of globalization. Yet, just like what Mark Gottdiener and Leslie Budd have pointed out in their observation of the said phenomenon, whether urban development depends primarily on the creativity of the city population alone remains a thesis that still has to be proved, although no one can deny that artists, designers, computer innovators, and other creative people, such as those working in finance and trade, are critical to a nation’s economy (9). Whether the idea of cultural creativity helps promote the so-called cultural enterprise, which is presumably meant for invigorating the city life, or, our current understanding of the idea on a quantitative level purposely invests the idea of creativity and originality with a nature of commercialism and highlights its use value, which, in turn, accelerates the commodification and vulgarization of urban culture, remains something worthy of further rumination.\n\nThe goal of this course, in the light of this emergent trend, aims at a critical exploration (and critique) of the correlations among the thriving of urban areas, the people who live in these regions, how everyday life experiences in the city are enacted and shaped through the discipline and social differentiation of the body, and the cultural creativity stimulated by the city’s ceaseless need for its self-rejuvenation.   It is designed to help students grasp the basic concepts of urban studies, the relevance of urban space to the body, and the critical concept of creativity. We will read a select group of articles organized according to different topics, and, whenever appropriate, juxtaposing these articles with literary texts or any suitable cultural products (e.g. films, or cultural events) for further critical reflections or debates.\n\nWeek\n\nDate\n\nReading assignment**/**Class Activity\n\nNote\n\n1\n\n2/20\n\nIntroduction\n\n介紹本學期課程及要求\n\n2\n\n2/27\n\nElizabeth Wilson. “The Invisible Flâneur.”\n\nJanet Wolff. “The Invisible Flâneuse: Women and the Literature of Modernity.”\n\n3\n\n  3/06\n\nRichard Sennett. _Flesh and Stone._\n\n“Fear of Touching”\n\n4\n\n3/13\n\nRichard Sennett. _Flesh and Stone._\n\n“Moving Bodies.”\n\n \n\n5\n\n3/20\n\nMichel Foucault. _Discipline and Punish_.\n\n“Of Other Spaces.”\n\n6\n\n3/27\n\nMichel Foucault. _History of Sexuality_. Vol. I\n\n7\n\n  4/03\n\nNational Holiday\n\nThe school is closed for one day. No Class\n\n8\n\n4/10\n\nTsai Ming-liang, _The Hole_\n\n\\*\n\n9\n\n  4/17\n\nWi Ding Ho, _Cities of Last Things_\n\n\\* 本片沒有找到\n\n10\n\n4/24\n\nMid-term proposal presentation\n\n \n\n11\n\n5/01\n\nJudith Bulter. _Gender Trouble._\n\n \n\n12\n\n5/08\n\nKathleen Woodward. _Figuring Age: Women, Bodies, Generations_.\n\n“Opening the Subject”\n\n13\n\n5/15\n\nKathleen Woodward. _Figuring Age: Women, Bodies, Generations_.\n\n“Historicizing Age”\n\n14\n\n5/22\n\nTeresa Brennan. _The Transmission of Affect_.\n\n“The Transmission of Affect in the Clinic”\n\n“The Education of the Senses”\n\n \n\n15\n\n5/29\n\nEileen Chang. _The Rouge of the North_, “The Golden Cangue” and other stories in _Love in a Fallen City_\n\n \n\n16\n\n6/05\n\nA Field Trip\n\n \n\n17\n\n6/12\n\nFinal paper proposal presentation\n\n18\n\n6/19\n\nIndividual Conference\n\nFinal paper Due: June 26?\n\n\\*Please make an appointment in Moodle in week 16.\n\n**Teaching method:**\n\nThe course will be run as a seminar combined with lectures.\n\n**Grading Policy:** attendance, participation, oral presentations 40%\n\nmid-term 20% : (a one-two page proposal of your final paper)\n\n              final paper 40% : (a well-organized scholarly paper; the ideal length of the paper will be 10-15 pp for MA students and 15-20pp for PhD students)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "lectures and comments on students' oral presentations"
        },
        {
            "type": "討論法",
            "note": "the course is discussion-based."
        },
        {
            "type": "問題解決教學",
            "note": "Students are encouraged to search for solutions to the problems they encounter after discussions and brainstorming inside and outside class."
        },
        {
            "type": "實地考察、參訪",
            "note": "A field trip will be included in the course organization."
        },
        {
            "type": "媒體融入教學",
            "note": "Multi-media teaching resources may be used."
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": "Teaching method:\nThe course will be run as a seminar combined with lectures.\nGrading Policy: attendance, participation, oral presentations 40% \nmid-term 20% : (a one-two page proposal of your final paper)\n              final paper 40% : (a well-organized scholarly paper; the ideal length of the paper will be 10-15 pp for MA students and 15-20pp for PhD students)"
        }
    ],
    "prerequisite": "",
    "general_core": []
}