{
    "year": 107,
    "term": 2,
    "name": "神經語言學",
    "teachers": [
        "詹曉蕙"
    ],
    "department": "LM21",
    "code": "ENC2047",
    "credit": 3,
    "serial": 1600,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "雲202"
        }
    ],
    "programs": [],
    "comment": "上課教室在雲和街大樓二樓，地址為雲和街1號(位於雲和小火鍋斜對面、Cafe a la mode正對面)，從師大側門右轉看見Starbucks右轉進入巷子步行約2分鐘(130公尺)，右手邊就會看到雲和街大樓，亦可使用Google Maps APP查詢位置。請同學使用學生證感應，進出雲和街上課教室。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "This is a reading-intensive course, intending to be a survey of current topics in neurolinguistics. It is divided into three parts. Part I is about foundational concepts and methods, and I’ll give lectures. Part II is about language representation and processing, which covers the important topics of this field. I`ll briefly introduce these topics and provide background knowledge at the beginning of the class, and the rest of the class will be student presentations on assigned readings (20-25 minutes each) and class discussion. The presenters will have to email me their question(s) for discussion by Monday midnight and give me their PowerPoint slides no later than Wednesday midnight so that I can upload them onto Moodle. Part III is group project presentations. Each group (2 people per group) will research a topic pertaining to neurolinguistics (topic submission by 5/4), which can be something not covered in class, and do a 45-minute PowerPoint presentation followed by a 15-minute Q & A session. The group has to assign an article for the class to read that can help them understand the presentation (assigned reading submission by 5/25—electronic file only). This article can be selected from a scientific journal, a popular magazine, or an academic/non-academic book. Each individual is required to turn in a term paper on the presented topic (i.e. short review article) by the end of the semester (6/22 term paper due). Everyone is welcome to review more literature in the term paper that is not presented in class. Maximum page limit for the paper is 10 pages (12 point font, double-spaced, one inch margins).",
    "goals": [
        "foundational concepts and methods of current topics in neurolinguistics"
    ],
    "syllabus": "Week 1 Overview of this course & course survey\n\nPART I: FOUNDATIONAL CONCEPTS AND METHODS\n\nWeek 2 Introduction to neurolinguistics (and brain basics)\n\n1) Pinker S. & Jackendoff, R. (2005). The faculty of language: what’s special about it? Cognition, 95:201–236.\n\n2) Ingram, J. C.L. (2007). The neuroanatomy of language. In Neurolinguistics: An introduction to spoken language processing and its disorders (pp. 40-65). Cambridge: Cambridge University Press. \\[electronic resource\\]\n\n3) Brown, C. M., & Hagoort, P. (1999). The cognitive neuroscience of language: Challenges and future directions. In C. M. Brown & P. Hagoort (Eds.), The neurocognition of language (pp. 3-14). Oxford: Oxford University Press.\n\nWeek 3  Aphasia and language\n\n1) Benton, A. & Anderson, S. W. (1998). Aphasia: historical perspectives. In Sarno, M. T. (Ed.). Acquired Aphasia (pp. 1-24). San Diego: Academic Press.\n\n2) Damasio, A. R. (1998). Signs of aphasia. In Sarno, M. T. (Ed.). Acquired Aphasia (pp. 25-41). San Diego: Academic Press.\n\nWeek 4 Neuroimaging techniques and language: ERP & fMRI\n\n1) Osterhout, L., McLaughlin, J. & Bersick, M. (1997). Event-related brain potentials and human language. Trends in Cognitive Science, 1 (6), 203-209.\n\n2) Kutas, M. & Schmitt, B. M. (2003). Language in microvolts. In M. T. Banich & M. Mack, Mind, Brain, and Language (pp 171-210). Mahwah NJ: Erlbaum. \\[esp. after p. 180\\]\n\n3) Rugg M. D. (1999). Functional neuroimaging in cognitive neuroscience. In C. M. Brown & P. Hagoort (Eds.), Neurocognition of Language (pp 15-36). Oxford University Press.\n\nPART II: LANGUAGE REPRESENTATION AND PROCESSING\n\nWeek 5  Speech perception I\n\n1) Naatanen, R. (1995). The mismatch negativity: A powerful tool for cognitive\n\nneuroscience. Ear and Hearing, 16, 6-18.\n\n2) Naatanen, R., Lehtokoski, A., Lennes, M., Cheour, M., Huotilainen, M., Livonen, A., Vainlo, M., Alku, P., Ilmoneimi, R. J., Luuk, A., Aillk, J., Sinkkonnen, J. & Alho, K. (1997). Language-specific phoneme representations revealed by electric and magnetic brain responses. Nature, 385, 432-434.\n\n3) Shtyrov, Y., Kuhala, T, Palva, S., Ilmoniemi, R. J. & Naatanen, R. (2000). Discrimination of speech and of complex nonspeech sounds of different temporal structure in the left and right cerebral hemispheres. NeuroImage, 12, 657-661.\n\nWeek 6 Speech perception II\n\n1) Van Petten, C., Coulson, S., Rubin, S., Plante, E., & Parks, M. (1999). Timecourse of word identification and semantic integration in spoken language. Journal of Experimental Psychology: Learning, Memory, and Cognition, 25, 394-417. \\[2 presenters\\]\n\n2) Ischebeck, A. K., Friederici, A. D. & Alter, K. (2008). Processing prosodic boundaries in natural and hummed speech: An fMRI study. Cerebral Cortex 18, 541–552.\n\nWeek 7 Meaning I\n\n1) Kutas, M. & Hillyard, S. A. (1980). Reading senseless sentences: Brain potentials reflect semantic incongruity. Science, 207, 203-205.\n\n2) Kutas, M. & Hillyard, S. A. (1984). Brain potentials during reading reflect word expectancy and semantic association. Nature, 307, 161-163.\n\n3) Kutas, M. & Federmeier, K. D. (2000). Electrophysiology reveals semantic memory use in language comprehension. Trends in Cognitive Science, 4, 463-470.\n\n4) Van Petten, C. (1995). Words and sentences: Event-related brain potential measures. Psychophysiology, 32, 511-525. \\[2 presenters\\]\n\nWeek 8 Meaning II\n\n1) Shapiro, K. & Caramazza, A. (2003). The representation of grammatical categories in the brain, Trends in Cognitive Sciences, 7, 201–206.\n\n2) Barber, H. A., Kousta, S.-T., Otten, L. J., & Vigliocco, G. (2010). Event-related potentials to event-related words: Grammatical class and semantic attributes in the representation of knowledge. Brain Research, 1332, 65-74.\n\n3) Swaab, T., Brown, C. & Hagoort, P. (2003). Understanding words in sentence contexts: The time course of ambiguity resolution. Brain and Language, 86, 326-343.\n\nWeek 9  Syntax I\n\n1) Osterhout, L. & Holcomb, P. J. (1992). Event-related brain potentials elicited by syntactic anomaly. Journal of Memory and Language, 31(6), 785-806.\n\n2) Osterhout, L., Holcomb, P. J. & Swinney, D. A. (1994). Brain potentials elicited by garden-path sentences: Evidence of the application of verb information during parsing. Journal of Experimental Psychology: Learning, Memory, and Cognition, 20, 786-803.\n\n3) Kaan, E. & Swaab, T. (2002). The brain circuitry of syntactic comprehension. Trends in Cognitive Sciences, 6(8), 350–356.\n\nWeek 10  Syntax II\n\n1) Friederici, A. (2002). Towards a neural basis of auditory sentence processing. Trends in Cognitive Sciences, 6(2), 78–84.\n\n2) Grodzinsky, Y. & Friederici, A. D. (2006). NeuroImaging of syntax and syntactic processing, Current Opinion in Neurobiology, 16, 240–246.\n\n3) Ullman, M. T. (2004). Contributions of memory circuits to language: the declarative/procedural model. Cognition, 92, 231–270. \\[2 presenters\\]\n\nWeek 11  Language production (Submission of final project topic due)\n\n1) Van Turennout, M., Hagoort, P. & Brown, C. M. (1998). Brain activity during\n\nspeaking: From syntax to phonology in 40 milliseconds. Science, 280, 572-574.\n\n2) Indefrey, P., Brown, C. M., Hellwig, F., Amunts, K., Herzog, H., Seitz, R. J. & Hagoort, P. (2001). A neural correlate of syntactic encoding during speech production. Proceedings of the National Academy of Sciences, 98, 5933–5936.\n\n3) Heim, S., Opitz, B., Müller, K. & Friederici, A. D. (2003). Phonological processing during language production: fMRI evidence for a shared production–comprehension network. Cognitive Brain Research, 16, 285–96.\n\nWeek 12  Language development\n\n1) Dehaene-Lambertz, G., Hertz-Pannier, L. & Dubois, J. (2006). Nature and nurture in language\n\nacquisition: Anatomical and functional brain-imaging studies in infants. Trends in Neuroscience,\n\n29(7), 367–373.\n\n2) Kuhl, P. K. & Rivera-Gaxiola, M. (2008). Neural substrates of early language acquisition.\n\nAnnual Review of Neuroscience, 31,511–534.\n\n3) Bates, E., & Roe, K. (2001). Language development in children with unilateral brain injury.\n\nIn C.A. Nelson & M. Luciana (Eds.), Handbook of developmental cognitive neuroscience (pp.\n\n281-307). Cambridge, MA: MIT Press.\n\nWeek 13  The bilingual brain\n\n1) Fabbro, F. (2001). The bilingual brain: cerebral representation of languages. Brain and Language. 79, 211–222.\n\n2) Abutalebi, J. (2008). Neural aspects of second language representation and language control. Acta Psychologia, 128, 466–478.\n\n3) Clahsen, H. & Felser, C. (2006). How native-like is non-native language processing? Trends in Cognitive Sciences, 10(12), 564-570.\n\n4) Kotz, S. A. (2009). A critical review of ERP and fMRI evidence on L2 syntactic processing. Brain and Language, 109, 68-74.\n\nWeek 14 Sign language (Submission of group project assigned reading due)\n\n1) Neville, H. J., Coffey, S. A., Lawson, D. S., Fischer, A., Emmorey, K. & Bellugi, E. (1997). Neural systems mediating American Sign Language: Effects of sensory experience and age of acquisition. Brain and Language, 57, 285-308.\n\n2) MacSweeney, M., Capek, C. M., Campbell, R. & Woll, B. (2008). The signing brain: The neurobiology of sign language. Trends in Cognitive Sciences, 12(11), 432–440.\n\n3) Campbell, R., MacSweeney, M., Waters, D. (2008). Sign language and the brain: A review. Journal of Deaf Studies and Deaf Education, 13, 3–20. \\[only needs to present pp. 8 -20\\]\n\nPART III: FINAL PRESENTATION ON VARIOUS TOPICS\n\n(Details will be given in May)\n\nWeek 15  Final project presentation (I)\n\nWeek 16  Final project presentation (II)\n\nWeek 17 Final project presentation (III)\n\nWeek 18 Summary & Term paper due",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "Class participation"
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "Presentation on readings"
        },
        {
            "type": "專題",
            "weight": 45,
            "note": "Term paper"
        },
        {
            "type": "其他",
            "weight": 15,
            "note": "Group project presentation"
        }
    ],
    "prerequisite": "",
    "general_core": []
}