{
    "year": 107,
    "term": 2,
    "name": "英文閱讀研究",
    "teachers": [
        "朱錫琴"
    ],
    "department": "LM21",
    "code": "ENM3022",
    "credit": 3,
    "serial": 1590,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 4,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "雲201"
        }
    ],
    "programs": [],
    "comment": "上課教室在雲和街大樓二樓，地址為雲和街1號(位於雲和小火鍋斜對面、Cafe a la mode正對面)，從師大側門右轉看見Starbucks右轉進入巷子步行約2分鐘(130公尺)，右手邊就會看到雲和街大樓，亦可使用Google Maps APP查詢位置。請同學使用學生證感應，進出雲和街上課教室。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course is designed to introduce current research and thinking about how second language learners read, and how to teach and assess second language reading. The class will be a seminar and will be conducted as lecture/discussion. A reading packet will be compiled as a major text for this course. The reading material for the course will include observational and experimental studies, but no prior experience with research and teaching is required. We will read, analyze, and discuss a couple of articles/ book chapters per week. Students will demonstrate their understanding of L2 reading process and outcome by designing a teaching material and planning a lesson for it. In addition, based on the discussion and critique on the issues presented in the course materials, students will write a response paper. The argument made in the response paper will be developed into a research proposal.",
    "goals": [
        "introduce current research and thinking about how second language learners read, and how to teach and assess second language reading",
        "Students will demonstrate their understanding of L2 reading process and outcome by designing a teaching material and planning a lesson for it"
    ],
    "syllabus": "Studies in EFL Reading Course Description: This course is designed to introduce current research and thinking about how second language learners read, what factors affect the development of second language reading capacity, and what types of comprehension readers may attain. The class will be a seminar and will be conducted as lecture/discussion. A reading list will be compiled as a major text for this course. The reading materials for the course will include observational and experimental studies, but no prior experience with research and teaching is required. We will read, analyze, and discuss a couple of articles/ book chapters per week. Throughout the semester, students will have a variety of assignments: 1) presentation of synopsis of the assigned articles, 2) a group project: either on a pilot data collection/coding, or on a program design for selected readers, and 3) oral and written presentation of a proposal. Synopsis: For each of the article in the reading list, students will rotate presenting the synopsis and lead the in-class discussion. It is expected that a potential research space will be explored/identified toward the end of discussion and the presenter will post the related questions by the following week. Pilot data collection/coding: In order to encourage earlier shaping of the term project - a proposal, students are encouraged to collaborate on a pilot data collection or design a reading program. Proposal: At the end of the semester students will be asked to submit a proposal (about 10 pages, default spaced) on a topic that is of maximum interest and usefulness. This decision should be made sometime after the mid-term. Grading policy: Oral and written presentation of the assigned reading: 20%+10%（with PPT posted before and potential RQ posted after oral presentation, on MOODLE） Project 1 (group work): a pilot with initial results/or a reading program design: 20% Project 2 (individual work): a proposal, to be presented in class: 40% Participation in class discussion: 10%",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Lecture on research methods"
        },
        {
            "type": "討論法",
            "note": "Discussion of assigned readings"
        },
        {
            "type": "問題解決教學",
            "note": "Peer feedback on proposals"
        },
        {
            "type": "合作學習",
            "note": "Collaboration in generating topics for research"
        },
        {
            "type": "實驗/實作",
            "note": "pilot data collection； reading program design"
        },
        {
            "type": "專題研究",
            "note": "Proposal writing on chosen topic"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "pilot/program design"
        },
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": "Classroom participation and presentation"
        },
        {
            "type": "專題",
            "weight": 10,
            "note": "Presentation of a proposal"
        },
        {
            "type": "其他",
            "weight": 40,
            "note": "Final project: a proposal"
        }
    ],
    "prerequisite": "",
    "general_core": []
}