{
    "year": 107,
    "term": 2,
    "name": "英文（三）：科技英文",
    "teachers": [
        "陳正賢"
    ],
    "department": "CU",
    "code": "00UB908",
    "credit": 2,
    "serial": 351,
    "group": "D",
    "quota": {
        "limit": 35,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 1,
            "to": 2,
            "campus": "本部",
            "classroom": "正301"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎必須先修過【英文(一)】◎必須先修過【英文(二)】",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本課程旨在加深學生的英語能力，結合與科學及科技等相關主題規劃英語授課內容，期透過主題式課程增進學生興趣並提升英語基本能力及學術應用可能。",
    "goals": [
        "1. 增進學生英語溝通表達能力 2. 透過參與課程活動促進團隊精神 3. 透過多面向英語閱讀促使學生了解多元文化，拓展學生國際化視野 4. 透過課堂討論培養批判精神 5. 提升學生英語學習動機及自主學習興趣"
    ],
    "syllabus": "Instructor: Alvin C.-H. Chen 陳正賢\n\nE-mail: alvinchen@ntnu.edu.tw\n\nOffice: 誠7樓\n\nClass hours: 8:10 – 10:00, Thurs.\n\nClassroom: TBA\n\nEnglish (III): English for Science and Technology\n\n (Tentative syllabus)\n\nFeb, 2019\n\n課程簡介\n====\n\n在這門課程當中，同學們將學習如何透過多元的網路資源，學習英語在不同科技專業主題領域下之相關用語，本課程將從TED Talks中，選擇當代熱門科技議題作為主要閱讀題材，以英文為媒介，增廣科普新知。同時佐以網路多元之影音題材及相關主題短片，讓學生不僅透過文字閱讀，更能透過聽覺與視覺的賞析，多媒介方式學習(Multi-modal learning)，著重「英語聽說」的方式，加強科技領域專業英語學習。更重要的是，整個學期我們將學習如何，擺脫傳統呆板死記硬背的學習方式，學習如何以情境化、活潑、且實用的「口說」方式，學習並應用英語語法和詞彙，訓練自己不是只有認識新詞，更能知道如何應用所學之專業語文能力，了解當代主流科技發展新知！\n\n整個學期我們將涵蓋的科技主題有:\n\n*   電腦、計算、與自然語言處理(Computer, Computing, and Natural Language Processing)\n*   機器學習是什麼? (What is machine learning?)\n*   人工智慧是什麼? (What is Artificial Intelligence?)\n*   人工智慧和倫理 (Ethical Issues in AI)\n*   大數據 (Big Data)\n*   大腦與學習 (Brain and Learning)\n\nCourse Description\n==================\n\nThis course aims to develop students' English proficiency and language skills needed for daily communicative purposes, academic success and future careers. With a special emphasis on the domain-specific materials on science and technology, students are expected to improve their language skills through extensive exposure to a variety of meaningful and authentic contents. On the one hand, students are required to read materials on different topics in hope for a progressive improvement of the domain-specific professional English proficiency. In this semester, we will be reading the _transcripts_ from TED Talks in many different fields. Most importantly, domain-specific words, language structures and patterns will be contextually illustrated and emphasized in relation to their pragmatic uses in relevant contexts. On the other hand, students will learn how to improve their English proficiency based on authentic materials via guided watching of various types of multimedia in class. Crucially, through authentic clips available on the Internet, students are expected to acquire the know-how of a multi-modal language learning and formulate their own learning habits in the long run.\n\nIn addition, this course will promote a skill of vocabulary learning — Use-in-Context! Students are expected to enrich their professional vocabulary via the class materials in different disciplines and mediums. Throughout the semester, students will learn how to contextualize the new words in a text by weaving them back into a descriptive summary of the text _verbally_. That is, after reading a text or watching a short clip, students will learn how to (1) identify the keywords in the material, (2) find out their meanings in the particular context, (3) and re-tell the main idea of the text using these keywords. This multi-modal approach of vocabulary learning not only enriches students’ vocabulary size but also increases students’ verbal skills by motivating them to use words in the real context. The ultimate goal is to sharpen students’ communicative competence via a maximal exposure to the various inputs of English.\n\nMaterials\n=========\n\n1.  Selected TED Talk transcripts\n2.  Other faculty-assigned video clips on the Internet\n\n_NB: All the class materials will be made available online for all the students enrolled._\n\nGrading Policies\n================\n\n*   Attendance & Class Participation: 10%\n*   Assignments: 20%\n*   Midterm: 30%\n*   Final: 40%\n\nTentative Schedule\n==================\n\n**Week**\n\n**Date**\n\n**Topics**\n\n1\n\n0221\n\nIntroduction\n\n2\n\n0228\n\n**Holiday**\n\n3\n\n0307\n\n電腦、計算、與自然語言處理(Computer, Computing, and Natural Language Processing)\n\n4\n\n0314\n\n電腦、計算、與自然語言處理(Computer, Computing, and Natural Language Processing)\n\n5\n\n0321\n\n機器學習是什麼? (What is machine learning?)\n\n6\n\n0328\n\n機器學習是什麼? (What is machine learning?)\n\n7\n\n0404\n\n**Holiday**\n\n8\n\n0411\n\nRe-cap\n\n9\n\n0418\n\n**Midterm Exam**\n\n10\n\n0425\n\n人工智慧是什麼? (What is Artificial Intelligence?)\n\n11\n\n0502\n\n人工智慧是什麼? (What is Artificial Intelligence?)\n\n12\n\n0509\n\n人工智慧和倫理 (Ethical Issues in AI)\n\n13\n\n0516\n\n人工智慧和倫理 (Ethical Issues in AI)\n\n14\n\n0523\n\n大數據 (Big Data)\n\n15\n\n0530\n\n大數據 (Big Data)\n\n16\n\n0606\n\n大腦與學習 (Brain and Learning)\n\n17\n\n0613\n\n大腦與學習 (Brain and Learning)\n\n18\n\n0620\n\n**Final Exam**\n\nHouse-keeping Rules\n===================\n\n1.  Please come in class on time.\n2.  Please hand in your assignment on time.\n3.  Please do not skip classes.\n4.  No food, drinks, and cell phone in class.\n5.  Preview is highly-recommended.\n\nRequirements and Rules\n======================\n\n1.  This class will be conducted in both English and Chinese.\n2.  Class attendance, lesson preparation and active class participation are required.\n\n\\[\\*I’ll take attendance throughout the semester.  If you **miss the call for more than 3 times, you will fail this course**.  Being late for over 20 minutes is treated as absence for the class that day.  If you are absent in case of uncontrollable situations (e.g. illness, emergency, etc.), be sure to give me **the official valid proof within two weeks**.\\]\n\n1.  Absence from a class is no excuse for not knowing the assignment and what has been discussed in that class. It is **your responsibility** to ask your classmates or the instructor what has been covered in the class.\n2.  **Late assignments** will NOT be accepted. Please keep this in mind.\n3.  **Cheating on quizzes or exams** is absolutely forbidden.  If someone is found cheating on an exam/quiz, he/she will fail that exam.\n4.  **Quizzes** will be given either at the beginning or at the end of each class meeting to check your comprehension of the class materials and your attendance (**without prior notice**). There will be no make-up quizzes unless an official leave application form is presented.\n5.  **No food, drinks, and cell phones** in class.",
    "methodologies": [
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": ""
        },
        {
            "type": "期中考",
            "weight": 30,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 40,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        }
    ],
    "prerequisite": "◎必須先修過【英文(一)】◎必須先修過【英文(二)】",
    "general_core": []
}