{
    "year": 107,
    "term": 2,
    "name": "英文（三）：科技英文",
    "teachers": [
        "孔繁偉"
    ],
    "department": "CU",
    "code": "00UB908",
    "credit": 2,
    "serial": 352,
    "group": "E",
    "quota": {
        "limit": 35,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "正104"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎必須先修過【英文(一)】◎必須先修過【英文(二)】",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本課程旨在加深學生的英語能力，結合與科學及科技等相關主題規劃英語授課內容，期透過主題式課程增進學生興趣並提升英語基本能力及學術應用可能。",
    "goals": [
        "1. 增進學生英語溝通表達能力 2. 透過參與課程活動促進團隊精神 3. 透過多面向英語閱讀促使學生了解多元文化，拓展學生國際化視野 4. 透過課堂討論培養批判精神 5. 提升學生英語學習動機及自主學習興趣"
    ],
    "syllabus": "**ENGLISH III—English for Science and Technology**\n\n**Spring Semester 2019**\n\nGoal: The goal of this course is to help students develop their English proficiency so that they will be better able to comprehend and use English in the courses they study in their major and in their daily lives. Through a series of talks, discussions, and projects, students will work on developing their speaking, listening, reading, writing, and vocabulary skills.  \n\nObjectives:\n\n1.      To help students continue to develop the skills they will need to employ when reading, listening, or discussing materials related to science and technology that have been published in English.\n\n2.      To teach students to think critically about the issues addressed in the readings and in class. \n\n3.      To provide classroom opportunities for the discussion of thoughts and ideas generated from students’ use of critical thinking skills.\n\n4.      To develop students’ presentation skills so that they can effectively prepare and deliver a presentation in English.\n\n5.      To provide opportunities through the use of homework to allow students to show their understanding of the course content. \n\n6.      To give students opportunities to apply English skills to tasks required for their own majors.    \n\n7.      To introduce students to some of the online resources available in English that are devoted to science and technology topics.  \n\n8.     To provide students with opportunities to explore other materials on science and technology topics that are of global interest. \n\nRequirements\n\n1.  Attendance and Preparation\n\nIt is very important that students attend class on a regular basis and that students prepare any homework assignments.  If you miss class frequently, points will be deducted from your final grade for the course, and it is possible that you may fail the course.  Please arrive for class on time. Continually arriving for class late will be viewed as an absence.  \n\n2.  Participation\n\nIt is expected that students will be active participants in the learning process.   \n\n3.  Projects \n\nStudents will be asked to complete a number of individual and group projects related to the material and activities in the textbook.  \n\nClass schedule (tentative and subject to change based on our need)\n\nWeek 1: Orientation\n\nWeek 2: Sociology: Home and travel\n\nWeek 3: Homeless and tech\n\nWeek 4: Helping and hating the homeless\n\nWeek 5: The Robber Barons\n\nWeek 6: The politics of Progressivism\n\nWeek 7: Message to Wall Street\n\nWeek 8: One hundred years of cinema\n\nWeek 9: A conversation with Leo Tolstoy on Film\n\nWeek 10: An interview with James Cameron\n\nWeek 11: Mind Control and the Internet \n\nWeek 12: The positive effects of social networking sites\n\nWeek 13: The use of social media in the Arab spring\n\nWeek 14: In search of memory\n\nWeek 15: The brain and human memory\n\nWeek 16: Music and the brain\n\nWeek 17: Review and evaluation\n\nWeek 18: Review and evaluation",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Weekly lecture"
        },
        {
            "type": "討論法",
            "note": "Discussion"
        },
        {
            "type": "合作學習",
            "note": "Group work"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": "Participation"
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "Final paper"
        },
        {
            "type": "成果展覽",
            "weight": 40,
            "note": "Presentation"
        }
    ],
    "prerequisite": "◎必須先修過【英文(一)】◎必須先修過【英文(二)】",
    "general_core": []
}