{
    "year": 107,
    "term": 2,
    "name": "英文（二）",
    "teachers": [
        "蘇鈺恩"
    ],
    "department": "CU",
    "code": "00UB8A4",
    "credit": 2,
    "serial": 322,
    "group": "G",
    "quota": {
        "limit": 35,
        "additional": 0
    },
    "schedule": [
        {
            "day": 5,
            "from": 1,
            "to": 2,
            "campus": "本部",
            "classroom": "正104"
        }
    ],
    "programs": [],
    "comment": "文學院（英語系除外）、藝術學院、科技學院、車能學位學程、體育系、台文系、華語系(國華組)一年級 (能力分班)",
    "restrict": "◎第一階段需人工加選◎第二階段需人工加選◎加退選階段需人工加選 ◎必須先修過【英文(一)】",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "共同科英文（二）課程為一學期兩學分課程，係為非英語系學生所開設的課程。目標在幫助大一學生活用中學時期所累積的英語知識，提昇英語聽、說、讀、寫整體的溝通能力。為達此目標，本課程要求教師盡量用英語上課，努力營造一個豐富的英語環境，讓學生不但有充分機會以英語參與課堂活動，且樂於使用英語與同學及老師溝通。",
    "goals": [
        "1. 增進學生英語溝通表達能力 2. 透過參與課程活動促進團隊精神 3. 透過多面向英語閱讀促使學生了解多元文化，拓展學生國際化視野 4. 透過課堂討論培養批判精神 5. 提升學生英語學習動機及自主學習興趣"
    ],
    "syllabus": "Week\n\nDate\n\nUnit\n\nAssignment and Content\n\n1\n\n2/22\n\nCourse Introduction\n\n1.  Grouping, warm-up games\n\n2\n\n3/1\n\nNo class\n\nPersonal assignment for next week: introduce your “home”/ “hometown” (3-5mins)\n\n3\n\n3/8\n\nUnit 7\n\n4\n\n3/15\n\nUnit 7\n\n5\n\n3/22\n\nUnit 7\n\n1.  Group report: two groups\n2.  Peer evaluation and feedback\n\n6\n\n3/29\n\nUnit 1\n\n7\n\n4/5\n\nNo class\n\n8\n\n4/12\n\nUnit 1\n\n9\n\n4/19\n\nUnit 1\n\n1.  Group report: two groups\n\n2.     Peer evaluation and feedback\n\n10\n\n4/26\n\nMiddle Exam Week:\n\n3 minute Presentations\n\n(individual presentation)\n\nIndividual presentation and peer evaluation and feedback\n\n11\n\n5/3\n\nUnit 5\n\n12\n\n5/10\n\nUnit 5\n\n13\n\n5/17\n\nUnit 5\n\n1.     Group report: two groups\n\n2.     Peer evaluation and feedback\n\n14\n\n5/24\n\nEnglish debate games\n\nPreparation for debate games\n\n15\n\n5/31\n\nEnglish debate games and wrap up\n\n16\n\n6/7\n\nNo class\n\n17\n\n6/14\n\nFinal presentation: individual interview \n\nEach student need to come in specified time\n\n18\n\n6/21\n\nFinal presentation: individual interview \n\n**教學目標 Objectives:**\n\n本課程主要目標為幫助學生增進其英文能力，並深化學生對英文的興趣、幫助學生建立其對英文使用的信心及熟悉。學生的積極參與、課堂討論與練習會是本課程所重視的主要部分。本課程將用不同活動引導學生運用基本的英文語句及字詞來幫助建立對英文的熟悉度，包含活用不同視覺媒體及遊戲及時事新聞。透過不同討論、練習及教師逐步引導，除基本的英文讀寫，本學期期許提升學生基本的英文聽說能力。學生將學習除了學習英文外，對主題或議題進行多方面的批判思考，而非只是熟悉單字及文法。\n\nThis course aims to help students to develop and improve their English abilities; meanwhile, it also helps to build up students’ confidence and interests in English. Student’s participation, discussion, and group activities in class will be the main focus of this course. Different activities will be offered to guide the students to apply basic English vocabularies, sentences, and grammar to build the familiarity toward English, including using different kinds of visual aids, games, and news...etc. \n\nStudents will engage in different discussion and practice under the instructor’s guide to improve students’ English speaking, listening, writing, and reading abilities. Besides from understanding the grammar and vocabulary, students are required to have further critical thinking toward the issues, subjects, and contents given in class.\n\n**Teacher’s email:** [winds10242000@gmail.com](mailto:winds10242000@gmail.com)\n\n(if you have any problems, please do contact me in advance )\n\n**Textbook:**\n\nPaul Dummet, Helen Stephenson, Lewis Lansford. (2017). _Keynote 3._ National Geographic Learning.\n\n(Please bring your textbook every time. Your teacher will inform you when you need it or not.)\n\n**上課規則及要求****Requirements and Rules:**\n\n1.  If you want to succeed in this class, you need to be willing to devote time participating every class activity, assignment, discussion, and presentation. Your learning attitude is essential in this class. You need to focus both on your presentation and class activities. If you have good performance on your presentation but don’t join any class activities, discussion, or practice, you won’t get a higher score for this class.\n2.  **You’ll be asked to mainly speak in English during the class as much as you can**, but you can ask for help in Chinese sometimes. You need to force yourself to practice in English then you can improve by yourself.\n3.  Attendance is required. **Missing 5 classes, without telling your teacher in advance with a proper reason, you will be failed for this class. Please note that if you’re late for too long, you’ll be absent for that class. For 1 absence, it costs you 2 points every time.**  \n4.  **If you don’t participate in class activities, including sleeping, using your phone, chatting, not paying attention, or doing other things not about this class, it’ll cost you 3 points each time.**\n5.  **Group presentation of each unit:** each time we finish a unit, the assigned group needs to use the words, phrases, sentences you learned in class of every unit to make a brief presentation.\n6.  For this semester, you will share with the class something you know very well in a **3-minute oral presentation**. You can choose any topics which you’re familiar with. Further details will be told in class.\n7.  In the end of this class, each of you will be doing the personal interview with your teacher in English in 10 mins. You’ll be asked to give your personal answers. Approximate questions will be given in advance before the interview week.\n8.  This course aims to offer a positive and comfortable learning environment for all the students to learn in a positive, relaxed, happy mood, so **please RESPECT your classmates, your teacher, and this class. Any serious violation of this class might cause great outcomes on your final score. If you have any problems, please do tell your teacher and have a discussion in advance.**\n\n**Grading:**\n\n1.     Group Presentation  25%  (Vocab , phrase, sentence10% + PPT 5% +Oral 10%)\n\n2.     3 Minute Presentation  10% (PPT 5% + Oral 5%)\n\n3.     Class participation  ( including assignments, class practice, group discussion…etc.) 20 %\n\n4.     Personal Interview  25%\n\n5.     Attendance 20%\n\n**Extra bonus and Makeup activities:**\n\nIf you think you have a bad performance in class, including your attendance, presentation, class participation, you can do the makeup activities.(You teacher will inform you in advance) For those who wants extra points for their final score, you can still do one of these activities.  \n\n1.  Attend a competition or event held in English and tell your teacher every detail about the content when you’re doing the interview with your teacher in the end of the semester. That means, your interview time will be longer for around 15-20 mins. You’ll be asked to answer questions about your participation of the event and show any proof of your participation.\n2.  Visit 英語聊天室English Chat Room (本部樸 102/公館圖書館) at least for 10 hours (you don't have to stay one just for 10 hours, it can be accumulated for several times). Please log into the system to record your visits and give me your records by the end of the class. Please notice that you need to finish this activity before the end of the semester, for our librarian will also send me your records at Chat Room before the end of the semester. So if you go to the Chat Room in the last week of this semester, you won’t get any proof from the library.",
    "methodologies": [
        {
            "type": "講述法",
            "note": "teacher's guide and instruction"
        },
        {
            "type": "討論法",
            "note": "Q&A discussion"
        },
        {
            "type": "問題解決教學",
            "note": "Q&A discussion and sharing"
        },
        {
            "type": "合作學習",
            "note": "group discussion and class activities"
        },
        {
            "type": "專題研究",
            "note": "group presentation of each unit"
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 10,
            "note": "3-minute presentation"
        },
        {
            "type": "期末考",
            "weight": 25,
            "note": "person interview"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "class participation, practice, and discussion"
        },
        {
            "type": "出席",
            "weight": 20,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 25,
            "note": "group presentation"
        }
    ],
    "prerequisite": "◎必須先修過【英文(一)】",
    "general_core": []
}