{
    "year": 108,
    "term": 1,
    "name": "專題討論：課程、教學與評量",
    "teachers": [
        "張文華"
    ],
    "department": "SD45",
    "code": "SED0091",
    "credit": 2,
    "serial": 2659,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 4,
            "from": 3,
            "to": 4,
            "campus": "公館",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "選修同學須具備科學教育或數學教育基礎",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本課程旨在培養對於課程、教學與學習之重要發展及當前相關議題之瞭解，並經由設計、分析及執行之過程中，發展適切的科學課程、教學、及評量之理念、模式及策略。",
    "goals": [
        "瞭解課程、教學及學習理論之發展與研究，鑑識國內外當前主要相關議題，並能進行比較、分析、評論。",
        "熟悉重要教學理論及學習理論發展現況，藉以分析教學實務案例，促進達成有效科學教學及學習。",
        "瞭解科學課程的重要沿革，運用教學與學習理論對課程進行不同層次的分析與設計。"
    ],
    "syllabus": "\\*由以下內容選擇其中10項主題，配合學生自選主題，進行教學。\n\n1.  9/19 NRC (2013). Next Generation Science Standards. [https://www.nextgenscience.org/](https://www.nextgenscience.org/)\n\n教育部(2017)。自然科學學習領域綱要。[https://www.naer.edu.tw/files/15-1000-14113,c639-1.php?Lang=zh-tw](https://www.naer.edu.tw/files/15-1000-14113,c639-1.php?Lang=zh-tw)\n\nMore Ref. Osborne, J. (2014). Teaching scientific practices: Meeting the challenge of change. Journal of Science Teacher Education, 25, 177-196.\n\n拼圖磁鐵活動。\n\n作業主題1：挑選一個你在中學時期學得最好或最不好的科學概念，分析並比較該概念在NGSS和新課綱中分別如何安排學習進程。準備10分鐘口頭報告。\n\n1.  9/26 AAAS (2000). Atlas. ([http://www.project2061.org/publications/atlas/](http://www.project2061.org/publications/atlas/))\n\nMore Refs.: Lederman, N. G., & Lederman, J. S. (2014). Is nature of science going, going, going, gone? _Journal of Science Teacher Education, 25_, 235-238.\n\nFord, M. (2008). Disciplinary authority and accountability in scientific practice and learning. _Science Education, 92_, 404-423.\n\n作業主題2：請運用(拼圖磁鐵活動)設計一個學習活動，協助學生了解science and engineering practices。準備10分鐘口頭報告。\n\n1.  10/3 Yarden, A., Norris, S. P., & Phillips, L. M. (2015). Chapter 2-Adapting primary literature for promoting scientific literacy, In Adapted primary literature: The use of authentic scientific texts in secondary schools. Dordrecht, the Netherlands: Springer. (eBook)\n\n作業主題3：閱讀文獻、寫摘要及準備10分鐘口頭報告。\n\n(10/10 off)\n\n1.  10/17 Yarden, A., Norris, S. P., & Phillips, L. M. (2015). Chapter 5- Creating and using adapted primary literature. In Adapted primary literature: The use of authentic scientific texts in secondary schools. Dordrecht, the Netherlands: Springer. (eBook)\n\n作業主題4：閱讀文獻、寫一頁摘要示例你會如何創造APL，及準備10分鐘口頭報告。\n\n1.  10/24 吳月鈴、鄭志鵬、張揮鈺、葉辰楨、張文華(2019)。國教院跨科主題模組研發成果：能量從哪裡來？去哪裡？([https://sites.google.com/lsjh.tp.edu.tw/energy/%E5%89%8D%E8%A8%80](https://sites.google.com/lsjh.tp.edu.tw/energy/%E5%89%8D%E8%A8%80))。\n\n作業主題5：請選擇新課綱中的一項跨科概念，說明你對該項跨科概念的理解及建議教學設計原則。準備10分鐘口頭報告。\n\n1.  10/31 Richards, J. C. (2008). Interdisciplinary teaching: History, theory, and interpretations In V. L. Akerson (Ed.) Interdisciplinary language arts and science instruction in elementary classrooms: Applying research to practice. Mahwah, NJ: LEA.\n\nMore Ref.: Sadler, T. D. (2008). A sociocultural perspective on scientific literacy and learning science. In V. L. Akerson (Ed.) Interdisciplinary language arts and science instruction in elementary classrooms: Applying research to practice. Mahwah, NJ: LEA.\n\n作業主題6：閱讀文獻、寫摘要及準備10分鐘口頭報告。\n\n1.  11/07 教育部(2018)。讀+科學：科學閱讀教學36問。台中：教育部國民及學前教育署。(pdf)\n\n作業主題7：選擇一章閱讀、寫摘要及準備10分鐘口頭報告。\n\n1.  11/14 期中考週\n\n期中作業：繳交三頁期末專題架構（含摘要、文獻架構、重要文獻列表、三個重要論點）\n\n1.  11/21 Chen Y-C, Benus MJ, Hernandez J. Managing uncertainty in scientific argumentation. Science Education. 2019;1–42. [https://doi.org/10.1002/sce.21527](https://doi.org/10.1002/sce.21527)\n\n作業主題9：閱讀文獻、寫一頁摘要示例你會如何編碼課室中的對話(包括code, definition, and at least one example)，及準備10分鐘口頭報告。\n\n1.  11/28 任宗浩。素養導向評量的界定與實踐。([https://reurl.cc/7Y53k](https://reurl.cc/7Y53k))\n\nMore Refs.: 素養導向評量、實作評量、…等另類學習評量方式\n\n作業主題10：針對作業主題1的科學概念，設計示例一種另類評量，及準備10分鐘口頭報告。\n\n1.  12/05-12/07 第35屆科學教育國際研討會\n\noptional作業主題11：選擇有興趣之課程教學或評量研究主題，聆聽報告，撰寫一頁摘要及向作者提問。\n\n1.  12/12 She, H.-C., Lin, H. S., & Huang, L. Y. (2019 online). Reflections on and implications of the programme for international student assessment 2015 performance of students in Taiwan: The role of epistemic beliefs about science in scientific literacy. JRST. DOI: 10.1002/tea.21553\n\n   optional作業主題12：閱讀文獻、寫摘要及準備10分鐘口頭報告。\n\n1.  12/19 NRC (2016). Using phenomena in NGSS-Designed lessons and units. ([https://www.nextgenscience.org/sites/default/files/Using%20Phenomena%20in%20NGSS.pdf](https://www.nextgenscience.org/sites/default/files/Using%20Phenomena%20in%20NGSS.pdf))\n\nMore Refs.: 王雅玲、詹寶菁(207)。芬蘭新課程綱要及現象為本學習之探究：兼論其對台灣實施跨領域課程之啟示與挑戰。**國家教育研究院教育脈動電子期刊****，****11**，1-15。([http://ericdata.com/tw/detail.aspx?no=285665](http://ericdata.com/tw/detail.aspx?no=285665))\n\nSymeonidis, V., & Schwarz, J. F. (2016). Phenomenon-based teaching and learning through the pedagogical lenses of Phenomenology: The recent curriculum reform in Finland. Forum Oświatowe, 28(2), 31–47. Retrieved from http://forumoswiatowe.pl/ index.php/czasopismo/article/view/458\n\noptional作業主題13：閱讀文獻、設計示例你如何運用現象為本教學的觀點，修改現有教學活動，及準備10分鐘口頭報告。\n\n1.  12/26 Beyer, C. J., Delgado, C., Davis, E. A., & Krajcik, J. (2009). Investigating teacher learning supports in high school biology curricular programs to inform the design of educative curriculum materials. JRST, 46(9), 977-998.\n\noptional作業主題14：閱讀文獻、寫摘要示例你會如何修改教科用書及準備10分鐘口頭報告。",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": "Please prepare a 10 minute presentation and two discussion questions. Submit the files to Moodle the day before each lesson.\n5 points for each required topic (10 min. presentation, and 2 questions). 10 points for one self-select topic."
        },
        {
            "type": "專題研究",
            "note": "撰寫一篇專題書面報告(含表格及文獻清單至多10頁A4，單行間距)，並於期末考週就書面報告內容提出口頭報告，報告時間約為20分鐘(含討論)。\nPlease select a topic and write a brief review based on related references in science education journals (SE, IJSE, JRST, RISE, IJSME...)"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 60,
            "note": "5 points for each required topic (10 min. presentation, and 2 questions). 10 points for one self-select topic."
        },
        {
            "type": "專題",
            "weight": 40,
            "note": "a brief review, no more than 5000 words, Single space."
        }
    ],
    "prerequisite": "",
    "general_core": []
}