{
    "year": 110,
    "term": 2,
    "name": "社區環境教育",
    "teachers": [
        "王順美"
    ],
    "department": "SM46",
    "code": "EEC0017",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 2684,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 2,
            "to": 4,
            "campus": "公館",
            "classroom": "行304"
        }
    ],
    "programs": [],
    "comment": "要求具備相關基礎課程",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "本課程透過導讀、討論、案例探討及實作，介紹社區環境教育的內涵及作法。認識參與、培力賦權、批判思考、協商及夥伴關係對社區運作的重要，以及這些要素如何藉由社區營造、利害關係人互動及問題解決模式的策略實踐，以培養認識地方、與地方建立關係的能力，環境關懷及行動力，能以社區或社群為本位合作式的永續發展相關的學習。",
    "goals": [
        "對社區及社區發展的認識（定義、組成、過程），以及對於社會變遷，社區議題的產生與解決途徑的認識",
        "對於成人教育的理論、社區問題解決教學模式、社會學習理論、自願學習的認識",
        "培養學生成為具備環境行動力及環境素養的公民"
    ],
    "syllabus": "**社區環境教育****2022**\n\n**社區環境教育**\n\n**理念：**社區營造與環境教育往往是一體兩面(社區設計)，社區營造乃為建構永續社區，解決社區的問題，過程中應邀請民眾一起的溝通、建立願景、診斷問題及提出解決策略及行動。在地的人受到關照也能關照人，更成長、發揮及心靈滿足，人與地方環境、其他生靈、外界支援共存共榮。這個過程是一個環境教育（學習）的歷程。\n\n**特質；**參與者是當地居民、學校、公司、機構（男女老少），經常在此地出沒者。透過地方本位教育（學校與社區）、社區營造過程（外來的協助者或專業者），包括引導參與、對話、建立社會資本、社會網絡、社區問題調查與解決技能、批判思考，培養其對地方的認知、地方感、擁有感、培力賦權、負責。\n\n**修課學生：**對於社區環境教育的認識並且有初步的服務或研究的經驗，為coordinator預備。\n\nCommunity environmental education\n\nCourse Description\n\nThis course is to introduce the content and approach of community environmental education through reading, discussion, case study and practice. The learners will clarify the importance of participation, empowerment, critical thinking and partnership for the learning in the community. They also discuss how it is possible that the environmental concern, the sense of place, responsible environmental behavior and action competence and collaboration for sustainable development will be built through community development, stakeholder interaction and problem solving approaches.\n\n**課程目標**\n\n瞭解本學期修課的同學的修課需求，本學期課程目標，為理論、案例評析及社區實做。\n\n*   理論部分，以閱讀文獻及討論方式，探討社區營造、社區問題解決、社會資本、社會網絡、組織學習、參與、賦權。前二部分乃對社區整體的瞭解，後面理論為對社區內部互動、組織的探討。導讀一小時\n*   社區案例部分，除了課程提供外，鼓勵同學分享自己既有的社區經驗或引入案例。案例部分，重視與理論的對話及評析。\n*   社區實做，找尋一個合適的社區，共同就環境議題採取行動，以達親自經歷參與、批判性思考、賦權之目的\n\n**課程特色**\n\n課程進度，因應社區案例狀況(目前有同學，提出到苗栗參與石虎社區保育工作)，採彈性調整。\n\n**評量**\n\n上課的參與、導讀、提供資料、提問30%\n\n個人作業：社區案例報告及剖析、課堂作業40%\n\n小組作業：社區實作報告30%\n\n課程表\n\n階段\n\n時間\n\nLecture & Reading\n\nPractice\n\n建立關係\n\n開學前\n\n拜訪stakeholders:\n\n社區營造理念、\n\n認識社區走讀、\n\n社區議題推動策畫\n\n第1-10週\n\n1.  修課動機、課程行動方案 (古巴影片)1次\n2.  社區案例分享 (社區資產運用) 1次\n3.  永續社區 (台灣、澳洲)導讀1次\n4.  認識社區(自然、認識人)\\*\\* 2次\n5.  磺溪生活流域社區行動經驗分享及剖析 (毓仁) 1次\n6.  社區議題行動構想討論2次\n\n*   2.社區資產評估\n*   3.地方創生的挑戰(認識社區)\n*   4.社區設計(共讀)\n*   6.U型理論\n*   6.design for change\n*   6.防災社區教育架構(stakeholders及教育架構)\n\n3.目標：發現探索、了解地方。剖析社區 (人口/組織/地理/自然資源/產業/活動) 、社區行動\n\n1)田野資料、文獻收集\n\n2)場域探索，觀察了解實際場域\n\n3)訪談，建立關係，收集第一手資料、需求與期待，合作的夥伴及場域\n\n4)綠色生活地圖\n\n6.目標：定義關鍵主題、挑戰點與需求、行動構想\n\n1) 傾聽、同理：了解居民特質、需求、行政連結\n\n2) 收斂關鍵主題、挑戰點與需求。連結期待與願景、培力\n\n3) 提出：培力目標及設計聲明statement（海報發表）\n\n社區交流行動方案\n\n第11-16週\n\n7.地方互動實踐2次\n\n8\\. 活動反思及課程反思1次\n\n*   7.(社會)資本、社會網絡\n*   7.世界咖啡館\n*   7.地方感 (洪如玉)、地方本位教育\n*   7.參與\n*   7.賦權\n\n1.  社會資本、社會網絡：由環教所研究生組成執行團隊、分組規劃\n\n   、執行工作坊或採取行動\n\n1.  宣傳、招聚居民\n2.  協力辦理世界咖啡館\n3.  彙整社區行動方案(及實踐)\n\n*   社區力量-古巴如何渡過產油高峰期(影片)\n\n*   蔡宏進 (1991)**社區原理**第1、4-8章。台北市：三民。(自修)\n*   ESD澳洲社區層級的作法(local agenda 21, community volunteer, social marketing, community interpretation, multi-culture, facilitation & mentoring)\n*   Dietz, T., Ostrom, E. & Stern, P. C. (2003). The Struggle to Govern the Commons. Science 302: 1907-1910 .\n*   黃源協、蕭文高、劉素珍 (2009) 從「社區發展」到「永續社區」：臺灣社區工作的檢視與省思。台大社會工作學刊。19: 87-131。\n*   Sobel, D. Place-based education: connecting classroom and community.\n*   Smith, G. Place-based education- learning to be where we are  \n*   洪如玉, 全球化時代教育改革與發展的另類思考-地方本位教育\n*   審議式民主 (案例s)\n*   Scharmar, C. Otto (戴至中 譯) (2019) The Essentials of Theory U: Core Principles and Principles and Aplications. U型理論精要: 從「我」到「我們」的系統思考，個人修練、組織轉型的學習之旅。台北市:經濟新潮出版社。\n*   Reid, Alan & Nikel, Jutta (2008) Differentiating and Evaluating Conceptions and Examples of Participation in Environment-Related Learning. From Reid, Alan, Jensen, Bjarne Bruun, Nikel, Jutta and Simovska, Venka Participation and Learning: Perspectives on Education and the Environment, Health and Sustainability. Springer.\n*   Arnstein, S. R. (1969) A ladder of citizen participation. Journal of American Institute of Planners. 35:216-224.    \n*   Hogan, C. (2000) Facilitating Empowerment: A Handbook for Facilitators, Trainers and Individuals. London: Kogan Page. Chapter 1. 1-18.\n*   地方創生(案例s)\n*   Coleman(1988) Social Capital in the Creation of Human Capital\n*   Caldera and Beckie(2011) Engaging communities in municipal sustainability planning: the use of communication strategies and social networks in Alberta.",
    "methodologies": [
        {
            "type": "講述法",
            "note": "講述社區社區發展、地方本位教育等重要理論"
        },
        {
            "type": "討論法",
            "note": "不同類型社區案例及社區環境教育案例討論"
        },
        {
            "type": "合作學習",
            "note": "與社區核心人員共同規畫社區願景及活動"
        },
        {
            "type": "實驗/實作",
            "note": "待討論"
        },
        {
            "type": "實地考察、參訪",
            "note": "待討論"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 80,
            "note": "每週上課的分享討論及實作作業"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}