{
    "year": 110,
    "term": 1,
    "name": "跨域設計研究",
    "teachers": [
        "林凱元"
    ],
    "department": "T",
    "code": "T0C9003",
    "credit": 3,
    "serial": 3315,
    "group": "",
    "quota": {
        "limit": 15,
        "additional": 5
    },
    "schedule": [
        {
            "day": 2,
            "from": 9,
            "to": 10,
            "campus": "本部",
            "classroom": "教室自排"
        }
    ],
    "programs": [
        "科技藝術學程"
    ],
    "comment": "美術系館405教室",
    "restrict": "◎限大二大三大四 ◎限碩一碩二碩三以上修習",
    "form_s": "",
    "classes": "9",
    "dept_group": "",
    "hours": 3,
    "description": "本課程著重跨領域整合與協作，在既有服務或產品上重新設計，或描繪一個未來去提出創新。透過文獻探討與實地調查訪談，解構現階段，探究真正的問題，思考根本對策。其成果期許為參展與國際研討會導向，並著重產品或服務的現實可行性或未來擴展性。",
    "goals": [
        "讓學生接觸不同領域可應用的資源",
        "讓學生熟悉跨領域合作模式"
    ],
    "syllabus": "**【授課方式：16+2週】 ※彈性授課辦法請與教師保持電子郵件聯絡**  \n  \n**課程主旨 (Goal)**:\n\nOur goal is to design the social /information system that links our lifestyles, experiences, future issues and the Internet together. These activities will develop a way to enhance our daily experiences and reform the society. This unrestricted global environment will improve communication between and within the Internet and the real world, promoting the creation of new products and services. This course doesn’t limit the field, students are expected to rediscover the conventional interface and service, and pull out the hidden touch point or redesign the system. The key elements for the lecture will be HCI research and Media design.\n\n**進度** **(schedule)**:\n\n1 Innovation pipeline 1 Media and Design\n\nWhat is Media and design? We will explore the concept of design. In addition, we will also understand how the Internet and media are being incorporated into modern design.\n\n2 Innovation pipeline 2 Interaction and interface\n\nInteraction design usually linked to the interface, but interface is not only virtual one on the screen. We will explore the multiple interfaces in the physical life and try to redesign or give the new concept to them.\n\n3 Innovation pipeline 3 J-ACG\n\n\"Anime\", \"Game\", \"Comic\", and \"Cosplay\" are some of the aggressive and innovative forms of pop culture found in Japan and now spreading worldwide. So called “Otaku” culture are now focused throughout the globe and giving Japan an important role to enhance innovative creativity. We explore the roots of these otaku cultural activities in Japan, considering these contents as a material.\n\n4 Innovation pipeline 4 Project management\n\nLearn management-related skills which will be necessary and important for projects to realize. This includes cross-disciplinary understanding, efficient communication and business strategy.\n\n5 Design research: Fieldwork and observation\n\nYou will be asked to visit the related fields of your research, and have in-depth interview as well as observation on site.\n\n6 Design research: Academic writing and logic\n\nWe will discuss some research questions and explain the academic narration. Additionally, Latex will be introduced.\n\n7 Design research: Deconstruction and Fundamental measure\n\nTo disassemble the product or system and understand its structure and production method. Base on the given issue, you will be asked to find out the solution based on different aspects.\n\n8 Design research: Transnational exchange and discussion\n\nWith the university in Japan or Korea, we are planning to organize the workshop or presentation between.",
    "methodologies": [
        {
            "type": "討論法",
            "note": "Experiencing design and implementation will be held based on groups. Maximin 4 members per group."
        },
        {
            "type": "問題解決教學",
            "note": "During each class, you will be asked to understand the “needs” of conceptual design and realization process based on steps."
        },
        {
            "type": "合作學習",
            "note": "You will be asked to collaborate with students from different disciplines."
        },
        {
            "type": "實地考察、參訪",
            "note": "You are required to go to the site or field of your research theme and bring back the primary sources."
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "希望修課同學可以多與不同領域的人交流並從對方角度思考合作模式"
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "課程目標為確立研究題目並對外展出成果。著重在互動介面與系統設計，其表現形式不限"
        },
        {
            "type": "成果展覽",
            "weight": 40,
            "note": "期許學生均能參與國際性學術研討會或展覽"
        },
        {
            "type": "專題",
            "weight": 20,
            "note": "議題討論＋小組論文報告各一次"
        }
    ],
    "prerequisite": "",
    "general_core": []
}