{
    "year": 107,
    "term": 2,
    "name": "MYP的教與學（IB）",
    "teachers": [
        "柘艾衛"
    ],
    "department": "EU",
    "code": "IBU0003",
    "credit": 3,
    "serial": 646,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 5,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "教室自排"
        },
        {
            "day": 5,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "教室自排"
        },
        {
            "day": 6,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "誠105"
        },
        {
            "day": 6,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "誠105"
        }
    ],
    "programs": [
        "國際教師學程-國際"
    ],
    "comment": "授課教師Dr, Eric Jabal。本課程為密集授課課程，實際授課時間為2/23 (六)、3/29 (五)、4/19 (五))、4/20 (六)、 5/10 (五) 、5/11 (六) 、5/31、 6/1 (六))、6/14 (五)、皆於9：00-16：00上課(中午休息一小時)。    上課時間異動:(五)於進修推廣部B1 003教室，(六)維持在誠105教室",
    "restrict": "◎第二階段需人工加選  ◎第一階段限 國際教師學程-華語文 國際教師學程-數學 國際教師學程-物理 國際教師學程-國際◎限國際教師學程-華語文、國際教師學程-數學、國際教師學程-物理、國際教師學程-國際選修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course aims to cultivate preservice teachers’ pedagogical content knowledge in IB education with an emphasis on the MYP. Preservice teachers will learn that MYP has a curriculum framework and explore IB standards. They will learn how to construct interdisciplinary units and inquiry-based learning through proposing quality statement of inquiry, engaging ATT and ATL in units, and planning appropriate formative assessments. Strategies to supervise MYP students to work on service as action and personal projects are also discussed in class. Examining IB MYP publications and collaborating with peer are required. Workshop leaders are also invited to prepare preservice teachers to become candidates of IB practitioners.",
    "goals": [
        "Know how topics in subject content can be learned and taught in alignment to IB principles",
        "Show the competence to deconstruct the intended learning goals and develop corresponding materials",
        "Design learning activities and teaching strategies that are developmental appropriate to learners aged 12 to 16 to promote inquiry and support the achievement of learning objectives.",
        "Be able to communicate and collaborate with peers within different teacher communities.",
        "Develop the competence to select, design and evaluate appropriate teaching and learning materials that are authentic and integrate global contexts/ international-mindedness."
    ],
    "syllabus": "本課程為全英語授課。\n\n**Instructor**\n\nDr. Eric Jabal, Visiting Assistant Professor\n\n[ericjabal@ntnu.edu.tw](mailto:ericjabal@ntnu.edu.tw)  \n\n**Course objectives**\n\nThis course aims to cultivate preservice teachers’ (PTs) pedagogical knowledge in IB education with an emphasis on the IB Middle Years Programme (MYP) curriculum framework and IB standards for schools. As learning is “a social event \\[that\\] requires interaction with multiple individuals, including peers” (Dawley, 2007), PTs will explore the conditions for cultivating student inquiry through case study, interactive, and direct instruction. In the process of using concept-based teaching and learning models of instruction, PTs will:\n\n*   construct meaningful inquiries using key and related concepts that combine with global contexts (facts, skills, conceptual understanding) to form a statement of inquiry and address subject group objectives;\n*   plan appropriate formative and summative assessments that take up factual, conceptual, and debatable inquiry questions; and\n*   apply engaging approaches to learning (ATL) in the classroom as part of role playing and simulations.\n\nStrategies to advise and supervise MYP students to participate in service and action and complete a personal (or community) project are also discussed in class. Over the course of the 18 topics of study delivered in a combination of online dialogues/blogs and face-to-face class interactions at NTNU, PTs are required to examine IB publications, collaborate with peers, consider multiple perspectives, and demonstrate their understanding of the MYP principles and practice through small group presentations and individual written reflection papers.\n\n**COURSE SCHEDULE**\n-------------------\n\n**Dates**\n\n**Mode**\n\n**Topics**\n\n**23 February**\n\n(0900-1600)\n\nOnline\n\n1\\. IB philosophy, mission statement, Learner Profile. Links to Curriculum Design 107.\n\n2\\. IB continuum & MYP school structure (including projects). IB Standards & practices: A (Philosophy) & B (Organization). International and/vs. global citizenship education.\n\n_Assignment #1a, bc – Blog posting (250-350 words: 1a by 11/Mar.) plus two knowledge-building contributions on two different classmate’s blog postings (each 100-150 words: 1b, 1c by 15/Mar.)_\n\n**29 March**\n\n(0900-1600)\n\nOnline\n\n3\\. MYP curriculum framework\n\n4\\. MYP subject guide exploration & unit planning process (including UbD). IB Standards & practices: C2 - Written curriculum\n\n_Assignment #2a, bc – Vlog posting (60-90sec: 2a by 8/Apr.) plus two knowledge-building comments on two different classmate’s vlogs (each 100-150 words: 2b, 2c by 12/Apr.)_\n\n**19-20 April**\n\n(0900-1600)\n\n@ NTNU\n\n5\\. Approaches to Teaching (ATT) in the MYP (inquiry, conceptual, contextual)\n\n6\\. Approaches to Learning (ATL) in the MYP (categories, clusters). IB Standards & practices: C3 – Teaching & learning \n\n**10-11 May**\n\n(0900-1600)\n\n@ NTNU\n\n7\\. MYP assessments (diagnostic, formative, summative – including e-assessment)\n\n8\\. MYP reporting to students, families. IB Standards & practices C4 – Assessment\n\n**31 May-1 June**\n\n(0900-1600)\n\n@ NTNU\n\n9\\. MYP unit planner writing\n\n10\\. MYP summative assessment & task-specific clarification drafting\n\n_Assignment #3 – As a pair, construct one IB-MYP subject unit plan (by 3/Jun.)_\n\n_Assignment #4 – Individually, construct three lesson plans (by 10/Jun.)_\n\n**14 June**  \n(0900-1600)\n\n@ NTNU\n\n11\\. Student presentations (and peer / instructor evaluation)\n\n12\\. Other important MYP elements: IDU, Building Quality Curriculum, MYP authorization/evaluation\n\n**COURSE ASSIGNMENT GRADE DISTRIBUTION**\n----------------------------------------\n\n**Category**\n\n**Weighting**\n\n**Description**\n\n\\[1abc\\] Blog reflection x 1 and response x 2\n\n15%\n\nPost original blog reflection response (250-350 words) to inquiry question linked to topics 1, 2; and\n\nPost two knowledge-building comments (each 100-150 words) on two different classmate’s blogs by building on, disagreeing with, or re-thinking it. Strive for thoughtfulness and nuance.\n\n\\[2abc\\] Vlog reflection x 1 and response x 2\n\n15%\n\nPost original video log reflection response (60-90sec.) to inquiry question linked to topics 3, 4; and\n\nPost two knowledge-building comments (each 100-150 words) on two different classmate’s vlogs building on, disagreeing with, or re-thinking it. Strive for thoughtfulness and nuance.\n\n\\[3\\] MYP Unit Plan\n\n25%\n\nConstruct one IB-MYP subject unit plan:\n\n1\\. Work in pairs to select a subject group and MYP topic (18 sessions/hours over 6 weeks).\n\n2\\. Draft an MYP3 unit using ‘MYP unit planner’ format.\n\n\\[4\\] Lesson plans x 3  \n& individual lesson presentation x 1\n\n25%\n\nFrom MYP Unit Plan 3, construct three lesson plans to be delivered @ unit **start** (sessions 1-6), **middle** (sessions 7-12), and **end** (session 13-18)\n\n1\\. Each of the three lesson plans to cover one 60-minute instructional session (including homework task)\n\n2\\. Write 3 x lesson plans using ‘5-min lesson plan’ format & present one lesson to class (15-20mins max.)\n\n3\\. All relevant lesson materials (eg. PPT slides, worksheets, assessment tasks) to be included.\n\n\\[5\\] Class engagement\n\n20%\n\nParticipation in and contributions to instructional sessions.\n\n **COURSE ASSIGNMENT RUBRICS (1abc, 2abc)**\n-------------------------------------------\n\n_Blog and vlog reflections – level of critical thinking, engagement displayed, and use of media (vlog) in the post_\n\n**EXCELLENT**\n\n**(4 points)**\n\n**SATISFACTORY**\n\n**(3 points)**\n\n**UNDER-DEVELOPED**\n\n**(2 points)**\n\n**LIMITED**\n\n**(1 point)**\n\n**NO CREDIT**\n\n**(0 points)**\n\n**Critical thinking**\n\n*   The blog post is focused and coherently integrates examples with explanations or analysis.\n*   The post demonstrates awareness of its own limitations or implications, and it considers multiple perspectives when appropriate.\n\n*   The blog post is reasonably focused, and explanations or analysis are mostly based on examples or other evidence.\n*   Fewer connections are made between ideas, and though new insights are offered, they are not fully developed.\n\n*   The blog post is mostly description or summary, without consideration of alternative perspectives, and few connections are made between ideas.\n\n*   The blog post is unfocused, or simply rehashes previous comments.\n\nThe blog post is missing or consists of one or two disconnected sentences.\n\n**Engagement**\n\n*   The entry reflects in-depth engagement with the topic in a substantive way. Reply pushes understanding of topic further.\n\n*   The post reflects moderate engagement with the topic. Reply critiques / comments in a cursory way.\n\n*   The post reflects passing engagement with the topic. Reply engages in a superficial way.\n\n*   The post displays no evidence of student engagement with the topic.\n\n**Use of media**\n\n*   Vlog displays a mastery of the media: visual elements are clear and support reflective quality of vlog post.\n\n*   Vlog displays a competent use of media: visual elements are mostly clear and support a generally reflective vlog post.\n\n*   Vlog displays inconsistent use of the media: visual elements are vague and vlog post displays a lack of reflective qualities. \n\n**COURSE ASSIGNMENT RUBRICS (5)**\n---------------------------------\n\n_Rubric for class participation and engagement – **What** you say... **How** you say it... **Why** you say it..._\n\n**EXCELLENT**\n\n**(4 points)**\n\n**SATISFACTORY**\n\n**(3 points)**\n\n**UNDER-DEVELOPED**\n\n**(2 points)**\n\n**LIMITED**\n\n**(1 point)**\n\n**Quality of contributions in class**\n\n_What you say...._\n\nProvides comments that advance level and depth of dialogue by reflecting an understanding of: assigned material(s); previous remarks of other students; insights about assigned material\n\nProvides relevant comments that are focused on assigned material\n\nProvides comments occasionally and, when prepared, relevant comments are based on assigned material\n\nDemonstrates a noticeable lack of interest on occasion\n\n**Peer interaction**\n\n_How you say it…_\n\nActively supports, engages, and respectfully listens to peers and instructors (ongoing)\n\nMakes a sincere, but developing, effort to interact with peers (ongoing)\n\nLimited interaction with peers and/or sometimes displays lack of interest in comments of others\n\nVirtually no interaction with peers and/or projects lack of interest or disrespect for others\n\n**Preparation**\n\n_Why you say it…_\n\nArrives fully prepared for every class with all assignments completed, and notes on reading, observations, questions\n\nArrives fully prepared for most classes with all assignments completed, and notes on reading, observations, questions\n\nSometimes arrives unprepared or with only superficial preparation\n\nExhibits little evidence of having read or thought about assigned material\n\n**Engagement**\n\n_in activities…_\n\nActively participates through respectful engagement with peers (small group activity)\n\nExhibits sincere, but developing, participation with peers (small group activity)\n\nLimited interaction with peers (small group activity)\n\nDemonstrates lack of interest and/or disrespect for others (small group activity)\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=932648e9bbd84f8291d481002b8100a2&fno=7541025530d84463a8fb003254f16ff5)\n----------------------------------------------------------------------------------------------------------------------------------------------------",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "實驗/實作",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 55,
            "note": "Blog reflection x 1 and response x 2; Vlog reflection x 1 and response x 2; MYP Unit Plan"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "Participation in and contributions to instructional sessions."
        },
        {
            "type": "報告",
            "weight": 25,
            "note": "Lesson plans x 3  & individual lesson presentation x 1"
        }
    ],
    "prerequisite": "",
    "general_core": []
}