{
    "year": 107,
    "term": 2,
    "name": "教師專業發展（IB）",
    "teachers": [
        "林子斌"
    ],
    "department": "EU",
    "code": "IBUE003",
    "credit": 3,
    "serial": 647,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 1,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "教310"
        }
    ],
    "programs": [
        "國際教師學程-國際"
    ],
    "comment": "",
    "restrict": "◎第一階段限 國際教師學程-華語文 國際教師學程-數學 國際教師學程-物理 國際教師學程-國際◎限國際教師學程-華語文、國際教師學程-數學、國際教師學程-物理、國際教師學程-國際選修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course aims at preparing students to do continuing professional development (CPD) as well as stimulating deeper understanding of the professionalism of being a teacher. The importance of CPD in contemporary educational practices is acknowledged globally. In order to equip students with abilities to achieve better in this fast-changing world, education professionals can no longer teach knowledge but have to infuse high order thinking skills such as critical thinking and systems thinking in their teaching. Education Professionals such as teachers, and school leaders are required to be life-long learners so that they can improve the quality of their teaching practices, engage students in various learning activities and demonstrate that they continuingly expand their capacity as an individual and a professional.",
    "goals": [
        "Observe classrooms and practice interdisciplinary teaching.",
        "Understand the need and importance of CPD; understand various approaches to CPD.",
        "Apply certain approach of CPD;　understand how professional learning community works in schools.",
        "Understand the need and importance of CPD.",
        "Experiencing and reflecting good practices of CPD in schools"
    ],
    "syllabus": "本課程為全英語授課，本學期規劃之課程中僅有一場校外講者會以中文進行分享，其餘授課、討論、分享與報告都將以英語為主要語言。\n\n**Course Description**\n\nThis course aims at preparing students to do continuing professional development (CPD) as well as stimulating deeper understanding of the professionalism of being a teacher. The importance of CPD in contemporary educational practices is acknowledged globally. In order to equip students with abilities to achieve better in this fast-changing world, education professionals can no longer teach knowledge but have to infuse high order thinking skills such as critical thinking and systems thinking in their teaching. Education Professionals such as teachers, and school leaders are required to be life-long learners so that they can improve the quality of their teaching practices, engage students in various learning activities and demonstrate that they continuingly expand their capacity as an individual and a professional.\n\n**Learning Objectives**\n\nThere are three main components of this course in the 18 weeks: 1. Understanding the importance of professionalism and CPD 2. Exploring various approaches to CPD, and 3. Experiencing and reflecting good practices of CPD in schools. The detailed learning objectives are as follow:\n\n**Course Structure**\n\nThis course is practical and student-centered. To understand the value and approaches to CPD, the best way is through hands-on experience. Therefore, the course is designed on a mixture of lectures and hands-on tasks. In the first five weeks, students will be introduced to the basics of CPD including its importance, approaches and status quo of CPD in Taiwanese context. Four to five invited speakers from local secondary schools as well as from IB schools in Taipei are going to share their experience related to professional learning community and CPD in week 6. From week 7 to week 11, students in group of 5 to 6 are going to do hands-on task that is to observe how teachers practice CPD in schools. Each group needs to choose at least one professional learning community as their case study. (For IB students, they need to have two CPD cases from different types of school: one is local Taiwanese secondary school and the other must be an IB school) From week 12 to week 14, it is for individual group tutorial and data analysis. Each group prepare their case(s) and meet up with the instructor to discuss the content. Week 15 to week 17, each group needs to present their cases and lead the discussion. The finalized case(s) report is due on week 18.\n\n**Class Meetings**\n\n_Session No._\n\n_Session_\n\n_Related Learning Objectives_\n\n**1**\n\n**Topic: Global Education Reform Movement**\n\n**Activities:**\n\nLecturing the global education reform movement and the main themes such as learner-centered instruction, flipped classroom, and CPD.\n\n**1-1**\n\n**2 to 5**\n\n**Topic: The development of CPD and Professional Learning Community: Global Trend and Local Practices**\n\n**Activities:**\n\nA combination of lectures and student-led sharing and discussion. Topics are from the course required readings. Students need to complete the required readings at home. Each group needs to present their assigned readings and come out with questions for further discussion.\n\nTask 1: understanding CPD and professional learning community\n\n**1-1, 1-2, 2-1**\n\n**6**\n\n**Topic: Invited Talks**\n\n**Activities:**\n\nFour to five invited speakers from both local secondary schools and IB schools are going to share their experience of CPD and professional learning community.\n\n**1-2, 2-1, 2-2**\n\n**7 to 11**\n\n**Topic: Experiencing CPD and Professional Learning Community**\n\n**Activities:**\n\nDuring these 5 weeks, there is no classroom meeting but each group needs to observe or take part in, at least, four CPD activities in the school they chose. For IB students, each group needs to do eight observations.\n\nTask 2: case study in CPD: gaining experience\n\n**1-2, 2-1, 2-2**\n\n**12 to 14**\n\n**Topic: Individual Group Tutorial**\n\n**Activities:**\n\nEach group will meet the instructor to discuss what they learned and how they analyze their data and reflect on this experience. Moreover, each group needs to propose how they are going to do about their sharing.\n\n**1-2, 2-1, 2-2, 3-1**\n\n**15 to 17**\n\n**Topic: Sharing Session: presentation of learning journey into CPD**\n\n**Activities:**\n\nEach group present their cases and learning journey. Also, the presenting group needs to lead post-presentation discussion.\n\nTask 3: case study in CPD: sharing what you learn\n\n**2-1, 2-2, 3-1, 4-1**\n\n**18**\n\n**Topic: Wrap-up and final discussion**\n\n**Activities:**\n\nInstructor gives feedback and propose questions for final discussion.\n\n**3-1, 4-1**\n\n**Grading and Evaluation**\n\nNo.\n\nTask\n\nWeighting\n\nAssessment Mode\n\nDue date\n\nRelated Learning Objectives\n\n1\n\nUnderstanding CPD\n\n15%\n\nGroup\n\nTBA\n\n1-1, 1-2, 2-1\n\n2\n\nCase study in CPD: gaining experience\n\n15%\n\nGroup\n\nTBA\n\n1-2, 2-1, 2-2\n\n3\n\nCase study in CPD: sharing what you learn\n\n30%\n\nGroup\n\nTBA\n\n2-1, 2-2, 3-1, 4-1\n\n4\n\nFinal Report\n\n30%\n\nGroup\n\nTBA\n\n3-1, 4-1\n\n5\n\nParticipation\n\n10%\n\nIndividual\n\nN/A\n\nAll\n\n**No.**\n\n**Objectives**\n\n**Related Programme Learning Objectives (PLO)**\n\n**Related Assessment Task(s)**\n\n**1**\n\n3-1. Pursue longitudinal professional development throughout the teaching career.\n\n1.  Understand the need and importance of CPD.\n2.  Understand various approaches to CPD.\n\n**Task 1, Task 2**\n\n**2**\n\n4-1. Be good at communicating and collaborating with others, even during cross-disciplinary tasks.\n\n1.  Apply certain approach of CPD.\n2.  Understand how professional learning community works in schools.\n\n**Task 2, Task 3**\n\n**3**\n\n4-2. Reflect on personal instruction and pursue a higher level of educational value.\n\n1.  Understand the need and importance of CPD.\n\n**Task 2**\n\n**4**\n\n5-1. Demonstrate cross-cultural diversity awareness and enrich the quality of teaching and learning.\n\n1.  Experiencing and reflecting good practices of CPD in schools\n\n**Task 2, Task 3**",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "實地考察、參訪",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 20,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 50,
            "note": "Oral (20) Written (30)"
        }
    ],
    "prerequisite": "",
    "general_core": []
}