{
    "year": 109,
    "term": 2,
    "name": "運動賽會管理",
    "teachers": [
        "程紹同"
    ],
    "department": "AU30",
    "code": "PEC9003",
    "credit": 3,
    "serial": 64,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "體001"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "9",
    "dept_group": "",
    "hours": 3,
    "description": "Sport industry has been demonstrating its influences and values via numerous sport events world widely in the new era. The extraordinary charisma of sport attracts fans around the world and the international/sport events play as a turbo engine in developing global sport industry. Therefore, the major cities and countries in Asia actively strive for hosting the international mega sport events. For instances, Japan, South Korea, and China hosted the Summer Olympic Games successfully. In addition, South Korea is the only nation that has won a grand slam in hosting Summer/Winter Olympic Games and the FIFA World Cup. Besides that, Beijing is the only international city ever in hosting Summer/Winter Olympic Games. The trend of hosting the international mega sport events has become the highlight of competitiveness among international cities, especially in Asia region.\n\nTaiwan has shown its capability in hosting the international mega sport events successfully though 2009 Taipei Deaflympic Games, 2009 Kaoshiung World Games and 2017 FISU Universiad Taipei. However, it is critical to cultivate talents of sport events management in order to keep pace with the host nations at the Olympics level.\n\nThis course not only introduces students to understand the role of sport events and their contribution to a city and a nation as well but also to the planning and management of sport events. It provides the necessary foundations including conceptualization, staffing, budgeting, financing, promoting, securing and managing. Upon completion of this course, students will understand the competencies required for managing and operating sport events through theory and application. Furthermore, it focuses on the challenges and opportunities a sport event manager is confronting with during the COVID 19 pandemic.",
    "goals": [
        "To understand the importance and contribution of international mega sport events.",
        "To expand students international perspectives of sport events management.",
        "To cultivate students ability of planning and managing the successful sport event and the ability to work with others (team work).",
        "To develop the essential capability of being an outstanding global sport events leader who is able to deal with various challenges and issues successfully in the sport world."
    ],
    "syllabus": "**第一週：**課程內容介紹；（國際）運動賽會管理概念建立\n\n**第二週：**國際運動賽會管理的哲學觀：賽會價值辯論活動：倫敦獲選2012年奧運主\n\n         辦城市(公視全球現場節目)\n\n**第三週：新冠肺炎與全球運動賽事未來發展**\n\n**第四週：**運動賽會組織與人力資源管理：婚禮宴會規劃練習活動\n\n**第五週：**運動賽會財務規劃；賽會財務個案分析\n\n**第六週：**運動賽會行銷管理一；賽會行銷管理個案分析\n\n**第七週：**運動賽會行銷管理二；賽會贊助個案分析\n\n**第八週：**運動賽會（社群）媒體與公共關係；記者會規劃練習活動：賽會（社群）\n\n         媒體與公關個案分析\n\n**第九週：**運動賽會風險管理與法令；風險管理與法令個案分析\n\n**第十週：**運動賽會行政業務運作；行政業務運作個案分析\n\n**第十一週：**運動賽會服務業務運作；服務業務運作個案分析\n\n**第十二週：**運動賽會競賽業務運作；競賽業務運作個案分析\n\n**第十三週：**運動賽會企劃書個案解析一\n\n**第十四週：**運動賽會企劃書個案解析二\n\n**第十五週：**運動賽會企劃書口頭報告\n\n**第十六週：**彈性運用於運動賽會實地觀摩、模擬操作與實作時間\n\n**第十七週：**彈性運用於運動賽會實地觀摩、模擬操作與實作時間\n\n**第十八週：**彈性運用於運動賽會實地觀摩、模擬操作與實作時間",
    "methodologies": [
        {
            "type": "講述法",
            "note": "專題演講方式介紹單元主題內容"
        },
        {
            "type": "討論法",
            "note": "規劃相關議題，進行小組（辯論）活動與研討"
        },
        {
            "type": "問題解決教學",
            "note": "同上"
        },
        {
            "type": "合作學習",
            "note": "同上"
        },
        {
            "type": "實驗/實作",
            "note": "以小組作業方式，進行賽會活動模擬操作或者配合業界進行實際操作"
        },
        {
            "type": "實地考察、參訪",
            "note": "配合時機，規劃安排參訪大型運動賽會活動（如大專運動會）及實地考察（如賽事活動記者會）"
        },
        {
            "type": "媒體融入教學",
            "note": "透過影片介紹強化單元主題內容與個案，以及學習運用社群媒體策略"
        },
        {
            "type": "專題研究",
            "note": "透過個案報告及小組活動方式，進行專題研究"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "參訪心得及課後作業（具有主動學習體育運動新知的精神；具有獨立思考及批判反省能力）"
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "個案解析與討論（具有從經驗中提升專業思考層次的能力；具有主動學習體育運動新知的精神；具有獨立思考及批判反省能力）"
        },
        {
            "type": "成果展覽",
            "weight": 40,
            "note": "活動企劃書（綜合知識/認知、職能導向、個人特質、價值與倫理等四大層面之核心能力驗證）"
        },
        {
            "type": "其他",
            "weight": 10,
            "note": "實地參觀學習以及實作學習態度"
        }
    ],
    "prerequisite": "",
    "general_core": []
}