{
    "year": 109,
    "term": 2,
    "name": "都市與區域計畫",
    "teachers": [
        "林文一"
    ],
    "department": "LU23",
    "code": "GEU0243",
    "credit": 3,
    "serial": 1909,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 5
    },
    "schedule": [
        {
            "day": 3,
            "from": 10,
            "to": 12,
            "campus": "本部",
            "classroom": "誠202"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "本課程首先簡介20世紀初都市規劃興起以來，主要規劃思潮、理論與及發展背景脈絡，提供同學對於都市與區域規劃的初步概念及認識。其次介紹台灣都市及國土規劃體制的基礎知識，使學生了解台灣空間規劃的背景與進程、計畫體制，並認識都市計畫之規劃執行與決策過程。最後以一系列當前都市及區域規劃的重要專題，讓學生了解關鍵議題的重要內涵與影響，深刻體會都市與區域計畫的基本精神與規劃途徑。\n課程中同學將進行分組報告就規劃研究議題或案例於期中提出議題、案例挑選及初探發表；期末則進行最後成果發表，作為期中與期末評量的主要依據。希望藉此培養學生空間規劃實務操作的基本能力，並希望能讓同學了解地理因素對都市與區域計畫的重要，以及都市與區域計畫對於地表空間與人地關係之影響。\n課程中也將秉持走出教室、貼近田野的學科精神，希望於學期中安排一次田野調查或地區個案探討(一日行程)，帶領同學實際觀察體驗台灣城鄉空間紋理特徵及人地氛圍，並實地感受空間規劃的影響作用與議題。\n\n\n本課程介紹都市及區域計畫基本概念、目的、程序、理論、實施方式與影響，並特別著重在地理因素對都市及區域計畫的重要，與都市及區域計畫對地表空間與人地關係之影響。",
    "goals": [
        "了解都市計劃之相關概念",
        "了解地理因素對都市計劃之影響與重要性",
        "了解都市計劃對地表空間與人地關係之影響"
    ],
    "syllabus": "**教學大綱：**\n\n規劃理論在過去的發展與演進本身就體現出規劃專業的多元、複雜與矛盾。在過去不同的規劃理論、概念都在彼此的爭論與批判。對此爭論本課程不企圖、也不可能提出標準的解答，因為任何的解答或許都只是某一群規劃理論家，在某個時代的特殊相信，而過去的教訓告訴我們它們都不斷處在被批評或修正的狀態。因為關於何謂Planning Theory本身就存在長久的爭論和歧見，本課程不並企圖解決這些爭論，關於何謂規劃理論？本課程主要參考Allmendinger (2009), Nigel (1998), Fainstein and Campbell(2012)等人的整理。其主要企圖從時間的脈絡介紹主要規劃理論的概念及其轉化與爭鬥的過程，希望讓學生關於各都市計畫理論的都有一些概要之觀念，並且搭配國內實務案例介紹，讓學生有一個比較整體性的理解架構，並瞭解各個理論之間的關係與脈絡。授課主要涵蓋幾大類主要理論或觀念（根據Allmendinger及Nigel的架構），每兩周為一個單元，一周介紹相關概念及理論，另一周則以台灣實務規劃為案例，透過高階規劃業師的講座，用這些實際案例與理論相對印證或對話。本課程希望學生不只是枯燥的閱讀理論，更能結合確實案例，並學習與思考一些在日後研究與應用上的可能性。\n\n**教學目標:**\n\n1.  提供關於都市計畫理論的背景與歷史脈絡\n2.  解釋各種不同學派之間的關係與差異及其成形的相關背景\n3.  都市計畫理論與台灣規劃案例及業界實務經驗的結合\n\n**教學方式:**\n\n**課程主要牽涉議題如下(部分主題可能是狀況合併或刪減):**\n\n*   Rethinking planning, physical environment and design:\n*   Marxism, Critical Theory and Planning\n*   System and rationale process views of planning\n*   Pragmatism: Planning and implementation\n*   New Right and Planning\n*   Planner as advocates\n*   Collaborative planning\n*   Final reflection: the recent development of new planning concepts and practices",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "實驗/實作",
            "note": "規劃實務操作練習"
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": "(1)\t平時成績除了出席點名外，更重要的是特堂的提問、回答與討論\n(2)\t期中考周及期末考周，學生需撰寫期中或期末報告 (視修課人數，期中報告也可能改為分組報告)。\n(3)\t各種報告嚴禁任何抄襲、剽竊別人文章、剪貼網路資料行為，所有引用都必須有出處及書目。\n(4)\t教師將發給同學學術寫作參考範式，報告應合乎該寫作範式的規範。\n(5)\t希望培養同學對於規劃理論脈絡的理解、批判力與反思力，沒有任何標準答案，請踴躍參與討論，勇敢提出自己的意見與猜測。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}