{
    "year": 107,
    "term": 2,
    "name": "永續發展",
    "teachers": [
        "莫家俊"
    ],
    "department": "ZU89",
    "code": "PGUS004",
    "credit": 3,
    "serial": 3162,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 5
    },
    "schedule": [
        {
            "day": 5,
            "from": 8,
            "to": 10,
            "campus": "本部",
            "classroom": "正206"
        }
    ],
    "programs": [
        "環境監測學程"
    ],
    "comment": "",
    "restrict": "◎第一階段限 環境監測學程",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "After the Industrial Revolution, it was assumed that we could have unlimited economic growth and development. Therefore, many countries, especially in Western Europe and North-America, developed at a very fast pace. This provided many benefits, which included a higher life expectancy, comfortable housing, and no more hunger. After a few decades though, we started to realize that there were also many problems associated with economic growth, such as depletion of natural resources, severe pollution, income inequality, and an increase in international conflicts. We realized that something had to be done, not only for ourselves, but especially for our future generations. We realized our limits of growth.\n\nAs a response to the devastating state of the environment at that time, Our Common Future, written by the World Commission on Environment and Development (WCED 1987), was one of the first influential documents which coined the term sustainable development. Sustainable development, according to the WCED (1987), needs to ensure that “it meets the needs of the present without compromising the ability of future generations to meet their own needs”. Our Common Future was followed up by a series of major United Nations conferences which shaped the paradigms and narratives on sustainable development of the 20th and 21st Century. Looking at the state of the World now, did we finally achieve sustainable development? If no, how can we explain it?\n\nThis course will deal with the key concepts of sustainable development and resource management. How can we define environmental, economic and social sustainability? How are those dimensions interconnected? What measures are undertaken to achieve sustainable development? And how do stakeholders practice resource management and how did it change over time? Through examples in Asia and beyond, we aim to answer previous mentioned questions. This course is particularly useful for students who are interested in working for NGOs, governments, development agencies, or who are interested in corporate social responsibility. At the end of the course we are able to understand the components and principles of sustainable development; apprehend the human responses towards achieving sustainable development; and identify ways to apply sustainable development approaches and theories to various geographical and social contexts.",
    "goals": [
        "To understand the differences between social, economic and environmental sustainability",
        "To apply theories and approaches of sustainable development to real-life situations.",
        "To analyze and comprehend policy documents on sustainable development",
        "To tackle sustainability issues from various angles and dimensions"
    ],
    "syllabus": "1: An Introduction to the Course  \n2: What is Sustainable Development?  \n3: Current Sustainability Challenges and the Sustainable Development Goals  \n4: Introduction to Development Geography  \n5: Environmental Sustainability I – Natural Resources and Resource Management  \n6: Environmental Sustainability II - Global Climate Change and Responses  \n7: Social Sustainability I – Poverty, Income Inequality and Development  \n8: Social Sustainability II – Food Security, Health and Population Issues  \n9: Midterm Exam  \n10: Economic Sustainability – Green Growth, Sustainable Technologies, and Energy  \n11: Sustainable Cities  \n12: Development Cooperation, Policy and Evaluation  \n13: Student Presentations I  \n14: Student Presentations II  \n15: New Approaches to Sustainable Development  \n16: Sustainable Futures  \n17: Wrap-up Lecture  \n18: Final Exam",
    "methodologies": [
        {
            "type": "講述法",
            "note": "This course consists of lecturers which are both theoretical and empirical."
        },
        {
            "type": "討論法",
            "note": "Every class also consists of a tutorial involving group discussions and activities."
        },
        {
            "type": "媒體融入教學",
            "note": "We will make ample use of media and visual materials during formal lectures."
        },
        {
            "type": "專題研究",
            "note": "Lectures will provides examples from many case studies."
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 30,
            "note": "The mid-term exam covers all lectures from Week 1 -8."
        },
        {
            "type": "期末考",
            "weight": 40,
            "note": "The final exam covers all lectures, but especially from Week 10-17."
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "Everyone is expected to attend the class and participate in the tutorials"
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "Presentations are held in Week 13 and 14. Every group has to pick a topic from the list of possible presentations (or come up with their own sustainability topic)."
        }
    ],
    "prerequisite": "",
    "general_core": []
}