{
    "year": 111,
    "term": 1,
    "name": "犯罪小說",
    "teachers": [
        "高瑪麗"
    ],
    "department": "LU21",
    "code": "ENU0342",
    "credit": 3,
    "serial": 1844,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 8,
            "to": 10,
            "campus": "本部",
            "classroom": "正302"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限本系(含雙主修)修習◎限大二大三大四修習",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "The course introduces contemporary critical and theoretical arguments concerning popular fiction and genre studies, to enable advanced students to develop a sophisticated understanding of these texts and their cultural contexts, and of the conventions of the genre itself and subgenres, with some examples of these texts in other media such as film and television series."
    ],
    "syllabus": "  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=3f2f9adbe1294214a6cc5d255a0fb54b&fno=adcb356dfcc54f0d911159887e3a7c5e)\n\n**CRIME FICTION**\n\nFALL 2022/ Monday 1530-1820\n\nProfessor Goodwin [profgood@ntnu.edu.tw](mailto:profgood@ntnu.edu.tw)\n\nAmong the most popular sub-genres of fiction are detective and mystery novels, with plots that uncover answers to pressing questions: Who did it? Who committed the crime, and why? In this course we analyze the long-term appeal of this sub-genre in its historical, sociological, cultural and literary contexts. We cover the historical and critical development of detective fiction as it began to emerge in the mid-nineteenth century in America (Poe) and England (Conan Doyle and Wilkie Collins), to the development of the figure of the private detective (Sherlock Holmes, Agatha Christie’s Poirot and Miss Marple, in the Golden Age of detective fiction in Britain (the “cozy” whodunits and puzzlers). In America, the sub-genre detours into hardboiled and noir crime thrillers, fiction featuring female detectives, police procedurals, courtroom thrillers, “ethnic” detective series and the advent of the psychopathic serial killer. In investigating the narrative structures of detective fiction, we consider the significance of its various sources: the Gothic novel and penny dreadfuls/dimestore novels, among other sources. The course also introduces contemporary critical and theoretical arguments concerning popular fiction and genre studies, to enable advanced students to develop a sophisticated understanding of these texts and their cultural contexts, and of the conventions of the genre itself and subgenres, with some examples of these texts in other media such as film and television series. Although our focus is on British and American crime fiction, in their presentations students may also focus on international crime writers (for example, Japanese).\n\nREQUIREMENTS:\n\nAs the success of this course depends on student preparation and participation, students should read the assigned texts in advance and come to class ready to participate.\n\n**GRADING POLICY:**\n\nGrades will be based on Attendance and Participation; a Report (on a crime writer of your choice; check with instructor first); a Midterm and Final take-home essay.\n\n**TEXTS:**\n\nYou can find most of our texts online, but these can also be purchased from online booksellers and Bookman Books across from NTU.\n\nConan Doyle, A. Sherlock Holmes (collected stories)\n\nChristie, Agatha. And Then There Were None.\n\nChandler, Raymond. The Big Sleep.\n\nGrisham, John. Text TBA\n\nOther handouts from instructor, available on Moodle.\n\n**TENTATIVE READING SCHEDULE:**\n\n1.  **I****ntroduction to course and the beginning of crime fiction.** Background to genre and distinctions among crime, mystery and Gothic. E A Poe, [Edgar Allan Poe](https://en.wikipedia.org/wiki/Edgar_Allan_Poe): [_Tales of Mystery & Imagination_](https://en.wikipedia.org/wiki/Tales_of_Mystery_%26_Imagination) (1852) including “Murders in the Rue Morgue,” and “The Purloined Letter”.\n2.  **Edgar Allen Poe, continued.**\n\n1.  **The beginnings of British mystery fiction. Excerpts from** Wilkie Collins, _The Moonstone_.  [http://www.gutenberg.org/files/155/155-h/155-h.htm](http://www.gutenberg.org/files/155/155-h/155-h.htm)  See also Priestman, Martin, ed. _Cambridge companion to crime fiction_, (Cambridge UP 2003), electronic resource at NTNU library. Introduction to Sherlock holmes\n\n1.  **Arthur Conan Doyle’s Sherlock Holmes (selected stories)**. [Arthur Conan Doyle](https://en.wikipedia.org/wiki/Arthur_Conan_Doyle): [_The Complete Sherlock Holmes_](https://en.wikipedia.org/wiki/Sherlock_Holmes) (1887-1927): “[A Study in Scarlet”; “Scandal in Bohemia](https://sherlock-holm.es/stories/html/cano.html#Story-3),\" \"[Adventure of the Speckled Band](http://www.enotes.com/topics/adventure-speckled),\" \"[Adventure of the Dancing Men](http://www.eastoftheweb.com/short-stories/UBooks/AdveDanc.shtml),\" \"[Five Orange Pips](https://sherlock-holm.es/stories/html/cano.html#Story-7),\" \"[The Musgrave Ritual](https://sherlock-holm.es/stories/html/cano.html#Story-19),\" and \"[The Final Problem](https://sherlock-holm.es/stories/html/cano.html#Story-25).\"\n\n1.  Conan Doyle, continued. Time permitting we will screen a Sherlock film or TV series.\n\n1.  **Agatha Christie and classic British whodunits including Dorothy Sayer**. Novel: _And Then There Were None._ \n2.  **Agatha Christie, cont.**\n3.  **MIDTERM TAKEHOME ESSAY.**\n4.  **American hardboiled: Introduction to D**etectives Sam Spade (Dashiell Hammett) and Philip Marlowe (Raymond Chandler). Chandler: _The Big Sleep_\n5.   **American Hardboiled,** **cont**. Raymond Chandler’s _The Big Sleep_\n6.  **Psychological Thrillers and Sociopathic Killers**: Ira Levin, _A Kiss Before Dying_;\n7.  **Levin, _A Kiss Before Dying,_ cont. Overview of the Sociopathic Killer**\n8.  **Gender and Genre**: Introduction to female detectives, pending availability of texts. Kathleen Gregory Klein, “The Woman Detective: Gender and Genre” (1995);\"The Hard-boiled Private Eye and Her Classical Competition\" Chapter 6 in _Issues of Gender and Genre. Story TBA_\n9.  **Courtroom Thrillers**: John Grisham, _The Partner_ or other text. Depending on availability, selections from Earle Stanley Gardner’s Perry Mason, Scott Turow, _Presumed Innocent_\n10.  **Courtroom Thrillers, cont.**\n11.  **FINAL TAKE-HOME ESSAY**",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": ""
        },
        {
            "type": "Group discussion",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 10,
            "note": ""
        },
        {
            "type": "Midterm Exam",
            "weight": 25,
            "note": ""
        },
        {
            "type": "Final exam",
            "weight": 25,
            "note": ""
        },
        {
            "type": "Class discussion involvement",
            "weight": 20,
            "note": ""
        },
        {
            "type": "Presentation",
            "weight": 20,
            "note": ""
        }
    ],
    "prerequisite": "◎Exclusive for students within this department(including dual degree program) ◎Exclusive for sophomore, junior, senior",
    "general_core": []
}