{
    "year": 111,
    "term": 1,
    "name": "英語聽講（一）",
    "teachers": [
        "陳秋梅"
    ],
    "department": "LU21",
    "code": "ENU0279",
    "type": "選",
    "grade": 1,
    "credit": 2,
    "serial": 1818,
    "group": "",
    "quota": {
        "limit": 40,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "誠701A"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限本系(含雙主修)修習◎限大一修習",
    "form_s": "1",
    "classes": "2",
    "dept_group": "",
    "hours": 2,
    "description": "",
    "goals": [
        "To build students’ academic listening skills and life situational listening proficiency",
        "To develop students’ speaking skills and communication abilities."
    ],
    "syllabus": "                                                             **_Basic Aural-Oral Training in English_**\n\nFall, 2021\n\n**Course Description**\n\nThis is a basic listening and speaking course for English majors and minors. By giving various kinds of “task-oriented” listening and speaking activities, the course objective is to help students become (1) better listeners who can comprehend with ease short dialogues, monologues, and speeches; (2) better speakers who can express themselves well in everyday situations. In order to add variety and provide realistic situations, video tapes are used in class as well.\n\n**Textbook**\n\nTanka, Judith & Baker, Lida R. (2014). **_Interactions 2: Listening/Speaking_**_, sixth edition._ McGraw-Hill Education. 文鶴：金山南路2段200號3樓 23934497\n\nSupplementary Teaching Materials\n\n_Crossroads Café_ (a video that presents a variety of accents -- authentic)\n\n_Three’s Company_ (a classic video marked by a great sense of American humor)\n\n_Impact Listening 3_ (marked by a feature of real world listening with a variety of idioms)\n\n**Course Requirements**\n\n**_1._**      **_Cheating on quizzes or exams_** is absolutely forbidden. If someone is found cheating on an exam or a quiz, he/she will be flunked.\n\n**_2._**      **_Attendance and preparation_**: You are expected to attend the class well-prepared. For every unexcused absence, 5 points of your final grade will be deducted; 3 or more unexcused absences will result in the failure of this course. Being late for over 30 minutes is treated as absence for the class that day. If you are absent in case of uncontrollable situations (e.g. illness, emergency, etc.), be sure to ask for leave **within two weeks** and make sure that I receive the e-mail. Besides, you cannot ask for more than **5** leaves for the whole semester according to the school regulations.\n\n**_3._**      **_Textbook_** is a must. You’re supposed to bring the textbook (or at least a copy of the chapter) whenever you come to class. Violation of this rule will cost you 3 points (out of your final score) each time.\n\n**_4._**      **_No eating or drinking in the lab_**. In order to keep the lab clean, please don’t bring any food or drink into the lab. If you really need to carry some food or drink, please leave it on the shelf in front of the class.\n\n**_5._**      **_No laptop_**. You are not supposed to bring your laptop to class unless you need it for presentation. Ask for permission in advance.\n\n**_6._**      **_Class participation_**: Lesson conductions will engage you in a variety of tasks and activities that foster both individual language practices, team work and cooperation. You are supposed to take active participation in these activities in order to develop real-time communication skills. The participation grade will be based on the following components: 1) pair practices  2) group/class discussions  3) role plays. You will be evaluated by your efforts and contribution to the aforementioned.\n\n**_7._**      **_After-class listening and speaking practice_**: You will be required to practice your listening skills on a weekly basis by using the audio and video resources provided at the lab or by listening to your own materials (e.g. Advanced, ICRT, CNN news, etc.). You’re supposed to complete at least 10 hours of listening practice this term. Each time when you do the outside listening activity, please write down the date, the time you spend listening to the material, the title of the material and its source, and then hand in the list on Dec. 26 (please add up all the times). Those who do more extra practice beyond the minimum requirement will get some bonus points.\n\nAfter each meeting, a topic will be given for you to think about. You’re supposed to express your opinions on the topic in the following meeting. Your performance will be evaluated by your group members at the end of the semester. Besides the assignments, you are encouraged to do extra speaking practices such as language exchange, volunteering at English camps, tutoring English, etc.\n\n**_8._**      **Group Presentation**\n\nFour to Six people form a group. Each group chooses one topic and does some research or survey about the topic (e.g. the eating/studying habits of NTNU students, the most popular part-time jobs / leisure activities / sightseeing spots / sports / restaurants, etc. ) In the presentation, the group tells the whole class their motivation (i.e. why they choose the topic), study methods (e.g. questionnaire, interview, etc.) their findings and suggestions. The ways of presentation could be a live talk, a role-play, a panel discussion, a talk show or a drama, as long as the way is effective. Use multimedia to make your presentation attention-getting. Only the members who are involved and make their contribution throughout the study can get the credit. The presentation is scheduled on **Dec. 17th.**\n\n**_9._**      **Skit Performance**\n\nGroup work of 4-6 people. About **10 minutes** for each group. The topic and content of the skit can be as creative as you want it to be. The more popular the performance is, the more points the group get. Please refer to the Skit Performance Evaluation Sheet to prepare for the play.\n\n**Grading Policies (subject to change, depending on the amount of quizzes)**\n\n1.       Attendance, Class Participation, and In-Class Quizzes  20%\n\n2.       After-Class Listening Practice  5%\n\n3.       After-Class Speaking Practice  5%\n\n4.       Group Presentation  20%\n\n5.       Skit Performance  20%\n\n6.       Final exam (listening test ) 30%\n\n**Tentative Schedule**\n\n_Week     Content_                                                   \n=====================================================================\n\n1               Orientation: Introduction to the course\n\n2, 3           _Interactions 1:_ Chapter 1；_Three’s Company_ Episode 1, 2\n\n4, 5           _Interactions 1:_ Chapter 2；_Three’s Company_ Episode 3, 4\n\n6, 7           _Interactions 1:_ Chapter 3；_TC._ Episode 5, 6\n\n8               _Interactions 1:_ Chapter 4；_TC._ Episode 7\n\n9               **Skit Performance**\n\n10              _Interactions 1:_ Chapter 4；_TC._ Episode 8\n\n11, 12        _Interactions 1:_ Chapter 5；_TC._ Episode 9, 10\n\n13, 14        _Interactions 1:_ Chapter 6；_TC._ Episode 11, 12\n\n15              **Group Presentation**\n\n16, 17         Film Watching; _TC._ Episode 13, 14\n\n18               **Final Exam** \n\nSkit Performance Evaluation Sheet\n\n**1.Content & Verbal Expression: 60%**\n\n**Comments:**\n\nContent of the whole skit        \n\nFluency of language delivery    \n\nEase of comprehension\n\n**2\\. Presentation Skills: 20%**\n\nActing & Interpretation of the content    \n\nOrganization & Quality of voice projection\n\n**3\\. Others: 20%**\n\nStage decoration (Props, costumes)\n\n  Acoustic effects (music, sounds) \n\nOverall score :  \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": ""
        },
        {
            "type": "Group discussion",
            "note": ""
        },
        {
            "type": "Problem base learning",
            "note": ""
        },
        {
            "type": "Cooperative learning",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 10,
            "note": ""
        },
        {
            "type": "Midterm Exam",
            "weight": 20,
            "note": ""
        },
        {
            "type": "Final exam",
            "weight": 30,
            "note": ""
        },
        {
            "type": "Class discussion involvement",
            "weight": 10,
            "note": ""
        },
        {
            "type": "Attendances",
            "weight": 10,
            "note": ""
        },
        {
            "type": "Presentation",
            "weight": 20,
            "note": ""
        }
    ],
    "prerequisite": "◎Exclusive for students within this department(including dual degree program) ◎Exclusive for freshman",
    "general_core": []
}