{
    "year": 111,
    "term": 1,
    "name": "英語教學實習（一）（教）",
    "teachers": [
        "王宏均"
    ],
    "department": "LU21",
    "code": "ENUE110",
    "type": "選",
    "grade": 4,
    "credit": 2,
    "serial": 1888,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 1,
            "to": 4,
            "campus": "本部",
            "classroom": "正303"
        }
    ],
    "programs": [],
    "comment": "提醒擬修習111-2「英語教學實習(二)(教)」同學，須先通過全民英檢高級初試或等同之國際標準化測驗。",
    "restrict": "◎限本系(含雙主修)修習◎限大四修習◎必須先修過【ENUE001  英語教材教法（教）】",
    "form_s": "4",
    "classes": "2",
    "dept_group": "",
    "hours": 4,
    "description": "Serving as a bridge between pre-service ELT coursework and actual, situated teaching, this course is designed to offer students an opportunity to observe, explore, and implement effective teaching ideas. It covers in-class micro-teaching, classroom observation, and practice teaching at the Affiliated High School of NTNU.\nThe major activities in the first semester include introduction to the English curriculum guidelines for Grades 1 to 12 in Taiwan, career planning in EFL teaching profession, school visits, and most importantly, in-class micro-teaching. To prepare students for the micro-teaching, the course also provide a review of lesson planning, and effective techniques in teaching vocabulary, grammar, listening, reading, speaking, and writing. Each student is required to write a lesson plan and then teach for 30 minutes, with all his/her classmates as students and observers. The micro-teaching is followed by a discussion session led by the instructor, with an aim to help improve students’ teaching techniques. \nThe second semester covers the following as the primary activities: talks by experienced senior teachers on various topics, more classroom observations, and a 6-week practice teaching at the Affiliated High School of NTNU. In addition to work related to the micro-teaching and practice teaching, students are required to write various reports and participate in classroom discussion and evaluation.",
    "goals": [
        "designed to offer students an opportunity to observe, explore, and implement effective teaching ideas."
    ],
    "syllabus": "**\\*\\*Please click** [教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=6ed2da23517949bf8cba899b1108a845&fno=5e9e6bd7192e43ce8ede101c401751e0) **to download the PDF file of this course syllabus.**\n\n**Instructor:** **王宏均** **Hung-chun Wang, Ph.D.**\n\n**E-mail: wanghc@gapps.ntnu.edu.tw**\n\n**Office: Cheng 708**\n\n**Office Hours:** **TBA**\n\n*   **Course Description:**\n\nEnglish Teaching Practicum is a hands-on practicum for pre-service English teachers in the English Department. It offers students an opportunity to gain more classroom experience, and to develop and apply their teaching ideas in the classroom. In the first semester, students will learn about the recent English curriculum guidelines in Taiwan as well as useful strategies for teaching English skills/subskills to middle school students. They will also learn to write well-structured lesson plans and to improve their own teaching skills. Classroom activities mainly include lectures, invited talks, micro-teaching, and group work.\n\n*   **Delivery of Instruction:**\n\n1.  Lecture\n2.  Group work & discussion\n3.  Student presentation\n4.  Micro-teaching/practice teaching\n\n*   **Grading Policy:**\n\n1\\.  Lesson plans (original/revised): 30%                                     \n\n2\\.  Micro-teaching performance: 30%                                        \n\n3\\.  Peer feedback (oral/written): 10%                                     \n\n4\\.  Reflection on lectures, invited talks, and micro-teaching: 20%                             \n\n5\\.  Attendance, participation & miscellaneous: 10%                                  \n\n*   **Classroom Policies:**\n\n1.  Class attendance is a fundamental requirement that will be strictly enforced in this course. Students are required to come to class **on time**. Absence from **each class period** will result in a 2.5-point deduction from the final course grade (except with a valid excuse approved by the instructor). Arriving late to class or leaving early will also count as an absence. Students’ participation will also be scored based on how much they contribute to discussions in class and during teacher-student conferences.\n2.  Students are required to submit any of their assignments (e.g., lesson plans and reports) before it is due. Late assignments will be marked down by **30%**. Once they are two or more days late, they will NOT be accepted. \n3.  Dishonesty: Academic dishonesty is a misconduct that occurs in academic exercises. It involves plagiarism, cheating, fabrication, etc. Students will be penalized for academic dishonesty on any tests, assignments and exercises.\n4.  Dress code: When students teach in the class or visit middle schools for classroom observation, they must follow the required dress code. Students who violate this rule will receive a 3-point deduction from the final course grade.\n\n*   **Textbook:**\n\nThere is no set textbook for this course. Reading materials will be provided.\n\n*   **Tentative Schedule**\n\n**Week**\n\n**Date**\n\n**Content**\n\n**Task/Assignment**\n\n1\n\n9/8\n\nOrientation & Introduction\n\n2\n\n9/15\n\nInvited Talk 1: Successful Career Planning R1\n\n**_Reflection 1_** **(Due: 9/22)**\n\n3\n\n9/22\n\nInvited Talk 2: (1) Grades 1-12 English Curriculum Guidelines R2; (2) Bilingual Education R2\n\n**_Reflection 2_** **(Due: 9/29)**\n\n4\n\n9/29\n\nTeaching Vocabulary & Grammar\n\n5\n\n10/6\n\nTeaching Listening & Reading\n\n6\n\n10/13\n\nTeaching Speaking & Writing\n\n**G1: LP draft due**\n\n7\n\n10/20\n\nLesson Structure & Lesson Planning\n\n**G2: LP draft due**\n\n**G1:** **Meeting**\n\n8\n\n10/27\n\nG1 Micro-teaching—Junior High, Book 4, Lesson 2 **R3**\n\n**G3: LP draft due**\n\n**G2****:** **Meeting**\n\n**_Reflection 3_** on JH micro-teaching (submit within a week after practice teaching)\n\n9\n\n11/3\n\nG2 Micro-teaching—Junior High, Book 4, Lesson 3 **R3**\n\n**G3:** **Meeting**\n\n**G4:** **LP draft due**\n\n10\n\n11/10\n\nG3 Micro-teaching—Junior High, Book 4, Lesson 4 **R3**\n\n**G4: Meeting**\n\n11\n\n11/17\n\nG4 Micro-teaching—Junior High, Book 4, Lesson 5 **R3**\n\n**G1:** **LP draft due**\n\n12\n\n11/24\n\nInvited Talk 3: Innovative TeachingR4\n\n**G2:** **LP draft due**\n\n**G1: Meeting**\n\n**_Reflection 4_** **(Due: 12/1)**\n\n13\n\n12/1\n\nG1 Micro-teaching—Senior High, Book 4, Lesson 4 **R5**\n\n**G3:** **LP draft due**\n\n**G2: Meeting**\n\n**_Reflection 6_** on SH micro-teaching (submit within a week after practice teaching)\n\n14\n\n12/8\n\nG2 Micro-teaching—Senior High, Book 4, Lesson 5 **R5**\n\n**G4:** **LP draft due**\n\n**G3: Meeting**\n\n15\n\n12/15\n\nG3 Micro-teaching—Senior High, Book 4, Lesson 6 **R5**\n\n**G4:** **Meeting**\n\n16\n\n12/22\n\nG4 Micro-teaching—Senior High, Book 4, Lesson 7 **R5**\n\nSubmit final versions of lesson plans in electronic form (with markings on the revised segments) on Moodle by 24:00 on Dec. 29th (Thursday)\n\n*   **Other Requirements**\n\nFor each group micro-teaching session, every student is required to work in a small group, write a lesson plan and teach based on it. After the micro-teaching session, the instructor will lead a discussion session to help the teaching group improve their professional knowledge and skills.\n\n1.  **Lesson Plan**\n\n1.  Students will work in a small group to write a lesson plan that covers **four class periods** for the first micro-teaching (junior high school English class) and **five class periods** for the second micro-teaching (senior high school English class). The lesson plan must be typewritten and formatted according to the sample lesson plans provided in this class.\n2.  Before each micro-teaching session, the teaching group must turn in their lesson plan **(1st version)** to the instructor **at least two weeks before** their teaching demonstration. After the instructor reads the lesson plan, he will discuss it with the teaching group **one week before** the micro-teaching session.\n3.  After discussing with the instructor, the teaching group needs to revise their lesson plan and submit a revision **(2nd version)** to the instructor **on the day of micro-teaching, before they start to teach**.\n4.  Each group must hand in **a** **final version** of their lesson plans on Moodle at the end of the semester, and all lesson plans have to be carefully proofread and well formatted.\n\n1.  **Micro-teaching**\n\n1.  The teaching group needs to prepare teaching materials (e.g., class handouts) and distribute them to their classmates for their micro-teaching.\n2.  In general, each student will have approximately 20 minutes to teach for each micro-teaching session.\n3.  The teaching group will be assisted by a video-taping group (i.e., the **next** teaching group) on the day of micro-teaching. The video-taping group needs to borrow a camcorder from the English Department and set it up before the micro-teaching starts (Please contact the department office to reserve a camcorder in advance). On the day of micro-teaching, they need to time and video-tape the teaching group’s teaching demonstration.\n4.  On the day of micro-teaching, students who are not in the teaching group and the video-taping group will act as students and provide comments and suggestions for the teaching group.\n5.  After each micro-teaching session, every student in the teaching group needs to watch his/her own teaching demonstration, write an individual reflection report (no less than two pages), and submit it to the instructor **within one week** (for Reflections 3 & 5). The reflection report should also incorporate feedback from classmates.",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Lecture"
        },
        {
            "type": "討論法",
            "note": "Discussion"
        },
        {
            "type": "合作學習",
            "note": "Group work and discussion"
        },
        {
            "type": "實驗/實作",
            "note": "Micro-teaching"
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": "1. Lesson plans (original/revised): 30%; 2. Micro-teaching performance: 30%; 3. Peer feedback (oral/written): 10%; 4. Reflection on lectures, invited talks, and micro-teaching: 20%; 5. Attendance, participation & miscellaneous: 10%"
        }
    ],
    "prerequisite": "◎必須先修過【ENUE001  英語教材教法（教）】",
    "general_core": []
}