{
    "year": 109,
    "term": 1,
    "name": "臺灣政治社會史專題",
    "teachers": [
        "林欣宜"
    ],
    "department": "LM22",
    "code": "HIM0156",
    "credit": 3,
    "serial": 1686,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 1,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "歷史系研究生第1教室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "本課程介紹史前迄今的臺灣歷史中的重要課題，協助學生以歷史的角度理解臺灣在社會與政治上的階段性變化，亦意在刺激學生思考臺灣在世界史中的定位。本課以英語講授，課程之進行方式將包括兩小時講授與一小時對指定閱讀之課堂討論或小組報告；建議學生應有基本英語聽說讀寫能力，能有中文閱讀能力更佳。",
    "goals": [
        "To understand the major social and political shifts of Taiwan society",
        "To read English literatures about Taiwan history",
        "To explore and enquire into pervasively-discussed historical issues and their connection with contemporary Taiwan society"
    ],
    "syllabus": "Week 1: Introduction to the course\n\nWeek 2: Students self-introduction and introduction to methodology, research tools and required knowledge in understanding Taiwan history\n\nWeek 3: Taiwan and the Austronesian world\n\nWeek 4: The “Emergence” of Taiwan History\n\nWeek 5: Legacy of the Dutch, Spaniard and others in the Seventeenth Century\n\nWeek 6: Konxiga and the Chinese regime on Taiwan\n\nWeek 7: The Beginning of Taiwan as a part of the Chinese Empire\n\nWeek 8: Land and social development of Taiwan under Qing rule\n\nWeek 9: Mid-term examination week\n\nWeek 10: The end of the Chinese imperial regimen on Taiwan\n\nWeek 11: Modernisation and the new Japanese rule\n\nWeek 12: Foreign presence and development on the island of Taiwan\n\nWeek 13: Taiwan in the “Japanese Empire” during WWII\n\nWeek 14: The “back” of the Chinese regime: political and social transformation\n\nWeek 15: Taiwan ‘s democratization: cinema appreciation – _Hand in Hand_ (2011, 140 mins) or a class trip to Nylon Cheng Memorial Museum\n\nWeek 16: Taiwan’s identity crisis and grass-root social movements\n\nWeek 17: Taiwan in modern world\n\nWeek 18: Term examination week",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Lecture (2 hours)"
        },
        {
            "type": "討論法",
            "note": "Discussion/Group presentation (1 hour)"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 60,
            "note": "Submission of a term essay under a word limit of 3,500. It should highlight students’ personal experiences, reading endeavor and systematical thinking of Taiwan history. Can be presented in forms of case study report, short movie, exhibition or others. Grades will be given upon the originality and logical thinking on students’ finding and thoughts about Taiwan history. Students are advised to make appointments to discuss with the teacher."
        },
        {
            "type": "期中考",
            "weight": 20,
            "note": "A critic essay on one of the references listed below, not to exceed the limit of 1,000 word."
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "Personal self-introduction / presentation / group presentation, and involvement in class discussion."
        }
    ],
    "prerequisite": "",
    "general_core": []
}