{
    "year": 109,
    "term": 2,
    "name": "繪畫史研究導論",
    "teachers": [
        "諾斯邦"
    ],
    "department": "TM67",
    "code": "AHM0115",
    "credit": 3,
    "serial": 3048,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "青田406室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course introduces the student to the history, styles, and genres of Western painting, and develops an understanding of major periods of this medium from the Renaissance until the 20th century under the scope of significant methodologies covering the field of Western art history. Paintings are addressed in their cultural context and artistic genres are presented in accordance with their historical emergence (religious painting, mythology, history painting; portraiture, landscape, still-life, etc.). Each lesson discusses a period focusing on major stylistic genres (Renaissance, Mannerism, Baroque, Classicism, Romanticism, Realism, Impressionism, Symbolism, Avant-Gardes, etc. It analyzes the influences of artists and/or artworks on specifc genres, topics or subject matter related to the Zeitgeist in question. Prominent art historians and art theories related with each period or genre are commented and contextualized. Changing methods of interpretation are carefully examined and works are analyzed under the scope of different methodological approaches and perspectives.",
    "goals": [
        "To impart in-depth knowledge on Western painting.",
        "To analyze and understand the historical development of Western painting.",
        "To cultivate student’s abilities to observe, understand, compare and interpret works.",
        "To shape student’s abilities to question and solve issues related to Western painting. To encourage their critical thinking.",
        "To train students to collect, study, and analyze primary and secondary sources, to select and comment the literature related to a specific topic."
    ],
    "syllabus": "**Introduction to Western Painting: styles, influences, genres and methodologies**\n\nThe course introduces the student to the history, methods and trends of the discipline of art history. It develops an understanding of the important theoretical developments that took place in the discipline from the Renaissance to the present. Prominent art historians and their theories are commented through the reading of exemplary texts. Their reception and influence  are analysed and contextualized. Changing methods of interpretation are carefully examined and compared through the scope of a selection of texts that cover different hermeneutic approaches and perspectives. \n\n**Week 1**\n\n**Introduction**\n\nThe first session provides an overview of the course by questioning why painting has occupied a prominent place in  the history of Western art. We will first introduce some aspects regarding the material of which painting is made, such as pigments and binder, the tools and supports used by painters, (palettes, brushes, panels, canvases…), as well as the sites of production such as the _atelier_ where we can analyze the different manners painters concretely documented the art of painting.\n\nReference texts:\n\n\\-        Philip Sohm, “Palettes as Signatures and Encoded Identities in Early-Modern Self-Portraits,” in _Art History_,  Vol. 40 no. 5, 2017, 994-1025\n\n\\-        Victor Stoichita, “Margins,” in _The Self-Aware Image. An Insight into Early Modern Metapainting_, (New, Improved and Updated Edition With an Introduction by Lorenzo Pericolo), London and Turnhout: Harvey Miller Publisher, 2015 / London: Reaktion Books, 1995, pp. 67-99\n\n\\-        Tristan Weddigen, “The Alchemy of Colors, Titian Portrays His Pigment Merchant Alvise ‘dai’ Colori’ dalla Scala,” in Koja, Stephan; Henning, Andreas. Titian. Lady in white. Dresden: Sandstein Verlag, pp. 50-63\n\n**Week 2**\n\n**Painting and its Founding Myths**\n\nIn this session we will focus on the founding myths of painting and see the importance given more specifically to the art of portraiture. We will question the implications such conceptions had on the understanding of the function of the, and see in parallel how the early modern development of easel painting was deeply influenced by the great authority Byzantine icons had gained after 1204, when they flooded into Italy after the Fourth Crusade.  \n\nReference texts:\n\n\\-        Boudewijn Bakker, “_Au vif – naar’t leven – ad vivum_. The Medieval Origin of a Humanist Concept,” in Nicolette C. Sluijter-Seijffert, Anton Willem Adriaan Boschloo, Jacquelyn N. Coutré, Stephanie S. Dickey (eds.), _Aemulatio: Imitation, Emulation and Invention in Netherlandish Art from 1500 to 1800: Essays in Honor of Eric Jan Sluijter_, Zwolle: Waanders Publishers, 2011, pp. 37-52Hans Belting, “The Coat of Arms and the Portrait: Two Media of the Body,” in _An Anthropology of Images: Picture, Medium, Body_, (translated by Thomas Dunlap), 2011, pp. 62-83\n\n\\-        Victor Stoichita, “The Shadow Stage,” in _A Short History of the Shadow_, London: Reaktion Books, 1997, pp. 11-41 \n\n**Week 3**\n\n**Painting as a Window**\n\nAlong the development of linear perspective, Leon Battista Alberti in his treatise _De Pictura_  (_On Painting_, 1435) defines the painted panel as an open window. Following Victor Stoichita’s seminal study on the self-aware image, the window is not just a metaphor, but a motif, like the representations of embrasures, niches, doors and frames that “acts as the archetypal matrix of painting.” While it brings about the dialectic between the interior and the exterior, it also marks visually, to quote Lorenzo Pericolo’s words, “the self-staging of painting in painting.” We will analyze the different ways these devices are used to stage the fictiveness of painting.\n\nReference texts:\n\n\\-        Joseph Masheck, “Alberti’s “Window”: Art-historiographic Notes on an Antimodernist Misprison’,  in _Art Journal_, Vol. 50, No. 1, 1991, pp. 35-41\n\n\\-        Lynn F. Jacobs, _Thresholds and Boundaries. Liminality in Netherlandish Art (1385-1530)_, London and New York: Routledge, 2018\n\n\\-        Klaus Krüger, “Andrea Mantegna: Painting’s Mediality,” in _Art History_, Vol. 37, No. 2, 2014, pp. 222-253\n\n\\-        Lorenzo Pericolo, “What Is Metapainting? _The Self-Aware Image_ Twenty Years Later,” in Victor Stoichita, _The Self-Aware Image. An Insight into Early Modern Metapainting_, (New, Improved and Updated), London and Turnhout: Harvey Miller Publisher, 2015, pp. 11-31\n\n\\-        Victor Stoichita, “Embrasures,” and “Margins,” in _The Self-Aware Image. An Insight into Early Modern Metapainting_, (New, Improved and Updated Edition With an Introduction by Lorenzo Pericolo), London and Turnhout: Harvey Miller Publisher, 2015, pp. 39-51 and pp. 67-99\n\n**Week 4**\n\n**Painting as _Istoria_**\n\nIn the middle of the second book of his treatise on painting (_De Pictura_, 1435), Alberti introduces the term of _istoria_which he considers as the painter’s greatest work and delineates the principles of narrative painting. We will see what these principles are, which importance the concept of narrative painting has had after Alberti in the classic theory of art, and how painters followed, questioned, or challenged the Albertian _istoria_. \n\nReference texts:\n\n*   Alexander Nagel, _Michelangelo and the Reform of Art_, Cambridge: Cambridge University Press, 2000\n*   Lorenzo Pericolo, “The Invisible Presence: Cut-In, Close-Up, and Off-Screen in Antonello da Messina’s Palermo _Annunciate_,” in _Representations_, Vol. 107, No. 1, 2009, pp. 1-29\n*   Lorenzo Pericolo, “A Matter of Optics and Rhetoric: The Aporia of Pictorial Narrative Before, During, and After Caravaggio’s Time,” in in _Caravaggio and Pictorial Narrative. Dislocating the_ Istoria _in Early Modern Painting_, London and Turnhout: Harvey Miller Publishers, 2011, pp. 35-120\n\n**Week 5** \n\n**_Disegno_** **/ _Colorito_**\n\nThe new humanist ideal of painting as a liberal art established the principle of a practice essentially governed by the intellect, establishing the primacy of _disegno_ – to be understood as both drawing and design – as the prime vector of the expression of the idea and manifestation of the form. _Colorito_ (color and coloring) was therefore relegated in classic theories to a subordinated role, often qualified as a cosmetic expedient. We will see that the debate between drawing and color had different implications in terms of how to appreciate a work, oposing the discursive and intellectual dimension of drawing to the sensual and tactile qualities of color. \n\nReference texts:\n\n*   Frederika H. Jacobs, “Aretino and Michelangelo, Dolce and Titian: Femmina, Masculo, Grazia,” in _Art Bulletin,_ Vol. 82, No. 1, 2000, pp. 51-67\n\nJacqueline Lichtenstein, _The Eloquence of Color. Rhetoric and Painting in the French Classical Age_, Berkeley: University Of California Press, 1993 \n\n**Week 6**\n\n**Renaissance**\n\n*   Florence 1400-1475: Emulation and _Paragone_\n*   Northern Renaissance and Italy\n*   Venice: Between North and Byzantium\n*   High Renaissance: Looking for Beauty\n\n(Leonardo da Vinci / Raphael / Michelangelo)\n\n**Bibliography:**  \n\n*   Peter Burke, _The Italian Renaissance: Culture and Society in Italy_, Cambridge, 1993\n*   Stephen Campbell, _The Cabinet of Eros: Renaissance Mythological Painting and the Studiolo of Isabella d'Este_, New Haven: Yale University Press, 2006\n*   Erwin Panofsky, “Iconography and Iconology: An Introduction to the Study of Renaissance Art”, in _Meaning in the Visual Arts_, Chicago: University of Chicago Press, 1982, pp. 26-54\n*   Victor Stoichita, _The Self-Aware Image: An Insight into Early Modern Meta-Painting_, Cambridge: Cambridge Univ. Press, 1997\n*   Aby Warburg, _The Renewal of Pagan Antiquity (Texts and Documents)_, Los Angeles (Malibu): Getty, 1999\n\n**Week 7**\n\n**Mannerism**\n\n*   Eccentricity and Playful Inventions\n\n(Pontormo, Parmigianino…)\n\n*   Tintoretto and Entrepreneurship\n*   Rudolph II and Prague\n\n**Bibliography:**\n\n*   Francis Ames-Lewis and Paul Joannides (ed.), _Reactions to the Master: Michelangelo's Effect on Art and Artists in the Sixteenth Century_, Aldershot: Ashgate, 2003\n*   Marcia B. Hall, _After Raphael: Painting in Central Italy in the Sixteenth Century_, Cambridge: Cambridge Univ. Press, 2001\n*   Tom Nichols, _Tintoretto: Tradition and Identity_, London: Reaktion Books, 2004\n*   Rebecca Zorach, _Blood, Milk, Ink, Gold: Abundance and Excess in the French Renaissance_, Chicago: University of Chicago Press, 2005\n\n**Weeks 8-9**\n\n**Baroque**\n\n*   The Carracci / Caravaggio\n*   The Art of Counter Reform / The Dutch Reform and Art\n\n(Rubens / Rembrandt)\n\nThe Golden Age in the Netherlands: Genres, Specialization and Art Market (Steen, Vermeer…)\n\n**Bibliography:**\n\n*   Svetlana Alpers, _The Art of Describing: Dutch Art in the Seventeenth Century_, Chicago: University of Chicago Press, 1984\n*   Holm Bevers, Jan Kelch (ed.), _Rembrandt: Wissenschaft auf der Suche; Beiträge des Internationalen Symposiums Berlin, 4. und 5. November 2006_, Berlin: Mann, 2009\n*   Benjamin Binstock, _Vermeer's Family Secrets: Genius, discovery, and the unknown apprentice_, NewYork: Routledge, 2009\n*   Paul Crenshaw, _[Rembrandt's Bankruptcy](http://www.kubikat.org/mrbh-cgi/kubikat_fr.pl?t_explizit=x&index=IDN&s1=ibf144m)__: the Artist, his Patrons, and the Art Market in Seventeenth-Century Netherlands_, Cambridge: Cambridge University Press, 2006\n*   Sandra Gianfreda, _[Caravaggio, Guercino, Mattia Preti](http://www.kubikat.org/mrbh-cgi/kubikat_fr.pl?t_explizit=x&index=IDN&s1=ib281462m)__: Das Halbfigurige Historienbild und die Sammler des Seicento_, Emsdetten: Edition Imorde, 2005\n*   Pamela M. Jones, _Altarpieces and Their Viewers in the Churches of Rome from Caravaggio to Guido Reni_, Aldershot: Ashgate, 2008\n*   Clare Robertson, _The Invention of Annibale Carracci_, Milan: Silvana Editoriale, 2008\n*   M. Roscam Abbing (ed.), _Rembrandt 2006_ / Leiden: Foleor, 2006\n*   Christian Tümpel ; Astrid Tümpel, _Rembrandt: Images and Metaphors_, London: Haus Publishing, 2006\n*   Genevieve Warwick (ed.), _Caravaggio: Realism, Rebellion, Reception_, Newark: University of Delaware Press, 2006\n*   Heinrich Wölfflin, _Principles of Art History. The Problem of Development of Style in Later Art_, New York: Dover Publications, 1950\n\n**Week 10**\n\n**Rococo**\n\n*   _Scenes galantes_ and the Art of Intimacy \n\n(Watteau, Boucher, Fragonard…) \n\n*   Public Exhibitions and the Birth of Art Criticism\n\n**Bibliography**\n\n*   Bruce Altshuler (ed), _Salon to Biennial: Exhibitions that Made Art History_, New York, NY: Phaidon, 2008\n*   Oskat Bätschmann, _The Artist in the Modern World: The Conflict Between Market and Self-Expression_, Cologne: DuMont, 1998\n*   Thomas Crow, _Painters and Public Life in Eighteenth-Century Paris,_ New Haven: Yale Univeristy Press, 1987\n*   Michael Fried, _Absorption and Theatricality. Painting and Beholder in the Age of Diderot_, Chicago: University of Chicago Press, 1988\n*   Mary D. Sheriff (ed.) _Antoine Watteau: Perspectives on the Artist and the Culture of His Time_, Newark, Del. : University of Delaware Press, 2006\n\n\\-        Philip Conisbee (ed), _French Genre Painting in the Eighteenth Century_, New Haven: Yale University Press, 2007\n\n**Week 11-12**\n\n**Neo-Classicism / Romanticism**\n\n*   Jacques-Louis David and Classicism\n*   Sublime! The Art around 1800\n\n(Fuseli, Caspar David Friedrich, Goya, Turner, Delacroix…)\n\n**Bibliography**\n\n*   Werner Hofmann, _Une époque en rupture (1750-1830)_, Paris: Gallimard, 1995\n*   Thomas Crow, _Emulation. David, Drouais, and Girodet in the Art of Revolutionary France (new edition),_ New Haven: Yale University Press, 2006\n\n**Realism 13-14**\n\n*   The Pre-Raphaelites / Courbet\n*   Painting and the Invention of Photography\n\n**Bibliography**\n\n*   Petra ten-Doesschate Chu, _The Most Arrogant Man in France : Gustave Courbet and the Nineteenth-Century Media Culture_, Princeton: Princeton University Press, 2007\n*   Linda Nochlin, _Courbet_, London: Thames & Hudson, 2007\n*   Elizabeth Prettejohn, _The art of the Pre-Raphaelites_, London: Tate Publishing, 2000\n\n**Week 15**\n\n**Impressionism / Symbolism**\n\n*   The Painters of the Modern Life\n\n(Manet, Caillebote, Degas, Monet…)\n\n*   Aestheticism and the Art for Art’s Sake (Whistler and Consorts)\n*   Secrets and Ambiguity (Redon, Khnopff, Klimt, Ensor…)\n\n**Bibliography**\n\n*   Norma Broude (ed), _Gustave Caillebotte and the Fashioning of Identity in Impressionist Paris_, New Brunswick, NJ: Rutgers University Press, 2002\n*   Bradford R. Collins, _12 views of Manet's Bar_, Princeton, NJ: Princeton University Press, 1996\n*   Eik Kahng (ed), _The Repeating Image: Multiples in French Painting from David to Matisse_, New Haven: Yale University Press, 2007\n*   Elizabeth Prettejohn, _Art for Art's Sake: Aestheticism in Victorian Painting_, New Haven: Yale University Press, 2007\n*   James H. Rubin, _Impressionism and the Modern landscape: Productivity, Technology, and Urbanization from Manet to Van Gogh_, Berkeley: University of California Press, 2008\n\n**Week 16**\n\n**The Avant-gardes**\n\n*   The Art of Transgression (Fauves, Futurists, Dadaists…)\n*   Surrealism\n*   Duchamp and After: The End of Painting\n\n**Bibliography**\n\n*   Jonathan P. Eburne, _Surrealism and the Art of Crime_, Ithaca: Cornell University Press, 2008\n\n**Teaching Methods**\n\nFor each lesson students are given a handout. It includes the essential bibliography mentioning monographs, academic studies, articles, documents, archives, and/or critics related to the topic. It provides the list of works (illustrations) analyzed during the lesson\n\nEach session tends to tackle a specific issue. Its goal is to present, analyze, and discuss the most important theoretical and practical aspects related to the topic in question. The outlines and the main issues are introduced at the beginning of each lesson. A brief summary of the previous lesson introduces the new issues which will be discussed. If questions related to previous lessons are still pending, they are answered, and/or recontextualized.\n\nThe topics are addressed through a close reading and detailed analysis of a single, or a group of works of art. The main issues related to a subject are examined through concrete examples. Different points of view are privileged in order to open new perspectives on well or-less known objects. I select various scientific texts, documents and sources and comment on them. Images, texts, and documents are used in order to present original and critical approaches.\n\nStudents’ abilities to gather, investigate and analyze art history resources are trained through personal contributions, such as the essays they are asked to present orally during the semester, and complete in a 10-page length written paper by the end of the semester. The topics are carefully chosen in order to propose issues that are closely related to the main topic of the course. Their relevance depends also on their accessibility. When selecting the topics I always take into account the literature at disposition. The students are in this respect given a selected bibliography which helps them to access the topic with the most appropriate tools. Students are also asked to complete their research with other readings.",
    "methodologies": [
        {
            "type": "實地考察、參訪",
            "note": "Study visits are organized when possible and according to the course topic – depending on the cultural actuality (exhibitions, events etc.)"
        }
    ],
    "grading": [
        {
            "type": "出席",
            "weight": 20,
            "note": "During the course the skills of the students are tested through questions intended to tackle problems in direct relationship to the topic. They are trained in the observation of artworks. They are taught how to describe a work (from the more general to the more specific), to understand its structure, its content, and its meaning. They are asked to compare works (or documents) with similar or contradictory examples. They are taught to identify and to interpret the different meanings of a work. Their aesthetic sensitivity and their critical thinking are encouraged through an acute observation and analysis of the works, documents, and academic writings introduced throughout the course. If the content presented seems to be unclear to the students, it is clarified through questions and answers."
        },
        {
            "type": "報告",
            "weight": 50,
            "note": "Students’ abilities to formulate a specific issue on a specific topic related to the course attended are trained, and improved. They are asked to present and structure their argumentation coherently, to produce a critical research based on an acute observation of the works analyzed, and to find possible solutions in a 30 minute time-lapse. The discussions, comments, and critics formulated during and/or after their oral presentation are always thought in a constructive way. They are intended to encourage the students to improve their critical approach, to redirect their previous intentions."
        },
        {
            "type": "成果展覽",
            "weight": 30,
            "note": "Students are asked to hand out a final paper respecting some formal, but essential points according to the common use in the academic field of art history (table of contents, quotations and correct referencing, presence of bibliography, illustrations etc.). Students are given a style sheet on which they can take example. The content should be well structured, written correctly, and thoroughly documented."
        }
    ],
    "prerequisite": "",
    "general_core": []
}