{
    "year": 109,
    "term": 2,
    "name": "北方文藝復興",
    "teachers": [
        "哈德森"
    ],
    "department": "TM67",
    "code": "AHM0118",
    "credit": 3,
    "serial": 3050,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "青田405室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "探討北方文藝復興藝術的演變與社會、文化、政治的關係，重要藝術家作品的特色，贊助者與重要工作坊的傳承，南、北方文藝復興藝術的交流，宗教改革對北方文藝復興藝術的影響等等議題，以增進對北方文藝復興藝術概觀性的認識，以及對相關議題的分析能力。",
    "goals": [
        "To create a wide-ranging knowledge and understanding of key developments in the visual arts and related cultures north of the Alps in the Renaissance.",
        "To train students’ ability to analyse form and iconography using correct terminology.",
        "To improve students’ ability in making aesthetic judgments.",
        "To instruct students how to find and interpret sources of art historical theory.",
        "To promote students’ competencies in collecting and interpreting related literature while maintaining a critical attitude toward scholarly opinions.",
        "To give technical instructions for writing an academic text and composing a paper."
    ],
    "syllabus": "**Northern Renaissance Art, Schedule of Session Topics**\n\nTo downlaod a pdf with the full course guide, click on the link at the bottom of the page..Here is a summary:\n\n**1\\.     Introduction** \n\nIn the first session, you will receive electronic copies of the course guide and the Academic Writing for Art History guide, and you will be given an overview of the course content, and an explanation of the assessment. This will be followed by definitions of key, course-specific terminology. Then, you will be given a presentation providing a brief account of some of the major centres of political and economic power in northern Europe during the Renaissance: the kingdoms of France and England, the duchies of Burgundy, Berry, and Anjou, and the Holy Roman Empire. \n\n**2\\.     Sculpture for the Burgundian Court in Dijon**\n\nThe Palais des ducs et des États de Bourgogne, in Dijon, was the seat of the dukes of Burgundy, and on the outskirts of the town they patronised the Chartreuse de la Sainte-Trinité de Champmol, as the site of their principal funerary chapel. For the chapel, they commissioned elaborate tombs, altarpieces, and sculpture for the portal, and in the cloister of the monastery, the celebrated Well of Moses. \n\n**3\\.     Luxury Books of Hours**\n\nWhile Paris was one of the leading centres of book production in Europe from the Middle Ages, during the Renaissance, Bruges, Ghent, and Antwerp emerged as rivals, particularly in the production of richly illustrated books of hours. We will examine how the texts, illustrations, and decoration of books of hours were devised to meet the requirements of clients, and how illuminators reached a new level of sophistication, equally in terms of realism and artifice. Further, we will explore how individual users adapted and intereacted with their books. \n\n**4\\.     Realism and Symbolism in the Work of Robert Campin and His Apprentices**\n\nRobert Campin is well documented as a master painter in early fifteenth-century Tournai,although the attribution of paintings to him is more disputed than for almost any major artist of the early Renaissance. There is greater consensus about the oeuvres of his workshop assistants, Rogier van der Weyden and Jacques Daret, and there is general agreement that the workshop produced a series of religious images that are highly innovative in their depiction of realistic details, such as sunlight and glistening, gold brocade. We will explore the complex interesection between realism and symbolism in paintings by Campin and his workshop. \n\n**5\\.     Painting, Piety, and Politics: Hubert and Jan van Eyck’s Ghent Altarpiece**\n\nThe Ghent Altarpiece is a landmark in Western art, celebrated for its exceptional scale, finesse, richness of ornament, and realistic detail. While containing a wealth of religious iconography, the portraits of the donors Joos Vijd and Elisabeth Borluut situate the commision in the context of the Flemish patrician-merchant classes, while allegorical iconography seemingly implicates the nobility. Currently undergoing conservation, a wealth of new scientific evidence is available online about the work's materials and technique, shedding light on some aspects of the Altarpiece's development, while leaving open other questions about the Altarpiece's unusual form, and the extent of contributions by Hubert and Jan van Eyck and assistants. \n\n**6\\.    Jan van Eyck, His Workshop, and Followers**\n\nBetween 1432 and 1441, Jan van Eyck headed a workshop in Bruges which produced a relatively small number of drawings, panel paintings, and illuminations, characterised by compositional innovation, intellectual sophistication, and exquisite pictorial quality. That there were assistants in the workshop is documented, although their identity remains uncertain. The recent emergence of the Eyckian drawing, now in the Boijmans Van Beuningen Museum, Rotterdam, has focussed attention once more on the question of reconciling what can be described as a miniaturist tendency in Eyckian painting, with the monumental style for which Van Eyck is more celebrated. As with the so-called Allendale Group of paintings inceasingly attributed to Giorgione, and the Karlsruhe Master, increaasingly recognised as Paulo Uccello, the so-called  \nHand G master can be recognised as Jan van Eyck's style adapted to the nature of images made, notwithstanding that some authors remain  \nunconvinced.\n\n**7\\.     Patronage of Nicolas Rolin and Guigone de Salins-Rolin**\n\nConsiderable attention has been paid by art historians to Chancellor Nicolas Rolin's pious patronage of the arts, and how it squares with his notoriously worldly interests. Here, we will give attention also to the patronage of his wife, Guigone de Salins-Rolin, at the Hôtel Dieu, Beaune. \n\n**8\\.     Representing the Body, Gender, and Sexuality**\n\nNorthern Renaissance Artists revelled in representing nudity in paintings, prints, and manuscript illluminations of Biblical narratives or scenes of contemporary life. Patriarchal doctrine and law, virtually exclusively, recognised only male and female genders, and allowed sexual relations only between a husband and a wife, while proscribing other kinds of sexual relations. Custom, however, sometimes tolerated exceptions, such as sex outside of marriage, for elite males. We will consider how in visual culture, illicit sexualitycould be depicted, or alluded to, including infidelity, polyamoury, and homosexuality.\n\n**9\\.     The Goldsmith’s Art**\n\nPetrus Christus' _A Goldsmith in His Shop_ (Metropolitan Muesum of Art, New York) provides a glimpse of the kinds of objects made, assembled, or traded by northern Renaissance goldsmiths, including ewers, cups, rings, broaches, rosaries, and purses. Other surviving forms include reliquaries, table centrepieces, chandeliers, lavers, candlesticks, collars, pendants, buckles, buttons, book cover embellishments, and commemorative tokens. We will investigate what these objects reveal about contemporary religion, superstition, ritual, and custom.\n\n**10\\.    Tournaments, Feasts, and Ceremonial Entrances**\n\nHistorical sources provide evocative descriptions of public festivities and civic celebrations across northern Renaissance Europe, although their ephemeral nature has resulted in little material evidence coming down to us. In this session, we conceptualize the integration of ritualised competition, performance, costume, painted sets and banners, theatrical props, and even foodstuffs, in chivalric and religious displays, and feasts. Further, we seek to identify implied political allegories, and recognize the motives behind such elaborate fashioning of civic identity, in a period of near constant dynastic struggles and military conflicts. \n\n**11\\.    Religious Conservatives Versus Reformers in the Holy Roman Empire: From an Enclosed Catholic Women's Community to Protestant Proselytizing**\n\nLongstanding Catholic attitudes favouring the use of images in devotional practices changd dramatically over the sixteenth century, in the Holy Roman Empire and neighbouring states, with the spread of the Protestant Reformation. However, its effects were not uniformly felt, and among its adherents, portraits of the reformers were immensely popular, and even biblical imagery continued to be produced, albeit of new kinds.\n\n**12\\.    Renaissance Art from the Holy Roman Empire in the Chimei Museum**\n\nThe Chimei Museum houses the only collection of northern Renaissance art, as well as Mannerist art, publicly accessible in Taiwan. On a day of theweek most convenient to the majority of the class, we will visit the museum, to examine closely the details of the artworks' iconography, and to consider their materials and technique.\n\n**13\\.    Print Culture in the Holy Roman Empire: Talismans, Monstrous Births, and Monuments**\n\nWoodcut prints developed rapidly in northern Europe in the second half of the fifteenth century and the first half of the sixteenth, from humble  \nobjects of popular, domestic use, to magnificent representations of feudal power. We will study some of the varied subject matter in prints, and the relationaship between prints and public discourse surrounding religious and political controversies.\n\n**14\\.    The Self-Fashioning of François I**\n\nKing François I of France was a prodigious patron of the visual arts and architecture, and subject of a substantial array of portraiture before and during his reign. We investigate his use of Christian and Classical iconography, and emblems, to represent the multifaceted nature of his self-fashioning.\n\n**15\\.    The Iconography of Queen Elizabeth I of England**\n\nDaughter of King Henry VIII, Elizabeth was born into a court well versed in the potential for literary and visual representation to serve dynastic, political, and diplomatic ends. The many portraits of Queen Elizabeth I, in panel paintings, miniatures, engravings, and coins, are distinguished by the richness and variety of their iconography.\n\n**16.    Cosmopolitan Cultures: Artistic Exchanges between Northern Europe, the Mediterranean, and the Levant**\n\nNorthern Renaissance art was exported across Europe, prized for its luminosity, detail, naturalism, and emotional expressiveness. Evidence of this is found in Renaissance humanist writing, inventories, and perhaps most eloquently, in the compositions of Italian artists, flattering through imitation. We will examine the history of the Florence, and other errant artworks. The course concludes with a quiz, which is not formally assessed, but does contribute to your mark for course preparation, attendance, and participation. \n\n**17-18.    Individual consultations with the professor available by appointment.**\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=10ca00d36c7d4131bec83d0e12f96ac2&fno=2f42e170fd1c4fa9a66fe6e233a4eb02)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "an approximately one hour presentation each week, for 16 weeks, by the professor"
        },
        {
            "type": "討論法",
            "note": "a one-to-two hour discussion each week, over 16 weeks, led by the professor, based on set readings and the case studies listed in the weekly schedule of this syllabus"
        },
        {
            "type": "問題解決教學",
            "note": "Non-assessed homework tasks may be given, requiring students to apply visual analysis and research methodologies to set artworks."
        },
        {
            "type": "媒體融入教學",
            "note": "Students will consult ultra-high resolution images of artworks, available from Google Cultural Institute."
        },
        {
            "type": "專題研究",
            "note": "Students will select a case study from the list in the syllabus schedule, or another example or topi chosen in consultation with the professor, as the basis for their assessed oral presentation."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 50,
            "note": "a written paper, in essay form, between 10 and 14 pages long"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "an oral presentation, with visual aids, of around 45 minutes"
        }
    ],
    "prerequisite": "",
    "general_core": []
}