{
    "year": 109,
    "term": 2,
    "name": "建築史研究導論",
    "teachers": [
        "Candida",
        "Syndikus"
    ],
    "department": "TM67",
    "code": "AHM0116",
    "credit": 3,
    "serial": 3049,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "青田405室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "The seminar has the goal to offer an introduction to architectural history from the classical antiquity to the present time. First, a concise summary of western architectural history will be provided. Second, a compact overview of the classical research fields and methods will be given. We shall follow key issues of architectural history studies, such as ‘space,’ ‘façade,’ ‘order,’ ‘ornament,’ ‘context,’ ‘scale,’ ‘style’ and ‘theory and practice.’\nOn the basis of carefully chosen examples, students will practice visual analysis and apply selected research methods of architectural history to acquire the necessary skills for studying buildings independently. Participants should gain knowledge and develop judgment in order to evaluate autonomously scientific points of view. Furthermore, they will learn the special terminology, which is necessary for joint discussion and academic writing. They will also learn to use bibliographic aids on the history of architecture and get basic skills of writing research papers. \nAs the direct physical experience of the monuments’ spatial conditions and materiality is a basic prerequisite for understanding the architectures’ nature and qualities, classroom training will be enriched by various off-campus activities: field trips and museum visits to sites in Taipei and its environs will be organized. This will help to understand the profound differences between Western and Asian architecture.\nIt is a special objective of this course to enhance students’ awareness of significant and urgent problems regarding their direct physical environment of the city.",
    "goals": [
        "To increase students’ knowledge of the development of architecture and architectural theory through the ages.",
        "To train students’ ability of analytical description and comparative analysis of form using the correct terminology.",
        "To enhance students’ knowledge of the development of architectural theory and methodology.",
        "To improve students’ capacity of esthetic judgment.",
        "To instruct students how to read and interpret contemporary sources of architectural theory and evaluate them with regard to the relevant buildings.",
        "To promote students’ competencies to collect and interpret related literature and to maintain a critical distance towards scientific opinions.",
        "To give an introduction with technical instructions for writing a scientific text and composing a paper."
    ],
    "syllabus": "Teaching Content (weekly):  \n1\\. Introduction: Historic building research today—questions, possibilities and problems. Techniques of description and interpretation. Description of architecture and specific language (with reference to a terminology catalog). Basic learning materials.  \n2\\. Distribution of topics for written papers.  \nForms of graphic/schematic representation. How to read architecture. Traditional building types versus new building types of the 18th/19th centuries. Introduction to descriptive methods. Training of terminology.  \n3\\. Short History of Western Architecture I: Western building traditions and their roots in antiquity. The architectural orders from antiquity to classicism.\n\nShort History of Western Architecture II: Romanesque and Gothic architecture in France, Italy, Germany.\n\n4\\. Ornament and decoration—The whole and the detail.  \n5\\. Short History of Western Architecture II: Renaissance architecture in the 15th century (Florence, Brunelleschi; Urbino, Rimini, Mantua, Alberti; Venice).\n\n6\\. The order in architecture.\n\n7\\. Architectural theory: Vitruvius, _Ten Books on Architecture_. Theorists of the Early Renaissance: Leon Battista Alberti, _On the Art of Building_ (_c._ 1452; publ. 1485). Early editions of Vitruvius (1496; Fra Giocondo \\[1511, 1513\\]; Cesare Cesariano \\[1521\\]). Architectural treatises of the 16th century: Andrea Palladio, _Four Books on Architecture_ (1570). Great Britain: Inigo Jones; _Vitruvius Britannicus_ (1715 and later).\n\n8\\. Proportion as value and quality issue in architecture. Theory and practice in architectural history.\n\n9\\. Short History of Western Architecture III: Church building in 16th-century Rome (Bramante, Michelangelo: St Peter’s Basilica). High Renaissance palaces and villas (Rome, Tuscany, Palladio in the Veneto). Mannerism in architecture (Michelangelo, Florence).\n\n10\\. Short History of Western Architecture IV: Palladianism—Palladio’s legacy in Great Britain and the United States.\n\n11\\. Short History of Western Architecture V: Abundance and order in Baroque architecture. Church architecture (Rome, Southern Germany). Castles and residences (France, Southern Germany).\n\nThe façade in Western architectural history. Do façades exist in Asia?  \n12\\. Short History of Western Architecture VI: Revolutionary architecture and _architecture parlante_. Stylistic variety and revival of styles in 19th-century architecture. Short History of Western Architecture VI: Architectural movements in the 2nd half of the 19th century: Arts & Crafts and Art Nouveau. Adolf Loos: _Ornament and crime_ (_c._ 1910).\n\nThe issue of style in Western architectural history.  \n13\\. Historical outlines of research: Architectural theory and methodology. The art of description in early times: architecture in literature/historical sources/ekphrasis. Procopius of Caesarea: _Peri Ktismaton_/_De aedificiis_/_On the Buildings_ (AD 561) (Description of the Haghia Sophia, Constantinople). St Bernard of Clairvaux (letter against decoration of monasteries); Cistercian monasteries. Traditional methods of art history with special regard to architecture. The origins (Plinius: _Natural History_; Vitruvius: _On Architecture_, Renaissance and Baroque).  \n14\\. The concept, history and analysis of style. Origins: Johann Joachim Winckelmann, Johann Wolfgang von Goethe (Straßburg, Münster; Palladio). Gottfried Semper (function, material, technique). Jacob Burckhardt and Renaissance (The _Cicerone_ \\[1855\\]). Alois Riegl and the Vienna School of Art History: _Kunstwollen_/will to art (_Problems of style: Foundations for a history of ornament_ \\[1893\\]). Heinrich Wölfflin: _Principles of Art History_ (_Renaissance and Baroque_ \\[1888/1964\\]). Problems of transfer from painting to architecture. John Ruskin: analysis of form (_Stones of Venice_ \\[1851–53\\]).  \n15\\. Iconography and Iconology. Aby Warburg. Erwin Panofsky: _Meaning in the Visual Arts_ (Abbot Suger on the Abbey Church of St.-Denis \\[1946\\]; _Gothic Architecture and Scholasticism_ \\[1951\\]). Otto von Simson: _The Gothic Cathedral: Origins of Gothic Architecture and the Medieval Concept Order_ (1956). Structural analysis: Hans Sedlmayr.  \n16\\. Short History of Western Architecture VII: New theories in 20th-century architecture. Architecture after 1900. The ‘free plan’ and organic space: Walter Gropius, Ludwig Mies van der Rohe. ‘Curtain wall.’ Le Corbusier and the five points of modern architecture. Henry-Russel Hitchcock/Philipp Johnson, _The International Style_ (1932). Ornament and modern architecture. Discussion of Postmodernism. After postmodern architecture/21st century.\n\nThe concept of space in architecture: August Schmarsow, _The Essence of Architectural Space_, 1893).  \n17\\. Historical context: Archive studies around 1900: Julius von Schlosser, Cornel von Fabriczy. New approaches of architectural history. Semiotics: Umberto Eco, _A Theory of Semiotics_ (1976). Günter Bandmann, _Medieval Architecture as Carrier of Meaning_ (1951). Aesthetic of reception. Current research/case studies.  \n18\\. Preservation of monuments and historic buildings. Current problems. UNESCO World Heritage. Preservation–transformation–conversion–demolition. Possibilities of conversion: Case studies and examples in Taiwan. Reconstruction: The history of the Berlin _Stadtschloss_ as case study. Final discussion.",
    "methodologies": [
        {
            "type": "講述法",
            "note": "30 % ex-cathedra-teaching (communication of relevant learning contents)"
        },
        {
            "type": "討論法",
            "note": "35 % group discussion"
        },
        {
            "type": "問題解決教學",
            "note": "Substantial part of the teaching are: 1) Analysis approaches and methods concerning artworks and their cultural, political, and economic backgrounds, and 2) Instruction of how to read respective original sources and secondary literature."
        },
        {
            "type": "合作學習",
            "note": "Students are taught how to discuss together course contents, research topics and methodological approaches."
        },
        {
            "type": "實地考察、參訪",
            "note": "Field trips and museums visits might be part of the course"
        },
        {
            "type": "媒體融入教學",
            "note": "PowerPoint Presentation, E-learning"
        },
        {
            "type": "專題研究",
            "note": "35 % case studies"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 10,
            "note": "Homework: preparation of topics, weekly reading."
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "Discussion of art works and texts (original sources, secondary literature).\nca. 30 min. discussion after each presentation."
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Weekly attendance at the course is required."
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "30–45 min. presentation with PowerPoint of the term paper topic; ca. 30 min. discussion after each presentation."
        },
        {
            "type": "專題",
            "weight": 50,
            "note": "Term paper of c. 15 pages to be submitted toward the end of the semester"
        }
    ],
    "prerequisite": "",
    "general_core": []
}