{
    "year": 109,
    "term": 2,
    "name": "藝術史學史",
    "teachers": [
        "諾斯邦"
    ],
    "department": "TM67",
    "code": "AHM0033",
    "credit": 3,
    "serial": 3044,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 3,
            "to": 5,
            "campus": "本部",
            "classroom": "青田406室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "The course introduces the history, methods and trends of the discipline of art history. It develops an understanding of the important theoretical developments that took place in the discipline from the Renaissance to the present. Prominent art historians and their theories are commented through the reading of exemplary texts. Their reception and influence  are analysed and contextualized. Changing methods of interpretation are carefully examined and compared through the scope of a selection of texts that cover different hermeneutic approaches and perspectives.",
    "goals": [
        "Development of the History of Art and Cognition",
        "Works and Key Discourses in the History of Art and Cognition",
        "Methodology and Related Works in the History of Art and Cognition"
    ],
    "syllabus": "**Art Historiography 2021**\n\n**The course introduces the history, methods, and trends of the discipline of art history. It develops an understanding of the important theoretical developments that took place in the discipline from the Renaissance to the present. Prominent art historians and their theories are commented through the reading of exemplary texts. Their reception and influence  are analysed and contextualized. Changing methods of interpretation are carefully examined and compared through the scope of a selection of texts that cover different hermeneutic approaches and perspectives.** \n\n**Week 1:**                      **Introduction I: Presentation of the topics**\n\n**Week 2:**                      **Common reading:**\n\n*   Felix Thürlemann, _More Than One Picture. An Art History of_ the Hyperimage, 2013, (English Translation: 2019), Introduction “Practices of the Hyperimage,” pp. 1-19, and Chapter 2 “Art Historians’ Image Practice,” pp. 87-140 (+ notes, pp. 193-202) \n\n**Week 3**                       **Common reading:**\n\n*   Hubert Damisch, _A Theory of /Cloud/. Toward a History of Painting_, (1972), Stanford: Stanford Unive rsity Press, 2002, Chapter 5, “Our Sheet’s White Care,” pp, 182-231\n\n**Week 4:**                      **Common reading:**\n\n*   “There Are No Visual Media,” in _Journal of Visual Culture_, Vol. 4, no. 2, 2005, pp. 257-266\n\n**Week 5**                       **Common reading:**\n\n*   John Onians, “Neuroarthistory: Making More Sense of Art,” in Kitty Zijlmans and Wilfried van Damme (eds.), _World Art Studies: Exploring Concepts and Approaches_, Amsterdam: Valiz, 2008, pp. 267-286\n\n**Week 6:**                      **Common reading:**\n\n*   Wu Hung, “The Painted Screen,” in _Critical Inquiry_, Vol. 23, No. 3, 1996, pp. 37-79\n\n**Week 7:                      Common reading;**\n\n*   Barbara Baert, _About Stains or the Image as Residue_,  Leuven: Peeters, 2015, pp. 1-58\n\n**Week 8:                      Common reading:**\n\n*   Craig Clunas, “The Gentleman,” in _Chinese Painting and Its Audience_, Princeton and Oxford: Princeton University Press, 2017, pp. 37-83\n\n**Week 9:                      Presentations: Svetlana Alpers, _The Art of Describing: Dutch Art in the Seventeenth Century_, Chicago: The University of Chicago Press, 1983**\n\n*   1\\. Chapter 3: “‘With a Sincere Hand and a Faithful Eye’: The Craft of Representation,” pp. 72-118\n*   2\\. Chapter 7: “Looking at Words: The Representation of Texts,” pp. 169-221\n\n**Common reading:**\n\n*   “Introduction,” pp. xvii-xxii\n\n**Week 10:                    Presentations:  Rosalind Krauss, _The Originality of the Avant-Garde and Other Modernist Myths_, Chicago: The University of Chicago Press, 1985**\n\n*   1\\. “The Photographic Conditions of Surrealism,” pp. 87-118\n*   2\\. “Notes on the Index, Part I,” “Notes on the Index Part II”, pp. 196-209 and pp. 210-220, and “Sculpture in the Expanded Field,” pp. 276-290\n\n**Common reading:**\n\n*   “Introduction,” pp. 1-6 and “Grids,” pp. 9-22\n\n**Week 11:                    Presentations: Linda Nochlin,  _Bathers , Bodies, Beauty: The Visceral Eye_, Cambridge: Harvard University Press, 2006**\n\n*   1\\. Chapter 2: “Manet’s _Le Bain_: The _Déjeuner_ and the Death of the Heroic Landscape,” pp. 55- 98\n*   2\\. Chapter 5: “More Beautiful than a Beautiful Thing. The Body, Old Age, Ruin, and Death” pp. 251-292\n\n**Common reading:** \n\n*   1\\. “Epilogue,” pp. 293-308\n*   2\\. “The Imaginary Orient,” in _Art in America_, 1984, pp. 119-131, and pp. 186-191 \n\n**Week 12:                    Presentations: Victor Stoichita, _The Self-Aware Image. An Insight Into Early Modern Meta-Painting_, 1997 (New, Improved and Updated with an Introduction by Lorenzo Pericolo, Turnhout: Harvey Miller Publishers, 2015)**\n\n*   1\\. Chapter 1 and 3: “Embrasures,” and “Margins,” in _The Self-Aware Image. An Insight into Early Modern Meta-Painting_, pp. 39-51, and 67-99\n*   2\\. Chapter 4: “Assemblage: How to Make a New Painting from an Old Image,” pp. 103-139\n*   3\\. Chapter 6: “The Intertextual Machine,” pp. 141-179\n\n**Common reading:**\n\n*   Lorenzo Pericolo, “What Is Metapainting? _The Self-Aware Image_ Twenty Years Later,” pp. 11-31\n\n**Week 13**:                    **Maria H. Loh, _Still Lives. Death, Desire, and the Portrait of the Old Master_, 2015**\n\n*   1\\. Chapter 1: “The Treachery of Images,” pp. 1-55\n*   2\\. Chapter 2: “The Artist’s Body of Work,” pp. 56-112\n*   3\\. Chapter 3: “Exquisite Corpse,” pp. 113-170\n*   4\\. Chapter 4: “A Body Too Much,” pp. 171-225\n\n**Common reading:**\n\n*   “User’s Guide,” pp. ix-xvii\n\n**Week 14:**                    **Hanneke Grootenboer, _Treasuring the Gaze. Intimate Vision in Late Eighteenth-Century Eye Miniatures_, Chicago and London: University of Chicago Press, 2012**\n\n*   1\\. Chapter 1, “Intimate Vision. The Portrait Miniature’s Structure of Address,” pp. 17-44\n*   2\\. Chapter 2, “Eye Portraits and the Two Sexes of Sight,” pp. 45-88\n*   3\\. Chapter 4, “Intimate as Extimate. The Gaze as Part Object,” pp. 125-160\n\n**Common reading**\n\n*   “Introduction: An Overlooked Episode in Vision’s History,” pp. 1-16\n\n**Week 15**:                    **Presentations: Mechthild Fend, _Fleshing Out Surfaces. Skin in French Art and Medicine, 1650-1850_, Manchester: Manchester University Press, 2017** \n\n*   1\\. Chapter 2: “The Surface’s Substance,” pp. 17-63\n*   2\\. Chapter 3: “Nervous Canvas,” pp. 65-104\n*   3\\. Chapter 4: “Sensitive Limit,” pp. 107-140\n*   4\\. Chapter 5: “Skin Colour,” pp. 143-191\n\n**Common reading:**\n\n*   Chapter 1, “Introduction,” pp. 1-14 \n\n**Week 16:                    Presentations: Hal Foster, _Brutal Aesthetics. Dubuffet, Bataille, Jorn, Paolozzi, Oldenburg_, Princeton and Oxford: Princeton University Press, 2020**\n\n*   1\\. Chapter 1: “Jean Dubuffet and His Brutes,” pp. 25-69\n*   2\\. Chapter 4: “Eduardo Paolozzi and His Hollow Gods,” pp. 139-193\n*   3\\. Chapter 5: “Claes Oldenburg and His Rays Guns,” pp. 195-247\n\n **Common reading:**\n\n*   “Introduction: Positive Barbarism,” pp. 1-23\n\n**Week 17-18:              Discussion**\n\nThe first half of the semester is devoted to the common reading of selected texts which will be commented in the classroom. The second part of the semester is reserved for individual presentations on selected chapters of books. In order to facilitate the discussion between presenters and the other participants of the course, everybody is asked to read carefully the introduction or texts that are mentioned as common reading in the program. \n\n**Instructions for the oral presentations and term papers delivered in the Art Historiography Course**\n\n**1\\. Oral Presentation (duration 30-40 minutes)**\n\nPlease provide a handout with your name and student number with the following information \n\n•       Title, date, publisher etc. of the book you are presenting (when it is a translation, please indicate the first edition in the original language and the original title) \n\n•       The chapter of the book you are analyzing\n\n•       The articulation of your presentation (it may be related to the structure of the chapter) \n\n•       The reception of the book (reviews, references in later publications)\n\n•       Bibliography \n\n**2\\. Final Term papers**\n\n**Content and Structure**\n\n•       In the introduction, present the text you are analyzing, when and how it was published, who is the author and what is the general content (you may summarize briefly the book in which the text was published) \n\n•       In the analysis, present the main stakes of the text you are reviewing. \n\n•       Describe the structure and the content of the text. The analysis of the text should give the detail of the form and the content of the thesis it embraces. You may comment key passages and paraphrase them.\n\n•       Try to describe in which way the argumentation is structured, for example in taking into account what is the point of departure of the argumentation and what is the final outcome and destination of the text. \n\n•       You may also challenge the pertinence of the argumentation by confronting some issues presented in your text with other studies. You may in this respect compare what different scholars wrote on these critical aspects.\n\n**Method**\n\nThe review must be based on a critical reading of the part assigned to comment. It begins with a thorough summary, describing the content, the structure, and methods the author used to build his/her argumentation. After having defined these aspects, it is necessary to replace the text in its context. This must be done through the presentation of the author, his/her career and significant publications.  It is also necessary to take into account the review(s) collected on the text under scrutiny. The reflections and comments provided during the discussion that took place in the classroom should be integrated in the final version of the term paper. Your analysis will have more strength if you provide the socio-historical as well as intellectual context in which the author and the text are inscribed. Some authors do explicitly refer to other scholars / texts / to legitimize their own point of view in their argumentation. They may explicitly frame their research within a specific intellectual, scientific, methodological context. The text and its significance can be also measured in term of its reception and how other scholars do refer, comment on the text either in positive of negative way. It is therefore necessary to have not only a look at the career of the authors, their methods, the influences they received from their \"masters\", but also to take into account the way the text was support(ed) or contradict(ed) by other scholars through the writings to which the text may respond and echo.\n\n**Quotations and footnotes**\n\n            Your term paper focuses essentially on the text you are reviewing. You must in this respect report thoroughly the page numbers you are referring to in the footnotes, no matter you are quoting or paraphrasing. (For the technical details, see the booklet “Academic Writing for Art History). You also have to make clear who is speaking, and where each idea comes from when the author of the main text mentions secondary texts and studies. \n\nYou must also indicate the sources you have consulted for your analysis and review (books, articles, DVDs, websites, etc.)\n\n            The footnotes serve also to provide the reader with further information you cannot put in the main text. This can be helpful, when you want to keep some continuity to the argumentation of the main text.\n\n Length: 10-15 pages, Times New Roman, line space 1.5 (bibliography, appendix etc. not included)\n\nFor details, see the booklet “Academic Writing for Art History”\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=9469e89546684b99a8575a27520d9774&fno=829af9b16dc84e7d865822ea7a5981b7)",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": "Assignments are presented at the beginning of the semester"
        },
        {
            "type": "其他",
            "note": "Each student will give an oral presentation and submit a term paper based on the oral presentation."
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 60,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 10,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}