{
    "year": 110,
    "term": 2,
    "name": "策略管理",
    "teachers": [
        "林舒柔"
    ],
    "department": "OM56",
    "code": "IAM0043",
    "credit": 3,
    "serial": 2418,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "雲508"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "Strategic management deals with decisions that fundamentally influence the direction of the organization and effective implementation of the direction chosen. Strategic management examines the organizational structure, resources & capabilities, and the strategic positioning of the organization to create, capture and sustain competitive advantage. In addition to economic value creation, management also must make decisions concerning the distribution of this economic value.\nIn this course we integrate these views together by taking the unique perspective of the situational problems of the general manager.  The general manager's primary responsibility is to diagnose the critical factors that require attention in complex business situations and to find workable solutions to strategic and organizational problems. To solve such business problems, the general manager must be capable of understanding and using knowledge from each functional area to provide a \"total business\" (systems) perspective on issues pertaining to strategic management. Thus, I will introduce a STRATEGY MATRIX (策略矩陣) developed by professor Seetoo (司徒達賢) as an exemplar to describe and analysis the business strategy of a particular company.\nThis course focuses on key issues in formulating and implementing strategies to create and sustain competitive advantage.  Emphasis is given to developing pragmatic and action-oriented general management skills.  Extant theory within the fields of strategy, accounting, economics, finance, inter- national business, marketing, political science and organization theory have important implications for general management. Thus, this course emphasizes cases and lecture/discussions.",
    "goals": [
        "了解企業如何獲得競爭優勢",
        "分析企業所處環境並制定政策"
    ],
    "syllabus": "Course Requirements\n===================\n\n*   **Meaningful Participation**\n\nInformed and engaged participation is an essential part of this class and is expected of everyone. Learning opportunities are maximized when you actively engage in class discussion. Active engagement means that you are listening carefully to your peers and seeking opportunities to make comments that move the class discussion forward. Please feel free to ask questions. Be respectful, but make your opinions known.\n\n*   **Case Presentation**\n\nFor enhancing discussion, each case will be presented by one group before case discussion.\n\n*   **Case Write-ups**\n\nEach participant needs to submit write-ups answering questions posted on Moodle for **four** cases (eigher A series or B series). The write-ups should be within **one page** and submitted by **Sunday midnights** (12:00 a.m.) before class dates. Before submitting your personal reports, you could discuss with other class participants. The comprehensiveness of different decision factors in your analyses will be important in the assessment of the written cases. Organize the analysis to facilitate your arguments. Frame your arguments in such a way as to guide the reader through the logic of your analyses and to ‘sell’ your recommendations. Please analyze the data provided to provide evidence-based arguments. Think critically. Your grade will reflect the depth of your analysis and your ability to defend your recommendations.\n\n*   **Business Projects**\n\nEach group will collaborate with one client. The goal is to propose ways to solve the issues raised by the client. Issues might involve operation improvement, strategic diagnosis or business proposal preperation. The process might include proposing to the business and subsequently revising according to the client’s feedback. Grades of this project will depend on the reports and oral presentation.\n\n**week**\n\n**Theme**\n\n1\n\n**Course Orientation** **& Project Introduction**\n\n2\n\n**S****trategic Decision-Making**\n\nExercise 1: Baldwin Bike\n\nCh 1: The concept of strategy\n\n3\n\n**Peace Memorial Day**\n\n4\n\n**Carbon Footprint Analysis**\n\nCase 1: Carbon Footprints--Methods and Calculations\n\nCase 2: Allbirds—Decarbonize Fashion\n\n5\n\nGuest SpeakerL葉欣誠老師演講\n\nCarbon Footprints Calculation\n\n6\n\n**Business Model**\n\nCase 3: Amazon.com 2003\n\nBusiness Model Canvas\n\n7\n\n**Digitalization and Competition**\n\nCase4: Nike: Changing the Sneakers Game\n\n8\n\n**Children's Day**\n\n9\n\n**Business Project Proposal Presentation** **Ⅰ**\n\n10\n\n**Business Project Proposal Presentation** **Ⅱ**\n\n11\n\n**NFTs and Blockchain**\n\nCase 5: How NFTs create value\n\nCase 6: Can blockchain help Chateau Lafite fight counterfeits?\n\n(Debate)\n\n12\n\n**Direct to Customers**\n\nCase 7: Warby Parker\n\nCh 5: Analyzing resources and capabilities\n\n13\n\n**Structure and Strategy**\n\nCase 8: GE Plastics\n\nCh 6: Organization structure and management systems\n\n14\n\n**Guest Speaker**\n\n15\n\n**Business Project Final Presentation** **Ⅰ**\n\n16\n\n**Business Project Final Presentation** **Ⅱ**\n\n學期專案\n\n專案一：全營所宣傳企劃\n\n專案二：光電所產品開發與面市企劃\n\n*   二A魚刺檢測\n*   二B 咖啡隨享烘焙機\n*   二C 除溼棒∕除溼箱\n\n專案三： 臺師大美術館\n\n*   三A 將臺師大美術館館藏轉譯為商業映演內容，合作場地為双融域AMBI Space\n*   三B 將臺師大美術館館藏轉譯為適合收藏之NFT形式作品，提出NFT上架銷售及Discord社群經營企劃\n*   三C臺師大美術館實體館藏募款拍賣會企劃\n*   三D 研擬臺師大美術館特展票務之定價、宣傳、銷售事宜\n\n專案四：Reurt品牌發展企劃\n\n專案五：石虎米無色選甘酒釀行銷企劃",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "其他",
            "note": "個案研究"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "個案簡報"
        },
        {
            "type": "報告",
            "weight": 40,
            "note": "企業專案"
        },
        {
            "type": "其他",
            "weight": 30,
            "note": "個案報告（包含6個哈佛個案）"
        }
    ],
    "prerequisite": "",
    "general_core": []
}