{
    "year": 109,
    "term": 1,
    "name": "中文閱讀與思辨",
    "teachers": [
        "林玉玫"
    ],
    "department": "CU",
    "code": "00UA7A2",
    "credit": 2,
    "serial": 248,
    "group": "I",
    "quota": {
        "limit": 35,
        "additional": 5
    },
    "schedule": [
        {
            "day": 2,
            "from": 1,
            "to": 2,
            "campus": "本部",
            "classroom": "樸305"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限體育系（學）選修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本學期課程規劃以閱讀與討論為主，融入深度討論教學法。\n基於參與學生已在中學培養相當程度之國語文能力，乃以議題思辨及溝通表達之訓練為課程宗旨。本課程期待各種族、信仰、年齡、性別、政治傾向、經濟階級等不同人士共同參與，我們希望能在課堂上閱讀具有啟發性的文本，鼓勵每個人思考問題的深層因素，並以口說、文字來分享個人不同的觀點。也期待思想及表達的訓練，能讓參與者運用所學於大學未來的學術研究，以及畢業後的職場生涯。",
    "goals": [
        "指導學生掌握理解各類文本的方法。",
        "提升學生分析、評論各類文本的能力。",
        "強化學生聆聽及口語表達的能力。",
        "促進學生思考、組織、想像與創造的能力。",
        "誘導學生閱讀的興趣、培養學生閱讀的習慣與品味。",
        "指導學生研讀經典，以充實知識涵養、拓展人生視野、啟發對人文及不同種族文化的關懷與理解。",
        "指導學生掌握理解各類文本的方法。"
    ],
    "syllabus": "第一單元   認識自我與展望未來\n\n【課程目標】\n\n        在大學入學考試之前，大家的目標或許很單純，就是挑選自己想要的領域，朝這方向考上理想的學校和科系。但在通過考試之後，也許會發現，人生的目標已經來到不同的階段了。大學教育更加重視自主、多元化學習，也勢必會認識更多不同的人，同時為了將來的就業，也需要培養更多專業知識。在這樣的情況之下，更應該深入了解自己，找到自我價值，明白李白所謂的「天生我材必有用」之真諦。\n\n        認識自我，重要的是明白自己的優缺點，與自己想要的是什麼。或許不能免俗的需要與其他人事物做比較，但比較的最終目的還在於體認自我與團體、社會的關係。本單元之目標，即希望能讓同學們對自我多一點探索與思考，並能認清自我的定位。在自我探索與思考部份，先以周震宇4E法則練習，用概括和解釋的方式來介紹自己。\n\n  \n        然後，再請同學回顧自己的家庭背景、時代背景，思考這些「環境」因素對自我的影響。希望透過這些，讓同學能從初步的到深入的認識自我，找出定位。\n\n【課程綱要】\n\n第1週    **課程導論與說明**\n\n第2週    **深度討論教學法說明**\n\n第3週    **自我定義：**\n\n            周震宇4E理論\n\n第4週    **凡走過必留下痕跡**\n\n            吳永佳〈念大學，為了什麼？〉\n\n第5週    **共同國文思辨及寫作能力測驗（前測）** \n\n第6週    **成長的故事**\n\n            李翠卿〈紅面棋王周俊勳：放下得失心，找回初衷〉    \n\n第二單元   經典閱讀與深度思辨\n\n【課程目標】\n\n        每個時代都有當代流行和推崇的經典，有的經典甚至能一直經過時間的考驗，歷久不衰。但在今天，你或許曾經在書店看過《崩壞國文》的書；愛因斯坦的相對論被改成「撩妹」語錄。或者經典重新被定義，例如梅西之於足球員身高，王建民之於伸卡球。權威與經典不斷被消解、重塑或顛覆，顯示不同的時代，有不同的經典，經典也是不斷被超越的。\n\n        因此，可試著思考，什麼是你專業領域中的經典（人物）？需要具備有什麼條件和價值？對這樣的經典，你又有什麼想法或感受？\n\n【課程綱要】\n\n第7週      體育**是什麼？能吃嗎？**  \n              電競算是運動嗎？\n\n第8週      **王牌投手的凋零**\n\n              陳展宇〈從張誌家事件，這個社會看到什麼？〉\n\n第9週      **說一口好球**\n\n              〈看球五十年，見證臺灣棒球崛起的第一代球評——張昭雄〉\n\n第10週     **體育課該怎麼上？**\n\n              陳子軒〈我們需要什麼樣的體育課？〉\n\n  \n第11週     **躲避球是「合法霸凌」嗎？**\n\n             〈廢了「合法霸凌」的躲避球，臺灣的足球就會比較好嗎？〉\n\n第12週     **電影《卡特教頭》欣賞**\n\n第三單元  專題探索與優質表達\n\n【課程目標】\n\n    升上大學以後，同學將有機會認識不同科系和領域的人，甚至可能經常被問起：「你們科系都在學些什麼？」因此，不同科系間的彼此交流，是很可能會出現的狀況。而一個真正瞭解自己領域專業知識的人，是能夠用通暢明白、簡明好懂的表達方式呈現出來的。如果你有看過電影《三個傻瓜》，必然會記得裡面有一段情節：一個機械系的教授在課堂上，請同學解釋何謂「機械」，其中一位同學將教科書中複雜且充滿專業名詞的定義一字不漏的背出來，獲得教授的欣賞；而主角用另一種簡單好懂且更為生活化的方式解釋「機械」，卻被教授嗤之以鼻。姑且先不論哪種表達方式比較好，但若我們想要將自己的專業知識，讓非此專業的人理解，那麼先用一種簡單明瞭的方式表現，所獲得的效果可能會更好。\n\n        又或者，四年一次的世界盃開打時，總會有許多「一月球迷」出現，跟隨世界盃的風潮看球，但本身對於足球這項運動的知識卻很少，等世界盃結束，對這項運動的熱情也就隨著減退。於是，網路上有不少資深球迷，開始花不少心力寫作文章，介紹厲害的球星、知名的職業聯隊、好看的職業聯賽等等，期望能用有趣又淺顯的介紹，吸引這些「一月球迷」繼續收看比賽，將足球推廣給更多人知道。\n\n    因此，在本單元中，我們可以試著訓練自己有這樣的能力，能根據聽眾/觀眾/讀者的性質，用適當、流暢且易懂的方式表達自己的專業；同時，還要能夠將自己的專業領域中，具有價值、能解決問題的部分呈現出來，讓大家明白，每個領域都有其存在的意義和重要性。甚至，能因此對你的領域產生濃厚的興趣。\n\n【課程綱要】\n\n第13週    **你可以比名嘴更厲害**\n\n             林宇軒〈如何寫好一篇科普文章？以新知類科普文為例〉\n\n第14週    **深度議題討論**\n\n             〈成績至上：競爭的教育體系讓教育走向險路〉\n\n             延伸閱讀：〈被學霸耽誤的插畫家〉、〈競爭無用論？〉\n\n第15週    **共同國文思辨及寫作能力測驗（後測）**     \n\n第16週    **期末成果報告，紙本繳交**\n\n第17週    **期末成果報告，紙本繳交**\n\n第18週    **成果檢討與學期回顧**\n\n**\\* 課綱僅供參考，本課程內容單元設計，將會依照當學期行事曆之假期，與學生之學習進度，進行彈性調整與安排。評分方式亦可能依實際情況需要調整，教師保留最後的修改權利**\n\n**\\* 請尊重智慧財產權，在合理範圍內使用圖書與網路資源，作業與報告嚴禁抄襲**",
    "methodologies": [
        {
            "type": "講述法",
            "note": "教師引導與講解"
        },
        {
            "type": "討論法",
            "note": "深度討論法（Quality Talk）簡稱QT"
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 25,
            "note": "每個單元皆配合一個作業，課前課中有AB表練習，細節課堂公布"
        },
        {
            "type": "期末考",
            "weight": 30,
            "note": "採報告形式，主題為根據自己的專長領域寫作一篇科普文章，細節課堂公布"
        },
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": "採QT形式"
        },
        {
            "type": "其他",
            "weight": 15,
            "note": "前、後測表現"
        }
    ],
    "prerequisite": "",
    "general_core": []
}