{
    "year": 109,
    "term": 1,
    "name": "英文（一）",
    "teachers": [
        "蘇鈺恩"
    ],
    "department": "CU",
    "code": "00UB7A4",
    "credit": 2,
    "serial": 328,
    "group": "K",
    "quota": {
        "limit": 35,
        "additional": 0
    },
    "schedule": [
        {
            "day": 5,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "正405"
        }
    ],
    "programs": [],
    "comment": "教育學院(教育系、心輔系、社教系、衛教系、人發系、公領系、特教系)、音樂系、企管系、競技系、東亞系、華語系(應華組)一年級(能力分班)",
    "restrict": "◎第一階段需人工加選◎第二階段需人工加選◎加退選階段需人工加選",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "共同科英文（一）課程為一學年課程，每學期兩學分，係為非英語系學生所開設的課程。目標在幫助大一學生活用中學時期所累積的英語知識，提昇英語聽、說、讀、寫整體的溝通能力。為達此目標，本課程要求教師盡量用英語上課，努力營造一個豐富的英語環境，讓學生不但有充分機會以英語參與課堂活動，且樂於使用英語與同學及老師溝通。",
    "goals": [
        "增進學生英語溝通表達能力",
        "透過參與課程活動促進團隊精神",
        "透過多面向英語閱讀促使學生了解多元文化，拓展學生國際化視野",
        "透過課堂討論培養批判精神",
        "提升學生英語學習動機及自主學習興趣"
    ],
    "syllabus": "Instructor: Susan Su 蘇鈺恩\n\nE-mail: [winds10242000@gmail.com](mailto:winds10242000@gmail.com)\n\nDay/Session：Friday 34\n\nClass：正405\n\n **English I (for Non-English Majors)**\n\nFall, 2020\n\n**教學目標****Objectives:**\n\n  This course aims to help students to develop and improve their English abilities; meanwhile, it also helps to build up students’ confidence and interests in English. Student’s participation, discussion, and group activities in class will be the main focus of this course. Different activities will be offered to guide the students to apply basic English vocabularies, sentences, and grammar to build the familiarity toward English, including using different kinds of visual aids, games, and news...etc. Students will engage in different discussion and practice under the instructor’s guide to improve students’ English speaking, listening, writing, and reading abilities. In addition to understanding the grammar and vocabulary, students are required to have further critical thinking toward the issues, subjects, and contents given in class.\n\n**課本****Textbook:**\n\nMacintyre, Paul & Bohlke, David.  (2019).  **_Reading Explorer: Book 2 (Third Edition)_**_._  National Geographic Learning.\n\n**\\*Please get the book at** **師大書苑** **before the first class (9/18).**\n\n**Weekly Schedule: (****課程進度將依實際狀況做適當調整或變更。一切變動皆會在課堂和學生事前告知。****)**\n\nWeek\n\nDate\n\nUnit\n\nAssignment and Content\n\n1\n\n9/18\n\nCourse Introduction 課程介紹\n\nKnowing your classmates, grouping\n\n2\n\n9/25\n\n1.  “How to read English articles?”: Reading tips and instruction\n2.  Unit 3A\n\n3\n\n10/2\n\n**No Class!**中秋節放假\n\n4\n\n10/9\n\n**No Class!**配合中秋節調整放假\n\n5\n\n10/16\n\nUnit 3A review, Unit 1A\n\n6\n\n10/23\n\nNews reading and review\n\n7\n\n10/30\n\n“How to structure and present your self-introduction”: prepare for self-introduction\n\nOutline your self-introduction\n\n8\n\n11/6\n\nReview self-introduction and learn how to make a short presentation of yourselves\n\n**Assignment: Finish your own self-introduction and prepare to memorize and present it on 11/13 (practice day)**\n\n9\n\n11/13\n\nReview and Practice: self-introduction\n\n10\n\n11/20\n\n**No Class! (****運動會****)**\n\n11\n\n11/27\n\n**1.Self-introduction (1~2mins)**\n\n**2.\\*autobiography due**\n\n**\\*****當天務必準時出席****Please be on time this day!**\n\n**\\*****當天除上台自我介紹也須同時繳交紙本全文** **(autobiography due)**\n\n12\n\n12/4\n\nTed talk reading and games\n\n13\n\n12/11\n\nUnit 4A\n\n**\\* Decide grouping and reporting time for final report**\n\n14\n\n12/18\n\nPrepare for final report, and wrap up  \n\n15\n\n12/25\n\n**Final presentation: group presentation**\n\n16\n\n1/1\n\n**No class**\n\n期末團體報告\n\n17\n\n1/8\n\n**Final presentation: group presentation**\n\n18\n\n1/15\n\n**Final presentation: group presentation**\n\n**上課要求與規則****Requirements and Rules:**\n\n1.  If you want to succeed in this class, you need to be willing to devote time participating all the class activities, including discussion, practice, assignment, and presentation. **Your learning attitude is essential in this class**. You need to focus both on your attendance and class activities. Without joining any class activities, discussion, or practice, you won’t get a higher score for this class. **(****沒有參與課堂活動、討論或練習，也不會獲得高分****)**\n2.  **Attendance is required**. **Missing 4 classes, without telling your teacher in advance( at least “a week” before your absence) with a proper reason, you will be failed for this class. Please note that if you’re late for more than 20 minutes, you’ll be absent for that class. For 1 absence, it costs you 2 points every time. (****缺席四次，在沒有以****「****正當理由及原因****」****事先告知老師下****，將無法通過此課程。遲到超過****20****分鐘視同缺席****。缺席一次扣****2****分。有任何狀況請記得事先****e-mail****或親自告知老師，請假請****以「正當理由及原因」告知老師並補上證明。****)**\n\n\\*Proper reasons contain (適當的理由包含以下):\n\n*   Illness or medical emergency (with proof)\n*   Family emergencies\n*   Pre-arranged school activities (with proof)\n\n1.  **Textbook is a must**. **Violation of this rule will cost you 1 point (out of your final score) each time**. (You can bring no textbook ONLY when teacher informs you!) **(****沒帶課本，每次扣總成績一分****)**\n2.  **Self-introduction****自我介紹**: We don’t have midterm exam; instead, **you need to write your self-introduction and make a brief presentation in 1~2mins with simple slide (1~3 slides)**.\n3.  **Final presentation** **期末團體報告**: **Followed by teacher’s instruction, each group needs to report and introduce the assigned article by teacher**. You’ll be scored on voc list, ppt, oral performance, man ideas, important/interesting messages, and individual explanation. (guide the whole class to read/understand the article) Further information will be given before your presentation.\n4.  You **cannot** use your laptop or smart phone in class **without the teacher’s permission**. Violation of this rule will cost you **2** points each time. **(****只有在老師允許時能用電子產品，上課請勿使用手機或筆電****)**\n5.  **Please check Moodle and e-mail frequently!** It’s your responsibility to make sure you register with the correct email address on Moodle. **Not receiving a notice or forgetting to check is NOT an excuse for any class activities. (****請隨時查****看****Moodle****及老師寄的****e-mail****!** **各種作業活動因沒有收到通知、不知道或忘了查看而沒做並不是理由。****)**\n6.  **Our syllabus will be adjusted based on the real class schedule. (****實際上課進度將因上課狀況做調整****) Please make sure you read any notice from teacher’s mail or Moodle.**\n7.  This course aims to offer a positive and comfortable learning environment for all the students to learn in a positive, relaxed, happy mood, so **please RESPECT your classmates, your teacher, and this class. Any serious violation of this class might cause great outcome on your final score. If you have any problems/questions, you are always welcome to talk to your teacher.**\n\n**計分****Grading:**\n\nAttendance出席\n\n**20%**\n\nMissing **4** classes, without telling your teacher in advance with a proper reason, you will be failed for this class. Being late for more than 20 minutes is also considered as “absent”. For 1 absence, it costs you 2 points every time.\n\nSelf-introduction\n\n(自傳及自我介紹)\n\n**30%**\n\n \n\nFinal Presentation 期末報告\n\n**25%**\n\n \n\n課堂參與及平時作業(討論與活動)\n\n**25%**\n\n \n\n**額外加分及補救活動****Extra bonus and Makeup activities:**\n\n**A. Extra bonus**: Joining Oral Reading Competition (英文朗讀比賽) will gain **5 points** for your final score. (each class needs to have 3 students)\n\n**B. Extra bonus and make up activities:** _If you have a bad performance in class, including your attendance, presentation, class participation, you need do 1 makeup activity.(You teacher will inform you in advance) For those who wants extra points for the final score, you can still do one of these activities._\n\nChoose 1 out of the 3 makeup activities:\n\n1.  **Lexile****讀本閱讀心得報告**: Choose a Lexile book of your Lexile level (based on your Lexile score). Read it, summarize the book, and write your feedback of the reading. You need to write in 500 words. You need to turn in your paper on the last day of this course.\n2.  **參與英文活動或比賽並寫心得報告:**Attend a competition or event held in English and write your feedback on the experience in 500~600 words. You need to introduce the English activity (what is the activity about, what did you do there, what did you learn/gain…etc.) and write your thoughts/feedback about attending this activity. You need to turn in your paper on the last day of this course.\n3.  **去英語自學教室學習英文****(****累積****10****小時****)**: Visit 英語自學教室 (本部樸 101) to use any on-line learning at least for 10 hours, including grammar, listening, and reading. (excluding movies) You don’t have to stay directly for 10 hours a day, it can be accumulated for several times. Please log into the system to record your visits and give me your records by the end of the class.",
    "methodologies": [
        {
            "type": "講述法",
            "note": "focus on students interaction with the classmates' discussion under teacher's instruction."
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "實驗/實作",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 15,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 20,
            "note": "final presentation"
        },
        {
            "type": "課堂討論參與",
            "weight": 25,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 15,
            "note": "Missing 4 classes, without telling your teacher in advance with a proper reason, you will be failed for this class. Being late for more than 20 minutes is also considered as “absent”. For 1 absence, it costs you 2 points every time."
        },
        {
            "type": "成果展覽",
            "weight": 25,
            "note": "self-introduction and autobiography"
        }
    ],
    "prerequisite": "",
    "general_core": []
}