{
    "year": 109,
    "term": 1,
    "name": "英文（一）",
    "teachers": [
        "蘇容梅"
    ],
    "department": "CU",
    "code": "00UB7A4",
    "credit": 2,
    "serial": 325,
    "group": "H",
    "quota": {
        "limit": 35,
        "additional": 0
    },
    "schedule": [
        {
            "day": 5,
            "from": 1,
            "to": 2,
            "campus": "本部",
            "classroom": "樸406"
        }
    ],
    "programs": [],
    "comment": "文學院(國文系、歷史系、地理系)、科技學院(工教系、科技系、圖傳系、機電系、電機系)、    藝術學院(美術系、設計系)、體育系、台文系、華語系(國華組) (能力分班)",
    "restrict": "◎第一階段需人工加選◎第二階段需人工加選◎加退選階段需人工加選",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "共同科英文（一）課程為一學年課程，每學期兩學分，係為非英語系學生所開設的課程。目標在幫助大一學生活用中學時期所累積的英語知識，提昇英語聽、說、讀、寫整體的溝通能力。為達此目標，本課程要求教師盡量用英語上課，努力營造一個豐富的英語環境，讓學生不但有充分機會以英語參與課堂活動，且樂於使用英語與同學及老師溝通。",
    "goals": [
        "增進學生英語溝通表達能力",
        "透過參與課程活動促進團隊精神",
        "透過多面向英語閱讀促使學生了解多元文化，拓展學生國際化視野",
        "透過課堂討論培養批判精神",
        "提升學生英語學習動機及自主學習興趣"
    ],
    "syllabus": "**FRESHMEN ENGLISH:**   \nAutumn Semester 2020\n\n**#Instructor:** Su, Jung-Mei   \n**#E-mail:**  jungmei@ntnu.edu.tw  \n**#Office Hours:**  \nBy appointment to be arranged after class or by email.\n\n**#Course Description**\n\nThis course aims to develop student’s English language proficiency regarding all four language skills. Students are expected to improve their reading and writing literacy along with listening comprehension and communication competence through a variety of in-class and out-of-class activities\n\n1      09/18   Orientation + Quality Talk: How to Ask Question and Respond (QT)+  **7-Day Challenge**\n\n2      09/25   Unit 1-A. _Sweet Love_ (QT1)\n\n3      09/26   Unit 1-A. _Sweet Love_ (QT2)(substitute the class on 10/02中秋節)\n\n4      10/09   **No Class** **國慶日補假**\n\n5      10/16   Unit 1-B _Food for the Future_ (QT3)\n\n6      10/23   Unit 1-B _Food for the Future_ (QT4)\n\n7      10/30   Unit 2-A.  _Song of the Humpback_ (QT5)\n\n8      11/06   Unit 2-A.  _Song of the Humpback_ (QT6)\n\n9      11/13   How to structure self-introduction\n\n10    11/20   **School Athletic Meet (No class)**\n\n11    11/27   Unit 2-B.  _The 1,000-Year Bird Song_ (QT7)\n\n12    12/04   Unit 2-B.  _The 1,000-Year Bird Song_ (QT8)\n\n13    12/11   Unit 4-A.  _Living Treasures_ (QT9)\n\n14    12/18   Unit 4-A.  _Living Treasures_ (QT10)\n\n15    12/25   Unit 4-B.  _Then Changing Face of Kung Fu_ (QT11)\n\n16    01/01   **National Holiday**\n\n17    01/08   Unit 4-B.  _Then Changing Face of Kung Fu_ (QT12)\n\n18    01/15   Group Presentation (7-Day Challenge ) **\\+** Peer Evaluation\n\n**Grading Policies**\n\n**A) Punctual attendance**, **lesson preparation** and **active participation** are required. Participation also includes teamwork and group discussion.\n\n*   All absences will be classified as excused or unexcused.\n*   Absences for the following reasons will be _excused_ if there is timely verification (within 1 week) of such reasons provided to the instructor:\n\n*   Illness or medical emergency\n*   Family emergencies\n*   Pre-arranged medical appointments.\n*   Pre-arranged school-sponsored activities, such as field trips.\n\n*   A Notification of Absence Form has to be submitted online (學生請假系統) within 1 week. Verification document (hard-copy) should also be handed in to the instructor within 1 week. Late submission will not be accepted.\n*   Students who are more than 30 minutes late to class will be considered absent.\n*   Students will fail this course if there are more than 3 unexcused absences.\n*   Students will fail this course if they miss more than 5 meetings the whole semester.\n\n**B)** This semester you have to turn in a special assignment related to the school-assigned Lexile novel.  The details of this assignment will be given at the beginning of this semester, and as always, please submit them to me as scheduled.\n\n**C)** A project will be held in this semester. You can use multimedia and all kinds of resources (apps, props, costumes, photos, etc.) to make your project interesting to the audience. It must be done in English. The length of your project presentation should be no shorter than 4 minutes. More details about this project will be given in class.\n\n**D)** In order to improve your extensive reading skills and discussion skills, Lexile novel is assigned as an  outside reading for you to practice high level reading skills and Quality Talk Q&A skills (QT: Q&A). Your instructor will teach you the essence of QT, the most frequently used 6 types of questions and responses. Each student must try to ask as many questions as possible, give responses as many as possible, proving that you really understand how to ask questions and give responses in order to elicit important information and stimulate further thoughts.\n\n**E)** Check Course Group Page and email frequently  \nI assume that you check your email and the course site frequently. It’s your responsibility to make sure you register with the correct email address on course group page. Without receiving a notice is NOT an excuse for any late submission. Late submission will be penalized 10% per day.\n\n**!! More details will be updated or given in class!!**\n\n**Bonus Points (for those who can’t get 60 points in the Final Exam)**\n\n1.  Time spent on the multimedia lab樸101 or chatroom may help you earn some bonus points.\n2.  Extra points will be given if you participate in activities that help improve your English ability, such as Spelling Bee, Reading Aloud Competition, 3-minute presentations competition, E-book competition, listening to English talks, i-read or language exchange, etc. How many points you’ll get depends on the length of time and efforts you spend on them.\n3.  Summaries of the Lexile outside readings.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 40,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 30,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}