{
    "year": 108,
    "term": 2,
    "name": "臺灣二十世紀歷史學研究中的個人文獻",
    "teachers": [
        "賀安娟"
    ],
    "department": "LM26",
    "code": "TCC1016",
    "credit": 3,
    "serial": 1587,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 12
    },
    "schedule": [
        {
            "day": 1,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "雲303"
        }
    ],
    "programs": [],
    "comment": "雲和街教學大樓3樓303教室",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "藉由本課程讓學生了解台灣歷史學，認識在台灣歷史中如何應用個人文獻，認知台灣歷史學的趨勢與走向。了解臺灣歷史文獻中的個人經驗，以自/他論述為例。並藉由課堂的報告和討論，增進師生間的學術對話，教學相長。",
    "goals": [
        "認識台灣歷史學",
        "認識在台灣歷史中如何應用個人文獻",
        "認知台灣歷史學的趨勢與走向",
        "了解臺灣歷史文獻中的個人經驗"
    ],
    "syllabus": "Course description:\n\nPersonal Documents as Source for 20th Century Taiwan Historiography\n\nThis course will introduce a variety of personal or ego-documents such as memoirs, biographies, autobiographies, diaries, as well as recollections of oral histories, written and/ or compiled, edited, published and unpublished works. The majority of these materials will be written in Chinese, however, the secondary research articles and theoretical grounding of the course will be provided and conducted in the English language. C.W. Watson _Of Self and Nation_ (1999) will serve as the basic work, and taken as an illustration in reading Taiwanese memoirs. For students whose Chinese language ability is limited, text materials of personal documents in more suitable languages (Japanese, English etc) will be recommended. This course will be complemented with practical lectures on the introduction of digital humanities (electronic text analysis) as a tool for searching personal documents (corpus linguistics or ctext). From the field, two scholars with expertise in personal documents research will be invited to provide complementary information about the course. Teaching method:\n\n1.  Overview in English of Taiwan-based research on memoirs and diary studies. This will help students select a memoir or diary and provide the societal and academic background.\n2.  Discussion of _Of Self and Nation_ (1999) individual chapters as illustrations how to read a Taiwanese memoir.\n3.  Introductory materials on digital humanities method with practical application: corpora search\n\n**週****1**  3月 2日 Introduction\n\nHand out of the syllabus and explanation of the course.\n\n_Of Self and Nation_, Introductory chapter\n\nA list with questions / topics to prepare the first three chapters of _Of Self and Nation_ will be handed out. \n\n**週****2**  3月 9日  Diaries and Taiwan Studies: overview of Taiwanese scholars engaging with diary research, major institutions, and accessibility. Focus will be on the diaries published and made accessible by the Institute of Taiwan History at Academia Sinica, the Wu Sanlian Foundation and other private initiatives.  \n\n**週****3**   3月 16日_Of Self and Nation_, Chapter 1 The Construction of an Autobiographical Self in the Letters of Kartini \n\nKey terms: language and education\n\nContextualisation of the chapter: reaching out to private letters and their inclusion in volumes _Selected Works_ (全集)  & Introducing research on private letters in Chinese history. \n\n**週** **4**  3月 23日  _Of Self and Nation_, Chapter 2 The Metamorphosis of a Javanese Aristocrat: The Memoirs of Pangeran Achmad Djajadiningrat & Chapter 3, The Representation of History and the Presentation of Self: Tan Malaka’s _Dari Pendjarake Pendjara_  \n\nContextualisation of the chapters: _Memoirs and Taiwan Studies._The publication of Recollections or Memoirs (回憶錄) is fairly extensive, especially in relation to the memoirs of Taiwanese elite who lived through the Japanese colonial period and whose works were published afterwards within the context of the liberalization of Taiwanese politics and society.\n\nKey terms: political events and social awareness, career \n\n**週****5**  3月 30 日_Of Self and Nation_, Chapter 3, The Representation of History and the Presentation of Self: Tan Malaka’s _Dari Pendjarake Pendjara_  Continued\n\n**週****6**  4 月 6 日 Reading assignment (1) \n\n**週****7**  4 月 13 日 Reading assignment (2)\n\n**週****8**   4月 20日 Introduction to Digital Humanities and Personal Documents (1) \n\n**週****9**   4月 27日  _Of Self and Nation_, Chapter 4, Religion, Nationalism, and the Individual in Modern Indonesian Autobiography: Hamka’s _Kenang-Kenangan Hidup_ & Chapter 5, Islam in Java – Refractions through an Autobiographical Prism: Saifuddin Zuhri’s  _Guruku Orang-Orang dari Pesantren_  &Chapter  8, Reconversion Narratives among Islamic Youth in Indonesia \n\nContextualisation of the chapters: Autobiography and Taiwan Studies. The research angle in the _Of Self and Nation_ chapters is religion (Islam). In this class we are concerned with the role of religion, folk belief, Confucian values and the manner in which they surface in ego-document research and publications in Taiwan.  \n\n**週****10**  5 月 4日_Of Self and Nation_, Chapter 6 “A World Full of Ambivalence”: Sitor Situmorang’s Autobiographical Reflections on Postcolonial Indonesia \n\nContextualisation of the chapter: This chapter deals with a poet, but if we bring it to the Taiwan context, we can also look at ego-documents written by foreigners and visitors. What is the perspective that they bring?\n\n**週****11**  5月 11 日 First  lecture TBC Prof Dr. Faye Yuan Kleeman \n\n**週****12**  5 月 18 日 Introduction to Digital Humanities (2)\n\n**週****13**  5 月 25 日 _Of Self and Nation_, Chapter 7 Revealing and resisting the Construction of Gender: Nh Dini’s Autobiography of a Javanese Childhood \n\nKey terms : gender in personal documents\n\n**週****14**  6 月 1日  Reading Language in Ego-Documents\n\nContextualisation: This class will elaborate perspectives on how to read and understand the use of language in personal documents.\n\n**週****15**  6月 8 日 _Of Self and Justice_ (Watson) and prison diaries (part 1) \n\nContextualisation: This class will introduce research and literature accessible on trauma related topics and chapters in Taiwan’s history. A comparative element with the discussion of these personal testimonies will be offered. Other comparative examples can be suggested.   \n\n**週****16**  6 月 15 日 _Of Self and Justice_ (Watson) and prison diaries (part 2)   \n\n**週****17**  6月 22 日 Explanation and preparation end-term paper \n\n**週****18**  6月 25 日  **Exam** **期末考試** **: prepare term paper to be submitted by email**",
    "methodologies": [
        {
            "type": "講述法",
            "note": "介紹與分析個人文獻"
        },
        {
            "type": "討論法",
            "note": "討論其歷史與社會的定位，貢獻　（演講）"
        },
        {
            "type": "實驗/實作",
            "note": "數位人文 (DH)"
        },
        {
            "type": "專題研究",
            "note": "students select a personal document"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": "discussion of the book chapter and Taiwan-related materials & & participation in DH workshop"
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "book chapter presentation with ppt or handout & participation in DH workshop"
        },
        {
            "type": "專題",
            "weight": 40,
            "note": "students select a personal document"
        }
    ],
    "prerequisite": "",
    "general_core": []
}