{
    "year": 109,
    "term": 1,
    "name": "職業運動經營管理專題討論",
    "teachers": [
        "陳美燕"
    ],
    "department": "AM31",
    "code": "SRM0037",
    "credit": 3,
    "serial": 41,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "綜604"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "職業運動是業餘運動發展到一定水準後，昇華出的產物；業餘運動是職業運動的基礎。職業運動有賴業餘運動提供人才、觀眾；業餘運動有賴職業運動提供出路、刺激進步。職業運動是業餘運動的動力；業餘運動是職業運動的根基。職業運動除對刺激業餘運動水準有助，可提供業餘選手努力目標外，更可帶給民眾特殊的視覺感受、情緒發抒、休閒娛樂以及交友聯誼等高品質的休閒生活。臺灣職業運動的發展較體育先進國家晚，也不夠順遂與蓬勃，是個還有很大成長空間的運動產業。本課程除回顧臺灣各種職業運動發展歷程外，更希望探討臺灣職業運動發展上的問題與先進國家的作法，培養同學對職業運動的認識、瞭解，進而發展出對職業運動問題的敏銳思維與研究分析能力。",
    "goals": [
        "認識職業運動經營管理的基本理論",
        "回顧臺灣各種職業運動的發展歷史",
        "探討職業運動的各種經營管理問題",
        "培養職業運動經營管理的敏銳思維",
        "發展職業運動經營管理的研究能力",
        "拓展職業運動經營管理的國際視野",
        "養成關心臺灣職業運動的發展情懷"
    ],
    "syllabus": "**Course\\_Description:**\n\nThis course will serve as anoverview of the field of professional sports management. Time will be spentexploring the development of the industry, current state, and future trends inthe discipline through the lenses of r professional sports.  Students will be introduced the basic tenetsand principles of professional sports management.  In addition to the many facets of professionalsports management, the course will present students the opportunity to explorecareer options in professional sports management.\n\n**Goals:**  \nStudents will be able to identify the basicprinciples of professional sports management\n\n·        Students will gain a knowledgeof careers in professional sports management\n\n·        Students will be able toidentify important issues and possible future trends in the field of professionalsports management\n\n·        Students will learn aboutorganizational management and leadership\n\n·        Students will have anunderstanding of Risk management and Sports Law\n\n·        Students will have anunderstanding of sports marketing and promotions\n\n**Learning\\_Outcomes:**  \nThrough an exploration of text, guest speakers andexperiential learning students will be able to articulate basic principles of professionalsports management including the role of the sports manager, identifying leadershipstyles, and recognizing basic professional sports management fundamentals andtheories\n\n·        Students will be able toidentify career opportunities in professional sports management including thedevelopment, particular tasks, and the career path of those opportunities\n\n·        Students will demonstrate anunderstanding of Risk Management and Sports Law through effective researchmethods and writing skills\n\n·        Students will construct a Sportsmarketing and promotions packet through effective research methods,collaboration, and experiential learning\n\n·        Students will create a mocksports organization demonstrating an understanding of all facets of professionalsports management, organizational management, and leadership styles",
    "methodologies": [
        {
            "type": "講述法",
            "note": "相關理論與研究介紹"
        },
        {
            "type": "討論法",
            "note": "個案研討"
        },
        {
            "type": "實地考察、參訪",
            "note": "相關企業或組織參訪"
        },
        {
            "type": "專題研究",
            "note": "研究主題發表"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 15,
            "note": "文獻評論"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "個案探討"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "出席狀況"
        },
        {
            "type": "報告",
            "weight": 25,
            "note": "針對主題提出分組報告"
        },
        {
            "type": "專題",
            "weight": 40,
            "note": "期末專題"
        }
    ],
    "prerequisite": "",
    "general_core": []
}