{
    "year": 109,
    "term": 1,
    "name": "行動文學：腳本寫作及其應用",
    "teachers": [
        "張瓊惠",
        "宋明達"
    ],
    "department": "LU21",
    "code": "ENC9001",
    "credit": 3,
    "serial": 1855,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 8,
            "to": 10,
            "campus": "本部",
            "classroom": "誠701B"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大二大三大四 ◎限碩一碩二碩三以上修習",
    "form_s": "",
    "classes": "9",
    "dept_group": "",
    "hours": 3,
    "description": "The goals of “Literature in Action” are as followed:\n1. To introduce reflective practice and develop critical thinking; \n2. To engage with and experience a variety of literature and literary activities;\n3 To foster an enthusiasm for literature and provide an insight into the benefits of literacy engagement outside of academia.\n\n“Literature in Action: Writing and Its Applications” is designed to introduce students to the methods of creating scripts for different genres. Students will begin to learn the general guidelines to scriptwriting, followed by three teaching modules. The first module is \"Three Spots\": Public Service Announcements, Program Promotions, and Commercials, all of which emphasize concise and precise writing. The second module is \"Video-game Writing\": The games today attract a growing number of adults, and this means games must offer more than simple plots with only repetitive violence and naive gender stereotypes; the scriptwriting of the video game story will emphasize the needs of the adult players, and at the same time maintain the fun and entertainment of what a game essentially is. The third module is \"Play Writing\": producing a play for performance on stage.",
    "goals": [
        "To write precisely and concisely",
        "To write a good video game story with marketable values and educational purposes",
        "To write a play script"
    ],
    "syllabus": "**Course description:**\n\nThis course aims to inspire students to explore the potential of English scriptwriting and content creation with a specific focus on its advantageous uses in social media. The course will be using the history, culture, and nightlife of NTNU and its surroundings as the framework for creating content for social media Apps. The course is structured around three workshops: multi-media map making, script writing for multi-layer maps, and YouTube content creation (taught by actual successful Taiwan-based YouTubers). In addition, students will go on guided tours of NTNU and its surroundings (hosted by professional tour guide) and have one-off invited talks from Taiwanese social media content creators who have used English to increase their following. Each workshop is taught by experts in the field, who will guide the students to acquire necessary skills in scriptwriting in the process of completing individual and team projects.   \n\n**Requirements:**                                       \n\n1.  Grading policy:\n\n*   Workshop Presentation 40%\n*   Final Project 30%\n*   Class discussion & participation 20%\n*   Attendance 10%\n*   Bonus grade: 2-6%\n\n1.  Regular attendance and punctuality in coming to the class are strongly desired. Exceptions are allowed only under emergent circumstances or notification in advance.\n2.  Request for personal leave is granted only with justifiable causes.\n3.  Plagiarizing or editing others’ writing without acknowledgement would result in failing the course.\n4.  All assignments must be submitted punctually. Delay will result in deducted grade.\n5.  Bonus grade is awarded based on in-class performance.\n\n**Week**\n\n**Date**\n\n**Themes**\n\n**Contents**\n\n01\n\n09/16\n\nIntroduction to the course\n\n02\n\n09/23\n\nWorkshop Warmer: NTNU highlights, A field trip at NTNU\n\n*   Exploring NTNU: history, art, culture, Higher Education, Taiwan\n\n03\n\n09/30\n\n**Workshop 1-1**: Multi-media Map Making, with Jane Wu\n\n*   Creating a multimedia map with an App: image, script, voice, and movie\n\n04\n\n10/07\n\nWorkshop 1-2: Multi-media Map Making\n\n05\n\n10/14\n\n▓ Mini-presentation\n\n06\n\n10/21\n\nA cultural field trip of Kang Qing Long 康青龍District, Taipei, hosted by professional tour guide\n\n*   Exploring NTNU neighborhood: history, art, culture, food, Taiwan\n\n07\n\n10/28\n\n**Workshop 2-1**: script writing\n\n*   Script writing with stories\n\n08\n\n11/04\n\nWorkshop 2-2: script writing\n\n09\n\n11/11\n\nWorkshop 2-3: script writing\n\n10\n\n11/18\n\n▓ Mini-presentation\n\n11\n\n11/25\n\nInvited talk: James from 姆士捲雜物誌\n\n12\n\n12/02\n\n**Workshop 3-1**: YouTube-content creation, with Youtuber Asher Leiss 小飛\n\n*   Creating a YouTube upload\n\n13\n\n12/09\n\nWorkshop 3-2: YouTube-content creation\n\n14\n\n12/16\n\nWorkshop 3-3: YouTube-content creation\n\n15\n\n12/23\n\nWorkshop 3-4: YouTube-content creation\n\n16\n\n12/30\n\nProject Work Week\n\n*   Individual conference with the instructors\n\n17\n\n01/06\n\nProject Work Week\n\n18\n\n01/13\n\n▓ Final Project Presentation",
    "methodologies": [
        {
            "type": "講述法",
            "note": "A short lecture to introduce students the basic skills to scriptwriting"
        },
        {
            "type": "討論法",
            "note": "Classroom discussion to reach consensus"
        },
        {
            "type": "問題解決教學",
            "note": "Potential problems provided by the instructors for students to develop into plausible topics for their project"
        },
        {
            "type": "合作學習",
            "note": "Team work for group presentation"
        },
        {
            "type": "媒體融入教學",
            "note": "Virtual technology and video/audio technology"
        },
        {
            "type": "專題研究",
            "note": "Group project"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 20,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 30,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}