{
    "year": 109,
    "term": 1,
    "name": "英國文學：浪漫時期至現代（一）",
    "teachers": [
        "林南"
    ],
    "department": "LU21",
    "code": "ENU0293",
    "credit": 2,
    "serial": 1936,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 4,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "正306"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大三修習",
    "form_s": "3",
    "classes": "2",
    "dept_group": "",
    "hours": 2,
    "description": "The purpose of this course is to help students get a general understanding of the development of English literature, especially from Romantic period to the modern period. In this semester, the focus will be on the Victorian Age and modern period. Students will be introduced to the historical background, the spirits of the time, the major genres, important writers and their works in these two periods.",
    "goals": [
        "to help students get a general understanding of the development of English literature, especially from Romantic period to the modern period",
        "Students will be introduced to the historical background, the spirits of the time, the major genres, important writers and their works"
    ],
    "syllabus": "**Course description**: In this survey course, we are going to study major English authors and texts after 1785 in English Literature.  In the semester, we will read major authors and their works from **the Romantic Period** and **the Victorian Age**.\n\nThe text is **The Norton Anthology of English Literature**, 9th ed., vol. 2.  New York: Norton, 2012.\n\n  \n\n**Requirements**: Reading literature is a rewarding experience even though examinations are necessary evils.  Students of this class are required to take midterm and final examinations.  **Regular attendance is also expected.  Every absence may result in three points being deducted from the final grade average.**  I hope you all can have a better understanding of English literature because of the course.\n\nA detailed schedule will be discussed and given in class.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 40,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 40,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 20,
            "note": "出席是最起碼的參與。無法到課，請於隔周提交書面假條。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}