{
    "year": 109,
    "term": 1,
    "name": "英語會話（一）",
    "teachers": [
        "多德"
    ],
    "department": "LU21",
    "code": "ENU0269",
    "credit": 2,
    "serial": 1874,
    "group": "B",
    "quota": {
        "limit": 25,
        "additional": 20
    },
    "schedule": [
        {
            "day": 4,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "誠304"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大一修習",
    "form_s": "1",
    "classes": "1",
    "dept_group": "",
    "hours": 2,
    "description": "The goal of the course is three-fold: to elevate students’ confidence and motivation to participate in English conversation, to broaden their knowledge pertaining to English conversation, and to enhance their skills in conducting English conversation. Through adjusting one’s attitude toward his/her role as an English interlocutor and acquiring communication strategies and basic understanding of discourse features of English conversation, students are expected to be able to conduct, i.e., beginning, sustaining, and ending, an English conversation in a culturally appropriate fashion and in a light-hearted manner. The class is conducted primarily through pair or group conversation of class materials and mini exercises to cultivate and polish learners’ conversation management skills.",
    "goals": [
        "to elevate students’ confidence and motivation to participate in English conversation",
        "to broaden their knowledge pertaining to English conversation",
        "to enhance their skills in conducting English conversation"
    ],
    "syllabus": "**Objective:** Students will improve their ability to express their ideas and opinions clearly and coherently through preparing and presenting material on personal interests / experiences and current affairs for group discussions. Whenever appropriate students will draw on self-selected authentic materials.  \nStudents will also be given instruction on how to improve their language skills, with particular emphasis on comprehensible input and autonomous learning.  \nSchedule:  \nThe course is divided into three tasks with students being required to do one presentation per task. The tasks are:\n\nTask One: ‘True Stories’  \nStudents will be introduced to the basic skills needed to prepare and give an effective presentation. The task involves the presenting and exchange of true stories in small groups as well as follow-up discussions.\n\nTask Two: ‘Time for a Change’  \nStudents will prepare presentations to propose improvements to a present-day situation.\n\nTask Three: ‘Articles for Discussion’  \nStudents will use self-selected authentic materials from newspapers, magazines and commercial online sources to investigate and prepare a presentation on an issue of contemporary concern.\n\nRefer to the attached document for a tentative schedule.\n\n**Class Activities:**  \nLecturing / Presentations / Group and Class Discussions\n\n**Evaluation:**  \nAttendance: 10%  \nPresentations: 60%  \nActive involvement in discussions and debates: 30%\n\n**Course Material:**  \nThere is no set textbook for this course. Students will be encouraged and expected to make use of personal experiences and authentic materials as appropriate when preparing their presentations.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 60,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}