{
    "year": 109,
    "term": 1,
    "name": "英文（一）",
    "teachers": [
        "多德"
    ],
    "department": "LU21",
    "code": "ENU0168",
    "credit": 3,
    "serial": 1860,
    "group": "E",
    "quota": {
        "limit": 25,
        "additional": 20
    },
    "schedule": [
        {
            "day": 1,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "誠304"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大一修習",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "The course, Freshman English for English majors, has several goals: \n \n1.      To introduce students to the basic and necessary reading skills that students will need to employ throughout their lives when reading or discussing materials that have been written in English.\n \n2.      To teach students to think critically about the issues addressed in the readings. \n \n3.      To provide classroom opportunities for the discussion of thoughts and ideas generated from students’ use of critical thinking skills.\n \n4.      To provide opportunities through the use of homework to allow students to show their understanding of the readings’ main ideas, supporting examples, vocabulary, idioms, phrases, the use of inference, and paragraph and essay construction. \n \n5.      To prepare students to be able to paraphrase passages from the readings, write summaries of the readings, and answer essay questions related to the readings.  \n \n6.     To provide students with opportunities to read essays or other readings which provide greater exposure and deeper understanding on topics of global interest.",
    "goals": [
        "To introduce students to readings on a wide variety of themes",
        "To teach students how to think critically about the issues addressed in the readings",
        "To discuss, in English, the issues addressed in the readings",
        "To help students become familiar with new vocabulary and culture points and discuss how they are used in the readings",
        "To prepare students to be able to paraphrase passages from the readings and answer essay questions related to the readings"
    ],
    "syllabus": "**Overview:**  \nThis course has a number of goals:  \n1\\. To introduce students to readings on a wide variety of themes  \n2\\. To teach students how to think critically about issues addressed in the readings  \n3\\. To discuss, in English, the issues addressed in the readings  \n4\\. To help students become familiar with new vocabulary and how it is used  \n5\\. To prepare students to be able to paraphrase passages taken from the readings  \n6\\. To enable students to answer essay questions related to the readings. One or two class sessions will be devoted to each reading. There will be some lecturing, but the course is conducted primarily through discussing the main ideas the author is trying to express and to what extent the students agree or disagree with the author. Cultural points, vocabulary and grammar will be addressed as appropriate.\n\n**Schedule:**  \nRefer to the attached document for a tentative schedule.\n\n**Class Activities:**  \nLecturing / Presentations / Group and Class Discussions / Writing",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": "ASSESSMENT Midterm Exam 30% Final Exam 30%  Quizzes & Homework 30% Participation 10%"
        }
    ],
    "prerequisite": "",
    "general_core": []
}