{
    "year": 109,
    "term": 1,
    "name": "英語發音（一）",
    "teachers": [
        "陳正賢"
    ],
    "department": "LU21",
    "code": "ENU0281",
    "credit": 2,
    "serial": 1869,
    "group": "D",
    "quota": {
        "limit": 20,
        "additional": 20
    },
    "schedule": [
        {
            "day": 1,
            "from": 8,
            "to": 9,
            "campus": "本部",
            "classroom": "誠304"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大一修習",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "As English becomes a global language, its pronunciation is globalized. English majors in Taiwan are still expected to master some level of \"understandable\" English; therefore, to master a pronunciation of an English is crucial. English majors (or minors) taking this course are expected to acquire some knowledge about and to familiarize themselves in modern North American English.",
    "goals": [
        "The purpose of this course, designed to help students develop speech clarity, is to intensively and extensively teach and drill students in the fundamentals of acceptable pronunciation, stress, and intonation as spoken in modern North American English."
    ],
    "syllabus": "English Pronunciation (Fall 2020) ENU0281; 10:20-12:10, Thursday Course Description: The purpose of this course is to help students improve their pronunciation of the English language as they speak it. With a brief introduction to the nature of English consonant and vowel production, as well as the peculiar characteristics of the supra-segmental features of the language, the course provides students with various kinds of listening and speaking practice. Special focus of the oral/aural practice will be placed on pairs/groups of potentially confusing sounds, linking of sounds across syllable/word boundaries, stress, intonation, rhythm, etc. In addition to classroom drills, 3 recording assignments will be given in a semester, each with specific target sounds/features for students to work on. It is hoped that through the intensive drills, students may develop their sound awareness, become conscious of their pronunciation problems, and further adopt the most efficient way to solve the problems and improve their pronunciation. Textbook: Lane, L. (2013). Focus on Pronunciation 3(3rd ed). NY: Pearson Education. (Available at 師大書苑02-83695556~8台北市和平東路1段182-3號2樓) Tentative Schedule WeekContent 1Waive Exam 2Introduction 3Holiday 4Vowels: Units 1& 2 5Vowels: Units 3 & 4 6Vowels: Unit 5 & 6 7Intonation: Units 44 & 45 8Intonation: Units 46 & 47 9Midterm Exam 10Intonation: Units 48 & 49 11Group Presentation 12Vowels: Units 7 & 8 13Vowels: Units 9 & 10 14Syllables and Stress: Units 27 & 28 15Syllables and Stress: Units 29 & 30 16Group Presentation 17Syllables and Stress: Unit 31 18Final Exam Grading Policy: 1. Attendance and Participation (20%) 2. Assignments and Presentations (40%) 3. Exams (40%)",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 40,
            "note": ""
        },
        {
            "type": "期中考",
            "weight": 20,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 20,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}