{
    "year": 109,
    "term": 1,
    "name": "文學作品導讀（一）",
    "teachers": [
        "邵毓娟"
    ],
    "department": "LU21",
    "code": "ENU0257",
    "credit": 2,
    "serial": 1878,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "正302"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大一修習",
    "form_s": "1",
    "classes": "2",
    "dept_group": "",
    "hours": 2,
    "description": "The goal of this course is to provide students with a reasonably compact introduction to the study and appreciation of fiction, poetry, and drama. The selected literary works are studied in terms of basic elements such as plot, setting, point of view, theme, style and tone, symbolism and also in terms of critical concepts and approaches so as to enhance students’ meaningful reading of literature and to heighten their sensibility and appreciation of aesthetic, social, cultural, ethical, and philosophical dimensions of literary expressions.",
    "goals": [
        "Learn key terms and concepts generally applied to the evaluation of literature",
        "Hone skills of close reading and critical thinking",
        "Develop curiosity about the world through context-specific analysis of literary works",
        "Improve sensitivity to the English language"
    ],
    "syllabus": "**Approaches to Literary Works**\n\n文學作品導讀\n\n**Fall 2020**\n\nInstructor: Jessie Shao 邵毓娟                                        Email: ycshao@ntnu.edu.tw\n\nOffice: Cheng 808                                                              Tel: 77491786\n\n**I. Goals:**\n\nThe goal of this course is to provide students with a reasonably compact introduction to the study and appreciation of fiction, poetry, and drama. The selected literary works are studied in terms of basic elements such as plot, character, setting, point of view, theme, symbolism so as to enhance students’ ability in meaningful reading of literature and critical thinking. Students will be introduced to a number of critical concepts and approaches so as to heighten their sensibility to appreciate the cultural, socio-political, and philosophical dimensions of literary expressions.\n\n**II. Required Textbook:**\n\nKelly J. Mays ed. _The Norton Introduction to Literature._ New York: Norton, 2016. 12th edition. (or 2019. 13th edition.)\n\n**III. Tentative Syllabus:**\n\n**Week 1 (Sep. 16):** Orientation\n\nTopic: What is literature? And what is fiction? (See “Basic Elements of Fiction.”) **Week 2** **(Sep. 23):** \n\nElements of Fiction: Narration (敘事) and Point of View (敘事觀點)\n\nTopic: Media Mediation and Modern Life\n\nAssigned Reading: “Cathedral” by Raymond Carver (p.32/p.28)\n\n**Week 3** **(Sep. 30):** Elements of Fiction: Plot (情節); Theme (主題/主旨)\n\nTopic: Conformism and Individuality\n\nAssigned Reading: “A & P” by John Updike (p.163/p.163)\n\n**Week 4 (Oct. 7):**\n\nTopic: Life and Writing\n\nAssigned Reading: “A Conversation with My Father” by Grace Paley (p.67/p.50)\n\n**Week 5 (Oct. 14):** Elements of Fiction: Setting (場景)\n\nTopic: Cultural Identity and Self-Identity\n\nAssigned Readings: “A Pair of Tickets” by Amy Tan (p.302/p.293)\n\n**Week 6 (Oct. 21):** Elements of Fiction: Character (人物)\n\nTopic: Racial Identity and Self-identity \n\nAssigned Reading: “Recitatif” by Toni Morrison (p.238/p.230)\n\n**Week 7 (Oct. 28):** Elements of Fiction: Symbol (象徵) and Figurative Language\n\nTopic: Conflict and Initiation Stories (啟蒙故事) \n\nAssigned Reading: “Araby” by James Joyce (p.168/p.288)\n\n**Week 8 (Nov. 4):**\n\n Topics: Initiation Stories; Gender and Subjectivity \n\nAssigned Reading: “Boys and Girls” by Alice Munro (p.152/p.152)\n\n**Week 9 (Nov. 11):**  **Mid-term Exam**\n\n**Week 10 (****Nov. 18****):** \n\nFilm-Viewing: _Stranger than Fiction_\n\n**Week 11 (Nov. 25):**\n\nTopic: Cross-Cultural Encounters and Conflicts\n\nAssigned Reading: “Interpreter of Maladies” by Jhumpa Lahiri  (p.446/p.491)\n\n**Week 12 (Dec. 2):**\n\nTopic: Liminal Experience and Black Identity  \n\nAssigned Reading: “Sonny’s Blues” by James Baldwin (p.432/p.91)\n\n**Week 13 (****Dec. 9****):**\n\nCritical Casebook: The Author’s Work as Context: Flannery O’Connor \n\nTopic: Self-consciousness, Violence, and Truth\n\nAssigned Reading: “Everything that Rises Must Converge” by Flannery O’Connor (p.495/p.540)\n\n**Week 14 (Dec. 16)**:\n\nTopic: Faith and Morality\n\nAssigned Reading: “A Good Man Is Hard to Find” by Flannery O’Connor (p.470/p.516)\n\n**Week 15 (Dec. 23)**: \n\nTopic: Paternalism and Gender Formation\n\nAssigned Reading: “A Rose for Emily” by William Faulkner (p.628/p.658)\n\n**Week 16 (Dec. 30)**:\n\nTopic: Desire and Female Subjectivity\n\nAssigned Reading: Chapter 8: Cultural and Historical Contexts: Women in Turn-of-the-Century America; “The Story of an Hour” by Kate Chopin (p.523/p.568); “The Yellow Wallpaper” by Charlotte Perkins Gilman (p.526/p.571)\n\n**Week 17 (Jan. 6): Final Exam**\n\n**Week 18 (Jan. 13): Individual Conference**\n\n**IV. Requirements:**\n\n1.  It is advised that you finish each reading assignment in advance of class meeting. \n2.  Follow basic classroom etiquette rules: Be punctual for class and send a notice to the instructor in advance when you cannot attend a class meeting.\n3.  Attendance and participation are important. Discussing these texts with the instructor and your peers will enhance your ability in the understanding and appreciation of literary works. Your responses and questions will help facilitate more discussion and reflection on the assigned readings.\n4.  Assignments:\n\n(1) Individual work: Students are expected to take a weekly online quiz based on the assigned reading.\n\n(2) Group work: Students are expected to work with their group members on the given topics so as to facilitate class discussion on the assigned reading.\n\n1.  There are two exams scheduled for this semester: Midterm and Final.\n\n**V. Grading Policy:** Your grade will be given based on your performance on the following aspects: 1. Individual Work: Attendance, participation, and weekly quizzes 30%; 2. Group Work 30%; 3. Exams 40%.\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=c0c3ee8a0d314fb69376650a3dbfc560&fno=3da2d433e8d049f9abf3a0f680b1ea0c)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "A well-organized lecture on the assigned reading based on the main concern of each text."
        },
        {
            "type": "討論法",
            "note": "Students are expected to think over the given topics and declare their thoughts in class."
        },
        {
            "type": "合作學習",
            "note": "Students need to work with their class members on the given topics."
        },
        {
            "type": "媒體融入教學",
            "note": "A number of visual aids will be brought in to enlighten and deepen students' understanding of a text or a central issue."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": ""
        },
        {
            "type": "期中考",
            "weight": 20,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 20,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}