{
    "year": 109,
    "term": 1,
    "name": "英語教學實習（一）（教）",
    "teachers": [
        "曾俊傑"
    ],
    "department": "LU21",
    "code": "ENUE110",
    "credit": 2,
    "serial": 1944,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 1,
            "to": 4,
            "campus": "本部",
            "classroom": "正304"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大四修習",
    "form_s": "4",
    "classes": "1",
    "dept_group": "",
    "hours": 4,
    "description": "Serving as a bridge between pre-service ELT coursework and actual, situated teaching, this course is designed to offer students an opportunity to observe, explore, and implement effective teaching ideas. It covers in-class micro-teaching, classroom observation, and practice teaching at the Affiliated High School of NTNU.\nThe major activities in the first semester include introduction to the English curriculum guidelines for Grades 1 to 12 in Taiwan, career planning in EFL teaching profession, school visits, and most importantly, in-class micro-teaching. To prepare students for the micro-teaching, the course also provide a review of lesson planning, and effective techniques in teaching vocabulary, grammar, listening, reading, speaking, and writing. Each student is required to write a lesson plan and then teach for 30 minutes, with all his/her classmates as students and observers. The micro-teaching is followed by a discussion session led by the instructor, with an aim to help improve students’ teaching techniques. \nThe second semester covers the following as the primary activities: talks by experienced senior teachers on various topics, more classroom observations, and a 6-week practice teaching at the Affiliated High School of NTNU. In addition to work related to the micro-teaching and practice teaching, students are required to write various reports and participate in classroom discussion and evaluation.",
    "goals": [
        "designed to offer students an opportunity to observe, explore, and implement effective teaching ideas."
    ],
    "syllabus": "  \n[教學進度與主題](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=612bf56b96674a13b475884a133649cc&fno=1268fdbb325445b58963751ca5d87108)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "lectures"
        },
        {
            "type": "討論法",
            "note": "discussions"
        },
        {
            "type": "實驗/實作",
            "note": "micro-teaching"
        },
        {
            "type": "實地考察、參訪",
            "note": "school visits"
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": "1. Online teaching resource report (10%), 2. Lesson Plans (first draft + revised version) (20%), 3. Classroom Observation Reports + conference reports (20%), 4. Micro Teaching Performance (30%), 5. Self-reflection on micro teaching (10%), 6. Attendance and participation (10%)"
        }
    ],
    "prerequisite": "",
    "general_core": []
}