{
    "year": 110,
    "term": 2,
    "name": "教育政策專題研究",
    "teachers": [
        "王麗雲",
        "林子斌",
        "鄭淑惠"
    ],
    "department": "ED00",
    "code": "EDD0158",
    "credit": 3,
    "serial": 350,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 16,
            "to": 11,
            "campus": "本部",
            "classroom": "教803"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "教育政策，係在談論教育體系中，政治與政略的問題，故會有教育政策的提出，意指教育體系出現了權力系統的失衡，有某些利害關係人，已經被犧牲了。然而，如此犧牲或在意識層級或非意識層級呈現，但無論是那一個環節，教育領導者，都有道德責任，透過教育政策作為教育改革的途徑，而教育政策無論就決策層級、方針層級、或者實踐層級，無非就是要找回教育所失去的靈魂，並為教育體係的利害關係人，特別是指學生，開啟最大的機會之窗。\n\t    教育政策的產生，會受國際潮流、國內聲音等環境所啟動，旨在提升國家教育競爭力、實現教育公平、提升教育品質及促進教育的生產力，故教育政策應評估國內、外環境所啟動，而且由三決策、方針及儀式三個環節所構成，也同時也蘊涵者權力遊戲在其中發酵。\n\t    教育政策發展的能力非常重要，但對碩士班學生而言，卻可能是一門體會困難、體驗遙遠的課程，但教學者有義務協助學生，能夠把教育政策知識的學習，轉化為生活的實踐，畢竟人們是無法脫離政治生活，而能把政治引領為正面的改革力量或學養，所以這門課或為工作、或為生活、或為未來能力的準備而設計。\n\t    有鑑於此，教師講述是首要課題，可彌補學生經驗不足的問題；其次，文章的批判與討論，擴充學生的知識背景與深耕學生的洞察力；再則，教育政策方案(白皮書)的規劃，加強教育政策布局能力；最後，教育政策現象的分析，以強化學生完權力遊戲的能力。",
    "goals": [
        "擴大學生教育政策的知識基礎",
        "強化學生教育政策的洞察力",
        "促進學生教育政策規劃的能力",
        "提升學生教育政策推動的能力"
    ],
    "syllabus": "「教育政策專題研究」授課大綱 開課班級：教育政策與行政博士班 上課時間：110學年度第2學期 週二17:30~20:25 授課教師：王麗雲（教928 /02-7749-3856；edulyw@ntnu.edu.tw） 林子斌（教 914 /02-7749-3867；tzubin\\_lin@ntnu.edu.tw） 鄭淑惠（教907 /02-7749-3848；shcheng@ntnu.edu.tw） 壹、課程目標 一、探討教育政策研究的理論與觀點，並能應用於教育政策的分析。 二、瞭解教育政策研究新興發展趨勢及其重要課題，掌握教育政策發展脈動。 三、思考教育政策新興理論的應用與影響，掌握政策規劃、執行策略和影響評估之關鍵。 貳、課堂要求與評量方式 一、英文文獻閱讀心得 (每人三篇) （30％） 報告同學的閱讀心得除了整理論文大意和重點，並需能批判評論，或與相關理論、研究或實務對話，提出個人見解或論點〈約3頁〉。 二、中文文獻綜整(每人三篇)(15%) 就該週主題相關中文文獻進行蒐集整理整理(bibliographic search)，建議找經典、代表性或新近著作(不限期刊論文、專書或學位論文)，綜整文獻重點與尚待回答之問題(2頁為度)，至少需綜整3篇相近之文獻。評分重點在文獻搜尋能力(多不見得好)、綜整評價能力、未來研究建議能力。 三、課堂表現（15％） 同學除讀導讀文獻外，另就各週英文文獻可自挑一篇閱讀，閱讀時間不要超過一小時，不須交任何報告或上傳任何報告，只需自行筆記或提問以便上課分享。請班代整理同學擬讀的文章編號(王麗雲老師上課週適用)。 四、期末專題報告(40%) 請就教育政策擇一主題，撰述專題報告，並建議應於日後投稿至學術研討會或具審查制之期刊。專題報告內容可針對政策研究理論進行探究，亦可結合教育政策議題，蒐集相關實徵資料進行分析，15頁為原則，同時須臚列相關參考書目，其中至少三篇需為相關之英文文獻（請於第17週繳交期末專題報告修正版）。 五、各周作業繳交期限為前一周的周六12:00 PM上傳moodle。 六、請於第10週之前，繳交研究計畫，計畫內容，包括：研究題目、研究目的、研究方法、中英文參考書目(英文至少三篇)，教師將提供回饋。 參、課程內容與進度 週次日期 主題授課教師 第一週02/15課程介紹王麗雲、林子斌、鄭淑惠 第二週02/22重大教育政策討論王麗雲、林子斌、鄭淑惠 1.整理國內外重大教育政策與相關議題 2.整理國內外具爭議性之教育政策 第三週03/01政策比較研究林子斌 3-1 Yang, R. (2014). Comparing policies. In M. Bray, B. Adamson & M. Mason, (Eds.) Comparative Education Research (2nd ed.), 285-308. Switzerland: Springer. 3-2 Wang, L., & Lin, T.-B. (2013). The Representation of Professionalism in Native English Speaking Teachers Recruitment Policies: A Comparative Study of Hong Kong, Japan, Korea and Taiwan. English Teaching: Practice and Critique, 12(3), 5-22. 3-3 Lin, T.-B., Mokhtar, I., & Wang, L. (2015). The construct of media and information literacy in Singapore education system: global trends and local policies. Asia Pacific Journal of Education, 35(4), 423-437. 3-4陳浩然、鄭雅双、郭亭吟、林欣儀（2020）。東北亞四國英語教育政策之比較。教育科學研究期刊，65(1)，1-26。doi:10.6209/JORIES.202003\\_65(1).0001 第四週03/08批判論述分析在教育政策研究上之運用林子斌 邀請運用批判論述分析之相關實務研究者進行實做與分享。 第五週03/15政策研究：批判論述分析與政策社會學林子斌 5-1 Fairclough, N. (2003). Analysing discourse: textual analysis for social research. London: Routledge. (Chapter 1) 5-2 Ball, S. (2006). Education policy and social class: the selected works of Stephen J. Ball. London: Routledge. (Chapter 3) 5-3 Ball, S. (2015). What is policy? 21 years later: reflections on the possibilities of policy research. Discourse: Studies in The Cultural Politics of Education, 36(3), 306-313. doi:10.1080/01596306.2015.1015279 5-4倪炎元（2012）。批判論述分析的定位爭議及其應用問題：以Norman Fairclough分析途徑為例的探討。新聞學研究，(110)，1-42。 5-5江宜芷、林子斌（2020）。當「大學選才」遇見「高中育才」：大學多元入學考招改革的批判論述分析。教育研究與發展期刊， 16(1)， 1-34。 第六週03/22重要政策議題：臺灣雙語教育政策與實踐林子斌 6-1 Ferrer, A., & Lin, T.-B. (2021). Bilingual Education in a Multilingual Nation: A Study of the 2030 Bilingual Nation Policy in Taiwan. Journal of Multilingual and Multicultural Development. 6-2林子斌、吳巧雯（2021）。公立國民中學推動雙語教育之挑戰與回應：政策到實踐。教育研究月刊，321，30-42。 6-3林子斌（2021b）。雙語教育實踐的要素：雙語教師專業學習社群之運作與功能初探。教育研究月刊，327， 4-13。DOI: 10.53106/168063602021070327001 6-4林子斌（2021a）。建構臺灣「沃土」雙語模式：中等教育階段的現狀與未來發展。中等教育季刊， 72(1)，6-17。DOI:10.6249/SE.202103\\_72(1).0001 6-5林子斌（2020a）。臺灣雙語教育的未來：本土模式之建構。臺灣教育評論月刊，9(10)，8-13。 6-6林子斌（2020b）。雙語國家政策下的臺灣國民教育：國家競爭力提昇之挑戰與機會。載於黃昆輝主編，新世代。新需求－台灣教育發展的挑戰 （頁 453-470）。 臺北：財團法人黃昆輝教授教育基金會。 6-7陳純音、林慶隆（2021）。雙語教學的光譜與對策。教育研究月刊，321，頁43-58。 6-8鄒文莉（2021）。臺灣雙語教育之全球在地化思維：學術面與實踐面的反思與啟示。教育研究月刊，321，頁17-29。 第七週03/29政策執行鄭淑惠 7-1 Howlett, M. (2019). Moving policy implementation theory forward: A multiple streams/critical juncture approach. Public Policy and Administration, 34 (4), 405-430. 7-2 Ganon-Shilon, S.,& Schechter, C. (2021). Shared sense-making processes within a National Reform Implementation: Principals’ Voices. Leadership and Policy in Schools, 20 (3), 494-521. 7-3 Pietarinen, J., Pyhältö, K., & Soini, T. (2019). Shared sense-making in curriculum reform: Orchestrating the local curriculum work. Scandinavian Journal of Educational Research, 63 (4), 491-505. 7-4 Schechter, C., Shaked, H., Ganon-Shilon, S., & Goldratt, M. (2018). Leadership metaphors: School principals’ sense-making of a national reform. Leadership and Policy in Schools, 17 (1), 1-26. 第八週04/05民族掃墓節放假一日 第九週04/12協力/ 協作與政策鄭淑惠 9-1 Bryson, J. M., Crosby, B. C., & Stone, M. M. (2015). Designing and implementing cross-sector collaborations: Needed and challenging. Public Administration Review, 75(5), 647–663. doi:10.1111/puar.12432 9-2 Emerson, K., Nabatchi, T., & Balogh, S. (2012). An integrative framework for collaborative governance. Journal of Public Administration Research and Theory, 22(1), 1-29. 9-3 Provan, K. G., & Kenis, P. (2007). Modes of network governance: Structure, management, and effectiveness. Journal of Public Administration Research and Theory, 18(2), 229–252. doi:10.1093/jopart/mum015 第十週04/19網絡與政策鄭淑惠 10-1 Fenwick, T. J. (2010). (Un)doing standards in education with actor-network theory. Journal of Education Policy, 25(2), 117-133. 10-2 Mukhopadhyay, R., & Sriprakash, A. (2013). Target-driven reforms: Education for all and the translations of equity and inclusion in India. Journal of Education Policy, 28(3), 306-321. 10-3 Kamp, A. (2017). Assembling the actors: Exploring the challenges of ‘system leadership in education through actor-network theory. Journal of Education Policy, 1-15. 10-4 給我一個實驗室 10-5 陳斐卿（2021）。操作型教師研習的網絡效果：行動者網絡理論視角。教育研究集刊，67（4），37-77。 第十一週04/26評鑑與政策鄭淑惠 11-1 Donaldson, M. L., & Woulfin, S. (2018). From tinkering to going “rogue”: How principals use agency when enacting new teacher evaluation systems. Educational Evaluation and Policy Analysis, 40 (4), 531-556. 11-2 Chen, H.T., Morosanu, L., Bellury, L.M., Teleaga, J., & Hardin, A.E. (2021). Proactive evaluation: The program stress test. American Journal of Evaluation, 42 (2), 293-303. 11-3 Snodgrass Rangel, V., Bell, E., & Monroy, C. (2019). Teachers’ sensemaking and data use implementation in science classrooms. Education and Urban Society, 51(4), 526-554. 第十二週05/03公共教育與私有化王麗雲 12-1.Lubienski, Chris(2000). Redefining \"Public\" Education: Charter Schools, Common Schools, and the Rhetoric of Reform. Paper presented at the Annual Meeting of Educational Research Association. 12-2.Center on Education Policy(2007) Why We Still Need Public Schools? Public Education for the Common Good. 12-3. Gerrard, J., Savage, G. C., & O’Connor, K. (2017). Searching for the public: school funding and shifting meanings of ‘the public’in Australian education. Journal of Education Policy, 32(4), 503-519. 12-4. Ball, Stephen J.(2009). Hidden Privatization in Public Education, Education Review, 73-83. 12-5. Ball, S. (2009) Privatising education, privatising education policy, privatising educational research: network governance and the ‘competition state’. Journal of Education Policy, 24(1), 83-99. 12-6. Ball, S. (2018). The tragedy of state education in England: Reluctance, compromise and muddle— a system in disarray. Journal of the British Academy, 6, 207–238. 12-7. Lay, J.C. Bauman, A. (2017). Private Governance of Public Schools: Representation, Priorities, and Compliance in New Orleans Charter School Boards. Urban Affairs Review, 55(4), 1006-1034 . 12-8.Jennings, J. (2012). Reflections on a Half-Century of School Reform: Why Have We Fallen Short and Where DoWe Go From Here? By Jack Jennings, President and CEO, Center on Education Policy. 第十三週05/10學校治理王麗雲 13-1.Alex Elwick (2018). New forms of government school provision – an international comparison, Journal of Education Policy, 33(2), 206-225, DOI: 10.1080/02680939.2017.1329551 13-2.Joan Gaynor Mowat (2018) Closing the attainment gap – a realistic proposition or an elusive pipe-dream? Journal of Education Policy, 33:2, 299-321, DOI: 10.1080/02680939.2017.1352033 13-3.Selwyn, N. (2016). There’s so much data: Exploring the Realities of Data-based School Governance, European Educational Research Journal, 15(1): 54-68. 13-4.Ranson, S. (2016). Contesting the Reform of School Governance in England: Contrasting Modes of Governance and Accountability, http://digibug.ugr.es/handle/10481/44604 13-5. Addi-accah, A. Anihoren, R.(2009). School governance and teachers' attitudes to parents' involvement in school, Teaching and Teacher Education, 25(6): 805-813. 13-6. Robinson, V. Ward, L. Timperley, H. (2003). The Difficulties of School Governance: A Layperson's Job? Educational Management & Administration, 31(3), 263-281 13-7. Kisida, B. Wolf, P.J. (2010). School Governance and Information: Does Choice Lead to Better-Informed Parents? American Political Research, 38(5), 783-805. 13-8.Wilkins, A. & Olmedo, A. (2018). Conceptualising education governance: Framings, perspectives and theories, in Wilkins A. and Olmedo A. (eds), Education governance and social theory: Interdisciplinary approaches to research. Bloomsbury: London. 第十四週05/17資料、證據與教育政策王麗雲 14-1.Carusi, F.T., Rawlins, P. & Ashton, K. (2018) The ontological politics of evidence and policy enablement, Journal of Education Policy, 33:3, 343-360, DOI: 10.1080/02680939.2017.1376118 14-2.Hazelkorn, E. (2007). The Impact of League Tables and ranking Systems on Higher Education Decision Making, Higher Education Management and Policy, 19(2):1-26 14-3.Hazelkorn, E. (2018): Reshaping the world order of higher education: the role and impact of rankings on national and global systems, Policy Reviews in Higher Education, DOI: 10.1080/23322969.2018.1424562 14-4.Grek, S. & Ozga, J. (2010). Governing Education through Data: Scotland, England, and the European Education Policy Space, British Educational Research Journal, 36(6): 937-952. 14-5.Bieber, T. & Martens, K. (2011). The OECD PISA Study as a Soft Power in Education? Lessons from Switzerland and the US, European Journal of Education, 46(1): 101-116. 14-6.Takayma, K. (2008). The Politics of International League Tables: PISA in Japan’s Achievement Crisis Debate, Comparative Education, 44(4): 387-407. 14-7.Pons, X. (2011). What do We Really Learn from PISA? The Sociology of Its Reception in Three European Countries, European Journal of Education, 46(4): 540-548. 14-8.Smith, T.M. & Baker, D.P. (2001). Worldwide Growth and Institutionalization of Statistical Indicators for Education Policy-Making, Peabody Journal of Education, 76(3-4): 141-152. 14-9.Ozga, J. (2009). Governing Education through Data in England: from Regulation to Self-Evaluation, Journal of Education Policy, 24(2): 149-162. 14-10.Lingard, B. & Rawolle, S. (2011). New scalar Politics: Implications for Education Policy, Comparative Education, 47(4): 489-502. 14-11.Ball, S. J. (2010). The Teacher’s Soul and the Terrors of Performativity, Journal of Education Policy, 18(2): 215-228. 14-12. Wilkins, C. (2015) Education reform in England: quality and equity in the performative school, International Journal of Inclusive Education, 19:11, 1143-1160. 14-13. Ball,S.J. (2009). Education, governance and the tyranny of numbers, Journal of Education Polciy, 30(3), 299-301. 14-14. McKnight, L. & Morgan, A. (2020) A broken paradigm? What education needs to learn from evidence-based medicine, Journal of Education Policy, 35(5), 648-664, 第十五週05/24教育研究應用王麗雲 15-1.Cohen-Vogel1, L. Tichnor-Wagner, A. Allen, D. Harrison, C. Kainz, K. Socol, A. R. & Wang, Q. (2015). Implementing Educational Innovations at Scale: Transforming Researchers Into Continuous Improvement Scientist, Educational Policy,29(1): 257–277 15-2.Coburn, C.E. Penuel, W.R. (2016). Research–Practice Partnerships in Education: Outcomes, Dynamics, Educational Researcher, 45(1): 48–54 15-3.Schulte, Barbara (2018) Envisioned and enacted practices: educational policies and the ‘politics of use’ in schools, Journal of Curriculum Studies, 50:5, 624-637. 15-4.Newman, J. Cherney, A. Head, B. (2016). Do Policy Makers Use Academic Research? Reexamining the “Two Communities” Theory of Research Utilization, Public Administration Review, 76(1): 24-32. 15-5.Brown, C. & Zhang, D. (2017). How Can School Leaders Establish Evidence-Informed Schools: An Analysis of the Effectiveness of Potential School Policy Levers, Educational Management Administration & Leadership, 45(3): 382-401. 第十六週05/31期末報告王麗雲、林子斌、鄭淑惠 1.期末報告 (務必出席) 2.印出紙本給三位教授，並上傳電子檔於moodle 第十七週06/07學生自主學習 自主學習任務：依照期末報告所獲得之回饋，對自己的專題進行修改與調整。 請於6/15繳交期末專題報告修正版（含預計投稿的研討會或刊物名稱）。 第十八週06/14學生自主學習 自主學習任務： 尋找相關之研討會或刊物，探索將專題在課程結束後進行發表之可能性。 備註：課程資料僅供課堂使用，請尊重智慧財產權。 [教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=16747d57b13e4c88b0c85677979f6be7&fno=09215b8088f94e2a97062aba3f99a8dd)",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 40,
            "note": "除了整理論文大意和重點，須能和相關理論或研究結合，提出見解或論點"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "包含出席情形"
        },
        {
            "type": "專題",
            "weight": 50,
            "note": "請就教育政策擇一主題，撰述專題報告"
        }
    ],
    "prerequisite": "",
    "general_core": []
}