{
    "year": 110,
    "term": 2,
    "name": "進階生態學",
    "teachers": [
        "李佩珍"
    ],
    "department": "SM43",
    "code": "BIC0174",
    "type": "必",
    "grade": null,
    "credit": 3,
    "serial": 2651,
    "group": "",
    "quota": {
        "limit": 33,
        "additional": 3
    },
    "schedule": [
        {
            "day": 2,
            "from": 2,
            "to": 4,
            "campus": "公館",
            "classroom": "Ｓ506"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "本課程介紹生態學的經典理論以及他們在當代研究中的應用。",
    "goals": [
        "探討生態學上基礎與最新的概念與原理"
    ],
    "syllabus": "This course will cover key concepts in ecology, from autecology (individuals) to ecosystem ecology and human dimensions of ecology. The instructor will deliver 5-7 lectures on some of the most important ecological theories and concepts (e.g., ecological niche, population dynamics, biodiversity, food web ecology, landscape ecology, macroecology) at the beginning of the semester, followed by student-led presentation and discussion on specific topics of their choice. The goals of this course are:\n\n1.  To help students gain an in-depth understanding of key theory and concepts in modern ecology, including their historical development and modern application\n2.  To help students develop the ability to think critically about ecology through problem solving, oral presentation and group discussion",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Lectures will be delivered on selected topics"
        },
        {
            "type": "討論法",
            "note": "Class discussion will be strongly encouraged"
        },
        {
            "type": "問題解決教學",
            "note": "Lectures and homework will include real-world examples and problem sets"
        },
        {
            "type": "合作學習",
            "note": "Students are encouraged to work as a group on some of the homework"
        },
        {
            "type": "媒體融入教學",
            "note": "On-line videos will be used"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 40,
            "note": "4 homework assignments, each 10 pts"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "Students' participation in class discussion will be recorded and used for evaluation"
        },
        {
            "type": "專題",
            "weight": 40,
            "note": "Each student will lead a discussion session on a specific topic"
        }
    ],
    "prerequisite": "",
    "general_core": []
}