{
    "year": 111,
    "term": 1,
    "name": "物理教材教法（IB）",
    "teachers": [
        "陳育霖"
    ],
    "department": "EU",
    "code": "IBC9001",
    "type": "選",
    "grade": null,
    "credit": 1,
    "serial": 650,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 8,
            "to": 8,
            "campus": "公館",
            "classroom": "Ｓ501"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎第一階段限 國際教師學程-華語文 國際教師學程-數學 國際教師學程-物理 國際教師學程-國際◎限國際教師學程-華語文、國際教師學程-數學、國際教師學程-物理、國際教師學程-國際選修",
    "form_s": "",
    "classes": "9",
    "dept_group": "",
    "hours": 1,
    "description": "",
    "goals": [
        "Students can understand the basic concepts of philosophy and the characteristics of various educational trends."
    ],
    "syllabus": "Physics is an international enterprise, which plays a key role in the future progress of humankind. The support of physics education continue to drive the economic engines of the world. Physics is an essential part of the educational system and of an advanced society.  \nScience stems from human curiosity or need around life. Humans study various phenomena and changes in nature via observation, and cleverly use science to solve problems, to adapt to the environment, and to live a better life. Science knowledge continues to accumulate in the process of civilization evolution.   \nLiving in the modern age, our surroundings are full of innovative technological products, a wealth of information, and environmental and ecological issues derived from resource development. Our nationals also need to have scientific literacy, such as understanding the contribution and limitations of science, making good use of scientific knowledge and methods, being able to deal with all kinds of daily science-related problems in a rational and positive manner and with innovative thinking, comments, judgments and actions. At the same time, we need to cultivate future scientific personnel to lay a solid foundation for human civilization and social and economic development.  \nThe core literacy of 12-year National Basic Education course in natural science includes:   \n(1) Inquiry Skills, providing students with opportunities to explore learning and problem-solving and to develop relevant;   \n(2) Scientific Attitude and Nature of Science, assisting students to understand the ways in which scientific knowledge is produced and developing scientific thinking and the habit of inquiry;   \n(3) Core Concept, guiding students to learn scientific knowledge.   \nBy practicing the above three connotations, cultivating students to achieve the goal of whole-person development.  \nThe core literacy of natural sciences focuses on scientific process skills including observation, logical thinking, reasoning and judgment, and students can use them as their basis to gain knowledge and planning experiments in order to solve problems, which corresponds to TOK of IBDP.   \nThe 3 phases and 9 items of the General Outline of 12-year National Basic Education are listed in the table below.\n\nLearning Objectives\n\nThis course emphasizes pre-service teachers' ability to cultivate practical teaching, including curriculum design skills, leading students to conduct scientific inquiry and practice/experiment, performance and presentation skills, communicate with groups and lead the team to focus discussion.\n\nTopics include instructional methodologies, textbook overview, IBDP course syllabus development, curriculum resources, and the selection and planning of appropriate inquiry-based lab experiments. Albert Einstein once said, “If you can't explain it simply, you don't understand it well enough.” Richard P. Feynman also asked his students take three non-trivial examples to depict a physics concept. Teaching and presenting efficiently can be regarded as a good assessment task to perform. In addition, Inquiry-based curriculum design is a process for teachers to continuously rebuild the concept of knowledge to **create** innovative ideas. Through **activities** designed to **share** with peers, pre-service teachers are expected to fulfill the scientific nature and contribute to the world, which is the concept of **IBDP CAS**, **Creativity, Activity, Service**.\n\n**No.**\n\n**Objectives**\n\n**Related Programme Learning Objectives (PLO)**\n\n**Related Assessment Task(s)**\n\n**1**\n\n1-1. Transform the professional knowledge of the intended subject.\n\nPre-service teachers should be able to demonstrate proficiency in physics and concepts needed for a proper understanding of physics.\n\n**Group discussion of knowledge map of physics in class, present and review peers’ presentation in class**\n\n**2**\n\n1-2. Understand the curriculum guidelines for the intended subject at the DP levels.\n\nPre-service teachers should be able to demonstrate proficiency in physics at the DP levels needed to teach\n\n**Group discussion of concepts of physics in class, present and review peers’ presentation in class**\n\nPre-service teachers need to take three non-trivial examples to depict a physics concept\n\n**3**\n\n2-1. Propose adequate instructional plans with a student-centered emphasis.\n\nPre-service teachers should be able to show their competence in developing student-centered instructional plans.\n\n**Group discussion on the** **physics topic taught in class, present and review peers’ presentation in class**\n\nPre-service teachers need to instruct high school students via “essential questions” to help “every” student take part in our class.\n\n**4**\n\n2-3. Utilize adequate assessments to promote student learning.\n\nPre-service teachers should be able to display the understanding of assessment principles and related applications to facilitate student learning. \n\n**Group discussion, brainstorming and design thinking on the** **physics topic taught in class, present and review peers’ presentation in class**\n\n**A table of assessment for inquiry-based instruction is proposed.**\n\n**5**\n\n5-3. Design project-based activities that improve students’ ability to engage in independent inquiry.\n\nPre-service teachers should be able to show that they have learned laboratory skills and they can enable students to engage in project-based independent inquiry.\n\n**Group discussion , brainstorming and design thinking on the** **physics topic taught in class, present and review peers’ presentation in class**\n\n**A table of assessment for inquiry and practice instruction is proposed.**\n\n**Course Structure**\n\nEach class is divided into two stages. In the first stage, pre-service teachers are guided to focus on discussing the design thinking of specific topic or experiment of physics. In the second stage, pre-service teachers take turns to teach pre-assigned units of physics in class and play moderator to help peers’ presentation, discussion, and review, aiming to reflect the process of the nature of science and student-centered pedagogy. Pre-service teachers put theory of **Teaching Materials and Methods: Physics** and **IBDP** into practice and prepare for practicing teaching in the classroom.\n\nThis course requires pre-service teachers' participation and discussion extensively. In each stage, the instructor will present related approaches of physics teaching and pre-service teachers will in turn be engaged to formulate their own strategies to practice the concepts in different tasks. The approaches utilized for giving lectures are lecture method, student-centered recitation method, and demonstration method. Discussions and group works are also the major instructional method throughout the course. Due to the inquiry-based and practice-based format, this course will engage pre-service teachers to complete many in-class works and presentation with peer review reflecting the nature of science and TOK-oriented instruction of IBDP.\n\n**Class Meetings**\n\n1.  How do we design a inquiry-based science course ? What is the first question you need to ask ?The local and global trends of physics education in 21st-Century\n2.  **Is that a simple case to take the derivative of position function _x_(_t_) to get the velocity _v_(_t_) and acceleration _a_(_t_)?**\n3.  Message you want to send written in chalk on the blackboard: writing phrase and equation on the blackboard or on the presentation slide.\n4.  What are measured exact with estimated values?\n5.  Newton’s 3rd law of motion and conservation of momentum\n6.  Students in IBDP classroom/IBDP practitioner’s talk\n7.  Teacher's faith of student-centered IBDP class management/IBDP practitioner’s talk\n8.  Assessments in IBDP classroom/IBDP practitioner’s talk\n9.  Newton’s 1st law of motion and inertial coordinate\n10.  Friction, Static Friction and Kinetic Friction, Friction coefficient\n11.  Scientific reasoning\n12.  Inquiry-based experiment design\n13.  Inquiry and practice, civic participation, CAS\n14.  Work-Kinetic Energy Theorem, Kinetic Energy\n15.  Work-Kinetic Energy Theorem, Potential Energy, and Conservation of Mechanical Energy\n16.  Electromagnetic interaction (Maxwell’s Equations) in Modern Life\n17.  The Four Fundamental Interaction of the Universe, Cosmology\n18.  Presentation and peer review",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "Direct instruction"
        },
        {
            "type": "Group discussion",
            "note": "Group discussion"
        },
        {
            "type": "Problem base learning",
            "note": "Problem and case inquiry"
        },
        {
            "type": "Cooperative learning",
            "note": "Peer cooperation and peer review, focused conversation methods and team building"
        },
        {
            "type": "Lab/Studio",
            "note": "Scientific hands-on inquiry experiment, teaching strategy inquiry"
        },
        {
            "type": "Field work",
            "note": "Teaching practicum"
        },
        {
            "type": "Media, audio, visual materials",
            "note": "Multimedia and ICT technology introduction, online course technology, digital measurement tools"
        },
        {
            "type": "Case studies",
            "note": "Physics and teaching real case study"
        },
        {
            "type": "Other:",
            "note": "Focused conversation methods, such as ORID and design thinking"
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 20,
            "note": "Individual assignment in item difficulty"
        },
        {
            "type": "Class discussion involvement",
            "weight": 20,
            "note": "Group item construction"
        },
        {
            "type": "Attendances",
            "weight": 10,
            "note": "Individual classroom reflection"
        },
        {
            "type": "Presentation",
            "weight": 20,
            "note": "Group presentation"
        },
        {
            "type": "Shows/ Exhibitions",
            "weight": 20,
            "note": "Classroom academic seminar, Group"
        },
        {
            "type": "Case study reports",
            "weight": 10,
            "note": "Reflective Writing"
        }
    ],
    "prerequisite": "◎First phase Exclusive for students within Programmes of International Baccalaureate Educator Certificate-Chinese Language Education Programmes of International Baccalaureate Educator Certificate-International  Mathematics  Education Programmes of I◎限Programmes of Intern、Programmes of Intern、Programmes of Intern、Programmes of Intern",
    "general_core": []
}