{
    "year": 108,
    "term": 2,
    "name": "運動管理學專題研究",
    "teachers": [
        "蕭嘉惠"
    ],
    "department": "AD30",
    "code": "PED0065",
    "credit": 3,
    "serial": 6,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 2,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "體003"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "本課程為運動管理專長學生之進階管理課程。除針對重要之單元主題進行講解外，將以具代表性之管理個案進行解析，輔以時事及趨勢討論，以加深學生理解程度。同時，本課程強調理論驗證實務能力之培養，進行管理研究與實戰操練，以落實學以致用，知行合一之教學目標。",
    "goals": [
        "強化學生對運動產業發展之國際觀與運動管理專業之認識",
        "培養學生對運動管理知能之理論應用能力",
        "培養學生對運動管理實務與問題之分析與解決能力",
        "培養學生成為高階運動管理者應具備之專業態度及能力"
    ],
    "syllabus": "課程主題內容與課外閱讀資料  \n  \n1\\. ：運動管理學導論  \n（1） Zeigler, E. F. (1987). Sport management: Past, present, future. Journal of Sport Management. 1, 4-24.  \n（2） Chelladurai, P. (1992). Sport management: Opportunities and obstacles. Journal of Sport Management. 6, 215-219.  \n（3） Slack, T. (1991). Sport management: some thoughts on future directions. Journal of Sport Management. 5, 95-99.  \n（4） Pitts, B. G. (2001). Sport management at the Millennium: A defining moment. Journal of Sport Management. 15, 1-9.  \n（5） Quatman, C., Chelladurai, P. (2008). The social construction of knowledge in the field of sport management: A social network perspective. Journal of Sport Management. 22, 651-676.  \n（6） Thibault, L. (2009). Globalization of sport: An inconvenient truth. Journal of Sport Management. 23, 1-20.  \n  \n2\\. ：運動產業現況  \n（1） 鄭志富（2002）。二十一世紀台灣運動產業之發展與挑戰。載於第二屆中華民國運動與休閒管理國際學術研討會論文集（伍-一）。台北市：國立台灣師範大學。  \n（2） 謝品華、劉世平譯（2004）。運動產業之經營典範。台北市：台灣培生。  \n（3） 台灣體育運動管理學會（2003）。台灣體育運動產業典範集錦。桃園縣：作者。  \n（4） 黃鴻程（2008）。服務業經營。台中市：滄海。  \n（5） Hong, F. (1997). Commercialism and sport in China: Present situation and future expectations. Journal of Sport Management. 11 , 343-354.  \n（6） Oga, J. (1998). Business fluctuation and the sport industry in Japan: An analysis of the sport industry from 1986 to 1993. Journal of Sport Management. 12, 63-75.  \n  \n3\\. 運動產業現況（閱讀資料同前）  \n  \n4\\. 管理倫理與社會責任  \n（1） Kjeldsen, E. (1992). The manager’s role in the development and maintenance of ethical behavior in the sport organization. Journal of Sport Management. 6, 99-113.  \n（2） Show, S., & Frisby, W. (2006). Can gender quity be more equitable? Promoting an alternative frame for sport management research, education, and practice. Journal of Sport Management. 20, 483-509.  \n（3） Zeigler, E. F. (2007). Sport management must show social concern as it develops tenable theory. Journal of Sport Management. 21, 297-318.  \n（4） Bradish, C., & Cronin, J. J. (2009). Corporate social responsibility in sport. Journal of Sport Management. 23, 691-697.  \n（5） Godfrey, P. C. (2009). Corporate social responsibility in sport: An overview and key issues. Journal of Sport Management. 23, 698-716.  \n  \n  \n5\\. 策略規劃與管理  \n（1） Thibault, L., & Slack, T. (1994). Strategic planning for nonprofit sport organizations: Empirical verification of a framework. Journal of Sport Management. 8, 218-233.  \n（2） 薛義誠（2008）。策略規劃與管理。台北市：雙葉。  \n（3） 司徒達賢（2001）。策略管理新論。台北市：智勝。  \n（4） 黃秀媛譯（2005）。藍海策略。台北市：天下。  \n（5） Sam, M. P., Jackson, S. J. (2006). Developing national sport policy through consultation. Journal of Sport Management. 20, 366-386.  \n（6） Hoye, R., Nicholson, M., & Houlihan, B. (2010). Sport policy: Issue and analysis. Burlington, MA: Butterworth-Heinemann.  \n  \n  \n6\\. 領導與組織文化  \n（1） Soucie, D. (1994). Effective managerial leadership in sport organizations. Journal of Sport Management. 8, 1-13.  \n（2） Weese, J. M. (1995). Leadership and organizational culture: An investigation of Big Ten and Mid-American Conference campus recreation administrations. Journal of Sport Management. 9, 119-134.  \n（3） Wallace, M., & Weese, J. M. (1995). Leadership, organizational culture, and job satisfaction in Canadian YMCA organizations. Journal of Sport Management. 9, 182-193.  \n（4） Weese, J. M. (1996). Do leadership and organizational culture really matter? Journal of Sport Management. 10, 197-206.  \n（5） Doherty, A. J., & Danylchuk, K. E. (1996). Transformational and transactional leadership in interuniversity athletics management. Journal of Sport Management. 10, 292-309.  \n（6） Doherty, A. J., & Chelladurai, P., & (1999). Managing culture diversity in sport organizations: A theoretical perspective. Journal of Sport Management. 13, 280-297.  \n（7） Scott, D. K. (1999). A multiframe perspective of leadership and organizational climate. Journal of Sport Management. 13, 298-316.  \n（8） Colyer, S. (2000). Organizational culture in selected Western Australian sport organizations. Journal of Sport Management. 14, 321-341.  \n  \n7\\. 領導與組織文化（閱讀資料同前）  \n  \n8.運動組織治理、組織承諾、組織效能與組織公民行為  \n（1） 鄭志富（1998）。體育行政人員工作價值觀與組織承諾之研究。載於鄭志富等著，運動管理學論文選輯（一）（頁3-33）。 台北市：師大書苑。  \n（2） Hoye, R., & Cuskelly, G. (2007). Sport governance. Burlington, MA: Butterworth-Heinemann.  \n（3） Haggerty, T. R., & Denomme, D. (1991). Organizational commitment in sport clubs: A multivariate exploratory study. Journal of Sport Management. 5, 58-71.  \n（4） Joski, P. (1995). Organizational effectiveness of Finnish sport clubs. Journal of Sport Management. 9, 85-95.  \n  \n9\\. 品質管理與人力資源管理  \n（1） Mawson, M. L. (1993). Total quality Management: Perspectives for sport managers. Journal of Sport Management. 7, 101-106.  \n（2） Goslin, A. (1996). Human resource management as a fundamental aspect of a sport development strategy in South African communities. Journal of Sport Management. 10, 207-217.  \n  \n10.行銷管理  \n（1） Hansen, H., & Gauthier, R. (1992). Marketing objectives of professional and university sport organizations. Journal of Sport Management. 6, 27-37.  \n（2） Hansen, H., & Gauthier, R. (1989). Factors affecting attendance at professional sport events. Journal of Sport Management. 3, 15-32.  \n（3） Wakefield, K. L., & Sloan, H. J. (1995). The effects of team loyalty and selected stadium factors on spectator attendance. Journal of Sport Management. 9, 153-172.  \n（4） Copeland, R., & Frisby, W. (1996). Understanding the sport sponsorship process from a corporate perspective. Journal of Sport Management. 10, 32-48.  \n（5） Kim, Y. K., & Trail, G. (2010). Constraints and motivators: A new model to explain sport consumer behavior. Journal of Sport Management. 23, 190-210.  \n  \n  \n11\\. 職業運動經營  \n（1） Gladden, J. M., & Sutton, W. A. (2003). Professional sport. In J. B . Parks & J. Quarterman (Eds.). Contemporary sport management (pp.297- 321). Champaign, IL: Human Kinetics.  \n（2） Crompton, J. L., & Howard, D. R. (2003). Financing Major League facilities: Status, evolution and conflicting forces. Journal of Sport Management. 17, 156-184.  \n（3） Cousens, L. (1997). From diamonds to dollars: The dynamics of change in AAA baseball franchises. Journal of Sport Management. 11, 316-334.  \n（4） Mason, D. S. (1997). Revenue sharing and agency problems in professional team sport: The case of the National Football League. Journal of Sport Management. 11, 203-222.  \n  \n12\\. 職業運動經營（閱讀資料同前）  \n  \n  \n13.運動觀光旅遊  \n（1） 李俊杰主編（2009）。運動觀光。台北市：五南。  \n（2） Gammon, S., & Robinson, T. (1997). Sport and tourism: A conceptual framework. Journal of sport Tourism, 4(3), 8-24.  \n（3） Hinch, T. D., & Higham, J. E. S. (2001). Sport tourism: A framework for research. The International Journal of Tourism Research, 3, 45-58.  \n（4） Gibson, H. (2003). Sport tourism. In J. B . Parks & J. Quarterman (Eds.). Contemporary sport management (pp.337- 360). Champaign, IL: Human Kinetics.  \n（5） Gibson, H. J. (2003). Sport tourism: A introduction to the special issue. Journal of Sport Management. 17, 205-213.  \n（6） Shonk, D. J., & Chelladurai, P. (2008). Service quality, satisfaction, and intent to return in event sport tourism. Journal of Sport Management. 22, 587-602.  \n（7） Hritz, N., & Ross, C. (2010). The perceived impacts of sport tourism: An urban host community perspective. Journal of Sport Management. 24, 119-138.  \n  \n14\\. 運動觀光旅遊（閱讀資料同前）  \n  \n  \n15\\. 運動管理的研究  \n（1） Li, M., Pitts, B., & Quarterman, J. (2008). Research methods in sport management. Morgantown, WV: Fitness Information Techology.  \n（2） Edwards, A., & Skinner, J. (2009). Qualitative research in sport management. Burlington, MA: Butterworth-Heinemann.  \n  \n16\\. 運動管理的未來  \n（1） Cuneen, J., & Schneider, R. (2001). Sport in the third Millennium: A retrospective and perspective on 1990s and 2000-era sport. Journal of Sport Management. 15, 267-274.  \n（2） Cuneen, J. (2004). Managing program excellence during our transition from potential to merit. Journal of Sport Management. 18, 1-12.  \n（3） Costa, C. A. (2005). The status and future of sport management: A delphi study. Journal of Sport Management. 19, 117-142.  \n（4） Cunningham, G. B., & Fink, J. S. (2006). Diversity issues in sport and leisure. Journal of Sport Management. 20, 455-465.  \n  \n17\\. 期末專題報告（每人報告15分鐘，討論10分鐘）。  \n  \n  \n18\\. 期末專題報告（每人報告15分鐘，討論10分鐘）。  \n  \n  \n評量方法  \n一、出席、上課報告與參與討論（40%）  \n二、個案分析（20%）  \n三、運動管理研究（40%）",
    "methodologies": [
        {
            "type": "講述法",
            "note": "教師講授每週重點內容"
        },
        {
            "type": "討論法",
            "note": "針對每週個案進行討論"
        },
        {
            "type": "問題解決教學",
            "note": "配合個案進行問題解決教學"
        },
        {
            "type": "合作學習",
            "note": "小組針對特定主題任務進行知識分享、理念溝通，以達成任務。"
        },
        {
            "type": "實地考察、參訪",
            "note": "實地參訪1~2個運動企業或機構"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "依學生每週文獻研讀作業評分"
        },
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": "依學生課堂參與討論之積極性與見解評分"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "依學生出席情形評分"
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "依每週專題報告情形評分"
        },
        {
            "type": "專題",
            "weight": 20,
            "note": "期末專題研究成果(期刊文章)"
        }
    ],
    "prerequisite": "",
    "general_core": []
}