{
    "year": 108,
    "term": 2,
    "name": "專業筆譯（中譯英）",
    "teachers": [
        "鄭永康"
    ],
    "department": "LM25",
    "code": "TIM1040",
    "credit": 3,
    "serial": 1566,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 4,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "譯506"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course is a practice-based training course designed to help students learn professional skills necessary for translating Chinese texts dealing with finance, economics, and law into English. Students’ self-study of relevant industries and fields through weekly online reference materials provided will lead to the acquisition of key terminology and background knowledge.",
    "goals": [
        "Students will be required to complete weekly translation exercise of about 700~1000 Chinese characters long. At least 14 exercises during the term",
        "Students will sit for their mid-term and final exams to gauge progress and to help them develop translation competence under time pressure.",
        "Students will be required to compile a bilingual glossary of terms based on the assigned exercises, to be submitted after mid-terms and the end of the semester.",
        "The course design will help students acquire professional translation skills necessary for handling documents/articles on finance, economics, and law. They shall also learn relevant terminology and conceptual background."
    ],
    "syllabus": "本課程目的在於訓練學生的文史哲文件專業翻譯能力，主要方向為中翻英。透過每週的筆譯作業，學生將學習如何處理相關文本。作業內容涵蓋不同領域，如中國文物，藝術，文化，歷史，儒道哲學等等。授課老師將提供相關背景資料或網路連結，讓同學們先閱讀英文背景文章，蒐集專業詞彙與片語，再進行每週作業的翻譯。\n\n除了作業，評量方式將包含期中和期末考試。\n\nWeekly Schedule\n\nWeeks 1-2 Introduction and warm up\n\nWeeks 3-7 Basic exercises on common topics on culture, history, art and philosophy\n\n(Mid-term exam）\n\nWeek 9-15 Advanced topics on Chinese and Taiwanese culture\n\n(Final Exam)\n\n**Course Objectives**\n\nTo help students learn the techniques for translating \"culture, history and art \" texts into Chinese/English\n\nClasses will be conducted as follows:  \n(1) A weekly translation exercise of about 800-1000 words/characters long. At least 13 exercises during the term.  \n(2) Source-language texts will include select articles on the four main topics. Handouts or relevant online links will be given to students for prior reading before doing their translation assignments.\n\n(3) Weekly translation projects submitted by students will be discussed in class, including analysis of mistranslations, omissions, corrections and improvements.  \n(4) Emphasis of student-work analysis: accuracy, grammar, diction, vocabulary, tone, language register, style and format.  \n(5) Students will be regularly assigned to study and comment on the work of their classmates as a means to learn others’ adopted techniques, as well as consider their pros and cons, in comparison with their own work.  \n(6) As a way to develop speed, students will at times be required to do translation of short passages on-site, to be followed by a review of their work.  \n(8) Students will sit for their mid-term and final exams.",
    "methodologies": [
        {
            "type": "討論法",
            "note": "In-class discussion of weekly assignments"
        },
        {
            "type": "合作學習",
            "note": "Students may be assigned to work in pairs"
        },
        {
            "type": "媒體融入教學",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "Weekly assignments"
        },
        {
            "type": "期中考",
            "weight": 10,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 10,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 40,
            "note": "Participation and contribution"
        },
        {
            "type": "出席",
            "weight": 20,
            "note": "Attendance, punctuality  and ATTENTIVENESS；AWOL"
        }
    ],
    "prerequisite": "",
    "general_core": []
}