{
    "year": 108,
    "term": 2,
    "name": "西方書籍藝術：從中世紀到當代",
    "teachers": [
        "哈德森"
    ],
    "department": "TM67",
    "code": "AHM0233",
    "credit": 3,
    "serial": 2955,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "青田406室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course provides an introduction to some of the key developments in illuminated manuscripts and printed books in the West, from the Middle Ages to the present. Through a series of in-depth case studies, the course will focus on medieval and Renaissance illuminated manuscripts from Western Europe, the transformation of book production with the development of printed books in Germany in the fifteenth century, and the various ways in which artists contributed to book production across Europe in the following centuries. Then, we will study the revival of handmade books in the nineteenth-century Arts and Crafts movement, and the emergence of new forms such as artists’ books and photobooks in the twentieth century. The study of some recent developments, such as the graphic novel and the impact of digital media, will bring the course to the present day. Consideration will be given to the changing relationships between images and texts, and how materials, techniques, and technologies have contributed to the changing nature of book arts over time.",
    "goals": [
        "The aim of this course is: –to create an in-depth knowledge and understanding of key developments of book arts of the West from the Middle Ages to the present.",
        "–to train students’ ability of analysis of form and iconography using the correct terminology.",
        "–to improve students’ capacity for aesthetic judgment.",
        "–to instruct students how to read and interpret sources of artistic theory.",
        "–to promote students’ competencies to collect and interpret related literature and to encourage them to maintain a critical attitude toward scholarly opinions.",
        "–give technical instructions for writing an academic text and composing a paper."
    ],
    "syllabus": "Please read the attached PDF for a full description of the course. Below is a summary:\n\n1.    Introduction\n\n*   overview of the subject content and details of the assessment\n*   course-specific terminology \n*   historical origins and early development of the codex\n\n2.    Insular Gospels: Illuminated Manuscripts and Christian Liturgy\n\n*   St Cuthbert Gospel, c. 700–30 AD, British Library, London, Add MS 89000\n*   Lindisfarne Gospels, c. 700, British Library, London, Cotton MS Nero D IV\n*   Book of Kells, c. 800 AD, Trinity College, Dublin, TCD MS 58\n\n3.    Secular Medieval Texts: Gender, Eroticism, Allegory, and Magic \n\n*   Justinian, Codex, 14th century, Bodleian Library, Oxford, MS Canon Misc. 495\n*   _Roman de la Rose_, c. 1400, Universitat de València, Biblioteca Històrica, BH MS 387\n*   The Voynich Manuscript, early 1400s, Beinecke Rare Book and Manuscript Library, Yale University, New Haven, Beinecke MS 408\n\n4.    Netherlandish and Italian Renaissance Books of Hours: Luxury Manuscripts for Private Devotion\n\n*   Turin-Milan Hours, illuminated early-to-mid 1400s, Bibliothèque Nationale de France, Paris, MS Nouvelle acquisition latine 3093 and Museo civico d’arte, Turin, MS 47\n*   The Rothschild Book of Hours, early 1500s, Kerry Stokes Collection, Perth, on loan to the National Library of Australia, Canberra\n*   The Sforza Hours, late 1400s and early 1500s, British Library, London, Add MS 34294\n\n5.     Illustration and Decoration in Humanist Renaissance Manuscrips  \n\n*   Dante (author) and Botticelli (artist), _Divina commedia_, c. 1485, Kupferstichkabinett, Staatliche Museen zu Berlin, MS Hamilton 201, and Biblioteca Apostolica Vaticana, Rome, MS Reg. lat. 1896\n*   Francesco Petrarca (author), _Trionfi, sonnetti, e canzoni_, c. 1465–1470, Cornell University Library, Ithaca, RareBd. MS. 4648 no. 24+\n*   Boccaccio (author) and Taddeo Crivelli (artist), _Decameron_, c. 1467, Bodleian Library, Oxford, MS Holkham misc. 49\n\n6.    The Gutenberg Bible and Illustrated Printed Books in Renaissance Germany and Italy\n\n*   _Biblia latina_, Johann Gutenberg, Maintz, c. 1455, British Library, London, C.9.d.3,4\n*   Hartmann Schedel and George Alt (authors), with Michael Wolgemut, and Wilhelm Pleydenwurff (artists), _Liber chronicarum_ (_Nuremberg Chronicle_), Nuremberg, 1493, Cambridge University Library, Inc.0.A.7.2\\[888\\]\n*   Albert Dürer, _Desymmetria partium in rectis formis huanorum corporum_, Nuremberg, 1532, Universitätsbibliothek Heidelberg, Cicognara Nr. 319-1\n*   Attributed to the Pseudo-Saint Bonaventura (author), _Le devote meditatione sopra la passione delnostro signore_, Hieronymous de Sanctis, 1487, Metropolitan Museum of Art, New York, 33.17\n*   Aldo Manuzio (publisher), _Hypnerotomachia poliphili_, Venice, 1499, Boston Public Library, call no. Incun.1499.C6\n*   L.A. Giunta (publisher) _Missale romanum_. Venice, 1501, Library of Congress, Washington, Rosenwald Collection, Rare Book and Special Collections Division, 39\n\n7.    Giovanni Battista Gaulli and the Frontispiece in Seventeenth-Century Rome\n\n*   Giovanni Battista Gaulli, _The Jesuit Cardinal Roberto Bellarmino_, British Museum, London, c.1678, 1994,U.3\n*   Giovanni Battista Gaulli, _The Jesuit Cardinal Roberto Bellarmino_, Musée des Beaux-Arts, Lyon,c. 1678, 1962-654\n*   Daniello Bartoli, _Della vita di Roberto Cardinal Bellarmino Arcivescovo di Capua_, Rome, 1678, British Library, London\n\n8.  William Blake and Romantic-Era Book Illustration\n\n*   William Blake, _Songs of Innocence and of Experience_, 1789-1794 \\[London\\], William Blake Archive, Fitzwilliam Museum, Cambridge, P.124—1950\n*   William Blake, _Europe: A Prophecy_, 1794/1821, Lambeth, William Blake Archive, Fitzwilliam Museum, Cambridge, P.124—1950\n*   Johann Wolfgang von Goethe (author) and Eugène Delacroix (artist), _Faust_, Paris,1828, Metropolitan Museum of Art, New York, 17.12\n\n9.  Aubrey Beardsley: Scandal and Censorship in Nineteenth-Century British Publishing\n\n*   Oscar Wilde (author) and Aubrey Beardsley (artist), _Salome: A Tragedy in One Act_, translated from the French, London, Boston, and Edinburgh, 1894, British Library, London, Eccles 296\n*   Alexander Pope (author) and Aubrey Beardsley (artist), _The Rape of the Lock_, London, 1896, National Gallery of Art, Washington, 1991.150.106\n\n10.  The Kelmscott Press, the Arts and Crafts Movement, and the Revival of the Handmade Book\n\n*   Geoffrey Chaucer (author) and William Morris at the Kelmscott Press (artist and printer), _The Works of Geoffrey Chaucer Now Newly Imprinted_, London, 1896, British Library, London, C.43.h.19\n*   William Caxton (author) and William Morris at the Kelmscott Press (artist and printer), _The History of Reynard the Foxe_, London, 1892\n\n11.  The Victorian Album: Photography, Identity, and Vernacular Visual Culture\n\n*   Eliezer Levi Montefiore, Album, 1860s, StateLibrary of New South Wales, Mitchell Library, Sydney, PXB851\n*   Marie-Blanche-Hennelle Fournier, Album, 1870s, The Art Institute of Chicago, Mary and Leigh Block Endowment, 2005.297\n*   Kate Edith Gough, Album, late 1870s, Victoria and Albert Museum, London, 867-1963\n\n12.  Twentieth-Century Artists’ Books\n\n*   Aleksandr Rodchenko, _Novyi lef: Zhurnal levogo fronta iskusstv_, no. 1, 1928, Museum of Modern Art, New York\n*   Max Ernst, _Une semaine de bonté_, Paris, 1934, Museum of Modern Art, New York, 828.1964.A-E\n*   Tristan Tzara (author) and Joan Miró (artist), _Parler seul_, Paris, 1948–50, Stedelijk Museum, Amsterdam, KBA 567\n\n13.  International Typographic Style to Experimental Typography\n\n*   Josef Müller-Brockmann, _Grid Systems in Graphic Design: A Visual Communication Manual forGraphic Designers, Typographers and Three Dimensional Designers_, Niederteufen, 1981\n*   Stefan Sagmeister, _Things I Have Learned in My Life So Far_, New York, 2008\n\n14.  Photobooks: Photography, Narrative Sequencing, and the Book Format\n\n*   Henri Cartier Bresson (photographer) and Henri Matisse (artist of the cover), _Images àla sauvette_, Paris, 1952, Fondation Henri Cartier Bresson, Paris\n*   Ed Ruscha, _Twentysix Gasoline Stations_, Los Angeles, 1963\n*   Christian Patterson, _Redheaded Peckerwood_, London, 2011\n\n15.  Graphic Novels and Comics Journalism, and Course Quix\n\n*   Art Spiegelman, _Maus_, New York, 1980–91, republished as _Maus: A Survivor's Tale_, New York, 1986, and _And Here My Troubles Began_, New York, 1991\n    \n*   Joe Sacco, _Palestine_, Seattle, 1993–1995\n    \n\n16–18.  Individual consultation with the professor to discuss students' written assignments, by appointment.",
    "methodologies": [
        {
            "type": "講述法",
            "note": "In most classes the professor will deliver a presentation with a Powerpoint display, which will serves as a means to generate discussion in the class."
        },
        {
            "type": "討論法",
            "note": "Students are free to ask questions, make comments, and lead discussions at any time in the classes, except when another student is delivering their presentation for assessment."
        },
        {
            "type": "合作學習",
            "note": "In session 16 there is a non-assessed teamwork quiz on the content of the course."
        },
        {
            "type": "實地考察、參訪",
            "note": "The class will visit libraries, book vendors, and private collections, as feasible."
        },
        {
            "type": "媒體融入教學",
            "note": "Documentaries will be screened in classes, and digitized manuscripts and books studied online."
        },
        {
            "type": "專題研究",
            "note": "Most classes will contain case studies, introduced either by the professor or a student delivering their oral presentation for assessment."
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "This mark is for attendance, punctuality, contribution to discussions and activities in class, and knowledge of the set texts."
        },
        {
            "type": "報告",
            "weight": 50,
            "note": "Students develop the same topic delivered in the class presentation into a 6-8 page exhibition catalogue entry for a book, with footnotes, bibliography, and figures, taking into account the feedback for their oral presentation."
        },
        {
            "type": "成果展覽",
            "weight": 30,
            "note": "Students choose a topic from the course syllabus and deliver an approximately 45 minute oral presentation in class, supported with a Powerpoint or similar visual presentation."
        }
    ],
    "prerequisite": "",
    "general_core": []
}