{
    "year": 108,
    "term": 2,
    "name": "藝術史學史",
    "teachers": [
        "諾斯邦"
    ],
    "department": "TM67",
    "code": "AHM0033",
    "credit": 3,
    "serial": 2947,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "青田406室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "The course introduces the history, methods and trends of the discipline of art history. It develops an understanding of the important theoretical developments that took place in the discipline from the Renaissance to the present. Prominent art historians and their theories are commented through the reading of exemplary texts. Their reception and influence  are analysed and contextualized. Changing methods of interpretation are carefully examined and compared through the scope of a selection of texts that cover different hermeneutic approaches and perspectives.",
    "goals": [
        "Development of the History of Art and Cognition",
        "Works and Key Discourses in the History of Art and Cognition",
        "Methodology and Related Works in the History of Art and Cognition"
    ],
    "syllabus": "**Art Historiography 2020 (Tentative Program)**\n\n**The course introduces the student to the history, methods and trends of the discipline of art history. It develops an understanding of the important theoretical developments that took place in the discipline from the Renaissance to the present. Prominent art historians and their theories are commented through the reading of exemplary texts. Their reception and influence  are analysed and contextualized. Changing methods of interpretation are carefully examined and compared through the scope of a selection of texts that cover different hermeneutic approaches and perspectives.**\n\nWeek 1:                      Introduction I\n\nWeek 2:                      Introduction II: Presentation of the topics \n\n**Week 3**           Common readings: \n\n*   Carlo Ginzburg, “Clues: Roots of an Evidential Paradigm”, in _Clues, Myths, and the Historical Method_, (translated by John and Anne C. Tedeschi), Baltimore: Johns Hopkins University Press, 1992, pp. 96-125 \n\n**Week 4:**                      Common readings\n\n*   Aby Warburg, _Images from the Region of the Pueblo Indians of North America_, (_Reise-Erinnerungen aus dem Gebiet der Pueblos_ / _Schlangenritual. Ein Reisebericht_, Berlin, 1988) Translation Michael P. Steinberg (Ithaca (NY), 1995)\n*   Prager, Philipp Andrew, “Making an Art of Creativity: The Cognitive Science of Duchamp and Dada,”, in _Creativity Research Journal_, Vol. 24, No. 4, 2012, pp. 266-277\n\n**Week 5**                       Common readings:\n\n*   Hubert Damisch, _A Theory of /Cloud/. Toward a History of Painting_, (1972), Stanford: Stanford University Press, 2002, Chapter 5, “Our Sheet’s White Care,” pp, 182-231 \n\n**Week 6:**                      Common readings \n\n*   W J T Mitchell, “Four Fundamental Concepts of Image Science,” in _Image Science: Iconology, Visual Culture and Media Aesthetics_, Chicago and London: The University of Chicago Press, 2015, pp. 13-21, and “There are no Visual Media,” in _Journal of Visual Culture_, Vol. 4, no. 2, 2005, pp. 257-266 _Image Science: Iconology, Visual Culture, and Media Aesthetics_, Chicago: University of Chicago Press, 2015\n*   W J T Mitchell, “Showing Seeing: a Critique of Visual Culture,” in _Journal of Visual Culture_, Vol. 1, no. 2, 2002, pp. 165-181\n\n**Week 7**                       **Presentations:** \n\n*   **Svetlana Alpers, The Art of Describing: Dutch Art in the Seventeenth Century, 1983,** \n\n1.  Chapter 2: “‘Ut picture, ita visio’: Kepler’s Model of the Eye and the Nature of Picturing in the North,” pp. 26-71\n2.  Chapter 3: “‘With a Sincere Hand and a Faithful Eye’: The Craft of Representation,” pp. 72-118\n\n**Background Readings**\n\n*   Martha Hollander, “Karel van Mander. The _Doorsien_ and the Language of Space,” in _An Entrance for the Eyes. Space and Meaning in Seventeenth-Century Dutch Art_, Berkeley and Los Angeles: University of California Press, 2002, p. 7-47\n*   Victor Stoichita, “Margins,” in _The Self-Aware Image. An Insight into Early Modern Meta-Painting_, (Chapter 3), Cambridge and New York: Cambridge University Press, 1997, pp. 30-63\n*   Victor Stoichita, “Paintings, Maps, and Mirrors,” in _The Self-Aware Image. An Insight into Early Modern Meta-Painting_, (Chapter 7), Cambridge and New York: Cambridge University Press, 1997, 151-197\n*   Mariët Westermann, “The Art of Describing: Dutch Art in the Seventeenth Century, 1983,” in in Richard Shone and John-Paul Stonard (eds.), _The Books that Shaped Art History_ _From Gombrich and Greenberg to Alpers and Krauss_, London: Thames and Hudson_,_ pp. 176-189\n\n**Week 8                       Presentations:** \n\n*   **Rosalind Krauss, _The Originality of the Avant-Garde and Other Modernist Myths_, Chicago: The University of Chicago Press, 1985**\n\n1.  “Grids,” and “In the Name of Picasso,” pp. 8-22, and 23-42 \n2.  “No More Play,” pp. 42-86\n3.  “Notes on the Index, Part I,” “Notes on the Index Part II”, pp. 196-209 and pp. 210-220, and “Sculpture in the Expanded Field,” pp. 276-290\n\n**Background Readings**\n\n*   Diarmuid Costello, “Automat, automatic, automatism: Rosalind Krauss and Stanley Cavell on photography and the photographically dependent arts,” in _Critical Inquiry_, Vol. 38, No. 4, 2012, pp. 819-854\n*   Partha Mitter, “Decentering Modernism: Art History and Avant-Garde Art from the Periphery,” in _The Art Bulletin_, Vol. 90, No 4, 2008, pp. 531-548\n*   Ana Lovatt, “The Originality of the Avant-Farde and Other Modernist Myths, 1985,” in Richard Shone and John-Paul Stonard (eds.), _The Books that Shaped Art History_ _From Gombrich and Greenberg to Alpers and Krauss_, London: Thames and Hudson_,_ pp. 190-201\n*   Spyros Papetros, _Retracing the Expanded Field: Encounters Between Art and Architecture_, Cambridge: MIT Press, 2014\n\n**Week 9**                       **Presentations:** \n\n*   **Victor Stoichita, _The Self-Aware Image. An Insight Into Early Modern Meta-Painting_, 1997 (New, Improved and Updated with an Introduction by Lorenzo Pericolo, Turnhout: Harvey Miller Publishers, 2015)**\n\n1.  Chapter 1 and 3: “Embrasures,” and “Margins,” in _The Self-Aware Image. An Insight into Early Modern Meta-Painting_, pp. 39-51, and 67-99\n2.  Chapter 7: “Paintings, Maps, and Mirrors,” pp. 183-227\n3.  Chapter 8: “Two Images: The Painter/The Act of Painting,” pp. 229-289\n\n**Background Readings**\n\n*   Svetlana Alpers, “The Mapping Impulse in Dutch Art,” Chapter 4 of _The Art of Describing: Dutch Art in the Seventeenth_ Century, 1983, pp. 119-168 and “Looking at Words: The Representation of Texts in\n*   Chapter 7: _Ibidem_, pp. 169-221\n*   Martha Hollander, “Karel van Mander. The _Doorsien_ and the Language of Space,” in _An Entrance for the Eyes. Space and Meaning in Seventeenth-Century Dutch Art_, Berkeley and Los Angeles: University of California Press, 2002, p. 7-47\n*   Victor Stoichita, “Margins,” in _The Self-Aware Image. An Insight into Early Modern Meta-Painting_, (Chapter 3), Cambridge and New York: Cambridge University Press, 1997, pp. 30-63\n*   Victor Stoichita, “Paintings, Maps, and Mirrors,” in _The Self-Aware Image. An Insight into Early Modern Meta-Painting_, (Chapter 7), Cambridge and New York: Cambridge University Press, 1997, 151-197\n*   Mariët Westermann, “The Art of Describing: Dutch Art in the Seventeenth Century, 1983,” in in Richard Shone and John-Paul Stonard (eds.), _The Books that Shaped Art History_ _From Gombrich and Greenberg to Alpers and Krauss_, London: Thames and Hudson_,_ pp. 176-189\n\n**Week 10                     Presentations:** \n\n*   **Wu Hung, _A Story of Ruins. Presence and Absence in Chinese Art and Visual Culture_, Princeton and Oxford: Princeton University Press, 2012**\n\n1.  Chapter 1: “Internalizing Ruins: Premodern Sensibilities of Time Passed,” pp. 11-91\n2.  Chapter 2: “The Birth of Ruins: Inventing a Modern Visual Culture in China,” pp. 92-163\n3.  Chapter 3:” Between Past and Future: Transience as a Contemporary Aesthetic of Ruins,” pp.  166-235\n\n**Background readings:**\n\n*   Paul Zucker, “Ruins – An Aesthetic Hybrid,” in _Journal of Aesthetics and Art Criticism_, Vol. 20, no. 1, 1961, pp. 119-130\n*    Michel Makarius, _Ruins_, Paris: Flammarion, 2004\n*   Siobhan Lyons (ed.), _Ruin Porn and the Obsession with Decay_, Cham: Springer, 2018\n\n**Week 11**:                    **Presentations:**\n\n*   **Maria H. Loh, _Still Lives. Death, Desire, and the Portrait of the Old Master_, 2015**\n\n1.  Chapter 1: “The Treachery of Images,” pp. 1-54\n2.  Chapter 4: “A Body Too Much,” pp. 171-225\n\n**Background readings:**\n\n*   Levy, Evonne, “Ernst Kris, _The Legend of the Artist_ (1934) and _Mein Kampf_”, in _Oxford Art Journal_, Vol. 36, No. 2, 2013, pp. 207-229\n*   Kris, Ernst, Kurz, Otto, _Legend, Myth, and Magic in the Image of the Artist: A Historical Experiment_, New Haven and London: Yale University Press, 1979\n*   Wittkower, Margot and Rudolf, _Born Under Saturn. The Character and Conduct of Artists. A Documented History from Antiquity to the French Revolution_, (1963), New York: New York Review Books, 2007\n*   Barolsky, Paul, _A Brief History of the Artist from God to Picasso_, University Park: Penn State University Press, 2011\n\n**Week 12**:                    **Presentations:** \n\n*   **Felix Thürlemann, _More Than One Picture. An Art History of_ the Hyperimage, 2013, (English Translation: 2019)**\n\n1.  Chapter 1: “Collector’s Arrangement,” pp. 38-86 \n2.  Chapter 2: “Art Historian’s Image Practice,” pp. 87-140\n3.  Chapter 3: “Artists’ Hyperimages,” pp. 141-182\n\n**Background readings**\n\n*   Victor Stoichita, _The Self-Aware Image. An Insight Into Early Modern Meta-Painting_, 1997 (New, Improved and Updated with an Introduction by Lorenzo Pericolo, Turnhout: Harvey Miller Publishers, 2015), Chapter 4, “Assemblage: How to Make a New Painting from an Old Image,” pp. 103-125, and Chapter 6, “The Intertextual Machine,” pp. 141-179\n*   Monica Centanni, “_Serio Ludere_. Aby Warburg’s Bilderatlas: A Role-Playing Game to Study Classical Tradition,” in Ekaterina Bobrinskaya and Anna Korndorf (eds.), _History of Art and Reejected Knowledge: From the Hermetic Tradition to the 21st Century_, Moscow: State Institute for Art Studies, 2018, pp. 54-77\n*   Didi-Huberman, Georges, “The Album of Images According to André Malraux”, in _Journal of Visual Culture_, Vol. 14, No. 1, 2015, pp. 3-20\n*   Grasskamp, Walter, _The Book on the Floor. André Malraux and the Imaginary Museum_, Los Angeles: Getty Publications, 2016\n\n**Week 13**:                    **Presentations:** \n\n*   **Barbara Baert, _About Stains or the Image as Residue_, 2015, Leuven: Peeters, 2015**\n\n**Background readings**\n\n*   Horst W. Janson, “The _Image Made By Chance_ in Renaissance Thought,” in Millar Meiss (ed.), _De Artibus Opuscula XL: Essays in Honor of Erwin Panofsky_, New York, 1961, pp. 254-266 \n*   Amy Knight Powell, “Images (Not)m Made By Chance,” in _Art History_, Vol. 40, no. 2, April 2017, pp. 380-403 \n*   Øystein Sjåstad, A Theory of the Tache in Nineteenth-Century Painting, Burlington: Ashgate, 2014\n*    Mónica Guinzbourg de Braude, “From Ambiguity in Chinese Painting to Rorschach’s Inkblots,” in _Rorschachiana_, Vol. 29, 288, pp. 25–37 \n*   Barbara Maria Stafford, “Characters in Stones, Marks on Paper: Enlightenment Discourse on Natural and Artificial Taches,” in _Art Journal_, Vol. 44, 1984, pp. 233-240\n\n**Week 14:                    Presentations:** \n\n*   **Craig Clunas, _Chinese Painting and Its Audiences_, Princeton: Princeton University Press, 2017** \n\n1.  Chapter 3: “The Emperor,” pp. 85-116\n2.  Chapter 4: “The Nation,” pp. 155-191\n3.  Chapter 5: “The People,” pp. 192-227\n\n**Background readings:**\n\n*   Victor Stoichita, The Self-Aware Image. An Insight into Early Modern Meta-Painting, Cambridge and New York: Cambridge University Press, 1997\n*   Wu Hung, The Double Screen. Medium and Representation in Chinese Painting, Chicago: The University of Chicago Press, 1996\n\n**Week 15                     Common Discussion**\n\n**Week 16:                    Common Discussion**\n\n**Week 17:                    Conclusion**\n\n**Instructions for the oral presentations and term papers delivered in the Art Historiography Course**\n\n**Oral Presentation (duration 30-40 minutes)**\n\nPlease provide a handout with your name and student number with the following information \n\n•       Title, date, publisher etc. of the book you are presenting (when it is a translation, please indicate the first edition in the original language) \n\n•       The chapter(s) of the book you are analyzing\n\n•       The articulation of your presentation (it may be related to the structure of the chapter(s)) \n\n•       The reception of the book (reviews, references in later publications)\n\n•       Bibliography \n\n**Term papers**\n\n**General remarks:**\n\n            In your paper, try to be as clear as possible, without being too pedantic. You must be coherent in your argumentation in any part of your text, from the beginning to the end. Each paragraph must also follow a coherent structure. Each argument or idea should obey to a logical continuity. Don’t jump from one idea to another without justifying it. You must accompany the reader in your train of thought. Never forget the main purpose or reason, which led you to provide the reader with a specific kind of information. In two words: be consistent!\n\n**Introduction**\n\nTry to catch the attention of the reader through an anecdote (some historical facts related to the publication date of the book you are reviewing or any element related to the context and the main argumentation of your paper). This catchy element should tease the reader and give him/her the envy to read your paper (ask yourself whether you would like to read your own paper). You can briefly synthesize the outlines of your paper and introduce the main issues you will discuss in each chapter, but don’t spoil the whole stuff. Let also the reader discover new things throughout the entire paper. Please avoid tautologies such as for example mentioning in your introduction that you will have a conclusion to your paper.\n\n**Content and Structure**\n\n•       Present the main stakes of the book you are reviewing. Describe its structure and its content (summarize briefly the different chapters that constitute the book); try to describe in which way the argumentation is structured and focus your attention on the chapter you have been assigned to analyze critically. Please try to show to which extent the part you are analyzing is coherent, according to the following issues:\n\n•       The central thesis can be found in that specific chapter, and/or the most problematic issues can be found within this chapter\n\n•       The author is the most pertinent or the less pertinent within this chapter; \n\n•       The critics and reviews of the book focus on the thesis developed in this chapter etc.\n\n•       The analysis of the selected chapter(s) should detail the form and the content of the thesis it embraces. Comment key passages and paraphrase them.\n\n**Method**\n\nYour review must be based on a critical reading of the part you have been assigned to comment. This must be done through the reviews you collected on the book, the discussion we had in the classroom, and your own good sense. Your comment will have more strength if you provide the socio-historical as well as intellectual context in which the author and the book are inscribed. Some authors do explicitly refer to other scholars / texts / to legitimize their own point of view. They may explicitly frame their research within a specific intellectual, scientific, methodological context. In any case, you must take into account the career of the authors, their methods, the influences they received from their \"masters\", the colleagues that support(ed) or contradict(ed) their vision, the writings to which the text may respond and echo.\n\n**Quotations and footnotes**\n\n            In general, your paper relies essentially on your readings. You must in this respect report all your references (books, articles, DVDs, websites, etc.) in the footnotes, no matter you are quoting or paraphrasing. (For the technical details, see below). You also have to make clear who is speaking, and where each idea comes from. \n\n            The footnotes serve also to provide the reader with further information you cannot put in the main text. This can be helpful, when you want to keep some continuity to the argumentation of the main text.\n\n Length: 10-15 pages, Times New Roman, line space 1.5 (bibliography, appendix etc. not included)",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": "Assignments are presented at the beginning of the semester"
        },
        {
            "type": "其他",
            "note": "Each student will give an oral presentation and submit a term paper based on the oral presentation."
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 60,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 10,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}