{
    "year": 108,
    "term": 1,
    "name": "英語戲劇表演藝術（一）",
    "teachers": [
        "卜莎娜"
    ],
    "department": "LU21",
    "code": "ENU0245",
    "credit": 2,
    "serial": 1852,
    "group": "",
    "quota": {
        "limit": 35,
        "additional": 14
    },
    "schedule": [
        {
            "day": 2,
            "from": 9,
            "to": 10,
            "campus": "本部",
            "classroom": "勤301"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大二大三大四修習",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "This is a hands-on course combining theory and practice. It aims to introduce students to fundamental approaches to acting and theater performance in English. In addition, the second semester of the course involves a final staged production for an audience, which the students perform in as well as plan, organize, promote, etc.\nIn the first semester, students take part in Scene Study practice, plus exercises to develop voice, movement and stage interaction. In addition, there is the opportunity for intensive, often one-on-one, practice and coaching in oral English, particularly in pronunciation, enunciation, intonation, rhythm, etc., as well as vocal projection. The course also provides an opportunity to develop personal confidence, and confidence in speaking English, particularly with regard to presenting/performing in front of an audience. Scene study practice also is a chance to develop imagination and creativity.\nThe approaches used in the class are drawn from a variety of well-known acting methods, including Meisner and Viewpoints techniques and the methods of Uta Hagen, as well as basic Stanislavski concepts. Materials used for practice are professional quality, including scenes from well-known plays and from TV and film scripts. No book is required, but it may be necessary to purchase some apps or online materials; for the most part, materials will be provided for you to prepare for classwork, and reference books and websites will be recommended. \nClasses are conducted entirely in English and are organized in a discussion- and practice/rehearsal-style setting. Class time is spent doing various warm-up and acting exercises, discussing and practicing assigned scripts, rehearsing, developing creative ideas for staging, and performing in class. Meeting outside of class with other classmates, as well as with the instructor, to rehearse your scripts will also be necessary. In the second semester, you will also need to spend time outside of class on planning and organizing the final performance. Cooperation and teamwork, therefore, are fundamental to the class. \n\nRequirements for the Course\nAttendance—Punctuality as well as consistent, conscientious attendance is a must for this class. You must be here to actively participate and engage in the class and to learn together. Any absences or tardiness must be dealt with in a responsible manner, and you will be expected to take the initiative to make up anything that you miss. Also, note that this is a class that requires physical activity. Please dress appropriately and do discuss with the instructor any physical limitations that you might have.\n\nJournal and Portfolio—A regular-sized notebook with a sturdy cover is required, to be used as a journal and as part of your portfolio. You will have some specific assignments for your journal, but you will also be expected to use it frequently on your own initiative to record, comment on, and further explore what we do in class, as well as to prepare for exercises, scenes, etc. Your portfolio, which will include your journal, should show a record of your development in the course throughout the semester. It should include, for example, an orderly collection of the handouts, your notated scripts, and other materials collected in preparing for your scenes, plus photos and videos of your work. The journal/portfolio will be handed in at the midterm and the end of the semester. It will be returned to you. All materials should be presented in English and in a professional-looking manner.\n\nAttending at least two theater performances outside of class—At least one of these should be in English. You will be asked to write a review/analysis of the performances in English, to include in your portfolio.  At least one of these can be a filmed version of a live performance, such as by National Theater Live or Digital Theater.\n\nDrama Showcase—At the end of the first semester, we will plan to organize a “Drama Showcase,” at which you will perform for the class and invited guests. The performances will be scenes from class that you have developed further, or new scenes or monologues. You will have an opportunity to rehearse in class for the showcase; however, you will also need to practice outside of class.  \n\nFinal grades will take into account participation, preparation, and serious efforts to develop your performing potential. You will be evaluated more on your professional attitude than on any “natural talent” you have as an actor. Certainly, we do value greatly and admire those people who have special talents; however, talent or ability goes nowhere without serious engagement and commitment to developing that talent and without serious commitment to the other people you are working with.  With that in mind, here are some more specific points regarding what will be considered in evaluating your professional attitude in this class: \n—Your responsible, sincere, honest, and serious engagement in the class. \n—The work you put into the activities and the progress that you make. This will be reflected in the quality of your general classwork, scene study presentations, and final showcase, as well as your journal/portfolio.\n—Your willingness to work outside of class, both with scene partners and with the instructor, as necessary.\n\t—Your willingness to work with different people—on your own, without being assigned. \n—Your willingness to share in any responsibilities involved in making the class successful, including planning and organizing the showcase or final performance.  \n—Your efforts to be proactive in using your time in class. \n\n—Final Note: Please be very judicious about using phones or digital devices during any class or rehearsal, especially when you are in between working on a scene or are getting ready to perform.",
    "goals": [
        "To introduce students to fundamental approaches to acting and theater performance in English.",
        "To provide a hands-on environment for students to gain experience in performing theatrical scripts English.",
        "To provide intensive, often one-on-one, guided practice and coaching in oral English as it applies to stage performance; including practice in pronunciation, enunciation, intonation, rhythm, and vocal projection."
    ],
    "syllabus": "Sarah Brooks\n\nContact: [sjbkc@yahoo.com](mailto:sjbkc@yahoo.com)\n\nWeek 1\n\nIntroduction: Basic Tools for the Actor\n\nIntro to Actor’s Warm-up: Breath to Voice to Text\n\nThe Master List of Ingredients for Every Interaction on Stage\n\nIntro to Meisner repetition practice\n\nWeek 2\n\nScene Study 1—using Meisner approach\n\nWeek 3\n\nVoice work: Resonance Circle + Articulation\n\nExits and Entrances Exercise: A reason for entering, a reason for being there, a reason for exiting\n\nWeek 4\n\nStatus Exercises: High vs. Low Status + Status transfers / Tactics\n\nIntro to Scene Study guidelines\n\nMemorization tips and guidelines = “learning by heart”\n\nWeek 5\n\nVoice work: Volume/Projection—Giving and Receiving\n\nScene Study 2—with status shifts + marking “beats” in a script\n\nWeek 6\n\nGiven Circumstances—Script Analysis\n\nScene Study 2—continued\n\nWeek 7\n\nUta Hagen: First Destination Exercise: Doing vs. Emoting\n\nWeek 8\n\nConditioning Forces: Adding layers\n\nWeek 9\n\nIntro to Objectives and Obstacles/Resistance, Text and Subtext—Script analysis\n\nVoice work—Review and progress evaluation\n\nMidterm Journal/Portfolio Review\n\nWeek 10\n\nScene Study 3—Focusing on Objectives\n\nWeek 11\n\n“Actioning” (Verbal Actions)—Script analysis\n\nWeek 12\n\nScene Study 4—using Verbal Actions\n\n\\= Playing actions, not emotions or attitudes\n\nWeek 13\n\nScene Study 4, continued\n\nIntro to Monologues and auditioning\n\nShowcase planning\n\nWeek 14\n\nMonologue audition practice\n\nWeek 15\n\nMonologue audition presentation\n\nWeek 16\n\nShowcase planning and rehearsal\n\nVoice work—Review and progress evaluation\n\nWeek 17\n\nShowcase rehearsal\n\nWeek 18\n\nFinal Showcase\n\nHand in Final Portfolios\n\n**教學方法**(Teaching Methods)\n\nIn the first semester, students take part in Scene Study practice, plus exercises to develop voice, movement and stage interaction. Classes are conducted entirely in English and are organized in a discussion- and practice/rehearsal-style setting. Class time is spent doing various warm-up and acting exercises, discussing and practicing assigned scripts, rehearsing, developing creative ideas for staging, and performing in class.\n\nThe approaches used in the class are drawn from a variety of well-known acting methods, including Meisner and Actioning techniques and the methods of Uta Hagen, as well as basic Stanislavski concepts.\n\nAttendance is required. Activities/presentations missed must be made up. For each absence, 3-5 points will be deducted from your grade, depending on the material missed. More than 3 absences could result in failure.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "實驗/實作",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": "Class participation/preparation/professional attitude—30 %\nJournal and Portfolio—30 %\nReviews of outside performances—10%\nSelected scene study presentations and Final Showcase—30%\nAttendance is required. Activities/presentations missed must be made up. For each absence, 3-5 points will be deducted from your grade, depending on the material missed. More than 3 absences could result in failure."
        }
    ],
    "prerequisite": "",
    "general_core": []
}