{
    "year": 108,
    "term": 1,
    "name": "寫作指導（一）",
    "teachers": [
        "朱錫琴"
    ],
    "department": "LU21",
    "code": "ENU0237",
    "credit": 2,
    "serial": 1834,
    "group": "C",
    "quota": {
        "limit": 17,
        "additional": 20
    },
    "schedule": [
        {
            "day": 5,
            "from": 8,
            "to": 9,
            "campus": "本部",
            "classroom": "正304"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大一修習",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "This two-semester course is to help students develop their ability to properly express themselves in written English. In the first semester, students are expected to acquire the fundamentals of English paragraph-writing, including structure (topic sentence, controlling idea, support and conclusion), outline, organization and coherence. In the second semester, students will extend their one-paragraph writing skills to three-paragraph short-essay writing. In addition, this course aims to equip students with analytic writing competence in response to different scenarios. In particular, course assignments will cover intensive writing practices in different modes, including description, narration, process, cause-effect, comparison-contrast, definition, and classification.",
    "goals": [
        "This class is to help students improve their skills in writing English paragraphs/essays."
    ],
    "syllabus": "Guided Writing\n\n1.  **Goal**: \n\nThis course is designed to foster effective English written communication in an academic setting. By directing students’ attention to the rhetorical features of English language writing, students will be aware of the English academic writing conventions that are commonly practiced in academic communication and thus use the conventions in their English writing. To achieve this goal, academic texts will be analyzed so as to promote the awareness of global and local rhetorical strategies used by the authors. For writing practice, the primary focus will be on paragraph-level writing. Six major rhetorical, thinking patterns will be introduced and practiced, including exemplification, enumeration, narration, description, process, cause-effect; comparison-contrast, and problem-solution. Cohesive devices that cue for these patterns will also be attended to.\n\n**Content**:\n\nTextual strategies: identifying/analyzing audience, promoting audience awareness, setting writing goals/purposes, working on topic sentences, supporting topic sentences, establishing global and local coherence by making cohesive ties explicit, organizing ideas in enumeration, and maintaining paragraph unity by elucidating topic relevance.\n\nGeneral writing strategies: Generating ideas through brainstorming, surveying, and discussion in the classroom; outlining, drafting, getting feedback from peers, revising, and editing.\n\n1.  **Textbook**: Writing Clear Paragraphs\n2.  **Assignments**:\n\nA. To foster writing skills, there will be assignments on five topics for intensive work. Each topic will be done in a tri-weekly cycle: 1) first-draft (bring 3 hard copies to class for peer response on the content and organization, 2) second-draft, to be turned in on MOODLE for teacher-response one day (Thursday noon) before class time, and 3) final-draft posted on MOODLE.\n\nB. There will be two group projects. Students will collaborate and present them during the mid-term and the end-of-the-semester.\n\n\\*\\*\\*Students are required to collect the 3 drafts for each of the five assigned and turn them in for a final assessment.\n\n\\*\\*\\*Points will be deducted for late-ins.\n\n\\*\\*\\*Plagiarization will lead to a score of 0. \n\n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=4e79c31daa714bd094ecbef23f61ed34&fno=61302eb1d879496ab7493ecb359abf8b)\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=5bf3133ee7444a7bbbb267bead04dd6e&fno=88c2102ab87a4f15a2b2a6bd8e38ffb9)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "hnnn橋qerwewq兒外俄武器"
        },
        {
            "type": "討論法",
            "note": "人q"
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 40,
            "note": "tyyretqwe"
        },
        {
            "type": "期末考",
            "weight": 20,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 5,
            "note": "eryt"
        },
        {
            "type": "出席",
            "weight": 5,
            "note": ""
        },
        {
            "type": "成果展覽",
            "weight": 30,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}