{
    "year": 108,
    "term": 1,
    "name": "寫作指導（一）",
    "teachers": [
        "陳正賢"
    ],
    "department": "LU21",
    "code": "ENU0237",
    "credit": 2,
    "serial": 1835,
    "group": "D",
    "quota": {
        "limit": 17,
        "additional": 20
    },
    "schedule": [
        {
            "day": 5,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "正405"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大一修習",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "This two-semester course is to help students develop their ability to properly express themselves in written English. In the first semester, students are expected to acquire the fundamentals of English paragraph-writing, including structure (topic sentence, controlling idea, support and conclusion), outline, organization and coherence. In the second semester, students will extend their one-paragraph writing skills to three-paragraph short-essay writing. In addition, this course aims to equip students with analytic writing competence in response to different scenarios. In particular, course assignments will cover intensive writing practices in different modes, including description, narration, process, cause-effect, comparison-contrast, definition, and classification.",
    "goals": [
        "This class is to help students improve their skills in writing English paragraphs/essays."
    ],
    "syllabus": "Guided Writing for English Majors\n=================================\n\nCourse Description\n==================\n\nThe objective of this course is to help students develop their ability to express themselves in written English. By the end of the course it is expected that every student will be able to write a well-organized, and well-focused paragraph in English, using proper expressions and proper sentence structures. The course is chiefly conducted by means of actual writing, with the help of guided instruction and supplementary reading and reference materials.\n\nIt will mainly be held in a format of discussion forums, where students are expected to share their critical comments on textbook exercises and peer works. Specifically, this course has four emphases. First, basic structures of English paragraphs will be introduced with highlights on the organization of different paragraph styles. Second, several crucial grammar structures will be reviewed throughout the semester with a special focus on their pragmatic uses and discourse functions in writing. Third, students’ vocabulary should be properly built up through Writing Journals on a regular basis. Finally, corpus-based tools will be introduced as a facilitator for language reference in writing.\n\nMaterials\n=========\n\n*   Langan, John. (2010). _Paragraph Skills_ (Second Edition). New York, NY: McGraw-Hill International. The textbook  is available at 師大書苑. The address of the bookstore is Hoping East Road, Section 1, No. 182-3, 2F. The cost of the book is $450.\n\nRequirements and Rules\n======================\n\n1.  Please do not show up late. Pay respect to the class participants.\n2.  Please do not submit assignments late. No late assignments will be accepted.\n3.  Due dates will always be specified for each assignment submission.\n4.  Please follow the format requirements for each writing assignment.\n5.  For each writing assignment, students are encouraged to resubmit their assignments if their initial grade is lower than A-- (but with substantial revisions!)\n6.  Attendance is very important. Always inform me in ADVANCE for legitimate leaves.\n\nPortfolio – _Writing Journals_\n==============================\n\nIn this semester, you are expected to keep writing journals by watching TED Talks and writing summaries/critiques. You need to:\n\n·Watch a TED Talk that you are interested in.\n\n·Write a summary paragraph, describing the main content of the talk. (NB: Be careful of plagiarism!)\n\n·Write a critique paragraph, evaluating the messages in the talk.\n\nThe minimum number of the talks required for the writing journals is SIX per semester. You can always do more if you want. All journals have to be submitted online.\n\nGrading Policies\n================\n\n*   Writing Assignments: 70%\n*   Portfolio: 20%\n*   Class participation: 10%\n\nTentative Schedule\n==================\n\n**Week**\n\n**Date**\n\n**Topics**\n\n**Preview**\n\n1\n\n0913\n\n**Holiday**\n\n2\n\n0920\n\nIntroduction\n\n3\n\n0927\n\nWriting Basics\n\nWriting Process\n\nCh1\n\n4\n\n1004\n\nFour Steps for Writing\n\nFour Steps for Revision\n\nCh2-3\n\n5\n\n1011\n\nFour Steps for Writing\n\nFour Steps for Revision\n\nCh2-3\n\n6\n\n1018\n\n**Holiday**\n\n7\n\n1025\n\nExemplification\n\nCh4\n\n8\n\n1101\n\nExemplification\n\nCh4\n\n9\n\n1108\n\n**Midterm**\n\n10\n\n1115\n\n**Sports Day**\n\n11\n\n1122\n\nNarration\n\nCh5\n\n12\n\n1129\n\nNarration\n\nCh5\n\n13\n\n1206\n\nDescription\n\nCh6\n\n14\n\n1213\n\nDescription\n\nCh6\n\n15\n\n1220\n\nProcess\n\nCh7\n\n \n\n16\n\n1227\n\nProcess\n\nCh7\n\n17\n\n0103\n\nRecap\n\n18\n\n0110\n\n**Final Exam**",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 60,
            "note": "Writing Assignments"
        },
        {
            "type": "期中考",
            "weight": 20,
            "note": "In-class Writing"
        },
        {
            "type": "期末考",
            "weight": 20,
            "note": "In-class Writing"
        }
    ],
    "prerequisite": "",
    "general_core": []
}