{
    "year": 108,
    "term": 1,
    "name": "高級寫作（一）",
    "teachers": [
        "孔繁偉"
    ],
    "department": "LU21",
    "code": "ENU0289",
    "credit": 2,
    "serial": 1886,
    "group": "C",
    "quota": {
        "limit": 15,
        "additional": 20
    },
    "schedule": [
        {
            "day": 5,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "正304"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大三修習◎必須先修過【ENU0287  中級寫作（一）】、【ENU0288  中級寫作（二）】",
    "form_s": "3",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "In Advanced Writing, the course aims to integrate writing skills students learned in previous two years with their knowledge of a topic, subject, or theme in order to prepare students for future career. Creative use of different types of essays will be expected to be contextualized in different fields, including exam-related, work-related, or research paper related fields. Language-based writing can also be integrated with different modes of communication, such as pictures, audios, webpages as an individual or group project.",
    "goals": [
        "To help students rehearse skills in various modes of writing",
        "Help students build a good sense of the difference between smart, sophisticated, quality writing and bland, hackneyed writing",
        "Students are expected to integrate writing techniques with their knowledge of the topic/subject"
    ],
    "syllabus": "**I. COURSE OVERVIEW**\n\nThis course requires more advanced rhetoric and cognitive skills than Intermediate Writing. It is also larger in size, requiring a higher word count in student writing. New challenges include genre analysis, synthesizing various viewpoints, and learning how to properly quote, paraphrase, and summarize sources. Genres studied and to be used by students in their writing include argumentation and genre analysis besides the ones covered before. Required writing also includes workbook exercises, reading reflections, simulated writing quizzes, and group writings. \n\n1.2.1 Advanced English Knowledge:\n\nTo acquire the basic and advanced knowledge of the English language, including punctuation, wording, grammar, and discourse features. \n\n1.2.6 Knowledge and skills of writing in English:\n\nTo acquire knowledge and norms of English basic writing, and to write effectively in appropriate styles of English.\n\n1.4.3 Written communication: \n\nTo write with correct spelling, punctuation, and grammar; to display coherence and fluency; to write in right styles (informal or formal memorandum, report, etc.) and use the format file; to display the ability of practical, academic and creative writing in English. \n\n1\\. Demonstrate literacy with English language including punctuation, wording, grammar, and discourse features. \n\n2. Demonstrate sufficient knowledge of English syntactic structure with subordination and coordination, parallel structure, and topic flow.\n\n3\\. Demonstrate elements of English proficiency with cohesion, moving from clarity on the sentence-level to unity on the paragraph-level. Recognize and appropriately use rhetorical and organization patterns such as classification and division, definition, and cause and effect, etc. for paragraph and essay development.\n\n4\\. Demonstrate skills pertaining to all stages of the writing process, including Pre-writing, Drafting, Revising, and Proofreading.\n\n5\\. Demonstrate and utilize rhetorical and organization patterns learned to produce essays with ideas and/or arguments independently derived from consulting printed and /or electronic documents, of from using the internet and library for information.    \n\n1.3.3 Skills of independent research: To gain the ability of literature retrieval and processing, including the ability of consulting printed and electronic documents, of using the internet and library for information, of sorting and editing effective information, of examining the quality and reliability of the information, of extracting the important and innovative content and finding the research questions and references usable to the research. \n\n2.1.1-2.1.3 Integrative thinking skills: To discover problems, to analyze problems; to solve problems. \n\n6\\. Identify, analyze, and formulate essays with clear and original thesis statements, adequate supporting evidence, and forceful conclusions that summarize the essay contents and further support the thesis.\n\nWeekly schedule: \n\n**Weekly schedule:** \n\nWeek 1: Orientation\n\nWeek 2: Course overview and introduction\n\nWeek 3: Chinglish workshop\n\nWeek 4: _School Meeting (no class)_\n\nWeek 5: Expository essays I \n\nWeek 6: Expository essays II\n\nWeek 7: CV workshop \n\nWeek 8: Classification essays I\n\nWeek 9: Classification essays II\n\nWeek 10: _Sports Day (no class)_\n\nWeek 11: CV workshop\n\nWeek 12: Process essays I\n\nWeek 13: Process essays II\n\nWeek 14: CV workshop \n\nWeek 15: Cause and effect essays I\n\nWeek 16: Cause and effect essays II\n\nWeek 17: Final evaluation and paper due",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Weekly lecture"
        },
        {
            "type": "討論法",
            "note": "Theme-based discussion"
        },
        {
            "type": "合作學習",
            "note": "Group discussion"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "Writing tasks (10% for each)"
        },
        {
            "type": "期中考",
            "weight": 30,
            "note": "Midterm"
        },
        {
            "type": "期末考",
            "weight": 40,
            "note": "Final paper"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Attendance"
        }
    ],
    "prerequisite": "◎必須先修過【ENU0287  中級寫作（一）】、【ENU0288  中級寫作（二）】",
    "general_core": []
}