{
    "year": 108,
    "term": 1,
    "name": "中級寫作（一）",
    "teachers": [
        "多德"
    ],
    "department": "LU21",
    "code": "ENU0287",
    "credit": 2,
    "serial": 1862,
    "group": "D",
    "quota": {
        "limit": 15,
        "additional": 20
    },
    "schedule": [
        {
            "day": 5,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "誠304"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大二修習◎必須先修過【ENU0237  寫作指導（一）】、【ENU0238  寫作指導（二）】",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "This two-semester second-level writing course aims to guide students to (1) practice basic academic writing convention, (2) sharpen analytical essay writing skills, (3) enhance essay coherence and cohesion, and (4) develop a clear writing style. The course will familiarize students with proper academic language and convention to compose five-paragraph short essays on the following five modes of writing: argumentation, definition, causal analysis, process analysis, and comparison and contrast. In addition to the different analytical modes of writing, the course will introduce students to organizing and editing strategies to fine-tune their essay writing. On the one hand, students will learn how to apply principles of coherence and cohesion in their writing to maintain consistent claims and to offer logical transitions at the levels of ideas, sentences, and paragraphs. On the other hand, students will learn how to develop a clear writing style by avoiding common sentence errors and improving concision and specificity in word choice and sentence formation.",
    "goals": [
        "To help students student develop their ability to express themselves in writing essays in English",
        "To help students write various kinds of essays in a well-organized manner"
    ],
    "syllabus": "**Objective**\n\nTo improve the fundamental skills needed for writing well-organized essays with different purposes and strategies on a variety of topics. Students will complete four substantial essays and numerous shorter pieces of writing in class.\n\n  \n\n**Schedule**\n\n  \n\n1\\. Introduction and diagnostic writing tasks\n\n2\\. Analysing written texts: overall structure and the structure of paragraphs\n\n3\\. Analysing written texts: word choice, collocations, and other issues\n\n4\\. The process of writing: brainstorming and outlines\n\n5\\. The process of writing: drafts and paragraphs\n\n6\\. The descriptive essay\n\n7\\. The descriptive essay\n\n8\\. Clinic\n\n9\\. The narrative essay\n\n10\\. The narrative essay\n\n11\\. Clinic\n\n12\\. The expository essay\n\n13\\. The expository essay\n\n14\\. Clinic\n\n15\\. Writing a review\n\n16\\. Writing a review\n\n17\\. Clinic\n\n18\\. Wrap-up and final submissions\n\n  \n\n**Class Activities**\n\nLecturing / Writing / Discussions / Clinics\n\n  \n\n**Evaluation**\n\nClass attendance: 10%\n\nClass participation: 20%\n\nWritten assignments: 70%\n\n  \n\n**Course Materials**\n\nMaterials selected by the instructor will be provided. Students will also be expected to self-select material for written assignments.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 70,
            "note": "Written assignments"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        }
    ],
    "prerequisite": "◎必須先修過【ENU0237  寫作指導（一）】、【ENU0238  寫作指導（二）】",
    "general_core": []
}