{
    "year": 108,
    "term": 1,
    "name": "美國文學",
    "teachers": [
        "路愷宜"
    ],
    "department": "LU21",
    "code": "ENU0226",
    "credit": 3,
    "serial": 1901,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 2,
            "from": 3,
            "to": 5,
            "campus": "本部",
            "classroom": "誠402"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大三◎限乙班修習",
    "form_s": "3",
    "classes": "2",
    "dept_group": "",
    "hours": 3,
    "description": "This course is a one-semester introduction to the history of American literature, surveying material from the discovery period through the mid-nineteenth century. The course takes a chronological approach to the literary material, with discussion of the historical circumstances and social and intellectual trends in each period. We will cover a variety of genres: history, sermon, political pamphlet, lyric, short story and novel.",
    "goals": [
        "To survey American literature from the discovery period through the mid-nineteenth century",
        "To cover a variety of genres: history, sermon, political pamphlet, lyric, short story and novel"
    ],
    "syllabus": "American Literature  \nDepartment of English, NTNU, Fall 2013\n\nCourse description  \nThe course offers and overview of and introduces students to canonical American literary voices, from the early beginnings to the Second World War. This historical period covers roughly the Puritan period, the Enlightenment, American Renaissance and the modern era. We will explore how a variety of writers responded to, imagined, and in a sense created what is seen as the “American” experience. The lectures and class discussions will consider the historical, cultural and political movements that contextualize these voices as well as the literary history that informs their work. While we will cover some historical background to contextualize the texts we explore, the focus will be on the textual artefacts and on learning techniques of literary analysis.\n\nObjectives  \nThe main goals of the lectures are the following:  \n1. To understand the development and major themes of American literature.  \n2. To give a critical reading of a representative set of classic fictional and poetic works and a comparative study of the cultural milieu of each work.  \n3. To draw the connections and differences between authors, styles, and thematic concerns.\n\nTextbooks  \nThe Norton Anthology of American Literature. Shorter Eight edition. Ed. Nina Baym. New York: Norton, 2013 (Bookman)  \nF. Scott Fitzgerald, The Great Gatsby (Bookman)  \nHandouts on Moodle [http://moodle.ntnu.edu.tw/](http://moodle.ntnu.edu.tw/)\n\nCourse requirements  \nStudents are expected to be familiar the required readings prior to the class discussion. Students will be graded on the basis of active participation in the class discussions, reports on moodle (20%). Midterm test 40%, final test 40%. Failure to take the mid and final test, to attend the classes, take quizzes and posts on moodle (ten reports on moodle and four responses to colleagues’ posts) will result in the student’s inability to pass the exam. The posts on moodle should be around 200 words in length and could range from your thoughts on the assigned readings, the answer to the study guides posted by the instructor or a close reading of a certain paragraph.\n\nAcademic Dishonesty  \nAcademic dishonesty is defined as but not limited to plagiarism, cheating, misrepresenting one’s work, and forging documentation. Academic dishonesty is a serious matter. I am savvy and vigilant in detecting students who use unattributed sources in their reports on moodle, citing references without indicating the sources or “collaborate” with fellow students during exams. Any student who plagiarizes or cheats will fail the course.\n\n  \nPart I: Beginnings to 1800\n\n9/9 Week 1 Introduction and General Background.\n\n9/16-9/23 Week 2-3 Visions of the New Word. The Puritan Legacy  \n• Christopher Columbus, “Letter to Luis de Santangel,” “Letter to Ferdinand and Isabella,” 24-28  \n• John Smith, “A Description of New England” 69-72  \n• John Winthrop, “A Model of Christian Charity” 90-102  \n• John Bradford, “Of Plymouth Plantation” 74-91  \n• Anne Bradstreet “The Prologue,” 111-112 “The Author to Her Book” 119-120, “To My Dear Loving Husband” 120\n\n9/30 Week 4 The Tradition of American Autobiography. The Enlightenment  \n• Mary Rowlandson, “A Narrative of the Captivity” 127-143  \n• Jonathan Edwards, “Personal Narrative” 179-189  \n• Benjamin Franklin “The Autobiography” part 1 (excerpts)\n\nPart II: 19th Century American Literature\n\n10/7 Week 5   \n• Washington Irving, “Rip Van Winkle” 470-482  \n• James Fenimore Cooper “The Last of the Mohicans” 485-491.\n\n10/14 Week 6  \n• R. W. Emerson, “Nature,”508-536, “Self Reliance” “549-566”  \n• Walt Whitman, “Preface to The Leaves of Grass” (excerpts), “One’s –Self I Sing” 1024,  “Song of Myself” (excerpts)  \n• H.D. Thoreau, “Where I Lived and What I Lived for,” 901-910.\n\n10/21 Week 7  \n• Nathaniel Hawthorne, “Young Goodman Brown,” 619-629, “The Minister’s Black Veil” 636-645.  \n• Edgar Allan Poe, “The Raven” 688-691, “Annabel Lee” 691, “The Purloined Letter” 724-737.\n\n10/28 Week 8  \n• Herman Melville, “Bartleby the Scrivener” 1102-1128.  \n• Emily Dickinson, selected poems, 49, 288, 249, 341, 712, 754  \n• Frederick Douglass, Narrative of the Life of Frederick Douglass (excerpts)\n\n11/4 Week 9 Midterm\n\n11/ 11 Week 10 American realism  \n• Mark Twain, The Adventures of Huckleberry Finn (excerpts)\n\n11/18 Week 11 Realism and Naturalism  \n• Henry James, Daisy Miller, 1511-1550, “The Art of Fiction,” 1738-1740  \n• William Dean Howells, “Novel Writing and Novel Reading,” 1735- 1738\n\n11/25 Week 12 African American Voices, Native American Voices . Women’s Voices  \n• W. E. B. Du Bois, The Souls of Black Folk , Chapter I: “Of Our Spiritual Strivings,” 1717-1722,  \n• Zitkala Ša (Gertrude Simmons Bonin), “Impressions from an Indian Childhood,” 1825-1831  \n• Charlotte Perkins Gilman, “The Yellow Wall-Paper,” 1699-1682  \n• Kate Chopin, “Desiree’s Baby,” 1605-1609.\n\nPart III: 1914-1945  \n12/2-12/9 Week 13-14  \nModernism: Fiction I  \n• F. Scott Fitzgerald, The Great Gatsby\n\n12/16 Week 15  \nModernism: Fiction II  \n• Ernest Hemingway, “The Snows of Kilimanjaro,” 2205-2221  \n• William Faulkner, “Barn Burning, ” 2188-2200\n\n12/23 Week 16  \nModern American Poetry  \n• Ezra Pound, “A Pact,” 1974, “In a Station of the Metro,” 1974, “Portrait d’une Femme,” 1973  \n• William Carlos Williams, “The Red Wheelbarrow,” 1968, “This Is Just to Say,” 1968, “Portrait of a Lady,” 1964, “Spring and All,” 1965, “The Dance,” 1969  \n• Robert Frost, “After Apple-Picking,” 1918 “The Road not Taken,” 1919, “Stopping by Woods on a Snowy Evening,” 1923 “Design,” 1924  \n• Wallace Stevens, “The Snow Man,” 1952, “The Emperor of Ice-Cream,” 1953, “Disillusionment of Ten O’clock,” 1954 “On Modern Poetry,” 1960.\n\n12/30 Week 17  \nVoices of the Harlem Renaissance  \n• Zora Neale Hurston, “How It Feels to be Colored Me,” 2124-2127.  \n• Langston Hughes, “The Negro Speaks of Rivers,” 2222 “Mother to Son,” 2223,  “I, Too,” 2223, “Song for a Dark Girl,” 2226 “The Weary Blues,” 2224,  “Democracy,” 2227.  \n• Claude McKay, “If We Must Die,” 2112,  “America,” 2112  \n• Countee Cullen, “Heritage,” 2241-2244\n\n1/4 Week 18 Final exam",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}