{
    "year": 108,
    "term": 1,
    "name": "英語教學實習（二）（教）",
    "teachers": [
        "曾俊傑"
    ],
    "department": "LU21",
    "code": "ENUE210",
    "credit": 2,
    "serial": 1916,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 1,
            "to": 4,
            "campus": "本部",
            "classroom": "正304"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大四修習◎必須先修過【ENUE110  英語教學實習（一）（教）】",
    "form_s": "4",
    "classes": "2",
    "dept_group": "",
    "hours": 4,
    "description": "Serving as a bridge between previous ELT coursework and actual, situated teaching, this course is designed to offer students an opportunity to observe, explore, and implement effective teaching ideas. It covers in-class micro-teaching, classroom observation, and practice teaching at a high school. The major activities in the first semester include analysis and discussion of teaching videos, visits to schools located in the Taipei area, and most importantly, in-class micro-teaching. For the micro-teaching, each student is required to write a lesson plan and then teach for 30 minutes, with all his/her classmates as students and observers. The micro-teaching is followed by a discussion session led by the instructor, with an aim to help improve students’ teaching techniques. To prepare students for the micro-teaching and practice teaching as well, a review of lesson planning and an introduction to procedures that may help teacher development are given at the beginning of the first semester. The second semester covers as its main activities visits to schools located outside the Taipei area, classroom observation, and practice teaching in a high school. In addition to work related to the micro-teaching and practice teaching, students are required to write various reports and participate in classroom discussion and evaluation. Outside the class, students need to study the assigned chapters in groups, brainstorm for its implications and write a one-page (or longer) reflection on each chapter.",
    "goals": [
        "designed to offer students an opportunity to observe, explore, and implement effective teaching ideas."
    ],
    "syllabus": "Serving as a bridge between previous ELT coursework and actual, situated  \nteaching, this course is designed to offer students an opportunity to observe, explore, and implement effective teaching ideas. The major activities include attending the arranged talk, visiting schools located in Taipei Area, discussing the written lesson plans, and most importantly, in-class micro-teachings. For the micro-teaching, students will be assigned to groups and are required to study the teaching materials, write up the lesson plan as a group, and meet with the instructor to discuss the lesson plan and revise it for the teaching practice. Each student will teach for 20 minutes with all his/her classmates as students and observers. The micro-teaching is followed by a discussion session led by the instructor, with an aim to help improve students’ teaching techniques.  \n  \n  \n1 Orientatio; lesson plans  \n2  Observation: Senior high school  \n3 Talk on CM language teaching  \n4 Teaching demo (group 1A) grade 10 (龍騰I)  \n5 Teaching demo (group 1B) grade 10 (龍騰II)  \n6 Spring Break  \n7 Teaching demo (group 2A) grade 11 (三民I)  \n8 Teaching demo (group 2B) grade 11 (三民II)  \n9 Teaching demo (group 3A) grade 11 (遠東I)  \n10 Teaching demo (group 3B) grade 11 (遠東II)  \n11 Observation: Junior high school  \n12 Teaching demo (group 2A) grade 7 (康軒)  \n13  Teaching demo (group 3A) grade 7 (朗文)  \n14 Teaching demo (group 1A) grade 8 (佳音I)  \n15 JunTeaching demo (group 1B) grade 8 (佳音II)  \n16 Teaching demo (group 2B) grade 8 (何嘉仁I)  \n17 Teaching demo (group 3B) grade 8 (何嘉仁II)  \n18 Portfolio due and individual conferences  \n  \nRequirements  \n1.achool visit and Observation reports: We will visit two schools and the students will be required to hand in two observation reports a week after the visit.  \n2.Micro-teaching:Each student will be required to teach TWICE in class-using the first time the designated junior high school text book and the second time the designated senior high school text book. For the micro-teaching, the students will be required to write up a lesson plan as a group, hand it in two weeks before the teaching and meet with the instructor for discussion one week before the teaching. Students will also be required to revise the lesson plan based on the discussion and hand in the revised version on the day of the micro teaching.  \n3\\. Portfolio: At the end of the semester, the students will be required to hand in their portfolio, which will include two observation reports, the lesson plans ( the original draft and the revised version), the observation sheets for the micro-teaching done by other groups of the class and two teaching reflections on their own teaching.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": "1.\tattendance and participation 10% 2.lesson plans 60% 3.observation reports 10% 4.observation sheets 10% 5.teaching reflections 10%"
        }
    ],
    "prerequisite": "◎必須先修過【ENUE110  英語教學實習（一）（教）】",
    "general_core": []
}