{
    "year": 107,
    "term": 1,
    "name": "英文（一）",
    "teachers": [
        "吳曉虹"
    ],
    "department": "CU",
    "code": "00UB742",
    "credit": 2,
    "serial": 308,
    "group": "",
    "quota": {
        "limit": 35,
        "additional": 0
    },
    "schedule": [
        {
            "day": 5,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "正405"
        }
    ],
    "programs": [],
    "comment": "教育學院、營養科學學位學程、音樂系、表演藝術學士學位學程、企管系、東亞系、華語系(應華組)、競技系一年級(能力分班)",
    "restrict": "◎第一階段需人工加選◎第二階段需人工加選◎加退選階段需人工加選",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "共同科英文（一）課程為一學年課程，每學期兩學分，係為非英語系學生所開設的課程。目標在幫助大一學生活用中學時期所累積的英語知識，提昇英語聽、說、讀、寫整體的溝通能力。為達此",
    "goals": [
        "增進學生英語溝通表達能力",
        "透過參與課程活動促進團隊精神",
        "透過多面向英語閱讀促使學生了解多元文化，拓展學生國際化視野",
        "透過課堂討論培養批判精神",
        "提升學生英語學習動機及自主學習興趣"
    ],
    "syllabus": "This course aims to develop students' English proficiency.  Students are expected to increase their reading and writing literacy along with listening comprehension and communication performance through a variety of in-class and out-of-class activities.\n\nCourse requirements\n\n**1\\. Textbook**\n\nKeynote 4\n\n**2\\. Class Participation**\n\nPunctual attendance in class is REQUIRED**.** Though you can learn from the readings, you can learn the most from interacting/practicing with others and actively participating in in-class activities. Your participation in class will be evaluated too. Absence from a class is no excuse for not knowing the assignments/exams and what has been covered in that class.\n\n**3\\. Lab Visits**\n\nEvery student must visit and make use of the labs this semester. \n\n**4\\. Group Presentation**\n\nStudents will form small groups and present on a topic of your choice.\n\nFor the presentation, you MUST proceed in English and be on time for the presentation. If you miss your presentation, no make-up presentation is possible.\n\n**5\\. Midterm and Final Exam**\n\nAbsence from a class is no excuse for not knowing the assignment/exam. No make-up exam is allowed. Cheating on exams is absolutely forbidden.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}