{
    "year": 107,
    "term": 1,
    "name": "英文（一）",
    "teachers": [
        "郭儀風"
    ],
    "department": "CU",
    "code": "00UB718",
    "credit": 2,
    "serial": 284,
    "group": "",
    "quota": {
        "limit": 35,
        "additional": 0
    },
    "schedule": [
        {
            "day": 5,
            "from": 1,
            "to": 2,
            "campus": "本部",
            "classroom": "正202"
        }
    ],
    "programs": [],
    "comment": "文學院（英語系除外）、藝術學院、科技學院、車能學位學程、體育系、台文系、華語系(國華組)一年級 (能力分班)",
    "restrict": "◎第一階段需人工加選◎第二階段需人工加選◎加退選階段需人工加選",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "共同科英文（一）課程為一學年課程，每學期兩學分，係為非英語系學生所開設的課程。目標在幫助大一學生活用中學時期所累積的英語知識，提昇英語聽、說、讀、寫整體的溝通能力。為達此",
    "goals": [
        "增進學生英語溝通表達能力",
        "透過參與課程活動促進團隊精神",
        "透過多面向英語閱讀促使學生了解多元文化，拓展學生國際化視野",
        "透過課堂討論培養批判精神",
        "提升學生英語學習動機及自主學習興趣"
    ],
    "syllabus": "Freshman English for Non-English Majors (Higher-Intermediate, Fall 2018) 8:10~10:00 & 10:20-12:10, Friday Instructor: Cannon Y. Kuo Email: cannonkuo@hotmail.comOffice: N/A Office Hours: by appointment Course Description: This course is designed to support students in their use of English language in academic context. Through intensive and extended reading of text materials, engagement in production activities, and practice at the Self-Learning Center, students are expected to acquire communication strategies for reading, listening, speaking, and writing, develop fluency and autonomy, and improve their critical thinking skills. Textbook: Daise, D., Norloff, C., & Carne, P. (2011). Q: Skills for Success: Reading and Writing, 4. New York: Oxford University Press. ($ 553; Available at 師大書苑; 02-83695556~8;台北市和平東路1段182-3號2樓) Articles for required reading: Unit 1, Reading 1: We All Need a Hero Unit 2, Reading 1: So Much Dead Space Unit 3, Reading 1: The Good Teern Unit 4, Reading 1: Can Climate Make Us Sicker Unit 5, Reading 1: Two Styles of Writing Grading Policy: Attendance & Participation 20% Mid-term Presentations 20% Final Presentation 20% Class Performances 10% Self-learning 10% Lexile Reading 10% Attitude 10% Classroom policies: 1. Be punctual! 2. Do NOT sleep or phubbing cellphone in class. 3. Raise your hand and state your name/department in Chinese if you have something to say. Class Performance(Quality Talk): 1. Prepare what you want to share before class. 2. Your sharing will be based on your contents, grammar, coherence and pronunciation. 3. No sharing, no Class performance grades. Mid-term/Final Presentations: 1. Select a topic you are interested in. This can be something related to your major, your favorite books or movies. 2. Your presentation will be limited to three minutes. You need to organize your presentation in a logical order or reasonable way. 3. PPT slides will be required. 4. You will be graded on the 1) your fluency (do you have enough practice?); 2) your grammar/ pronunciation (do you express yourself correctly/ understandably?); 3) your content (does your content interesting/ appealing?). 5. NO reading from the scripts or notes! If you do, you will be forbidden to continue and score ZERO on oral presentation. 6. Turn in your presentation script the designated day. NO late work will be accepted! 7. Follow the presentation instructed structure or low grades. WeekDateUnit/ ContentActivities/ Assignments 1. 09/14Orientation/ GroupingIntro Presentation structure 2. 09/21Unit 1 We all need a heroClass discussion(Quality Talk) 3. 09/28Unit 1 We all need a heroClass discussion(Quality Talk) 4. 10/05Preparing your mid-term presentationHand in your script next meeting 5. 10/12Unit 2 So much dead space Class discussion(Quality Talk) 6. 10/19Unit 2 So much dead spaceClass discussion(Quality Talk) 7. 10/26Mid-term presentationClass discussion(Quality Talk) 8. 11/02Mid-term presentationClass discussion(Quality Talk) 9. 11/9Mid-term presentationClass discussion(Quality Talk) 10. 11/16Off (Sports’ Day) 11. 11/23Unit 3 The Good TeenClass discussion(Quality Talk) 12. 11/30Unit 3 The Good TeenClass discussion(Quality Talk) 13. 12/07Unit 4 Two Styles of WritingClass discussion(Quality Talk) 14. 12/14Unit 4 Two Styles of WritingClass discussion(Quality Talk) 15. 12/21Final Presentation Class discussion(Quality Talk) 16. 12/28Final Presentation Class discussion(Quality Talk) 17. 01/04Final Presentation Class discussion (Quality Talk) 18. 01/11Feedback SessionClass discussion (Quality Talk)",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 10,
            "note": "Self-learning"
        },
        {
            "type": "期中考",
            "weight": 20,
            "note": "Presentation"
        },
        {
            "type": "期末考",
            "weight": 20,
            "note": "Presentation"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 20,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 10,
            "note": "Lexile Reading"
        },
        {
            "type": "其他",
            "weight": 10,
            "note": "Attitude"
        }
    ],
    "prerequisite": "",
    "general_core": []
}