{
    "year": 107,
    "term": 1,
    "name": "英文（三）：文學與文化",
    "teachers": [
        "蘇君縈"
    ],
    "department": "CU",
    "code": "00UB904",
    "credit": 2,
    "serial": 332,
    "group": "E",
    "quota": {
        "limit": 35,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "正301"
        }
    ],
    "programs": [],
    "comment": "◎ 建議修習級數 : 進階級、中高級。中初級、初級可自行選擇是否修習",
    "restrict": "◎必須先修過【英文(一)】◎必須先修過【英文(二)】",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "閱讀文學及文化文本，欣賞並了解英語文多變的風貌與魅力；並透過英文聽說讀寫練習，認識與討論文學和文化議題。",
    "goals": [
        "增進學生英語溝通表達能力",
        "透過參與課程活動促進團隊精神",
        "透過多面向英語閱讀促使學生了解多元文化，拓展學生國際化視野",
        "透過課堂討論培養批判精神",
        "提升學生英語學習動機及自主學習興趣"
    ],
    "syllabus": "**Literature and Culture**\n\n                                            **Spring Semester 2012**\n\nInstructor: Pai Su-yu                                              Office: Cheng 708\n\nEmail: [Sue\\_10610@yahoo.com](mailto:Sue_10610@yahoo.com)                            Office Hours: Thurs. 10:30 to noon\n\n                                                                                                      and by appointment\n\nPhone: Office: 7734-1803\n\n            Home:  2666-9271\n\n**Literature and Culture Course Description**\n\nAn introductory course to provide students with the understanding of world literature and culture with respect to classic and modern critical considerations; basic concepts such as the definition of literature and culture, literary genres and themes, the reading of literary and non-literary texts, cross-disciplinary approaches in the studies of literature and culture will be presented.\n\nIn-depth discussions will be conducted on issues that are of historical significance or critical to contemporary situations concerning culture or topics that are important to the efforts of global environments and cultures.\n\n**Overview of Course Goals**\n\n1.  To assist students in understanding basic literary and cultural concepts, terms and to provide opportunities to students to read, discuss and further explore areas of newly acquired interest.\n2.  To introduce students to a literature and cultural readings, using a thematic focus.\n3.  To provide students with learning situations and activities that further utilize and refine their proficiency in the 4 skill areas in reading, writing, speaking and listening.\n4.  To give students learning opportunities to become independent learners, using English, inside and outside of the classroom environment.\n5.  To allow students opportunities to plan and monitor their individual learning progress, with the instructor’s guidance.\n\n**Attendance**\n\nIn order to learn, participation is an important key for your success. Therefore, it is important to attend class. If you have a conflict, NOTIFY me or the Department of English, well BEFORE the class begins. Arrangements for any missed classes must be made with the instructor within three days of the missed class. Exceptions can always be made in the case of emergencies.\n\n**Assessment Guidelines**\n\n1\\. Class assignments                                              20%\n\n2\\. Quizzes, in-class activities                                 20%\n\n3\\. Attendance/participation                                    10%\n\n4\\. Evaluations: midterm and final                          40% \n\n5\\. Learning portfolio                                              10%",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": ""
        }
    ],
    "prerequisite": "◎必須先修過【英文(一)】◎必須先修過【英文(二)】",
    "general_core": []
}