{
    "year": 107,
    "term": 1,
    "name": "英文（三）：教育英文",
    "teachers": [
        "程玉秀"
    ],
    "department": "CU",
    "code": "00UB906",
    "credit": 2,
    "serial": 335,
    "group": "B",
    "quota": {
        "limit": 35,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 1,
            "to": 2,
            "campus": "本部",
            "classroom": "樸402"
        }
    ],
    "programs": [],
    "comment": "◎ 建議修習級數 : 進階級、中高級。中初級、初級可自行選擇是否修習",
    "restrict": "◎必須先修過【英文(一)】◎必須先修過【英文(二)】",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本課程主要藉由主題人物探討全球教育創新議題,透過「創新分組」與「學習型團隊」,提升學生的創新協作能力,並在學期中和學期末以「語言劇場」同步引導英文程度不同的學生合作學習。課程將融入優質對話的體驗學習,整學期學生將在英文演說、敘說、說故事、簡報或新聞報導的學習,以「同步聽說」法和「全像多維」學習法不斷演練,從各自不同的程度快速提升英文聽說讀寫的整合運用能力。",
    "goals": [
        "1. 增進學生英語溝通表達能力 2. 透過參與課程活動促進團隊精神 3. 透過多面向英語閱讀促使學生了解多元文化，拓展學生國際化視野 4. 透過課堂討論培養批判精神 5. 提升學生英語學習動機及自主學習興趣"
    ],
    "syllabus": "The main goal of this course is to enhance non-English majors’ English abilities to adequately comprehend and properly convey ideas on education through exposure to authentic materials (such as TED Talks, videos from YouTube, and newspaper articles, etc.) and performing communicative language tasks (such as discussion, response writing, and oral presentation). The course is organized around four themes related to education. Based on the materials provided, students will reflect upon their own educational experiences, probe for answers to questions raised by the teacher or themselves, and articulate their thoughts about teaching, learning, and schooling. Students are expected to learn education-related English and broaden their knowledge and views about education at the same time.\n\n**Tentative Schedule**\n\n**Week**\n\n**Date**\n\n**Topics**\n\n**Theme #1: What Is Education and What Is Education for?**\n\n1\n\n09/13\n\n Orientation\n\n2\n\n09/20\n\n· YouTube: Five Main Reasons Why Education Is Important\n\n· Education and Training in a Changing World: What Skills Do We Need? (UNESCO). \n\n· What is Education? (A **blog post** by Dr. Marilyn Price-Mitchell)\n\n3\n\n09/27\n\n· YouTube: The Right to Learning Should Be Given to Any Child (Malala Yousafzai) \n\n4\n\n10/04\n\n· Ted Talks: Every Kid Needs a Champion (Rita Pierson)\n\n5\n\n10/11\n\n· Ted Talks: How to Escape Education’s Death Valley (Sir Ken Robinson)\n\n\\* **Plan for the mid-term report**.\n\n**Theme #2: Which Countries Have the Best Education?**\n\n6\n\n10/18\n\n· YouTube: 5 Reasons Why Finland Is a Global Education Leader\n\n· YouTube: Finland’s Formula for School Success (Education Everywhere Series)\n\n7\n\n10/25\n\n· YouTube: Which Countries Have the Best Education?\n\n· Pisa Tests: Singapore Top in Global Education Rankings (BBC News)\n\n· YouTube: Singapore’s 21st-Century Teaching Strategies (Education Everywhere Series)  \n\n8\n\n11/01\n\n· Striving for Excellence: Do the Shanghai Lessons Have More to Offer Our Schools?  (A **commentary text** by Paul W. Bennett)\n\n· Ted Talks: What the Finnish Education Systems Could Learn From Asia (Hannamiina Tanninen)  \n\n9\n\n11/08\n\n**No Class: Conduct interviews with different stakeholders on issues related to what we have discussed so far and turn it into a news report.**\n\n10\n\n11/15\n\n**Midterm: Presentations of News Reports**\n\n**Theme #3: Technology in Teaching and Learning**\n\n11\n\n11/22\n\n· YouTube: The Hole in the Wall Project (CNN report)\n\n· Ted Talks: Build a School in the Cloud (Sugata Mitra)\n\n12\n\n11/29\n\n· Ted Talks: Can a Robot Pass a University Entrance Exam? (Noriko Arai)\n\n· How Has Technology Changed Education? (purdue.ed)\n\n13\n\n12/06\n\n· Ted Talks: Connected, But Alone? (Sherry Turkle)\n\n\\* **Decide what you plan to do for your final project.**\n\n**Theme #4: Psychology in Teaching and Learning**\n\n14\n\n12/13\n\n· Ted Talks: Grit: The Power of Passion and Perseverance (Angela Lee Duckworth)\n\n\\* **Draft a plan for the final project.**\n\n15\n\n12/20\n\n·Ted Talks: How Frustration Can Make Us More Creative (Tim Harford)\n\n16\n\n12/27\n\n·Ted Talks: On Being Wrong (Kathryn Schulz)\n\n17\n\n01/03\n\n· YouTube: My Philosophy for a Happy Life (Sam Berns)\n\n\\***Fine-tune your final project.**\n\n18\n\n01/10\n\nProject Presentation (Submission of the Final Products)\n\n**_Note:_** _**The syllabus is subject to change based on the needs of the class**._\n\n**Course Requirements & Grading Policy:**\n\n1\\. Written responses to class materials                                                                      30%\n\n2\\. Mid-term news report (group work)                                                                       20%\n\n3\\. Final project (group work) (drafts, teamwork, oral presentation, & final product)    30%\n\n4\\. Performance on classroom activities                                                                      10%\n\n5\\. Attendance & participation                                                                                    10%",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "實地考察、參訪",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": "依據指示，紀錄每單元學習要點"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "針對教師或同學所提出的議題進行討論與參與課堂活動"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "每堂課的出席狀況"
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "針對期中前所探討的主題，進行採訪並報導"
        },
        {
            "type": "專題",
            "weight": 30,
            "note": "延伸本學期所探討的主題，製作專題"
        }
    ],
    "prerequisite": "◎必須先修過【英文(一)】◎必須先修過【英文(二)】",
    "general_core": []
}