{
    "year": 108,
    "term": 1,
    "name": "東亞語言文化比較",
    "teachers": [
        "賀安娟"
    ],
    "department": "LM26",
    "code": "TCC2018",
    "credit": 3,
    "serial": 1709,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 20
    },
    "schedule": [
        {
            "day": 1,
            "from": 8,
            "to": 10,
            "campus": "本部",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "雲和街教學大樓3樓303教室",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "The aim of this course is to provide a comprehensive overview of the linguistic diversity in East Asia in relation to the cultural and historical specificities that characterize each of the countries under discussion. The course adapts an historical perspective, and will not border on present-day language planning and cultural policy in East Asia. Students interested in these topics, should enroll in the course entitled “多元文化主義與語言教育” \nIn this course東亞語言文化比較we will mainly read and study materials (primary and secondary) that are also known as missionary linguistics (傳教語言學). We will cover the regions of Korea, China, Japan, Taiwan and these parts of Southeast-Asia where missionaries compiled dictionaries, glossaries and textbooks in Chinese dialects. Attention will be paid to the introduction of different orthographies, the role of the church in 19th century language standardization initiatives and programs, as well as the present-day legacy of missionary linguistics in East Asia. A brief comparison with topics in missionary linguistics beyond East Asian borders will provide the bigger picture. This course is taught in English.",
    "goals": [
        "認識各種語言在台灣歷史中的地位轉變",
        "瞭解台灣多元文化的傳承與變遷，以殖民及移民的觀點瞭解台灣文化、語言、及文學",
        "具有使用檔案、文獻、文本的能力，具有跨國或跨語言的比較能力",
        "具有專業反思能力"
    ],
    "syllabus": "The aim of this course is to provide a comprehensive overview of the linguistic diversity in East Asia in relation to the cultural and historical specificities that characterize each of the countries under discussion. In the first half, the course load of texts will adapt an historical perspective, while the second half will include present-day language planning and cultural policy in East Asia.\n\nIn this course we will mainly read and study materials (primary and secondary) that are also known as missionary linguistics. We will cover the regions of Korea, China, Japan, Taiwan and these parts of Southeast-Asia where missionaries compiled dictionaries, glossaries and textbooks in Chinese dialects. Attention will be paid to the introduction of different orthographies, the role of the church in 19th century language standardization initiatives and programs, as well as the present-day legacy of missionary linguistics in East Asia. A brief comparison with topics in missionary linguistics beyond East Asian borders will provide the bigger picture. This course is taught in English.\n\nThis course will introduce a number of topics that cover language and culture in East Asia. The focus will be on the Chinese cultural sphere of influence, the Chinese diaspora in Southeast Asia, but also the legacies of colonialism and imperialism in the region. Reading skills in Asian languages and Indo-European languages are required. If desired, the practical aspect of the course may include a few lectures in digital humanities that introduce databases and tools for computational linguistics.\n\nWeek 1   **週**1  **9****月 9****日**   Introduction and handout of the syllabus\n\nThis course will introduce a number of topics that cover language and culture in East Asia. The focus will be on the Chinese cultural sphere of influence, the Chinese diaspora in Southeast Asia, but also the legacies of colonialism and imperialism in the region. Reading skills in Asian languages and Indo-European languages are required.\n\nWeek 2 **週2**  **9****月 16****日** Assignment: China, Japan, Korea. Students select one country that has a relation with Taiwan (historical, political, economical, religious etc).\n\nWeek 3   **週3**  **9****月 23****日** Introduction to the academic literature on missionary linguistics.  **“**The Scope of Missionary Linguistics”: China\n\nReading and discussion article by Sandra Breitenbach, _Missionary Linguistics in East Asia. The Origins of Religious Language in the Shaping of Christianity_ (Frankfurt-am-Main: Peter Lang, 2008), pp.25-101\n\nOptional: **“**Linguistic Studies by Portuguese Jesuits in Sixteenth and Seventeenth Century Japan”Reading and discussion article by Toru Maruyama, _Missionary Linguistics_, edited by Even Hovdhaugen (ed) (Amsterdam: John Benjamins, 2004), pp. 141-160.\n\nComplementary Readings:\n\nEmi Kishimoto. “The Adaptation of the European Polyglot Dictionary of Calepino in Japan: _Dictionarium Latino Lusitanicum, ac Iaponicum_ (1595)” in _Missionary Linguistics II, Orthography and Phonology_, edited by Otto Zwartjes (Amsterdam: John Benjamins, 2005), pp. 205-224.\n\nMasayuki Toyoshima. “Phonetic Spellings in Historical Context vs Idiolect: The Japanese grammars by Joao Rodriguez Tcuzu and his holograph documents” in _Missionary Linguistics II, Orthography and Phonology_, edited by Otto Zwartjes (Amsterdam: John Benjamins, 2005), pp. 273-280.\n\nWeek 4 **週4**  **9****月 30****日** Discussion of materials that take Taiwan as a case study for missionary linguistics \n\nHeylen, Ann. “Dutch Language Policy and Early Formosan Literacy (1624-1662)” & “Missionary Linguistics on Taiwan. Romanizing Taiwanese: Codification and Standardization of Dictionaries in Southern Min (1837-1923)”, 2001\n\nComplementary Readings:\n\nHenning Kloter. “‘_ay sinco lenguas algo diferentes_’: China’s local vernaculars in early missionary sources” _Missionary Linguistics III, Morphology and Syntax_, edited by Otto Zwartjes, Gregory James and Emilio Ridruejo (Amsterdam: John Benjamins, 2007), pp. 191-210.\n\nWeek 5 **週5**  **10****月 7** **日**   Focus on Taiwan in East Asia, with special attention to the Japanese legacy (part 1)\n\nIntroducing, Heylen Ann, _Japanese models, Chinese culture,_ with special attention to the bibliographic  references\n\nWeek 6 **週6**  **10****月 14** **日**   Focus on Taiwan in East Asia, with special attention to the Japanese legacy in comparative perspective with Korea (part 2)\n\nDavid J. Silva.“Missionary contributions toward the revaluation of Hangeul in late nineteenth-century Korea,”_International Journal of the Sociology of Language_ 192 (2008), 57-74.  \n\nWeek 7 **週7**  **10****月 21** **日**  The relationship of Taiwan with its neighbors equally points to the countries in southeast Asia. This class will introduce the region, with special attention to the Chinese diaspora in Malaysia, the Philippines, Indonesia, Singapore.\n\nWeek 8 **週8**  **10****月 28** **日**  Attention will be paid to the meaning of ‘Formosan’, indigenous, aboriginal and Austronesian. Looking southwards also reaches to Oceania: Australia, New Zealand and islands that have ethnicities who speak Austronesian languages. Beyond borders: missionary linguistics in the Pacific\n\nReading and discussion: “Lancelot Threlkeld and missionary linguistics in Australia to 1850”article by  Hilary M. Carey,  _Missionary Linguistics_, edited by Even Hovdhaugen (ed) (Amsterdam: John Benjamins, 2004), pp. 253-275.\n\nWeek 9**週9** **11****月 4****日** Mid-term exam  \n\nWeek 10 **週**10 **11****月 11****日**The topic for this class is Language education and Pedagogy of the languages. This class will include a section on Digital Humanities: databases on languages, dictionaries and keyword search (if desired)\n\nSuggested readings:\n\nGeorg Bossong.“The Influence of Missionary Descriptions of Far Eastern Languages on Western Linguistic Thought: The case of Christoforo Borri, S.J. and Tommaso Campanella” in _Missionary Linguistics III, Morphology and Syntax_, edited by Otto Zwartjes, Gregory James and Emilio Ridruejo (Amsterdam: John Benjamins, 2007), pp. 123-144.  \n\nDavid Mikosz. “Eurocentric Views of Universal Languages from 1605-1828, _Itinerario_ 22.2 (1998), pp. 103-115.\n\nAntje Lann Hornscheidt. “Postcolonial continuities in Danish monolingual dictionaries: Towards a critical postcolonial linguistics”in Eric Achimbe ed.\n\nWeek 11  **週**11 **11****月 18****日**Articles on sociolinguistics, journals on language planning and book series on language topics pertaining to the languages in East Asia will be discussed.  \n\nWeek 12 **週**12 **11****月 25****日** The focus for this class are case studies in sociolinguistics in multicultural/lingual societies. Students present a paper. Introduction: _Handbook of Sociolinguistics_ (pdf uploaded in moodle) and a selection of edited volumes (Berlin: Mouton De Gruyter) that cover topics in sociolinguistics with languages in a postcolonial setting. Articles for reading will be distributed in class, depending on the students’ interests.\n\nWeek 13 **週**13  **12****月2****日**Topics for this class are Culture: ethnicities and language. We pay special attention to the cultural encounter between the languages as representatives of ideologies. The relevance of politics may be discussed. Taiwan in and about southeast Asian literature. Comparative to East-Asian literature on the topic. Literature and cultural translation. Taiwanese writers, cinematographers, artists in East and SE-Asia. A discussion of case studies.\n\nWeek 14 **週**14  **12****月9****日**The focus is on how language is used in research on ego-documents, diaries, and oral histories. This class can be combined with a lecture on digital humanities introducing personal documents.\n\nWeek 15 **週**15  **12****月16****日** The focus is on how language is used in research on popular culture. This class can be combined with a lecture on digital humanities introducing databases that store data on popular culture.\n\nWeek 16  **週**16  **12****月23****日**\n\nAssignment: students prepare a presentation that positions language in popular culture or in personal documents. The topic and region can be Taiwan, China, Japan, Korea, SEAsia.  (part 1)  \n\nWeek 17 **週**17  **12****月30****日**\n\nAssignment: students prepare a presentation that positions language in popular culture or in personal documents. The topic and region can be Taiwan, China, Japan, Korea, SEAsia.  (part 2)\n\nWeek 18  **週**18  **1****月6****日** Exam\n\nWrite a paper on your topic of choice demonstrating a literature survey, major journals and databases, bibliography, and discuss one commonality. Can be a digital exercise.",
    "methodologies": [
        {
            "type": "問題解決教學",
            "note": "discussing essays"
        },
        {
            "type": "實驗/實作",
            "note": "digital humanities excercises (optional, depending on demand students)"
        },
        {
            "type": "專題研究",
            "note": "term paper"
        }
    ],
    "grading": [
        {
            "type": "期末考",
            "weight": 40,
            "note": "term paper"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "discussion of the reading materials"
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "2 class presentations, handout or ppt"
        },
        {
            "type": "專題",
            "weight": 20,
            "note": "selection of a region and a language"
        }
    ],
    "prerequisite": "",
    "general_core": []
}