{
    "year": 110,
    "term": 1,
    "name": "中國神話導讀",
    "teachers": [
        "鍾宗憲"
    ],
    "department": "LU20",
    "code": "CHU0176",
    "credit": 2,
    "serial": 1799,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "樸205"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "3",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本課程以介紹中國神話為主。學生必須閱讀相關資料與故事，並遵學教師的講解與引導，從事分組作業的討論與寫作。",
    "goals": [
        "就文學層面而言，認識神話與敘事學、詩學、語言學之間的關聯。",
        "就哲學層面而言，了解神話的思維方式與哲學思想的關聯。",
        "就宗教層面而言，從古代宗教、祭祀的記載，解讀神話的意義。",
        "就歷史層面而言，從「合理化」的過程，復原神話的原貌。",
        "就文化層面而言，以考古資料與古今民俗現象，對神話作綜合性觀照。",
        "進行中國神話的基礎導讀，掌握神話發展梗概，具備神話學基本概念。",
        "培養宏觀的學術視野，從事跨科際、跨民族的學術性比對，並反省現代文化現象與相關論述。"
    ],
    "syllabus": "一、課程目標：（一）就文學層面而言，認識神話與敘事學、詩學、語言學之間的關聯。（二）就哲學層面而言，了解神話的思維方式與哲學思想的關聯。（三）就宗教層面而言，從古代宗教、祭祀的記載，解讀神話的意義。（四）就歷史層面而言，從「合理化」的過程，復原神話的原貌。（五）就文化層面而言，以考古資料與古今民俗現象，對神話作綜合性觀照。（六）進行中國神話的基礎導讀，掌握神話發展梗概，具備神話學基本概念。（七）培養宏觀的學術視野，從事跨科際、跨民族的學術性比對，並反省現代文化現象與相關論述。二、核心能力與基本素養： （一）能具備經史學、哲學、文學、語言文字、國文教學等專門知識。 （二）能具備中國語言、文學、學術思想、文獻資料之認知與研究能力。 （三）能具備理解、分析、評鑑文獻的能力。 （四）能具備多元文化跨領域轉化、跨領域知識架構、科際整合的能力。 （五）能針對不同媒體的性質，組織、重述與再現文本。 （六）能具備講解、教導、傳播中華傳統文化的能力。 （七）能具備培養靈感、激發創意、形成創見的能力。 （八）能具備人文關懷能力與人文素養。 （九）能具備良善的性情與高尚的品格。 （十）能遵守語言基本規範。三、教學理念：（一）基本上，以新還原論所謂的顯義層面（敘述層面）、本義層面（內容層面）、喻義層面（象徵層面）、隱義層面（背景層面）等四個層面進行中國神話解讀。（二）注重田野考察、考古新知、學術思潮與典籍文本的相互參照，因此不僅限於文本閱讀與解析，而更強調實際的文化進程與思維方式的轉變。（三）強調神話詮釋的現代意義，乃至於鼓勵重述神話。四、課程進度與綱要：\n\n第一講 天地萬物的創造\n\n第二講 庇護生命的女神\n\n第三講 國家寶藏的發現\n\n第四講 神國異境的想像\n\n第五講 黃帝蚩尤的戰爭\n\n第六講 萬水朝東的恐懼\n\n第七講 射日奔月的浪漫\n\n第八講 閃耀星空的吟唱\n\n第九講 神聖英雄的誕生\n\n第十講 物我合一的變化\n\n第十一講 文明曙光的展現\n\n第十二講 後神話的發展\n\n**（依臺灣大學系統相關規定調整學期週數為16+2週）**",
    "methodologies": [
        {
            "type": "講述法",
            "note": "課程計分十二單元，演講式授課以中國神話基礎文本導讀與治學基本方法介紹為主，配合資料投影方式進行課程講解，並以影片、圖畫方式作為輔助教材。"
        },
        {
            "type": "討論法",
            "note": "課程講授之外，輔以課堂討論。依課程進度，除書面作業統一批改，課堂中隨機對答；討論以知識運用、思辨訓練與表達邏輯為主。"
        },
        {
            "type": "合作學習",
            "note": "視選課人數設定專題，進行分組，並安排分組報告。"
        },
        {
            "type": "專題研究",
            "note": "視上課人數多寡與課程進度需要，設計報告與作業實際寫作規劃。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": "個人專題作業。"
        },
        {
            "type": "期中考",
            "weight": 30,
            "note": "學期書面測驗一次。"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "無故缺課，每次扣2分。"
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "分組報告，含課堂討論與課外討論。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}