{
    "year": 111,
    "term": 1,
    "name": "跨域設計研究與實務（一）",
    "teachers": [
        "林凱元"
    ],
    "department": "T",
    "code": "T0C9006",
    "credit": 3,
    "serial": 3087,
    "group": "",
    "quota": {
        "limit": 25,
        "additional": 5
    },
    "schedule": [
        {
            "day": 3,
            "from": 16,
            "to": 11,
            "campus": "本部",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "藝術學院會議室(於樂智樓3樓，僅作教室使用，請學生切勿擅自使用與授課無關器物)",
    "restrict": "◎限大三大四 ◎限碩一碩二碩三以上修習",
    "form_s": "",
    "classes": "9",
    "dept_group": "",
    "hours": 3,
    "description": "本課程著重跨領域整合與協作，在既有服務或產品上重新設計，或描繪一個截然不同的未來。透過文獻探討與實地調查訪談，解構現況，探究真正的問題，思考根本對策。其成果期許為參展、競賽、國際研討會或學術論文，並著重產品或服務的現實可行性或未來擴展性。",
    "goals": [
        "讓學生接觸不同領域可應用的資源",
        "讓學生熟悉跨領域合作模式"
    ],
    "syllabus": "**【授課方式：****16+2****週】**  \n**此課程著重分組討論與具體執行，選課前建議與授課教師聯繫** **rgpstu15@gmail.com**\n\n**Goals**:\n\nOur goal is to design the digital/physical system that links our lifestyles, experiences, future issues. These activities will develop a way to enhance our daily experiences and reform the society. Further, improve communication between and within the Internet and the real world, promoting the creation of new products and services. This course doesn’t limit the field, students are expected to rediscover the conventional interface and service, and pull out the hidden touch point or redesign the system.\n\nThis semester will focus on how to start the research and related methods. It is the processes of “Questioning, Thinking and Giving”.\n\n**Contents**:\n\n1.Innovation pipeline 1 Media Design and HCI\n\nWhat is Media and design? We will explore the concept of design. In addition, we will also understand how the Internet and media are being incorporated into modern design. Modern Media Design requires a technology to realize. We will learn how technologies are being put together to implement a design concept: making it into reality.\n\n2.Innovation pipeline 2 Interaction and Interface\n\nInteraction design usually linked to the interface, but interface is not only virtual one on the screen. We will explore the multiple interfaces in the physical life and try to redesign or give the new concept to them.\n\n3.Innovation pipeline 3 J-ACG Discussion\n\n\"Anime\", \"Game\", \"Comic\", and \"Cosplay\" are some of the aggressive and innovative forms of pop culture found in Japan and now spreading worldwide. So called “Otaku” culture are now focused throughout the globe and giving Japan an important role to enhance innovative creativity. We explore the roots of these otaku cultural activities in Japan, considering these contents as a material.\n\n4.Design research: Elements\n\nDesign Thinking, Philosophy, Vision, Fieldwork, Analysis, Target Persona\n\n5.Design research: Academic writing and logic\n\n6.Design research: Deconstruction\n\nTo disassemble the product or system and understand its structure and components.",
    "methodologies": [
        {
            "type": "討論法",
            "note": "Research design and implementation will be held based on groups. Maximin 4 members per group."
        },
        {
            "type": "問題解決教學",
            "note": "During each class, you will be asked to understand the “needs” of conceptual design and realization process based on steps."
        },
        {
            "type": "合作學習",
            "note": "You will be asked to collaborate with students from different disciplines."
        },
        {
            "type": "實地考察、參訪",
            "note": "You are required to go to the site or field of your research theme and bring back the primary sources."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": "個人或小組討論與報告"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "希望修課同學可以多與不同領域的人交流並從對方角度思考合作模式"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "盡可能參與全部課程，缺課是自己的損失"
        },
        {
            "type": "報告",
            "weight": 40,
            "note": "確立研究題目與成果目標，其表現形式不限"
        }
    ],
    "prerequisite": "",
    "general_core": []
}