{
    "year": 110,
    "term": 1,
    "name": "視覺研究導論：視覺與視覺性",
    "teachers": [
        "李立鈞"
    ],
    "department": "TM60",
    "code": "ATC0211",
    "credit": 3,
    "serial": 3106,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "美506"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "「視覺研究」為當代藝術學門新興之整合性學術研究領域，目前許西方許多知名大學校院均紛紛成立「視覺研究」系所，以當代之視覺文化思潮為主軸，統整原藝術史、藝術批評、視覺傳播、電影等藝術類學門，並分享學術資源。本課程開設之目的即在根據「視覺研究」之範疇，探討視覺文化思潮於今日我國藝術界、藝術教育中的理論與實務，並希望藉國外理論為推手，提供修課者檢視本土視覺文化現象，以及是類現象與我國藝術界、藝術教育界間互動關係的機會。",
    "goals": [
        "探討視覺文化思潮於今日我國藝術界、藝術教育中的理論與實務"
    ],
    "syllabus": "本課程將以「16+2週」方式進行，第17、18週將以學生自主學習與個別討論進行彈性授課。\n\n**課程介紹：**\n\n自從美國藝術史家米切爾（William J. T. Mitchell）與德國藝術史家伯姆（Gottfried Boehm）分別在1992與1994年代提出了「圖像轉向」（Pictural Turn、Iconic Turn）的概念之後，藝術史學經歷了重大的轉變：當代藝術史學不僅將研究的對象延伸至「藝術作品」以外的圖像，強調「圖像」的物質性、媒介性，更開始以藝術史的視角來檢視「圖像」在不同領域中所扮演的重要角色與其「製造知識」的能力。\n\n在本課程中，我們將回顧1990年代以來當代藝術史學經歷的圖像轉向，介紹當代藝術史研究的理論與方法。此外，我們將以現代科學中製造、運用與展示的圖像為例，運用當代藝術史的研究觀點來討論為什麼「圖像」並不是科學知識單純的「插圖」或是「附屬物」，並且進一步深入剖析「科學圖像」的不同面相與探問環繞它而生的種種議題。\n\n我們將探討「圖像」對於科學而言為何如此重要，而它又是如何被運用在實驗中、推動「事實」的發現。我們亦將回顧藝術家與科學家的複雜關係，分析科學家必須經過哪些調校、排除雜訊與標準化、美學化的過程才得以製造出「正確」的圖像。透過這些討論，我們將探討圖像「製造知識」的能力並且重新思考平時隱沒在科學實踐脈絡中的「圖像問題」。\n\n**授課進度表：**\n\n1\\. 課程介紹\n\n為何圖像，如何「轉向」？\n\n2\\. 當代藝術史研究轉向I：Pictural Turn\n\n本週介紹美國藝術史家米切爾（William J. T. Mitchell）的圖像理論，討論「圖像」在當代社會所扮演的重要角色。\n\n指定閱讀：\n\nWilliam J. T. Mitchell, “The Pictorial Turn,” in Picture Theory: _Essays of Verbal and Visual Representation_ (Chicago, IL: Chicago University Press, 1994), 11-34.\n\n參考資料：\n\nNeal Curtis, “‘As if’: Situating the Pictorial Turn,” in _Culture, Theory & Critique_ 50 (2009), 95-101.\n\nNeal Curtis ed., _The Pictorial Turn_ (New York: Routledge, 2010).\n\n3\\. 當代藝術史研究轉向II：Iconic Turn\n\n本週討論「圖像轉向」對於視覺文化研究的影響與啟發。\n\n指定讀物：\n\nMichele Bertolini, “The ‘Pictorial Turn’ as Crisis and the Necessity of a Critique of Visual Culture,” in _Philosophy Study_ 5.3 (2015), 121-130.\n\nKeith Moxey, “Visual Studies and the Iconic Turn,” in _Journal of Visual Culture_ 7.2 (2008), 131-146.\n\n參考資料：\n\nWilliam J. T. Mitchell, _Image Science: Iconology, Visual Culture, and Media Aesthetics_ (Chicago and London: The University of Chicago Press, 2015).\n\n4\\. 當代藝術史研究轉向III：從「科學的圖像」到「圖像的科學」\n\n本週討論如何以「圖像轉向」的觀點來探討「圖像」在「科學」中所扮演的角色，認識當「科學圖像」作為視覺文化研究對象時所能探問的問題。\n\n指定讀物：\n\nDavid Topper, “Towards an Epistemology of Scientific Illustration,” in _Picturing Knowledge: Historical and Philosophical Problems Concerning the Use of Art in Science_, ed. Brian S. Baigrie, 2nd revised edition (Toronto: University of Toronto Press, 1996), 215-49.\n\n參考資料：\n\nHorst Bredekamp, Vera Dünkel and Birgit Schneider (eds.), “Introduction: The Image — A Cultural Technology: A Research Program for a Critical Analysis of Images” to _The Technical Image. A History of Styles in Scientific Imagery_ (Chicago and London: The University of Chicago Press, 2015), 1-5.\n\nGabriele Werner, “Discourses about Pictures: Considerations on the Particular Challenges Natural-Scientific Pictures Pose for the Theory of the Picture,” in _The Technical Image_, 8-13.\n\nCaroline A. Jones and Peter Galison eds., _Picturing Science, Producing Art_ (New York: Routledge, 1998).\n\n5\\. 研究觀點I：觀看的歷史性\n\n本週閱讀Ludwik Fleck，討論為什麼「科學事實」也有其自身的歷史，而為什麼對Fleck而言所有的「觀看」都是一種「風格化」的目視。\n\n指定讀物：\n\nLudwik Fleck, “To Look, To See, To Know,” in _Cognition and Fact: Materials on Ludwik Fleck_, ed. Robert Sonné Cohen and Thomas Schnelle (Dordrecht et al.: Reidel 1986), 129-151.\n\n參考資料：\n\nLudwik Fleck, _Genesis and Development of a Scientific Fact_ (Chicago: University of Chicago Press 1979).\n\n6\\. 研究觀點II：圖像的物質性\n\n本週閱讀拉圖（Bruno Latour），討論「圖像」將事物記寫、固定下來，並同時作為物件能被移動、傳遞至遠方的特質。\n\n指定讀物：\n\nBruno Latour, “Drawing Things Together,” in _Representation in Scientific Practice_, ed. Michael E. Lynch and Steve Woolgar (Cambridge, MA: MIT Press, 1990), 19-68.\n\n7\\. 研究觀點III：圖像的轉譯性\n\n本週透過拉圖在亞馬遜雨林的田野研究來剖析科學家如何將收集來的植物與土壤經過一連串手續轉譯成草稿、圖表，而這些圖像媒介又如何形塑了知識的形構。\n\n指定讀物：\n\nBruno Latour, “Circulating Reference: Sampling the Soil in the Amazon Forest,” in _Pandora’s Hope: Essays on the Reality of Science Studies_ (Cambridge, MA: Harvard University Press, 1999), 24-79.\n\n參考資料：\n\nMichael Lynch, “Representation is Overrated: Some Critical Remarks about the Use of the Concept of Representation in Science Studies,” in _Configuration_ 1.2 (1994), 137-49.\n\nMichael Lynch and John Law, “Lists, Field Guides, and the Descriptive Organization of Seeing: Bird-Watching as an Exemplary Observational Activity,” in _Representation in Scientific Practice_, 267-99.\n\n8\\. 研究觀點IV：圖像的探勘性\n\n本週討論「可見性」在科學與藝術中所扮演的角色，並探討「圖像技術」與「知識生產」之間的緊密關係。\n\n指定讀物：\n\nHans-Jörg Rheinberger, “Making Visible. Visualization in the Sciences – and in Exhibitions?” in _The Exhibition as Product and Generator of Scholarship_, ed. Susanne Lehmann-Brauns, Christian Sichau and Helmuth Trischler (Berlin: Max Planck Institut für Wissenschaftsgeschichte, 2010), 9-23.\n\nM. Norton Wise, “Making Visible,” in Isis 97.1 (2006), 75-82.\n\n參考資料：\n\nMartin Kemp, _Visualizations: The Nature Book of Art and Science_ (Oxford: Oxford University Press, 2000)\n\n9\\. 實驗室參訪\n\n10\\. 研究觀點V：圖像的證據性\n\n本週以「攝影相片」為例，討論所謂的「證據」是如何在對於圖像的操作、調校、論述與期待中被建構出來的。\n\n指定讀物：\n\nJoel Snyder, “Res Ipsa Loquitur,” in _Things That Talk: Object Lessons from Art and Science_, ed. Lorraine Daston (New York: Zone Books, 2004), 195-221.\n\n參考資料：\n\nAlex Soojung-Kim Pang, “‘Stars Should Henceforth Register Themselves’: Astrophotography at the Early Lick Observatory,” in _British Journal for the History of Science_ 30.2 (1997), 177-201.\n\n11\\. 研究觀點VI：圖像的客觀性\n\n本週探討科學家與藝術家在歷史上的互動關係，回顧「科學圖像」在歷史上的不同製造方式，並藉此來探討「客觀性」的概念是如何在19世紀中發展出來的。\n\n指定讀物：\n\nLorraine Daston and Peter Galison, “The Image of Objectivity,” in _Representations_ 40 (1992), 81-128.\n\n12\\. 圖像問題I：雜訊\n\n本週聚焦始終伴隨著科學影像的「雜訊」，回顧科學家如何將「雜訊」從「真正的資訊」區辨出來，並將它排出在影像之外。此外，我們亦將討論為何「訊息」與「雜訊」的邊界往往是模糊的，而為什麼「雜訊」在很多狀況下反而是推動科學研究與藝術創作的關鍵要素。\n\n指定讀物：\n\nPeter Geimer, _Inadvertent Images: A History of Photographic Apparitions_ (Chicago and London: University of Chicago Press, 2018), 77-98.\n\n參考資料：\n\nJochen Hennig, “The Instrument in the Image: Revealing and Concealing the Condition of the Probing Tip in Scanning Tunneling Microscopic Image Design,” in _Instruments in Art and Science_, 348-61.\n\n13\\. 圖像問題II：歧異性\n\n本週以「脈波圖」為例，討論19世紀科學家如何透過「標準化」的方式消弭不同機器記寫下來紛雜圖像。\n\n指定讀物：\n\nSoraya de Chadarevian, “Graphical Method and Discipline: Self-Recording Instruments in Nineteenth-Century Physiology, in _Studies in the History and Philosophy of Science_ 24 (1993), 267-291.\n\n14\\. 圖像問題III：矛盾性\n\n本週閱讀藝術史家斯耐德（Joel Snyder），探討當現代影像技術將原本不可見或是位於人類感知範圍之外的事物顯現出來的同時，它如何也矛盾地將人完全排除在外，並讓這些圖像成為只能透過儀器或是其它圖像技術來檢驗、覆核的對象。\n\n指定讀物：\n\nJoel Snyder, “Visualization and Visibility,” in _Picturing Science, Producing Art_, 379-397.\n\n參考資料：\n\nPeter Geimer, “Picturing the Black Box: On Blanks in Nineteenth Century Paintings and Photographs,” in _Science in Context_ 17.4 (2004), 467-501.\n\n15\\. 醫學影像中心參觀\n\n16\\. 視覺文化I：科學美學\n\n在科學研究中，「圖像」除了作為探究不可見世界的工具，它更是科學家展示成果與理論的媒介。本週探討科學家在面對公眾，展示實驗結果時，他們會有哪些「美學」上的考量，而圖像必須經過哪些轉譯、賦予意義的過程才能真正被外人閱讀與理解。\n\n指定讀物：\n\nSamuel Y. Edgerton and Michael Lynch, “Aesthetics and Digital Image Processing: Representational Craft in Contemporary Astronomy,” in _Picturing Power: Visual Depiction and Social Relations_, ed. Gordon Fyfe and John Law (London: Routledge, 1988), 184-220.\n\n參考資料：\n\nBernike Pasveer, “Representing or Mediating: A History and Philosophy of X-ray Images in Medicine,” in V_isual Cultures of Science: Rethinking Representational Practices in Knowledge Building and Science Communication_, ed. Luc Pauwels (Hanover, NH: Dartmouth College Press, 2006), 41-62.\n\nBaudouin Jurdant, “Popularisation of Science as the Autobiography of Science,” in _Public Understanding of Science_ 2 (1993): 365-73.\n\nVera Dünkel, “X-Ray Vision and Shadow Image: On the Specificity of Early Radiographs and Their Interpretations around 1900,” in _The Technical Image_, 116-25.\n\n17\\. 視覺文化II：科學奇觀\n\n本週以早期「X光動態圖像」為例，討論「科學圖像」在進入公眾領域之後引發的討論、奇想、狂熱與它對於大眾視覺文化的影響。\n\n指定讀物：\n\nLisa Cartwright, _Screening the Body: Tracing Medicine’s Visual Culture_ (Minneapolis: University of Minnesota Press, 1995), 107-142.\n\n18\\. 結語與回顧",
    "methodologies": [
        {
            "type": "講述法",
            "note": "授課老師將以指定閱讀的文本出發，討論文本內容，並且以不同圖像、影片與歷史背景來延伸對於文本的討論。"
        },
        {
            "type": "實地考察、參訪",
            "note": "參觀科學實驗室，了解現代科學中的圖像使用。"
        },
        {
            "type": "媒體融入教學",
            "note": "使用大量圖像、相片與紀錄片作為延伸討論的材料。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": "書寫3篇1000至1500字課前（或課後）閱讀摘要，並提出兩個與文章主題（或上課講授內容）有關的提問。"
        },
        {
            "type": "期末考",
            "weight": 40,
            "note": "可從下列兩種形式挑選 (1) 挑選課堂上任一題目撰寫4000字的書面報告 (2) 選取一個科學研究或實踐的場域（譬如手術房、實驗室、人類學家的田野等等）作為觀察的對象，練習以當代藝術史研究方法來分析「圖像」在其中的角色，撰寫3000字的觀察紀錄。"
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "針對分配到的讀本在課堂上進行30分鐘的導讀，介紹文章內容，並提出問題供大家討論。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}