{
    "year": 110,
    "term": 1,
    "name": "博物館經營與展示研究",
    "teachers": [
        "廖世璋"
    ],
    "department": "EM02",
    "code": "SOC0142",
    "credit": 3,
    "serial": 425,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 10,
            "to": 12,
            "campus": "本部",
            "classroom": "教710"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "本課程主要針對博物館學相關的行政研究作重要介紹及分析，並以專論方式分析國內外目前相關博物館的理論、趨勢及重要案例，並在後面課程針對博物館的經營及展示規劃進行反思，為批判性「博物館社會學」理論之研析。\n\n整個學期的課程規劃大約分成三大領域：\n（1）1/3博物館經營及展示的基礎概論及行政工作。\n（2）1/3博物館經營及展示相關理論及概念之專題研究。\n（3）1/3博物館經營及展示相關之反思性及批判性文化理論。\n\n課程重點包括：博物館經營及展示通論、博物館政策研析、博物館建築空間計畫、博物館經營專案管理、主題博物館專論、地方（社區）博物館專論、「城市就是博物館」專論、博物館實地參觀考察等。\n\n所謂的博物館批判性理論，將至少包括：再認識「知識」、重新認識「展示」、文化治理、博物館的權力及微權力、博物館空間的符號消費、文化差異地點及異質空間、博物館展示的文化框架、博物館建築與展示之文本創造與分析、文化主體性及他者等相關概念的介紹及討論。\n\n介紹及分析一般博物館經營及展示計畫理論，及國內外重要案例介紹與分析。介紹及分析國內外博物館發展中的文化創意產業。參觀台北市各類博物館，由館方實務導覽解說展覽內容，及分享博物館經營計畫等。",
    "goals": [
        "理論博物館作為博物館理論的概念，借用許多社會學文化研究方面的理論，進而深化博物館展示的策展及詮釋分析的內含，除有助於針對目前的各項展覽進行展示分析之外，可作為日後策展的參考。此外，也透過這些理論能重新思維博物館的文化實踐與社會角色，並期望同學能藉此發展具反思性、批判性的博物館學。",
        "分析及討論目前國內「蚊子館」的問題及原因，及分析正在國內發生中的重大博物館計畫等現況時勢。討論全世界各大博物館的趨勢，以及分析國內目前博物館經營發展現況與問題，並講述空間硬體規劃及經營軟體計畫。介紹這些博物館經營軟體計畫，並反思國內目前經營實務的困境。介紹博物館經營發展策略下，舉辦大型藝術節慶活動。",
        "介紹及分析一般博物館經營及展示計畫理論，及國內外重要案例介紹與分析。",
        "介紹及分析國內外博物館發展中的文化創意產業。參觀台北市各類博物館，由館方實務導覽解說展覽內容，及分享博物館經營計畫等。"
    ],
    "syllabus": "**國立臺灣師範大學課程綱要（20210921配合疫情修正版）**\n\n**配合疫情修正版！修課同學請注意：**\n\n1.為配合疫情的線上教學，開放前三週，請修課同學自行加入臉書私密社團「文化原料供應商」，[https://www.facebook.com/groups/280349958790033](https://www.facebook.com/groups/280349958790033)\n\n所有即時、動態之訊息或資訊等，都會集中在此發佈！（同樣有使用藝名者，需要事先告知，以利審查！）\n\n2.線上上課時，將會直接使用「臉書包廂」視訊（比較簡單）為主。\n\n**本學期開設「博物館經營與展示研究」之後，會輪流開其他課程，至少要兩三年後，才會再次開設本課程。**\n\n在上述整個學期的課程規劃約分成三大領域之下，設計三個主題來帶領同學進入此三個領域：「現代博物館範型」、「後博物館範型」、「博物館文化反思及批判理論」等。有關各單元教學進度及主題如下設計。\n\n一、「現代博物館」範型\n\nWeek1  9/23（老師授課）\n\n課程設計介紹、課程要求說明\n\n1-1博物館的文化治理、博物館發展與台灣文化政策\n\n廖世璋（2002）。國家治理下的文化政策：一個歷史回顧。建築與規劃學報。3（2）：160-184。\n\nWeek2  9/30（老師授課）\n\n1-2台灣博物館的經營方式\n\n廖世璋（2009）。文化資產空間做為博物館再利用之法規研究：以台北市為例。博物館學季刊，23（1）：25-46。\n\nWeek3  10/7\n\n1-3現代博物館籌設、組織經營、策略規劃、預算編列及案例分析\n\nWeek4  10/14\n\n1-4現代博物館發展計畫、人事管理、藏品管理、設施管理、博物館倫理及案例分析\n\nWeek5  10/21\n\n1-5現代博物館行銷及公關、社會公共服務議題、當代博物館的挑戰、邁向新的博物館領域及案例分析\n\nWeek6  10/28（老師授課）\n\n1-6現代博物館的建築計畫、布展策略、展示技術及案例分析\n\n講義現場發給\n\n二、「後博物館範型」及範型移轉\n\nWeek7  11/4（老師授課）\n\n2-1後博物館範型理論及地方實踐：現代博物館與後博物館的範型移轉及科學哲學內涵分析，以及「歷史」類型的後博物館研究案例。\n\n廖世璋（2014）。後博物館的地方實踐-寶藏巖。博物館學季刊，28（2）：35-72。\n\n2-2博物館的範型及地方實踐：「從近代一般傳統的現代博物館到後博物館相關名詞概念分析，以及「美術館」類型的後博物館研究案例。\n\n廖世璋（2016）。後博物館概念的都市藝術策展—以基隆黃色小鴨為例。博物館學季刊，30（4）：73-97。\n\nWeek8  11/11\n\n2-3生態博物館、文化遺產博物館\n\n（「活」的博物館、地方博物館、社區博物館、產業博物館、文化遺產園區）\n\nWeek9  11/18\n\n2-4 「後博物館範型」全球研究趨勢\n\n（基礎教材Hooper-Greenhill, E., 2000. Museums and the Interpretation of Visual Culture. London: Routledge. 以及其他國際期刊論文）\n\n三、博物館與展示的文化反思及批判理論\n\nWeek10  11/25\n\n3-1美術館的「觀看」角色：展示作為一種「觀看的實踐」\n\n（影像權力與政治、觀眾製造意義、觀賞的現代性知識與權力、複製與詮釋、延伸的閱讀）\n\nWeek11  12/2\n\n3-2美術館的「觀看」角色：展示作為一種「觀看的實踐」\n\n（寫實主義與透視法、視覺的政治學、複製及詮釋、媒體及消費文化）\n\nWeek12  12/9\n\n3-3美術館的「觀看」角色：展示作為一種「觀看的實踐」\n\n（後現代主體、陳述、認同及反身性、科學觀看與觀看科學、視覺文化的全球流動）\n\nWeek13  12/16\n\n3-4博物館的「社會」角色（博物館社會學）\n\n（1）社會生成的博物館（再定義博物館工作相關名詞、個人與社會、文化公民、文化治理與文化公民權、博物館作為知識殿堂、知識教育與治療）；（2）博物館的社會不平等（階級不平等、博物館宗教化、博物館內的社會性別與身體、空間不平等）；（3）博物館經濟的異化（博物館經濟的資本積累、博物館消費文化與消費的社會功能）\n\nWeek14  12/23\n\n3-5博物館的「社會」角色（博物館社會學）\n\n（4）博物館的權力政治（博物館權力地位、博物館的權力運作與技術、台灣博物館的發展歷程與福利國家政策）；（5）博物館的文本、再現與後結構主義分析（博物館文本、博物館的再現性、博物館的後結構主義分析）；（6）博物館的後現代文化消費（博物館的現代性與後現代性、博物館的符號消費、博物館的戲劇消費）\n\nWeek15  12/30\n\n3-6博物館的「社會」角色（博物館社會學）\n\n（7）博物館展現消費的技術工具（「觀看」的消費技術工具、「真實性」的消費技術工具、「認同」的消費技術工具）；（8）範型歷程及移轉：博物館反身性的地方社會運動（博物館各範型發展歷程與範型特徵及其移轉、台灣本土博物館的後殖民意識與轉型、未來：邁向博物館反身性的地方社會運動）\n\nWeek16  1/7\n\n期末報告分享\n\nWeek17  1/14\n\n博物館自主學習\n\nWeek18  1/21\n\n博物館自主學習\n\n教學進度及內容補充說明：\n\n1.文獻研析60%。\n\n（1）領域「一」：因為屬於概論基礎課程，應該全部都要閱讀，但同學可選擇章節，每人輪流報告。\n\n（2）領域「二」：除老師授課之外，每位同學可以選擇自己喜歡的專題論文，國際學術期刊以博士班研究生為主，並輪流報告。\n\n（3）領域「三」：除老師授課之外，為反思性及批判理論，每位同學可以選擇自己喜歡的專題論文，並輪流報告。\n\n2.出席率、課堂討論互動參與20%。\n\n3.期末報告20%。（博物館及展覽相關主題研究分析，各項個案、政策、計畫、法規、制度、教育、反思、批判理論等；以及你有興趣的研究對象進行研究，期末課堂報告，word檔格式並能清楚研析理論或初步研究發現；作為期末作業的分享。期末作業字數為3000字至5000字，另訂繳交日期。）\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=19086ccd0b2442baa37a84472878e313&fno=bccea571d2eb4cf7912591dcfff3f0d1)\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=1d0ada25adb246e29ff0fcb47e3b63a1&fno=4b13b22a43934a0f86c71e36ad389dba)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "授課老師講述博物館的理論概念及國內外重要案例"
        },
        {
            "type": "討論法",
            "note": "同學們一起討論目前國內外博物館經營及展示的問題"
        },
        {
            "type": "問題解決教學",
            "note": "同學一起討論目前國內內外博物館問題的解決方法"
        },
        {
            "type": "媒體融入教學",
            "note": "幻燈簡報及播放國內外博物館的相關案例"
        },
        {
            "type": "專題研究",
            "note": "同學期末繳交博物館專題研究報告"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "課堂同學針對博物館經營及展示提出問題及討論"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "出席率"
        },
        {
            "type": "報告",
            "weight": 60,
            "note": "同學針對文獻研析進行報告"
        },
        {
            "type": "專題",
            "weight": 20,
            "note": "期末同學針對專題進行研究分析，並在最後一週上台報告"
        }
    ],
    "prerequisite": "",
    "general_core": []
}