{
    "year": 111,
    "term": 1,
    "name": "英文（三）：人文領域探索",
    "teachers": [
        "陳秋蘭",
        "陳建元",
        "蘇淑娟"
    ],
    "department": "CU",
    "code": "00UB9O1",
    "type": "必",
    "grade": null,
    "credit": 2,
    "serial": 329,
    "group": "A",
    "quota": {
        "limit": 35,
        "additional": 0
    },
    "schedule": [
        {
            "day": 4,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "誠205"
        }
    ],
    "programs": [],
    "comment": "*適合中初級程度以上同學修習",
    "restrict": "◎必須先修過【英文（一）】◎必須先修過【英文（二）】",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "藉由主題式課程，加深學生對該領域實務趨勢認識、議題簡報、實務案例討論與批判分析。\n強化學生該領域之實務/任務型英語口語溝通、簡報、寫作表達能力",
    "goals": [
        "增進職場實務知能",
        "提升英語組織與跨文化溝通表達能力",
        "培養實務案例批判及分析能力",
        "拓展國際視野及移動力",
        "促進實務領域的協作能力"
    ],
    "syllabus": "English III is one of the three-semester English language courses required at NTNU. This course on **Humanities and Cultures Exploration** focuses on introducing students to humanity topics like languages, cultures, literature, history and geography. The three components are briefly described below.\n\n1.  **Language, Culture and Literature (8 weeks)**\n\nTopics on world languages and the status of English will be introduced to help students know how languages are used in the world. Then the interaction among language, culture and literature will be discussed through reading and video-watching. Students are expected to engage in critical reading and discussions based on the materials provided in class.\n\n1.  **Geography (4 weeks)**\n\nThe purpose of the 4 weeks of geography course is to familiarize students with a geographical perspective of living in the university. The lecturing will introduce geographical terms so that the students may gain spatial perspectives of experiencing their environment. By conducting field trips around university campuses and the Hsin-Dian River which links two NTNU campuses, the students will be immersed in environmental milieu for achieving lively individual experience in the environment.\n\n**3\\. History (4 weeks)**\n\nThrough thematic design, this part of the course enables students to further understand the overview of the field of history, and learn to abstract, discuss, criticize and analyze academic cases. The history component of the course will improve students' reading, oral communication, writing and listening skills in the field of history.\n\n**Tentative Weekly schedule**\n\nWeek 1- Week 4: Language, Culture and Literature\n\nWeek 1: Course Introduction\n\nWeek 2: Languages around the world\n\nWeek 3: The Status of English/World Englishes\n\nWeek 4: Language and Culture\n\nWeek 5- Week 8: Geography\n\nWeek 5: Environment of a University Town: Fundamental human geography and physical geography of a university town\n\nWeek 6: Student Life on Campus and its Surroundings: Urban history and how urban history becomes geography\n\nWeek 7: Exploring NTU System Universities: the geography of University development\n\nWeek 8: Biking as a Way of Exploring City and its Ecology: a city by the river\n\nWeek 9- Week 12: History\n\nWeek 9: History of Christianity-1\n\nWeek 10: History of Christianity-2\n\nWeek 11: History of French Revolution-1\n\nWeek 12: History of French Revolution-2\n\nWeek 13- Week 16: Language, Culture and Literature\n\nWeek 13: Non-verbal Communications\n\nWeek 14: Cultural Differences and Cross-cultural Communication\n\nWeek 15: Literature and Culture\n\nWeek 16: Final Presentation of the Project\n\n**Grading Policy**\n\n1.  Attendance: 20%\n2.  Assignments: 40% (to be assigned by teachers of each component)\n3.  Final Project: 40%\n\nFor the final project, students will choose one of the three options. The written report of the project is due on December 1. Outstanding projects in each option will be chosen for presentation on December 22 (Week 16). Bonus points will be awarded to those projects presented on the last day of class.",
    "methodologies": [
        {
            "type": "講述法",
            "note": "閱讀文章"
        },
        {
            "type": "討論法",
            "note": "討論文章內容"
        },
        {
            "type": "合作學習",
            "note": "小組報告"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 40,
            "note": "三位老師一主題所指定作業"
        },
        {
            "type": "出席",
            "weight": 20,
            "note": "課堂出席率 及參與課堂討論"
        },
        {
            "type": "專題",
            "weight": 40,
            "note": "期末專題書面報告"
        }
    ],
    "prerequisite": "◎必須先修過【英文（一）】◎必須先修過【英文（二）】",
    "general_core": []
}