{
    "year": 107,
    "term": 1,
    "name": "數值天氣預報",
    "teachers": [
        "徐月娟"
    ],
    "department": "SU44",
    "code": "ESC0009",
    "credit": 3,
    "serial": 2940,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 4,
            "from": 7,
            "to": 9,
            "campus": "公館",
            "classroom": "Ｃ409"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大三大四 ◎限碩一碩二碩三以上修習",
    "form_s": "",
    "classes": "9",
    "dept_group": "",
    "hours": 3,
    "description": "使用數值模式來模擬天氣及氣候，為研究大氣物理過程的重要工具。近年來大氣數值模式產品也已成為天氣預報及氣候預測的主要參考指引。本課程介紹大氣數值模式發展之歷史過程，以及建造一個大氣數值模式所需具備的三方面主要知識，亦即動力架構設計、數值計算方法和物理過程參數化。使學生由簡至深逐步了解大氣數值模式的相關知識，以及數值天氣預報產品的意義，目的是使學生具備從事大氣數值模式的研發和成果應用的基礎知識。\n介紹數值天氣預報發展沿革，含大氣基本控制方程式、準靜力系統、準地轉系統等。介紹建造一個大氣數值模式所需具備的三方面知識，亦即動力架構、物理過程和數值計算。這些知識為從事大氣數值模式的設計和應用的重要基礎。介紹數值天氣預報產品及其應用。",
    "goals": [
        "使學生認識大氣數值模式為研究天氣現象的一項利器，了解數值天氣預報產品的意義，並使學生具備從事大氣數值模式的設計和應用的基礎知識。"
    ],
    "syllabus": "教學目標： 使用數值模式來模擬天氣及氣候，為研究大氣物理過程的重要工具。近年來大氣數值模式產品也已成為天氣預報及氣候預測的主要參考指引。本課程介紹大氣數值模式發展之歷史過程，以及建造一個大氣數值模式所需具備的三方面主要知識，亦即動力架構設計、數值計算方法和物理過程參數化。使學生由簡至深逐步了解大氣數值模式的相關知識，以及數值天氣預報產品的意義，目的是使學生具備從事大氣數值模式的研發和成果應用的基礎知識。 介紹數值天氣預報發展沿革，含大氣基本控制方程式、準靜力系統、準地轉系統等。介紹建造一個大氣數值模式所需具備的三方面知識，亦即動力架構、物理過程和數值計算。這些知識為從事大氣數值模式的設計和應用的重要基礎。介紹數值天氣預報產品及其應用。  \n  \n教材內容： 第一週 認識大氣數值模式、大氣基本控制方程式 第二週 大氣波動(聲波、重力波、低頻氣象波… 第三週 準靜力系統、原始方程組及預測架構 第四週 數值天氣預報發展沿革 第五週 資料初值化及過濾方程式 第六週 垂直向離散化、控制方程組及預測架構(廣義坐標、等高面、等壓面… 第七週 垂直向離散化、控制方程組及預測架構(等σ面、等位溫面… 第八週 水平向離散化(等角投影、水平格點… 第九週 時間差分法(一致性、精確度、截斷誤差… 第十週 時間差分法(振盪方程、衰減方程、收斂性、穩定性… 第十一週 時間空間差分法(平流方程、線性不穩定… 第十二週 時間空間差分法(渦度方程、非線性不穩定… 第十三週 準地轉系統及過濾模式 第十四週 相當正壓模式、斜壓模式 第十五週 原始方程式模式 第十六週 物理參數化 第十七週 數值天氣預報產品及其應用 第十八週 期末考筆試  \n  \n方法評量： 課堂講解、討論與問答，3~4次作業練習，加深學習印象。 學期成績(100%) = 作業練習、書面報告(35%) +期末考筆試(40%) +出席與參與(25%)  \n  \n參考書目： 1. 課程講義 2. Holton, J. R., 2004: An introduction to dynamic meteorology (4th Edition). Elsevier Academic Press, 511pp. 3. Arakawa, A., 1995: Atmospheric models. Geophysical Magazine, Series 2, Vol. 1, II-I-1 – II-I-28, Japan Meteorological Agency. 4. Mesinger, F. and A. Arakawa, 1976: Numerical methods used in atmospheric models, vol. I. GARP Publication Serious No., 17, WMO/ICSU. 5. 中央氣象局網站\\_天氣預報\\_數值模式 [http://www.cwb.gov.tw/](http://www.cwb.gov.tw/)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "以講課為主，並鼓勵學生發問及討論，將有四次左右作業練習。"
        },
        {
            "type": "討論法",
            "note": "以講課為主，並鼓勵學生發問及討論，將有四次左右作業練習。"
        },
        {
            "type": "其他",
            "note": "以講課為主，並鼓勵學生發問及討論，將有四次左右作業練習。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 35,
            "note": "作業練習、書面報告"
        },
        {
            "type": "期末考",
            "weight": 40,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 25,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}