{
    "year": 110,
    "term": 2,
    "name": "英文（三）：教育英文",
    "teachers": [
        "黃海龍"
    ],
    "department": "CU",
    "code": "00UB9B1",
    "credit": 2,
    "serial": 299,
    "group": "A",
    "quota": {
        "limit": 35,
        "additional": 0
    },
    "schedule": [
        {
            "day": 1,
            "from": 6,
            "to": 7,
            "campus": "公館",
            "classroom": "Ｓ406"
        }
    ],
    "programs": [],
    "comment": "*適合中初級程度以上同學修習。",
    "restrict": "◎必須先修過【共同英文(一)】◎必須先修過【共同英文(二)】 ◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "藉由主題式課程，加深學生對該領域實務趨勢認識、議題簡報、實務案例討論與批判分析。\n強化學生該領域之實務/任務型英語口語溝通、簡報、寫作表達能力。",
    "goals": [
        "增進職場實務知能",
        "提升英語組織與跨文化溝通表達能力",
        "培養實務案例批判及分析能力",
        "拓展國際視野及移動力",
        "促進實務領域的協作能力"
    ],
    "syllabus": "**National Taiwan Normal University**\n\n**110 Spring Semester (110 – 2)**\n\n**English (III): Education syllabus**\n\nInstructor: Huynh Hai-Long (Harry) / 黃海龍\n\nEmail: longhhuynh@ntnu.edu.tw\n\nClass time: 週一，6-7節 Monday periods 6–7 / 1:20 p.m. – 3:10 p.m., 公館S404, 16 weeks\n\n*   **Course description**\n\nThis course aims to improve students’ Academic English proficiency with a strong focus on reading, speaking and writing in Academic English. In this course, there will be a range of activities which engage students in contemporary topics with practical issues, sharpen their critical thinking, and boost their communicative abilities. They also learn to teamwork with their peers and to become more autonomous learners.\n\n*   **Course objectives:**\n\nThe course is designed to\n\n1.  Develop students’ communicative skills in Academic English\n2.  Expand and enhance students’ knowledge of academic vocabulary in Education\n3.  Build students’ confidence in communication in English\n4.  Develop students’ teamwork and autonomy\n5.  Broaden cultural and intercultural knowledge\n\n*   **Classroom materials**\n\nOnline book extracts, journal articles in Education, videos on YouTube and some online writing pieces. Students will choose these and finalize 9 links (from those on pages 3–4) that they would like to read.\n\n*   Grading policy and course requirements\n\n1.  Grading policy\n\n1.  Attendance: 10%\n2.  Participation in group discussion and classroom activities: 15%\n3.  Summaries: 15%\n4.  Mid-term – presentation: 30%\n5.  Final – essay: 30%\n\n1.  Course requirements:\n\n*   _Attendance and participation (10%)_\n\nClass attendance is required and strictly checked. Students are expected to come to class every week, except for (a) hospitalized cases; or (b) emergencies; or (c) authorized absences. For these exceptions, evidence with the signature and stamp of the person in charge must be provided. Any absences apart from the exceptions mentioned above are counted, and each absence results in 1 point deducted in the attendance/participation score. If the classes are online, students are required turn on the camera/webcam all the time.\n\n*   _Participation in discussion and activities (15%)_\n\nStudents must participate in all discussions and class activities. They are required to answer questions the teachers posted on Moodle or shown in pre-recorded videos. Any time a students fails to do this will result in 10% deducted in this part.\n\n*   _Summaries (15%)_\n\nStudents are expected to compose summaries of assigned readings. The lecturer will discuss with the students which readings to summarize and set due dates for these summaries. Late submissions will result in 30% deduction in the score for summaries. A submission which is received 2 days or later than due date will be instantly marked zero. If there is an emergency happening on the due date, students should email the lecturer as soon as possible.\n\n*   _Mid-term (30%) and final (30%)_\n\nFor the mid-term test, students will work in groups of three or four and will present on one of the topics given. The presentation must last from 6 to 8 minutes.\n\nFor the final test, students will work individually and will write an essay on one of the topics learned. Each essay will be marked on 3 criteria: Topic Development (Task Response), Organization (Coherence and Cohesion), and Delivery (Vocabulary and Grammar). See scoring guide based on [TOEFL iBT Independent Writing Rubrics](http://www.ets.org/s/toefl/pdf/toefl_writing_rubrics.pdf) (page 1).",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "實驗/實作",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 15,
            "note": ""
        },
        {
            "type": "期中考",
            "weight": 30,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 30,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 15,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        }
    ],
    "prerequisite": "◎必須先修過【共同英文(一)】◎必須先修過【共同英文(二)】",
    "general_core": []
}