{
    "year": 110,
    "term": 2,
    "name": "英文（二）",
    "teachers": [
        "陳秋梅"
    ],
    "department": "CU",
    "code": "00UB8A4",
    "credit": 2,
    "serial": 279,
    "group": "D",
    "quota": {
        "limit": 35,
        "additional": 0
    },
    "schedule": [
        {
            "day": 5,
            "from": 1,
            "to": 2,
            "campus": "本部",
            "classroom": "正404"
        }
    ],
    "programs": [],
    "comment": "文學院(國文系、歷史系、地理系)、科技學院(工教系、科技系、圖傳系、機電系、電機系)、藝術學院(美術系、設計系)、體育系、台文系、華語系(國華組)、車能學位學程",
    "restrict": "◎第一階段需人工加選◎第二階段需人工加選◎加退選階段需人工加選 ◎必須先修過【共同英文(一)】 ◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "共同科英文（二）課程為一學期兩學分課程，係為非英語系學生所開設的課程。目標在幫助大一學生活用中學時期所累積的英語知識，提昇英語聽、說、讀、寫整體的溝通能力。為達此目標，本課程要求教師盡量用英語上課，努力營造一個豐富的英語環境，讓學生不但有充分機會以英語參與課堂活動，且樂於使用英語與同學及老師溝通。",
    "goals": [
        "1. 增進學生英語溝通表達能力 2. 透過參與課程活動促進團隊精神 3. 透過多面向英語閱讀促使學生了解多元文化，拓展學生國際化視野 4. 透過課堂討論培養批判精神 5. 提升學生英語學習動機及自主學習興趣"
    ],
    "syllabus": "Instructor: Janet Chen\n\nE-mail: [t22040@ntnu.edu.tw](mailto:t22040@ntnu.edu.tw)\n\nOffice: 本部誠八樓805號研究室\n\n **_English II (for Non-English Majors)_**\n\nSpring, 2022\n\n**Course Objective**\n\nThis course is intended to teach students how to use the tools and resources available to them to do English tasks such as reading aloud an essay, understanding an article, role playing an everyday situation in English, introducing themselves and their majors, teaching people how to learn the skills they are good at, expressing their opinions, taking notes, writing resumes and autobiographies and well-organized essays, etc. Students will be offered lots of opportunities to develop the four language skills along with critical thinking skills through a variety of in-class and out-of-class activities.\n\n**Textbook**\n\nMacintyre, Paul & Bohlke, David. (2015). _Reading Explorer: Book 2 (Second Edition)._ National Geographic Learning.\n\n**Requirements and Rules**\n\n1.  **Punctual attendance**, **lesson preparation** and **active participation** are required. Participation also includes teamwork and group discussion.\n\n*   All student absences will be classified as excused or unexcused.\n*   Absences for the following reasons will be _excused_ if there is timely verification (within 1 week) of such reasons provided to the instructor:\n\n*   Illness or medical emergency\n*   Family emergencies\n*   Pre-arranged medical appointments.\n*   Pre-arranged school-sponsored activities, such as field trips.\n\n*   A Notification of Absence Form has to be submitted online (學生請假系統) within 1 week. Verification document (hard-copy) should also be handed in to the instructor within 1 week. Late submission will not be accepted. A Notification of Absence Form without a verified document will be regarded as an _unexcused_ absence.\n*   Students who are more than 30 minutes late to class will be considered absent.\n*   Students will fail this course if there are more than 3 unexcused absences.\n*   Students will fail this course if they miss more than 5 meetings the whole semester.\n\n1.  **Plagiarism or Cheating on quizzes or exams** is absolutely forbidden. If someone is found cheating on an exam or plagiarizing a paper, he/she will fail that exam or that assignment.\n\n1.  **Textbook** is a must. Violation of this rule will cost you 2 points (out of your final score) each time.\n\n1.  You are **not** supposed to use your phone, laptop, iPad, or iPod to do things irrelevant with the class. Violation of this rule will cost you 2 points each time.\n\n1.  **Previewing** the reading is a must. In every meeting, each group will use the first hour for discussion and the second hour for presentation. In the first hour, the head leads the whole group to go over the text and makes sure each member understands everything. In the second hour, they’ll be required to read aloud the paragraphs, explain what they mean and answer all the comprehension questions. After that, they discuss the post-reading questions together and one of them must represent their group to report their opinions. Each member must present at least once throughout the whole semester and his/her presentation will constitute 5% of their final score.\n\n1.  **Reading and Discussion Project**\n\nIn order to improve students’ extensive reading and discussion skills, one Lexile book will be assigned as an outside reading for them to practice discussing on 3/18. Before the event, the teacher will briefly introduce the essence of quality talk and the most frequently used 6 types of questions. Each student must try to ask as many questions as possible, proving that they really understand how to ask questions in order to elicit important information and stimulate further thoughts. They write down their questions on a paper before coming to class. In class, they take turns asking their group members the questions. While doing the task, they work together, thinking about which questions are important and inspiring enough to be included. After that, they hand in a paper with all the questions fitting the 6 categories and their answers on it. This assignment constitutes 5 points and is due on 04/01. Then each student writes down his/her thought about the book on an A4 paper and submit it to me on 04/08. This will constitute another 5 points.\n\n1.  Everyone must take **the TOEIC Test on 3/26**. The score you get will constitute 5% of your final score.\n\n1.  A midterm speaking activity – **Talent** **Show** \\-- will be held on 4/18. It’s a group work. People with the same or similar specialties work together. They use English to introduce and demonstrate their specialties to the class. Think about how to make your show interesting to a layman. If there are 6 people in the group, then the show time should be at least 12 minutes. Everyone must speak for some time so that they can get the credit.\n\n1.  A speaking activity – **Sports Celebrity Interview** \\-- will be held on 5/06. Two people work as a pair. One of them plays the role as an interviewer, and the other, as a very famous athlete. The interview must be done in English and last at least 2 minutes. The longer, the better. Your interview doesn’t need to be based on facts. You are encouraged to use multimedia and all kinds of resources (props, costumes, photos you take, etc.) to make your interview interesting. Please print out your script on an A4 paper and give it to me before you present.\n\n1.  **Self-Study Project**\n\nThis is to encourage students to use English outside the classroom. You must devote at least 4 hours on this project. (1) Participate in the following events, or attend a talk, an event, a show, a competition etc. in which English is the main language. Submit a list/ summary of what you do before 1/21 and what you think about the event. This list should include information such as date, duration, details and any other crucial information.\n\nHere are a few suggestions for you to consider:\n\n1\\. 英語自學教室 (本部樸101) Record the details of your visit.\n\n2\\. 英語聊天室 (本部樸102/ 公館圖書館) Record the details of your visit.\n\n3\\. 師大教學發展中心/ 圖書館- 英語讀書會[http://goo.gl/xxr5rV](http://goo.gl/xxr5rV)\n\n4\\. 校內外英語相關競賽 (record the competition)\n\n5\\. 聽英語演講 (summarize the lecture and write your opinion about the talk)\n\n6\\. 語言交換 (record your language exchanges)\n\n7\\. 看英語影片 (a summary of the plot and what you think about the movie)\n\n8\\. 讀英文雜誌，故事或小說 (review or afterthought about the reading material)\n\n1.  **Check Moodle 2.8 and email frequently**\n\nI assume that you check your email and the course site frequently. It’s your responsibility to make sure you register with the correct email address on Moodle 2.8. **Not receiving a notice is NOT an excuse for any late submission. Late submission will be penalized 10% per day.**\n\n**Grading Policies**\n\nAttendance and Participation       10%\n\nTalent Show                                   20% \n\nSport Celebrity Interview              15%\n\nQuizzes and Assignments             15%\n\nFinal Exam                                     30%\n\nTOEIC Test (on 3/26)                       5%\n\nSelf-Study Project                           5%\n\n**Tentative Schedule (16 weeks of in-person instruction + 2 weeks of self-study)**\n\n_Wk  Date  Content_                                                       \n==========================================================================\n\n1    2/18  Introduction\n\n2    2/25  Unit 7-1.  _The Flower Trade._\n\n3    3/04  Unit 7-1.  _The Flower Trade._ \n\n4    3/11  Unit 7-2.  _The Power of Perfume._ \n\n5    3/18  Unit 7-2;  **Reading & Discussing a Lexile book: discussion skills**\n\n6    3/25  Unit 9-1.  _The Teenage Brain._ \n\n7    3/26  **TOEIC Test**  (4/01 No Class)\n\n8    4/08  Unit 9-1.  _The Teenage Brain._ \n\n9    4/15  **Talent Show**\n\n10   4/22  Unit 9-2.  _Seeing Double._\n\n11   4/29  Unit 9-2.  _Seeing Double._\n\n12   5/06  **Sport Celebrity Interview**\n\n13   5/13  Unit 10-1.  _The Big Thaw._\n\n14   5/21  Unit 12-1.  _The_ Dream of Flight\n\n15   5/28  **Final Exam** (all the readings discussed in class)\n\n16   6/03  National Holiday, No Class\n\n17   6/10  Self-Study Project\n\n18   6/17  Self-Study Project  **(Self-learning record is due.)**",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "實驗/實作",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 30,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 10,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 20,
            "note": ""
        }
    ],
    "prerequisite": "◎必須先修過【共同英文(一)】",
    "general_core": []
}