{
    "year": 110,
    "term": 2,
    "name": "英文（三）：運動英文",
    "teachers": [
        "陳秋梅"
    ],
    "department": "CU",
    "code": "00UB9E2",
    "credit": 2,
    "serial": 309,
    "group": "A",
    "quota": {
        "limit": 35,
        "additional": 3
    },
    "schedule": [
        {
            "day": 1,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "樸402"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎必須先修過【共同英文(一)】◎必須先修過【共同英文(二)】 ◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "藉由主題式課程，加深學生對該領域實務趨勢認識、議題簡報、實務案例討論與批判分析。\n強化學生該領域之實務/任務型英語口語溝通、簡報、寫作表達能力",
    "goals": [
        "增進職場實務知能",
        "提升英語組織與跨文化溝通表達能力",
        "培養實務案例批判及分析能力",
        "拓展國際視野及移動力",
        "促進實務領域的協作能力"
    ],
    "syllabus": "Instructor: Janet (陳秋梅)\n\nE-mail : [t22040@ntnu.edu.tw](mailto:t22040@ntnu.edu.tw)  \n\nClass time: Monday 10:20–12:10     \n\nOffice: 本部誠八樓805號研究室\n\n**_English III: English for Sports_**\n\nSpring, 2022\n\n**Course Objective**\n\nThis is an English course mainly for sports majors. By giving various kinds of “task-oriented” activities, the course objective is to help students become (1) better listeners who can understand easily short talks, news and conversations about sports; (2) better speakers who can express themselves appropriately in sports situations (3) better readers who can understand short English articles related to sports.\n\n**Teaching Material**\n\nMost of the learning materials are adapted from sports textbooks, the Internet, or encyclopedia. The sports covered are those that enjoy greater popularity in our daily life and on TV broadcast. Only copied handouts will be used in this course. Each student should pay for the copied handouts.\n\n**Rules and Requirements**\n\n1.  **_Plagiarism & Cheating on quizzes or exams_** is absolutely forbidden. If someone is found plagiarizing or cheating on an exam or a quiz, he/she will be flunked.\n\n1.  **_Attendance and Preparation_**: Students are expected to attend class well-prepared. For every unexcused absence, 3 points of their final grade will be deducted; 3 unexcused absences will result in the failure of this course. Being late for over 30 minutes is treated as absence for the class that day. If students are absent in case of uncontrollable situations (e.g. illness, emergency, etc.), they must ask for leave **within two weeks** and make sure that I receive the email. Besides, they cannot ask for more than **5** leaves for the whole semester according to the school regulations.\n\n1.  Some paper for writing is a must so that you can use it to take notes or quizzes.\n\n1.  You are not supposed to use your **_phone or laptop_** to do things irrelevant with the teacher’s instruction. Violation of this rule will cost you 3 points each time.\n\n1.  **_Class Participation_**: Lesson conductions will engage students in a variety of tasks such as pair practices, group/class discussion and role plays. Students should participate actively in these activities so as to develop real-time communication skills.\n\n1.  **_Teach your expertise:_** The whole class will be divided into 6 groups. Each group is responsible to find an English article introducing a particular sport (e.g. badminton, table tennis, swimming, 400-meter relay race, etc.). Imagine that you were the teacher. Think about how you will conduct the course so that you can make the learning very enjoyable and instill the knowledge into your students’ heads at the same time. Design a handout that introduces the important words and concepts about the sport. Print out your **handout and article** and upload them unto Moodle by **2/28**. I’ll review your article and handout. If they are approved, you make **copies** for your classmates when it’s your turn to teach your expertise. Each group has about 30 minutes. Try to come up with some interesting teaching activities (e.g. playing kahoot, role play, etc.) to motivate and engage your students. Your handout will constitute 10 points and your oral presentation, the other 10 points.\n\n1.  **_Comment on an Olympic or World Game:_** Choose a memorable Olympic / world game and play its video clip in class. Analyze the game and tell the class why the game is so important / memorable / interesting / special. Imagine that you were the commentator who is watching and analyzing the game to your audience. Your video clip should be no longer than 1 minute and your comment should be about 2 minutes. (The longer, the better.) You must submit your written comment a week before your presentation.\n\n1.  **_Self-Study Project_**\n\nThis is to encourage students to use English outside the classroom. You must spend at least 4 hours on this project. Participate in the following events, or attend a talk, an event, a show, a competition etc. in which English is the main language. Submit a list/ summary of what you do before 6/13 and what you think about the event. This list should include information such as date, duration, details and any other crucial information. If you learn more hours than required, the extra time can help you get some bonus points for your final exam if your score is below 60.\n\nHere are a few suggestions for you to consider:\n\n1\\. 英語自學教室 (本部樸101)  Record the details of your visit.\n\n2\\. 英語聊天室 (本部樸102/ 公館圖書館)  Record the details of your visit.\n\n3\\. 英語工作坊 (本部樸102)  Record the details of the course or event.\n\n4\\. 師大教學發展中心/ 圖書館- 英語讀書會[http://goo.gl/xxr5rV](http://goo.gl/xxr5rV)\n\n5\\. 校內外英語相關競賽 (record the competition)\n\n6\\. 聽英語競賽轉播或演講 (summarize the broadcast / lecture and write your opinion)\n\n7\\. 語言交換 (record your language exchanges)\n\n8\\. 看英語運動影片 (a summary of the plot and what you think about the movie)\n\n9\\. 讀英文雜誌，故事或小說 (review or afterthought about the reading material)\n\n1.  **Check Moodle and email frequently**\n\nI assume that you check your email and the course site frequently. It’s your responsibility to make sure you register with the correct email address on Moodle. **Not receiving a notice is NOT an excuse for any late submission. Late submission will be penalized 10% per day.**\n\n**Grading Policies (subject to change)**\n\n1.  Attendance and Participation                                          10%\n2.  Quizzes and Self-Study Project                                        20%\n3.  Teach Your Expertise                                                        20%\n4.  Comment on an Olympic / World Game (4/18)              20%\n5.  Final Exam (5/30)                                                             30%\n\n**Teaching Schedule:** (tentative; subject to change if necessary)\n\n**_Week     Date         Contents_**                                    \n\n 01         2/14        Introduction\n\n 02         2/21        _Why Do We Have Sports?_\n\n 03         2/28        National Holiday (no class); **handout of the teaching activity due**\n\n04          3/07        _Has Exercise Always Been Important?_\n\n05          3/14       _Most Common Sports Injuries_; Teach your expertise 1\n\n06          3/21        _Body Mass and Weight_; Teach your expertise 2\n\n07          3/28       _Remote Learning_\n\n08          4/04        National Holiday (no class)\n\n09          4/11        _Cheating in Sports; Drugs in Sports_; **script of midterm report due**\n\n10          4/18        **Comment on an Olympic / World Game**\n\n11          4/25        _Gi; Gi as a Weapon_\n\n12          5/02        _Gamers: Image and Reality_; Teach your expertise 3\n\n13          5/09        _Raising a Child Athlete_; Teach your expertise 4\n\n14          5/16        _Extreme Sports_; Teach your expertise 5\n\n15          5/23       _Triathlon – One Sport, Born of Three_; Teach your expertise 6\n\n16          5/30         **Final Exam (**all the readings **/** an **open-book** test**)**\n\n17          6/06         _Self-Study Project_\n\n18          6/13         _Self-Study Project;_ **self-learning report due**",
    "methodologies": [
        {
            "type": "講述法",
            "note": "lecture by the instructor"
        },
        {
            "type": "討論法",
            "note": "pair discussion, group discussion and class discussion"
        },
        {
            "type": "問題解決教學",
            "note": "problem solution"
        },
        {
            "type": "合作學習",
            "note": "collaborative learning"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "handouts and assignments"
        },
        {
            "type": "期末考",
            "weight": 30,
            "note": "a written exam"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "involvement and contribution in discussion sessions"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "attendance"
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "oral report of a study"
        }
    ],
    "prerequisite": "◎必須先修過【共同英文(一)】◎必須先修過【共同英文(二)】",
    "general_core": []
}