{
    "year": 110,
    "term": 2,
    "name": "英語文職場實習",
    "teachers": [
        "江璧羽"
    ],
    "department": "LU21",
    "code": "ENC9003",
    "credit": 2,
    "serial": 1739,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 6,
            "from": 1,
            "to": 4,
            "campus": "本部",
            "classroom": "勤301"
        }
    ],
    "programs": [],
    "comment": "需先聯繫老師方能選課，實際分享會時間請見 Moodle 及 email。",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "9",
    "dept_group": "",
    "hours": 4,
    "description": "本課程為本系大學部及碩士班開設選修之課程，目的希望透過產學合作的方式，提供學生在學期間探索職場的各種可能性；鼓勵學生由職場實習的經驗中，培養及補足就業所需要的能力和技能，促使學生與業界接軌，增加全球就業競爭力。",
    "goals": [
        "結合理論與實務經驗，整合運用所學於相關工作"
    ],
    "syllabus": "**\\*Note: This is a course to encourage internship and grant credits for the completed internship. The official class meeting time will be determined later with the registrants. This meeting time will be scheduled for internship experience sharing only. There is no lecture in this course.**\n\n二、教學主題\n\n1\\. 學生自行聯繫實習機構，取得工作或實習機會後，方能選課。實習或工作時間不限當學期，可以回朔大學時期的實習或工作\n\n2\\. 實習內容、時間、及場域由各實習單位排定與學生專業相關進度及內容。\n\n3\\. 實習時數不可低於72小時，且應同時符合實習單位之時數要求與完成課程要求者，方能取得學分。如學生無法於同一實習機構達到產業實習時數規定，可於規定期限內至不同機構實習，並與開課老師聯繫確認，採累計時數方式進行認列。需在選課當學期送交成績前完成所需時數。\n\n4\\. 教師將以實地訪視、電話、視訊或email訪談等方式，對實習機構及實習生雙方均進行查核與評估。並在學期中安排職場實習的相關討論、成果報告、或分享。\n\n二、教學主題 (Course Content)\n\nFor thecompletion of this 2-credit-hour course, students need to fulfill a minimum of 72hours of work altogether in a semester. Job specifications, work duties andrelevant job-schedules are to be determined by and negotiated betweeninternship organizations and students.\n\nNote 1: Forverification of class registration eligibility and in obtaining pre-approval ofstudents’ self-selected work placement(s), students are required to firstcontact the instructor prior to class enrollment. Specifically, students are toprovide their proposed practicum with anticipated work duties, job tasks andintended work schedules. Student will receive confirmation via email for theirproposed practicum experience if the practicum proposal is approved.\n\nNote 2: Forthe fulfillment of the required 72 working hours in one semester, students arepermitted to intern at more than one organization (with prior consent of theinstructor).\n\nNote3. The check-in meeting will be arranged on-site or online with the student,the organization and the instructor. Students are also required to meet forsharing, reflection and presentation during thesemester.",
    "methodologies": [
        {
            "type": "討論法",
            "note": "討論實習所遇到的問題及可能的處理方式\nStudents are to regularly meet up with the instructor for work briefings. During these meetings, students are to discuss challenges and issues faced at work and to seek viable solutions for problems encountered. By maintaining immense contacts and discussions with the instructor, students are encouraged to take proactive actions for the assurance of their job quality and work performances, and in meeting corporate specifications."
        },
        {
            "type": "實地考察、參訪",
            "note": "至公私部門職場實習\nInternship in a public/private sector"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "實習書面紀錄及報告\n實習影音紀錄2分鐘\n*Written Report (A self-reflection report detailing one’s professional learning, job achievements as well as any other experiences relating with the practicum.)  \n*Video/Audio Recording (Footages containing students’ job trainings and work performances.)"
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "實習成果報告\n*Students are to provide an oral report at the end of their internship. This project shall include student progress made during the internship learning and one exhibiting the individual’s overall accomplishments on the job. (The content shall also include work-specific measures and/or actions taken in response to coaching and feedback provided by the instructor during professional consultations and relevant discussions.)"
        },
        {
            "type": "其他",
            "weight": 50,
            "note": "由實習單位主管依據出席狀況、工作表現、學習態度等評定\n*Internship organizations are to provide evaluations of students’ job performances by corporate standards and predetermined set of criteria. (Such evaluation may include: students’ professionalism in the workplace, students’ execution skills and their work outcomes.)"
        }
    ],
    "prerequisite": "",
    "general_core": []
}