{
    "year": 110,
    "term": 2,
    "name": "文學作品導讀（二）",
    "teachers": [
        "路愷宜"
    ],
    "department": "LU21",
    "code": "ENU0258",
    "type": "必",
    "grade": 1,
    "credit": 2,
    "serial": 1763,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "正302"
        }
    ],
    "programs": [],
    "comment": "建議修習輔系第二年以後選修",
    "restrict": "◎課程開放上修",
    "form_s": "1",
    "classes": "2",
    "dept_group": "",
    "hours": 2,
    "description": "",
    "goals": [
        "Learn key terms and concepts generally applied to the evaluation of literature",
        "Hone skills of close reading and critical thinking",
        "Develop curiosity about the world through context-specific analysis of literary works",
        "Improve sensitivity to the English language"
    ],
    "syllabus": "**Approaches to Literature**\n\nNational Taiwan Normal University, Spring 2022\n\nCourse instructor: Ioana Luca\n\nWednesdays, 13:20-15:10                             \n\n**Course Description**\n\nThe course introduces students to a wide range of literary genres, from different geographical areas and historical periods. It is meant to develop skills necessary to read, understand, critically analyze, and (hopefully!) enjoy literary texts. We will learn what to look for while reading fiction, non-fiction, poetry, drama, and graphic narratives. We will use techniques of literary analysis, apply literary studies terminology, and demonstrate an ability to move from descriptive observations about literary texts to larger claims about their meaning, context, and significance. We will also cultivate the ability to put our own ideas into writing and into conversation with others.\n\nAt the same time, we will also examine the roles literature has played in individuals’ lives and in society, with a focus on the function of literary works in the 20th and 21st centuries. Questions such as Why is literature produced? Why do we read literature? What effects can literary works have on our lives and contemporary society? will provide the larger framework for our discussion.\n\n**Objectives**\n\nThe primary aim of this course is to help students develop critical skills of analysis and interpretation. Students will also learn how formal and stylistic elements as well as historical context shape the meaning and significance of literature. By becoming more skillful readers of texts and their contexts, students become better readers of the worlds that literature addresses, develop their ability to decipher meaning from language, and better understand their own interactions with science, technology, media, and politics.\n\n**Textbooks**\n\nCourse pack (available in the copy-center in the basement on Shida Road), pdfs on Moodle for the first two weeks\n\nLecture notes, handouts, or any extra materials will be posted on Moodle [http://moodle.ntnu.edu.tw/](http://moodle.ntnu.edu.tw/)\n\n**Course requirements** \n\nStudents are expected to be familiar with the required readings _prior_ to class discussions. Students will be graded on the basis of (1) their active participation in the class discussions and on Moodle—60% (more details will follow) (2) a midterm & final test—40%.",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": ""
        },
        {
            "type": "Group discussion",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "other:",
            "weight": 100,
            "note": "Students are expected to be familiar with the required readings prior to class discussions. Students will be graded on the basis of (1) their active participation in the class discussions and on Moodle—60% (more details will follow) (2) a midterm & final test—40%.\n\nAttendance/Participation  10%\n\nGroup Assignments             30%\n\nMidterm Exam                      30%            \nFinal Exam                             30%"
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}