{
    "year": 110,
    "term": 2,
    "name": "寫作指導（二）",
    "teachers": [
        "陳秋梅"
    ],
    "department": "LU21",
    "code": "ENU0238",
    "credit": 2,
    "serial": 1744,
    "group": "A",
    "quota": {
        "limit": 17,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "誠305"
        }
    ],
    "programs": [],
    "comment": "建議修習輔系第一年時選修",
    "restrict": "◎必須先修過【ENU0237  寫作指導（一）】 ◎課程開放上修",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "",
    "goals": [
        "This class is to help students improve their skills in writing English paragraphs/essays."
    ],
    "syllabus": "**Guided Writing**—Spring Semester 2022\n\nFridays, 13:20—15:10 p.m.     正401\n\nInstructor: Janet Chen (陳秋梅)   Office: 誠 805\n\nemail: **[t22040@ntnu.edu.tw](mailto:t22040@ntnu.edu.tw)**\n\n1.  **Course Description:**\n\nThis two-semester course is to help students develop their ability to properly express themselves in written English. Specifically, it aims to (1) familiarize students with the fundamentals of paragraph structure (topic sentence, controlling idea, support and conclusion), (2) equip them with organizing skills to maximize the effectiveness of writing from paragraphs to short-essays, and (3) improve language skills for concise expressions of ideas. In the first semester, students are expected to review important topics of English paragraph-writing. In the second semester, students will extend their one-paragraph writing skills to three-paragraph short-essay writing. The course also develops students’ analytic writing competence in response to different scenarios. In particular, course assignments will cover intensive writing practices in different modes, including description, narration, process, definition, cause-effect, comparison-contrast, and classification. The course is chiefly conducted by means of actual writing, with the help of guided instruction and supplementary reading and reference materials.\n\nII.  Textbook:\n==============\n\nLangan, J. (2011). **_Essay skills_** (2nd ed.). Chicago, Il: McGraw-Hill. The textbook is available at 師大書苑 -- Hoping East Road, Section 1, No. 182-3, 2F. The cost of the book was $425 last year. If you choose to buy a used book, all of the answers must be removed.\n\n**III. Class Activities and Requirements:**\n\n1.  **Class Meetings:** Part of each class will be dissemination of information through lecture; however, most will be seminar format with students participating in discussions, questions, applications, and interactions with the instructor and each other. Students are expected to have read all assignments for each class.\n2.  **Attendance:** Students are expected to attend class punctually on a regular basis. If you are absent without asking for a leave, or if you are late, points will be deducted from your final grade. If absences are frequent, this could be grounds for failing the course.  \n\n1.  **Class Participation:** Students are expected to attend class, ask and answer questions, and comment during feedback sessions.\n\n1.  **Homework:** Students are expected to complete all homework assignments—drafting and revising their paragraphs, readings and exercises from the textbook, and any extra assignments.  \n\n1.  **Essays:**  A number of different types of essays will be assigned.  During the spring semester we will discuss 4 types of paragraphs—classification, cause and effect, comparison or contrast, and definition.  You will submit 2 pieces of writing for each type—the first polished draft of the essay (in-class writing, at least 3 paragraphs with about 500 words) and its revision.  The grades for the first submission and the revision are averaged together.  Prior to writing your first assignment, you will be given guidelines that address the format for submitting your work.   \n\n1.  **Peer review:** Comments that you make on your classmates’ paragraphs are a valuable part of the learning process. After each in-class writing, you exchange your draft with one of your classmates for his/her review. Look for a different reviewer every time. Then you turn in your polished draft. In the next meeting, we will look at some examples from your writing and discuss them together. Your constructive comments will be highly appreciated.\n\n1.  **Submission of written work:**  Please submit all written assignments punctually as indicated by the instructor.  Extensions will be granted only in exceptional circumstances.  Points will be deducted from your grade if assignments are turned in late. Except in-class writings, all the assignments must be printed out on an A4 paper 1.5 spaced with 12 font size.\n\n1.  **Self-Study Project:** You don’t need to come to class in the last two meetings, but you are required to do a self-study project. For example, you can write two journals, write a story on your own, practice taking two writing exams, compose a poem, write your opinions about a news event, a movie or an article, or write to your key pal, etc. Any event that helps improve your writing ability will do and you can do this task earlier than the scheduled time. Send your project unto Moodle by 6/17.\n\n1.  **Plagiarism:** Plagiarism means to use another person’s work without giving this person credit. Most students who do this do it accidentally. They copy something from the Internet or include something in their writing because a high school teacher said that the phrase or passage was an example of good writing. While it is always a good idea to look for, and try to emulate, good writing, it is NEVER acceptable to present someone else’s work as your own. If you do this, people will think you are dishonest, and it can be grounds for failing a course or losing a job. If you plagiarize in Guided Writing, it will be viewed as a serious offense and can be grounds for failing the course.  \n\n1.  To encourage students to contribute their ideas to discussion, the person who voices his opinion most often will get 2 extra points and the one who does this the second most often, 1 extra point. Each group can either keep a record or hold a vote to find out the two people who make the most contribution.\n\n**IV.  Grading:**\n\nAttendance and Participation                  5%\n\nSelf-Study Project                                     5%\n\nEssays (4 In-Class & 4 Rev.)                     60%\n\nAssignments in Class                              10%\n\nFinal Exam (In-Class Writing)                   20%\n\n       **V.  Schedule (16 weeks of in-person instruction + 2 weeks’ self-learning)**\n\n**Week**\n\n**Date**\n\n                       **Topic**\n\n          **Homework**\n\n1\n\n02/18\n\nIntroduction\n\nPractice taking the IELTS writing test\n\nTextbook—Chapter 8\n\n2\n\n02/25\n\n### Discuss the IELTS writing test\n\n### Discuss Chapter 8\n\nTextbook—Chapter 9\n\n3\n\n03/04\n\n### Discuss Chapter 8 & 9\n\nChapter 10 -- Division-Classification; pp. 268-271\n\n4\n\n03/11\n\nChapter 10 – Division-Classification\n\nFirst In-Class Writing\n\n5\n\n03/18\n\n### Discuss Your First In-Class Writing\n\nRevise your first draft\n\nChapter 10 -- Cause and Effect; pp. 259-261\n\n6\n\n03/25\n\nYour First Rewriting Due\n\nChapter 10 – Cause and Effect\n\nSecond In-Class Writing\n\n7\n\n04/01\n\nSpring Break, No Class\n\n8\n\n04/08\n\n### Discuss Your 2nd In-Class Writing\n\n### Revise your 2nd draft\n\n9\n\n04/15\n\n### Second Rewriting Due\n\n### Creative Writing: Relay Writing Stories\n\n### Finish Writing Your Story\n\n### Chapter 10 – Comparison and Contrast; pp. 261-265\n\n10\n\n04/22\n\n### Your Story Due\n\n### Chapter 10 – Comparison and Contrast\n\n### Third In-Class Writing\n\n11\n\n04/29\n\n### Discuss Your Third In-Class Writing\n\nRevise your 3rd draft.\n\nChapter 10 --Definition;\n\npp. 265-268\n\n12\n\n05/06\n\n### Third Rewriting Due\n\n### Discuss Your Stories\n\n13\n\n05/13\n\nChapter 10 – Definition\n\nFourth In-Class Writing\n\n14\n\n05/20\n\nDiscuss Your Fourth Rewriting\n\nRevise your 4th paragraph.\n--------------------------\n\n15\n\n05/27\n\nYour Fourth Rewriting Due\n\nFinal Exam\n\n16\n\n06/03\n\n### Dragon Boat Festival, No Class\n\n17\n\n06/10\n\n### Self-Learning Project\n\n18\n\n06/17\n\n### Self-Learning Project\n\nYour self-learning project due.\n-------------------------------",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "lecture"
        },
        {
            "type": "Group discussion",
            "note": "discussion"
        },
        {
            "type": "Problem base learning",
            "note": "problem solving"
        },
        {
            "type": "Cooperative learning",
            "note": "cooperative learning"
        },
        {
            "type": "Lab/Studio",
            "note": "in-class writing / short story writing"
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 60,
            "note": "4 essays and 4 revisions"
        },
        {
            "type": "Final exam",
            "weight": 20,
            "note": "final exam"
        },
        {
            "type": "Class discussion involvement",
            "weight": 5,
            "note": "discussion"
        },
        {
            "type": "Attendances",
            "weight": 5,
            "note": "attendance and participation"
        },
        {
            "type": "Case study reports",
            "weight": 10,
            "note": "story writing & assignment"
        }
    ],
    "prerequisite": "Prerequisite course: 【ENU0237  Guided Writing (I)】 ◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}