{
    "year": 110,
    "term": 2,
    "name": "小說選讀",
    "teachers": [
        "林秀玲"
    ],
    "department": "LU21",
    "code": "ENU0024",
    "type": "選",
    "grade": 2,
    "credit": 3,
    "serial": 1768,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 8,
            "to": 10,
            "campus": "本部",
            "classroom": "誠701A"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "to provide a general survey of the representative works of fiction",
        "focus on the historical, social contexts of these works"
    ],
    "syllabus": "The aim of this fiction selection course is to provide a general survey of the representative works of fiction by some major British novelists.  In addition to traditional discussion of characterization and plot, we will focus on the historical, social contexts of these works.   For example, Elizabeth Gaskell\\`s _North and South_, besides interweaving intriguing twisting plots of traditional romance, provides an acute social criticism of industrialization, class discrepancy, the discrepancy between mill owner and the workers, between the rich and the poor.   We will also pay particular attention on the depiction of London in the nineteenth and early twentieth centuries, especially represented in the works by Charles Dickens, Sir Arthur Conan Doyle, and Oscar Wilde.  At the end of 19th century, we will also look at the rise of detective fiction, as the crime of urbanization in London rises, and also the rise of  children's literature and adventure stories as industrialization makes steam-ship traveling easier, faster and safer to Asia and the other parts of the World.  \n\nAll in all, we will discuss the issues of the industrialization and the contrast between the North and South in England, the cosmopolitanism and the issues of modernity and modernization in London, and we will also discuss the issues of overseas, such as that of expanding British Empire and imperialism and colonialism depicted in Jane Austen's _Manfield Park_, the rise of adventure stories in the _Treasure Island, Around the World in 18 Days_, and other works_._ \n\nIn the class, we will watch film adaptations of these novels and documentaries of the period, and then discuss selected texts.  \n\nWe will watch the films and discuss the following works:\n\nJane Austen: _Pride and Prejudice_.\n\n\\-----.  _Mansfield Park_. \n\nElizabeth Gaskell, _North and South_. \n\nCharles Dickens,  _Great Expectations._ \n\n_\\-----.  Our Mutual Friend_. \n\n\\-----.  _The Mystery of Edwin Drood_. \n\nOscar Wilde, _The Picture of Dorian Gray_. \n\nSir Arthur Conan Doyle, _The Sign of Four_. \n\nRobert Louis Stevenson.  _The Treasure Island_.  \n\nSyllabus is subject to changeafter the discussion of registered students in the first 2 weeks, a more detailed syllabus will be announced in the class.  You may start to read these works in the winter break to prepare for the class.",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "watching film adaptations, and lecture"
        },
        {
            "type": "Group discussion",
            "note": "discussion, group discussion, group presentation."
        },
        {
            "type": "Case studies",
            "note": "thematic studies"
        }
    ],
    "grading": [
        {
            "type": "Class discussion involvement",
            "weight": 15,
            "note": ""
        },
        {
            "type": "Attendances",
            "weight": 15,
            "note": ""
        },
        {
            "type": "Presentation",
            "weight": 70,
            "note": "No midterm, nor final exams.  Students are required to submit 1 final paper.  The topics of the final paper will be announced at the end of semester.  English majors and minors have to write your paper in English; non-English majors or minors may choose to write in Chinese.  Length of the paper is at least 5 pages long, 1.5 line space.  Paper will be due one week after the examination week."
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}