{
    "year": 110,
    "term": 2,
    "name": "浪漫時代詩人",
    "teachers": [
        "曾思旭"
    ],
    "department": "LU21",
    "code": "ENU0087",
    "type": "選",
    "grade": 3,
    "credit": 3,
    "serial": 1796,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 8,
            "to": 10,
            "campus": "本部",
            "classroom": "誠305"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "3",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "To help students get a better understanding of the Romantic spirit in English Romantic period and the poems of the six major English Romantic poets",
        "Works of some famous female poets will also be discussed in class to provide students a wider and more balanced view of Romantic poetry."
    ],
    "syllabus": "**Romantic Poets**\n\n**National Taiwan Normal University, Spring 2022**\n\n**Fridays, 3:20-6:10pm**\n\nDr. Justin Prystash                                                 \n\nOffice: Cheng 720                     \n\nOffice Hours: W 10:20-12:10; F 13:20-15:10; Virtual Meetings by Appointment\n\nEmail: jsprystash@gmail.com               \n\n**Course Description**\n\nThis course is meant to give an in-depth exposure to the six major British Romantic poets: William Blake, William Wordsworth, Samuel Taylor Coleridge, Lord Byron, Percy Bysshe Shelley, and John Keats. We will make sense of these poets by thinking about historical context, learning about literary terms and techniques, and—most importantly—closely reading their poems.   \n\n**Schedule**\n\nWeek 1, 2/18: Introduction; Syllabus Review\n\nWeek 2, 2/25: William Blake, from _Songs of Innocence_ (M)\n\nWeek 3, 3/4: William Blake, from _Songs of Experience_ (M) and _The Marriage of Heaven and Hell_ (M)\n\nWeek 4, 3/11: William Wordsworth, “I Wandered Lonely as a Cloud” (M), “Ode: Intimations of Immortality” (M), and “Tintern Abbey” (M)\n\nWeek 5, 3/18: William Wordsworth, _The Prelude: Book One_ (F)\n\nWeek 6, 3/25: Samuel Taylor Coleridge, “The Rime of the Ancient Mariner” (F) \n\nWeek 7, 4/1: Samuel Taylor Coleridge, “Christabel” (F)\n\nWeek 8, 4/8: Lord Byron, _Don Juan: Canto I_ (F)  \n\nWeek 9, 4/15: Lord Byron, _Don Juan: Canto II_ (F)\n\nWeek 10, 4/22: Midterm Exam\n\nWeek 11, 4/29: Percy Bysshe Shelley, “Ozymandias,” “Stanzas Written in Dejection,” “Mutability,” and “Mont Blanc”\n\nWeek 12, 5/6: Percy Bysshe Shelley, “To a Skylark,” “The Flower that Smiles Today,” “Ode to the West Wind,” and “Hymn to Intellectual Beauty” \n\nWeek 13, 5/13: John Keats, “The Eve of St. Agnes” (F) and “Ode on a Grecian Urn”\n\nWeek 14, 5/20: John Keats, “La Belle Dame Sans Merci” and “Ode to a Nightingale”\n\nWeek 15, 5/27: Final Exam\n\nWeek 16, 6/3: Holiday (No Class Meeting)\n\nWeek 17, 6/10: Flex Week (No Class Meeting)\n\nWeek 18, 6/17: Flex Week (No Class Meeting)\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=592e397a05ce438bae6918425ce63477&fno=d6c06622a1674cf89647d03bdda1a09a)",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": ""
        },
        {
            "type": "Group discussion",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "Midterm Exam",
            "weight": 30,
            "note": "Midterm and Final Exams\n\nThe midterm and final exams will both ask you to write a response on a particular poem. A response is a short essay that summarizes the poem, provides a claim about the poem, and supports that claim by examining quotes from the poem. We will practice writing responses in class, so you should be well-prepared for these exams. On the midterm, I will offer you a choice of three short poems; you will select one to write a response on (without the help of your notes). On the final exam, I will offer you a choice of three long poems; you will select one to write a response on (with the help of your notes). Poems that might be included on the midterm are marked (M) and those that might be included on the final exam are marked (F) on the schedule below. Those that will not appear on any exam are unmarked."
        },
        {
            "type": "Final exam",
            "weight": 50,
            "note": "Midterm and Final Exams\n\nThe midterm and final exams will both ask you to write a response on a particular poem. A response is a short essay that summarizes the poem, provides a claim about the poem, and supports that claim by examining uotes from the poem. We will practice writing responses in class, so you should be well-prepared for these exams. On the midterm, I will offer you a choice of three short poems; you will select one to write a response on (without the help of your notes). On the final exam, I will offer you a choice of three long poems; you will select one to write a response on (with the help of your notes). Poems that might be included on the midterm are marked (M) and those that might be included on the final exam are marked (F) on the schedule below. Those that will not appear on any exam are unmarked."
        },
        {
            "type": "Attendances",
            "weight": 20,
            "note": "Attendance/Participation\n\nAlthough I will guide our discussions, I expect you to come to class familiar with that week’s assigned reading(s), ready to ask questions and have fruitful discussions and debates. I will take attendance every week. I will also regularly hold in-class group activities where you will analyze and/or synthesize passages from our texts and share your perspectives with others."
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}