{
    "year": 110,
    "term": 2,
    "name": "英語聽講（二）",
    "teachers": [
        "陳秋梅"
    ],
    "department": "LU21",
    "code": "ENU0280",
    "credit": 2,
    "serial": 1766,
    "group": "",
    "quota": {
        "limit": 40,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "誠701A"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "1",
    "classes": "2",
    "dept_group": "",
    "hours": 2,
    "description": "",
    "goals": [
        "1.　To build students’ academic listening skills and life situational listening proficiency",
        "2.　To develop students’ speaking skills and communication abilities."
    ],
    "syllabus": "Instructor: Janet ( 陳秋梅 )\n\nE-mail: [t22040@ntnu.edu.tw](mailto:t22040@ntnu.edu.tw)   \n\nOffice: 本部誠八樓805號研究室 \n\n**_Basic Aural-Oral Training in English II_**\n\nSpring, 2022\n\n**Focus (Objectives) of This Term**\n\n1.  To continue training the students to be able to **express their opinions fluently**.\n2.  To cultivate the students’ ability to **summarize** a story, a talk, or a lecture\n3.  To enable the students to **understand longer dialogues, stories and speeches**.\n4.  To enhance students’ ability to **understand news clips**\n\n**Teaching Materials**\n\nMain teaching materials will be provided by the students themselves and supplementary teaching materials are given by the instructor, coming either from the Internet or some frequently-used textbooks.\n\n**Course Requirements**\n\n1.  **_Cheating on quizzes or exams_** is absolutely forbidden. If someone is found cheating on an exam, he/she will be flunked.\n\n1.  **_Attendance and preparation_**: You are expected to attend the class well-prepared. For every unexcused absence, 3 points of your final grade will be deducted. Being late for over 30 minutes is treated as absence for the class that day. If you are absent in case of uncontrollable situations (e.g. illness, emergency, etc.), be sure to ask for leave **within two weeks** and make sure that I receive the official notice. Besides, you cannot ask for more than **5** leaves the whole semester according to the school regulations.\n\n1.  **_No eating or drinking in the lab_**. To keep the lab clean, no eating or drinking is allowed.\n\n1.  **_A notebook (or paper for writing) is a must._** You’ll be often required to take notes while listening to a lecture/talk. Then you exchange your notes with your group members and think about how to improve your note-taking skills.\n\n1.  You are not supposed to use your **phone** to do things irrelevant with the class.\n\n1.  **_Class participation_**: Lesson conductions will engage you in a variety of tasks such as pair practices, group/class discussions, role plays. You’re supposed to participate actively in these activities so as to develop real-time communication skills.\n\n1.  **_Listening Activity_**\n\nTwo people work together to find an interesting/educative talk and a news report from the Internet to be the learning material. The talk should be about **3-5 minutes** long **without subtitle** and the news report, **no longer than 3 minutes**. Design a handout with an introduction (background knowledge), a list of difficult vocabulary, 5 questions that test the main points, and 2-3 follow-up questions for the audience to discuss further. The presenter must prepare a handout for all his classmates. The audience must write down their answers on the handout and finish the questionnaire that follows. This activity will start from 3/06. The handout must be submitted to Moodle by 2/28. I’ll review each handout a week before their presentation. Think carefully about how you can engage your audience – whether the topic is interesting, whether the difficulty level of the talk is appropriate? Would it be too difficult or too easy? Each presenter has 20 minutes to do this activity (including introducing the background information, teaching the difficult words/phrases/idioms in the video, playing the video, asking comprehension questions and leading the follow-up discussion). Try to imagine that you were the teacher and how you could stimulate your students.\n\n1.  **_Speaking Practices:_**\n\nIn every meeting, the first 20 minutes is used for group discussion. About 6 people form a group. Choose a person who is well-organized, eloquent and responsible to be the leader to host the discussion. Each time a topic is given for you to discuss. Within the first 10 minutes, you brain storm together and take turns presenting your ideas to your group members. And then three of you must represent your group to report your discussion (based on the notes you’ve taken) to another three groups, who will rate your performance. Each report must be at least 2 minutes long. In this semester, you must give such a report 4 times. Afterwards, each of you will be required to give an impromptu report. In other words, there’ll be altogether five speaking practices and they will comprise 15 points.\n\n1.  **_Talk Show:_**\n\nNear the end of the term, your group must give a talk show. Choose one to be the host and the others, the invited guests. You pick your own topic (e.g. the downside of robots or GM foods; the problems caused by social networking websites; the impact of online courses /working holidays on our society; reasons for the emergence of emoticons /YouTubers; whether we should legalize marihuana/possession of guns or not; etc.). At the beginning of the show, the host tells the class what motivates them to discuss the topic. Then he elicits talk from the invited guests, reconciles different opinions among them, if necessary, and concludes the main findings at the end. The show must be at least 12 minutes long (depending on how many people there are; basically each person 2 minutes). Use multimedia to make your show attention-getting. Everyone must talk for some time. Only the members who make their contribution can get the credit. The more interesting the show is, the higher score they’ll get. Criteria for this task– time control, plentiful ideas, fluent delivery, good organization, and degree of audience’s involvement.\n\n1.  **_Skit Performance_**\n\nGroup work. The skit should be about **10-15 minutes** long. You could write your own play or adapt a well-known story into your own version, or even choose a play from online. This task is intended to give you a chance to explore yourself by doing something very different from your daily routines. The more popular the performance is, the more points the group gets. Criteria for this task are as follows:\n\n1.  Content & fluency of language delivery  70%\n2.  Presentational skills (acting, interpretation of the content, quality of voice projection) 20%\n3.  Stage decoration (props; costumes) & acoustic effects (music & special sound effects) 10%\n\n1.  **_Self-Study Project & Listening Exam_**\n\nThe final listening exam falls on 5/30. To get good scores, you are advised to do as much after-class listening practice as possible (like listening to TED Ed., ABC news, CNN news, etc.) In the last 2 meetings (6/06 & 6/13), you don’t need to come to class, but you must learn on your own and keep a self-learning record. The record requires at least 4 hours of learning and constitutes 5 points. On the record, please write down information about the date, the program you listen to or the event you do (speaking activities like attending speech contests, joining English clubs, being English tutors, etc.), duration of the listening / speaking task, a brief summary of the task, what you’ve learned, etc.) Please add up all the times and put it at the first line. If you learn more than 4 hours, the extra time will help you get some bonus points when your score in the final exam is under 70. Basically, one extra hour will get one extra point for the final exam. An example of the report is in the appendix.\n\n**Grading Policies**\n\n1.   Attendance and Participation               5%\n2.   Self-Study Project                                 5%\n3.   Listening Activity                                10%\n4.   Speaking Practices (five times)           15%\n5.   Talk Show                                            15%\n6.   Skit Performance                                 20%\n7.   Final Exam ( listening test)                  30%\n\n**Tentative Schedule (16 weeks’ in-person instruction + 2 weeks’ self-study)**\n\n_Wk  Date  Content_                                                     \n========================================================================\n\n1   2/14   Introduction\n\n2   2/21   Group discussion & essential note-taking skills & listening strategies\n\n3   2/28   National Holiday; **Handout of LA is due**.\n\n4   3/07   Discussion Round 1; Listening Activity 1 & 2\n\n5   3/14   Discussion Round 1; LA 3 & 4\n\n6   3/21   Discussion Round 2; LA 5 & 6\n\n7   3/28   Discussion Round 2; LA 7 & 8\n\n8   4/04   National Holiday (No Class)\n\n9   4/11   **Skit Performance**\n\n10  4/18   Discussion Round 3; LA 9 & 10\n\n11  4/25   Discussion Round 3; LA 11 & 12\n\n12  5/02   Discussion Round 4; LA 13 & 14 (**topic of talk show is due**)\n\n13  5/09   Discussion Round 4; LA 15 & 16\n\n14  5/16   **Talk Show**\n\n15  5/23   Discussion Round 5\n\n16  5/30   **Final Exam (listening test)**\n\n17  6/06   Self-Study Project\n\n18  6/13   Self-Study Project **(self-learning report due)**",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "lecture"
        },
        {
            "type": "Group discussion",
            "note": "discussion"
        },
        {
            "type": "Problem base learning",
            "note": "problem solving"
        },
        {
            "type": "Cooperative learning",
            "note": "cooperative learning"
        },
        {
            "type": "Case studies",
            "note": "talk show"
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 5,
            "note": "self-learning report"
        },
        {
            "type": "Final exam",
            "weight": 30,
            "note": "listening test"
        },
        {
            "type": "Class discussion involvement",
            "weight": 15,
            "note": "group discussion and speaking practices"
        },
        {
            "type": "Attendances",
            "weight": 5,
            "note": "attendance and participation"
        },
        {
            "type": "Presentation",
            "weight": 10,
            "note": "listening activity"
        },
        {
            "type": "Case study reports",
            "weight": 15,
            "note": "talk show"
        },
        {
            "type": "other:",
            "weight": 20,
            "note": "skit performance"
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}