{
    "year": 110,
    "term": 2,
    "name": "英語會話（二）",
    "teachers": [
        "多德"
    ],
    "department": "LU21",
    "code": "ENU0270",
    "credit": 2,
    "serial": 1760,
    "group": "B",
    "quota": {
        "limit": 25,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "誠304"
        }
    ],
    "programs": [],
    "comment": "建議修習輔系第一年時選修",
    "restrict": "◎課程開放上修",
    "form_s": "1",
    "classes": "1",
    "dept_group": "",
    "hours": 2,
    "description": "",
    "goals": [
        "Acquire the attitude that is conducive to having English conversation.",
        "Know the stages involved in the English conversation process.",
        "Acquire the skills to open, sustain and close an English conversation.",
        "Learn the vocabulary for topics commonly mentioned in daily conversations.",
        "Acquire the skills to perform FTA’s (Face Threatening Acts) like requesting, rejecting a request, hiding true feelings, and deflecting embarrassing questions.",
        "Learn how to conduct phone conversations.",
        "Acquire the knowledge and ability to conduct conversations at a job interview."
    ],
    "syllabus": "**Objective:**  \nStudents will improve their ability to express their ideas and opinions clearly and coherently through preparing and presenting material on personal interests / experiences and current affairs for group discussions. Whenever appropriate students will draw on self-selected authentic materials.\n\nStudents will also be given instruction on how to improve their language skills, with particular emphasis on comprehensible input and autonomous learning.\n\n**Schedule:**\n\nThe course is divided into three tasks with students being required to do one presentation per task. The tasks are:\n\nTask One: ‘Two Sides of the Issue’\n\nStudents will be introduced to the basic skills needed to prepare and give an effective presentation on self-selected debate topics. The task involves engaging with the debate topics in small groups as well as follow-up discussions.\n\nTask Two: ‘Teacher For A Day’\n\nStudents will work in groups to prepare and give a communicative language lesson in English. Instruction, examples and advice will be provided on communicative language learning, lesson planning and classroom management.\n\nTask Three: ‘How To’\n\nStudents will work in groups to teach each other _‘how to’_ do skills that they themselves have mastered. Instruction, examples and advice will be provided on the language needed to complete this task successfully.\n\nA tentative schedule will be drawn up during the first class of the semester as students are given dates on which to complete the three tasks.\n\n**Class Activities:**\n\nLecturing / Presentations / Group and Class Discussions",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": ""
        },
        {
            "type": "Group discussion",
            "note": ""
        },
        {
            "type": "Cooperative learning",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "Class discussion involvement",
            "weight": 25,
            "note": ""
        },
        {
            "type": "Attendances",
            "weight": 15,
            "note": ""
        },
        {
            "type": "other:",
            "weight": 60,
            "note": "Two Sides, Teacher for a Day, How To"
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}