{
    "year": 110,
    "term": 2,
    "name": "美國文學",
    "teachers": [
        "高瑪麗"
    ],
    "department": "LU21",
    "code": "ENU0226",
    "type": "必",
    "grade": 3,
    "credit": 3,
    "serial": 1812,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 12
    },
    "schedule": [
        {
            "day": 2,
            "from": 3,
            "to": 5,
            "campus": "本部",
            "classroom": "正304"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "3",
    "classes": "1",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "To survey American literature from the discovery period through the mid-nineteenth century",
        "To cover a variety of genres: history, sermon, political pamphlet, lyric, short story and novel"
    ],
    "syllabus": "SURVEY OF AMERICAN LITERATURE\n\nSpring 2022\n\nCOURSE OBJECTIVES: This course is a one-semester introduction to the history of American literature, surveying material from the discovery period through the mid-nineteenth century. The course takes a chronological approach to the literary material, with discussion of the historical circumstances and social and intellectual trends in each period. We will cover a variety of genres: history, sermon, political pamphlet, lyric, short story and novel.\n\nCOURSE TEXT: **Norton Anthology of American Literature, shorter 9th edition (2-volume set)**\n\nTENTATIVE SCHEDULE OF READINGS (PAGE NUMBERS TENTATIVE,depending on edition of Norton anthology) \n\n1\\. Course Overview. In Norton, “Beginnings to 1700,” pp. 1-9; Christopher Columbus, Letters, 24-8; Cabeza de Vaca, “Relation,” 30-36; John Smith, from “The General History of Virginia,” 43-53.  \n  \n2\\. “Pilgrims and Puritans,” 9-14; Bradford, from “Of Plymouth Plantation,” Book 1, pp. 57-61;Book II, 66-71; Winthrop, “ A Model of Christian Charity,” 75-87  \n  \n3\\. Anne Bradstreet, pp. 97- ff;“The Prologue,” “To Her Father With Some Verses,” “The Author to Her Book,” “Before the Birth of One of her Children,” “ To My Dear and Loving Husband,” “Here Follows Some Verses Upon the Burning of Our House”; Edward Taylor, pp. 134 ff. “Prologue,” “Meditation 42,” “Upon Wedlock, and Death of Children,” “Huswifery.” “American Literature 1700-1820,” pp. 151-155.  \n  \n4\\. Jonathan Edwards, “Sinners in the Hands of an Angry God,” pp. 194-205; Benjamin Franklin, “The Way to Wealth,” pp. 218-225; The Autobiography, Part One, 231-ff (as much as possible), and Part Two, 282 (middle) to 292.  \n  \n5\\. Jefferson, “ A Declaration by the Representatives of the United States of America, 342-46; de Crevecoeur, Letters from an American Farmer, Letter III, “What is an American,” 310 ff; Paine, from Common Sense, 326-332; “The Crisis,” 332-40.  \n  \n6\\. Phillis Wheatley, pp.419 ff; “On Being Brought from Africa to America,” “ To S.M., a Young African Painter,” “ To His Excellency General Washington”; Olaudah Equiano, “Interesting Narrative of the Life,” 357-68.; Samuel Occom, ‘A Short Narrative of My Life,” 209 ff.  \n  \n7. “American Literature 1820-1865,” 431-4408; Irving, “Rip Van Winkle,” 455-67; Cooper, The Last of the Mohicans,, pp. 469-75; the Cherokee Memorials, pp. 570 and 580; William Apess, “An Indian’s Looking-Glass for the White Man,” 483 ff.   \n  \n8\\. Ralph Waldo Emerson, “Self-Reliance”(532 ff) and “Nature” (Introduction, 492 ff); Henry David Thoreau, “Resistance to Civil Government” (829) and Walden, 1 (Economy, pp. 844 ff) and 2 (Where I Lived, and What I Lived For, pp. 886 ff).\n\n  \n9\\. MIDTERM EXAM (Journals due)\n\n  \n10\\. Hawthorne, “The Birthmark” (631) and other Hawthorne stories;  Edgar Allan Poe, “To Helen”; “The Raven”; “Annabel Lee”; The Philosophy of Composition; “Ligeia”; Herman Melville, “Bartleby the Scrivener.” (1093).  \n  \n11\\. Harriet Beecher Stowe, Uncle Tom’s Cabin, Chapters VII (767) and XII (787); speech by Sojourner Truth; Harriet Jacobs, Incidents in the Life of a Slave Girl, I, VII, X, XLI; Frederick Douglass, Narrative, Chapters I, VI, X.  \n  \n12\\. Walt Whitman, Preface to Leaves of Grass; “Once I Pass’d through a Populous City”; “Crossing Brooklyn Ferry”; “Song of Myself” (Sections 1,2,5,6,10,11, 15,21,24, 31,32,43, 48). Introduction to Emily Dickinson.  \n  \n13\\. Emily Dickinson, Poems 67, 185, 241, 258, 280, 303, 341, 435, 449, 465, 632, 712, 754, 986, 1078, 1129. “American Literature 1865-1914,” pp. 1255-1267. Introduction to Mark Twain’s Huckleberry Finn.  \n  \n14\\. Mark Twain, Huckleberry Finn.\n\n15\\. Mark Twain,Huckleberry Finn.\n\n16\\. FINAL EXAMINATION. Reading Journals Due in one week. \n\n17-18 Flexible Weeks. Films TBA",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": ""
        },
        {
            "type": "Group discussion",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 15,
            "note": "READING JOURNAL (weekly responses to readings; to be collected twice in semester)"
        },
        {
            "type": "Midterm Exam",
            "weight": 35,
            "note": ""
        },
        {
            "type": "Final exam",
            "weight": 40,
            "note": ""
        },
        {
            "type": "Class discussion involvement",
            "weight": 10,
            "note": "PARTICIPATION (including attendance, preparedness, and participation in class discussions)"
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}