{
    "year": 110,
    "term": 2,
    "name": "英語教材教法（教）",
    "teachers": [
        "劉宇挺"
    ],
    "department": "LU21",
    "code": "ENUE001",
    "credit": 2,
    "serial": 1809,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "正305"
        }
    ],
    "programs": [
        "PASSION偏鄉教育學程"
    ],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "3",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "This is an introductory course that aims at helping students become familiar with current theories and practices in EFL teaching and learning. Students will be exposed to common approaches and practices in EFL through reading articles, viewing video-tapes, and doing hands-on projects. The focus of the first semester is on introducing ESL methods and approaches and the second semester will focus on techniques to teaching language skills and components.",
    "goals": [
        "To help students become familiar with current theories and practices in EFL teaching and learning",
        "To familiarize students with techniques to teaching language skills and components."
    ],
    "syllabus": "【授課方式：16+2週】\n\n**英語教材教法English Teaching Materials and Methods**    \n\nInstructor: 劉宇挺                                                                     \n\nE-mail: [yeutingliu@ntnu.edu.tw](mailto:yeutingliu@ntnu.edu.tw)\n\n**Course Description:** \n\nThe main objective of this course is to introduce you to issues, theories and methods of teaching English to speakers of other languages. In this course, we will trace the historical development of second/foreign language teaching methods from grammar-based curricula to present-day interactive methods, where most of our focus will be placed. TESOL approaches and methods will be studied/discussed in terms of their theoretical underpinnings; in addition to the theoretical focus, we will also discuss the practical aspects of teaching English as a foreign/second language. By the end of the course, you will be well-versed in applying major teaching methods that are currently being used in most EFL/ESL classrooms.\n\n**Required Text:**\n\nBrown, H. D, & Lee, H. (2015). Teaching by Principles: An Interactive Approach to Language Pedagogy (4th edition). New York: Pearson Education. \n\n**Supplementary Resources:** \n\nLarsen-Freeman, D. (2000). _Techniques and principles in language teaching (2nd ed.)_. Oxford University Press. \n\n**Class Policies:**\n\n*   The course will be conducted in English  \n*   As a courtesy to me and to your peers, I expect you to come to every class on time with your readings completed and prepared to participate in discussion and group activities. You are allowed to miss one session for justifiable reasons (i.e. illness, family emergencies, or important occasions such as religious holidays, or job interviews). If you have to miss a class session, please notify me as early as possible. Also, it is your responsibility to hand in any assignments on time and to find out what you have missed. Multiple absences may result in an automatic failing grade.\n*   Written and oral assignments must be completed in full and passed in by the scheduled due dates. Late assignment will result in a grade penalty of three points a day. Assignments late for more than one week will NOT be accepted. \n*   Written assignments should be typed and double-spaced (1.55 spaced if using Chinese version of Microsoft Office) with reasonable margins (not more than 2.54 cm on each side of the paper). \n*   Academic honesty is expected at all times. Plagiarism will result in a serious grade penalty and may lead to an automatic failing grade for the course.   \n\nSchedule\n========\n\nWeek 1                        Course Introduction. \n\nWeek 2                        Chapter 3: Contextualizing Communicative Approach\n\nWeek 3                        Chapter 10: Lesson Planning\n\nWeek 4                       Chapter 11: Techniques, Textbooks, and Materials\n\nWeek 5                       Chapter 12: Technology in Language Learning and Teaching\n\nWeek 6            彈性授課\n\nWeek 7            Chapter 13: Creating an Interactive Classroom\n\nWeek 8                        Chapter 14: Classroom Management \n\nWeek 9                       Midterm exam/project presentation  \n\nWeek 10          彈性授課\n\nWeek 11          Chapter 15: Teaching Listening \n\nWeek 12          Chapter 16: Teaching Speaking \n\nWeek 13                     Chapter 17: Teaching Reading \n\nWeek 14          Chapter 18: Teaching Writing\n\nWeek 15                     Chapter 19: Teaching Grammar and Vocabulary \n\nWeek 16                     Chapters 20: Language Assessment \n\nWeek 17          Chapters 21: Classroom-Based Assessment \n\nWeek 18                      Final presentation\n\n**Grading Criteria**\n\nAttendance & Participation 10%\n\nGroup Presentation 10%\n\nMidterm exam/project 35%\n\nFinal exam/project 35%\n\n**General Descriptions of Requirements:**  \n\n1.For methodology videos, please preview necessary online or written materials associated with the language teaching methods to be demonstrated.  \n\n2.Group presentation: Each group will be responsible for one weekly presentation. The presentation should be about 15 minutes long.\n\n3.Video reflection: Except for the presentation group, each group will have to record a three-minute video reflection weekly. After reading the chapter for each week, the group has to decide on one issue of focus and every member of the group will have to express his/her perspective on the issue of choice. The submitted video reflections will be randomly selected by the teacher to be shown to the class for further class discussion. The recorded clips should be submitted to the class leader the day before the class (either via e-mail or CDR). The class leader will have the clips ready to be shown before the class starts (CDR). \n\n**Explanation of chapter task: You will be working in groups of 4 or 5s on the tasks.**\n\n1.After reading, you will design a poster of your understanding of Chapter 2. This chapter discusses the history of language teaching. You will use a flow chart or a history chart to demonstrate your understanding of how different language teaching methods developed.  \n\n2.You will be asked to read Chapter 3 and design a list of 20 questions. You will be responsible for asking questions to other students and providing the best answers for the questions you have designed. Your questions must be based on the Chapter 3 content. Evaluation will be based on the quality of your questions and the preparedness of your answers. \n\n3.You will be asked to conduct an interview of a student or several students from the Mandarin language training center at NTNU after reading Chapter 4. You need to video-record your interview. Based on the interview, you need to construct learner profiles. In the profiles, you need to explain background information of the students, the principles of learning that have been identified, and whether the students are successful learners of the second/foreign language. You will show your edited video tape to accompany the presentation. \n\n4.After reading chapter 5, you need to find one student who is very interested in language learning and one student who is not very interested. You will need to interview the two students to find out the reasons for the interest or a lack of interest in language learning (The interviews can be in either English or Chinese). These reasons can be from factors suggested in Chapter 5. In the class, you will present some parts of the interviews and your analysis of the two students’ motivation and their success in learning languages. \n\n5.You will be asked to observe a class. You will need to read chapter 6 so that you will be able to know what to observe. After observation, you need to document on the language teaching approach used and the learning characteristics of the students you observed. You can also comment how well the teacher has addressed the needs of the students.   \n\n6.You will read chapter 7. You will be asked to record a one-minute English self introduction of at least 6 students of various proficiencies. In the class, you will play the recordings to the class and get the students to rate the speakers based on the proficiency index provided in the chapter. After the rating activity, you will explain how your group has rated these speakers and how you have determined these ratings. \n\n7.You will read chapter 13. After reading chapter 13, you will be asked to combine the chart on pg 217 and pg 220 and create a new observation recording sheet. You will be given a recording of a class to observe. You are required to use your new observation sheet to observe the recording and document how interaction has occurred and what questions have been used in the classroom. You will also be asked to show your new observation recording sheet and share your analysis with the class with edited clips of the class. \n\n8.You will be asked to read chapter 25. After reading, you will find one language teacher you want to discuss. You will need to provide a short clip of the teacher in the classroom and explain through the clip the qualities of the particular language teacher. You will also need to interview the teacher to find out professional development the teacher has taken in order to improve on different aspects of personal and professional growth.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 20,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 40,
            "note": "final project presentation"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "Attendance & participation:"
        },
        {
            "type": "報告",
            "weight": 10,
            "note": "Lecture report"
        },
        {
            "type": "其他",
            "weight": 20,
            "note": "Presentation"
        }
    ],
    "prerequisite": "",
    "general_core": []
}