{
    "year": 109,
    "term": 2,
    "name": "政治生態學研討",
    "teachers": [
        "莫家俊"
    ],
    "department": "LM23",
    "code": "GEC8027",
    "credit": 3,
    "serial": 1630,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 5
    },
    "schedule": [
        {
            "day": 1,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "地理系研討室五"
        }
    ],
    "programs": [
        "原民教育學程"
    ],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "Globally there are around 300 million indigenous peoples, consisting of approximately 5000 distinct cultures. They live in every part of the world – ranging from the Arctic Circle to tropical rain forests. It is estimated that indigenous peoples occupy 22% of the world’s surface and live in areas which occupy 80% of the planet’s biodiversity and ecosystems.  The natural environment forms an integral part of many indigenous peoples’ livelihoods, cultures, worldviews, and identities which are essential for their survival. However, many indigenous and local communities are threatened by deforestation, mining, restrictive government policies, and bad consequences of ‘development’. The main aim of this advanced course is to outline the key ideas and theories of political ecology, traditional ecological knowledge (TEK), and local natural resource management, and its underlying principles and approaches. This course allows students to appreciate the ecological, spiritual and socio-cultural values, and holistic nature of TEK, and critically analyze current discourses on natural resource conservation from a political ecology perspective. This course will be suitable for students both in human and physical geography, and for students in sustainability and social sciences. We will focus both on indigenous and local communities in Taiwan, but also in other parts of the world.",
    "goals": [
        "Understand and critically discuss theories on political ecology, nature conservation and traditional ecological knowledge systems.",
        "Be familiar with the negative effects of development interventions, land grabbing, economic development and nature conservation on local and indigenous peoples.",
        "Map the different stakeholders and governance regimes involved in nature conservation and rural development from  a political ecology perspective.",
        "Evaluate the sustainability of ‘bottom-up’ nature conservation programs across various geographical contexts."
    ],
    "syllabus": "\\[The course is in English, but please don't worry, it is an excellent opportunity to practice your English\\]\n\n全球有大約300萬原住民人口，其中包含約5000種不同的文化。他們居住在世界各地，從雨林到北極圈。據估計，原住民居住分布佔在全球地表面積的22%，並且佔80%的生態多樣與生態系統。自然環境組成了許多原住民的生計、文化、世界觀以及認同，是生存的必須。然而，許多原住民及地方社區被礦業、森林砍伐、政府政策限制以及其他不好的發展所威脅。本堂課的主要目標是建立政治生態學的理論與重要概念、傳統生態知識(traditional ecological knowledge, TEK)與地方自然資源管理，以及相關的方法與原則。此課程讓學生學習去感謝生態、精神與社會文化價值以TEK神聖的本質，並且從政治生態學的角度分析目前自然資源保存的課題。我們將不僅會關注台灣的原住民以及地方社區，也會涉略國外的案例。\n\n這堂課適合對有興趣以政治的視角探討，自然保護、永續以及環境與社會正義議題的同學。此外，此課程也規劃前往台灣的原住民部落進行戶外實察，以實際的探討政治生態學的議題。我們不僅關注於原住民以及地方社區，我們同時會探究其他的議題如：全球氣候變遷、發展相關理論、都市及鄉村環境衰退，等等。此課程藉由媒體資源、地方田野調查並且邀請專家於課堂分享經驗，將理論與與實務案例探究並重。\n\nWeek 1: Introduction to the Course\n\nWeek 2: Introduction to Political Ecology\n\nWeek 3: Guest Lecture 1 TBA\n\nWeek 4:Indigenous Peoples in the World\n\nWeek 5:Guest Lecture 2 TBA\n\nWeek 6: De-growth and Post-Development Theories\n\nWeek 7: Guest Lecture 3 TBA\n\nWeek 8: Traditional Ecological Knowledge: What is TEK and why is it important?\n\nWeek 9: Case studies in TEK\n\nWeek 10: Adaptive capacity, Nature Conservation and Natural Resource Management\n\nWeek 11: Eco and Indigenous Tourism: Curse or Development Opportunity?\n\n**Week 12: Preparation for the field trip and Fieldtrip**\n\nWeek 13: Global Climate Change and Sustainability\n\nWeek 14: Land Grabbing, Mining, and Human Rights\n\nWeek 15: Urban Political Ecology + Research Methods in PE\n\nWeek 16: Wrap-up Lecture + talk about your essay + opening up of take-home exam\n\nWeek 17: Reading week – take home exam (no class)\n\nWeek 18: Reading week – take home exam + final deadline (no class)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "This course consists of lecturers which are both theoretical and empirical."
        },
        {
            "type": "討論法",
            "note": "Students are required to lead seminars to practice their presentation skills."
        },
        {
            "type": "實地考察、參訪",
            "note": "We will visit an Indigenous Community in Taiwan"
        },
        {
            "type": "媒體融入教學",
            "note": "We will make ample use of media and visual materials during formal lectures."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 50,
            "note": "Write a short essay and present it during class – choose a theme related to political ecology (a topic list will be provided) – 20%.\nPhoto-based essay during the fieldtrip – 20%\nAssignment on the guest lecture in the class – 10%"
        },
        {
            "type": "期末考",
            "weight": 30,
            "note": "This includes all the readings, discussions, and lectures."
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "In each class we will have class debates, video assignments, or other forms of class involvement."
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Everyone is required to attend the lectures and seminars, unless you have a valid reason not to come."
        }
    ],
    "prerequisite": "",
    "general_core": []
}