{
    "year": 107,
    "term": 2,
    "name": "特殊兒童認知與學習專題研究",
    "teachers": [
        "王曉嵐"
    ],
    "department": "EM09",
    "code": "SPC0005",
    "credit": 2,
    "serial": 516,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 5,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "特203"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 2,
    "description": "本課程旨在協助學生了解特殊兒童的認知和學習發展，並認識主要的認知發展理論以及研究方法。經由上課講授、課堂討論、以及閱讀指定教科書和期刊論文，讓學生了解孩童認知發展的過程，並培養學生具有應用課堂所學，深入觀察特殊兒童認知歷程的研究興趣和教學能力。課程內容包含：認知發展的主要理論、特殊兒童主要認知功能的建構，如知覺、概念、語言、推理與記憶的發展，包括認知神經基礎異常之探討。\nWhat behavioral, cognitive, and neurological features characterize individuals with developmental disabilities? How are developmental disabilities/talents defined, identified, portrayed, and experienced? In this course, we will integrate theoretical perspectives, cognitive neuroscience findings, and the clinical process to understand developmental disabilities/talents. Personal narratives, portrayals in the media, and how the science of disabilities is incorporated into law and education policy will further inform our study of these topics.",
    "goals": [
        "瞭解兒童與學習心理學的起源、發展簡史、發展脈絡",
        "了解特殊兒童認知心理與神經機制的歷程與異常",
        "認識研究特殊兒童疾患的實驗方法",
        "瞭解特殊兒童認知與特殊教育的關係"
    ],
    "syllabus": "第一週： Overview of the Course for Savvy Shoppers 課程簡介\n\n第二週： Perspectives on Developmental Disabilities and Talents 有關發展性疾患和資賦優異的觀點\n\n第三週： Reading Disabilities I 閱讀障礙與困難 1\n\n第四週： Reading Disabilities II 閱讀障礙與困難 2\n\n第五週： Writing Disabilities 書寫障礙\n\n第六週： Communication/Oral Language Disabilities 溝通障礙\n\n第七週： Auditory Impairments 聽覺障礙\n\n第八週： Midterm Presentations 期中報告\n\n第九週： Autism Spectrum Disorders I 自閉症 1\n\n第十週： Autism Spectrum Disorders II 自閉症 2\n\n第十一週：Attention Problems, Attention Deficit Hyperactivity Disorder 注意力不集中與過動症\n\n第十二週： Executive Function/Attention Disabilities 執行功能障礙與注意力缺陷\n\n第十三週： Conduct Problems and Conduct-Related Disorders 行為問題\n\n第十四週： Anxiety, Stress, Schizophrenia, and Depression 精神疾患\n\n第十五週：Mathematics Disabilities 數學障礙\n\n第十六週： IQ, Genes and the Brain 智力、基因與大腦\n\n第十七週： Malleable Minds: Translating Insights From Neuroscience to Gifted Education 神經科學與資優教育\n\n第十八週： Final Presentations 期末報告",
    "methodologies": [
        {
            "type": "講述法",
            "note": "解釋神經心理學各學派知識、概念與研究方法"
        },
        {
            "type": "討論法",
            "note": "藉由全班討論或小組討論來表達獨力想法與立場"
        },
        {
            "type": "實驗/實作",
            "note": "課後參與神經心理學相關實驗以實際了解研究過程"
        },
        {
            "type": "專題研究",
            "note": "融合已知文獻發展個人教學或研究計畫"
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 20,
            "note": "期中報告The topic may be a new theory in the field together with evidence pro and con, research findings supporting a new etiologic model for a particular disorder, a major controversy, or another theme in developmental psychopathology that is of special interest to you."
        },
        {
            "type": "期末考",
            "weight": 20,
            "note": "期末報告The topic may be a new theory in the field together with evidence pro and con, research findings supporting a new etiologic model for a particular disorder, a major controversy, or another theme in developmental psychopathology that is of special interest to you."
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "Performance will be graded based on speech content, clarity of expression and organization of ideas."
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Full-attendance is strongly encouraged."
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "課後心得Readings assigned in the syllabus will be the focus of your brief thought papers (word limit specified for each paper—typically 500-1000 words max; 1-2 pages). You will need to submit 6 out of 15 thought papers. You will be asked to focus on specific readings from the syllabus and to (a) summarize the most important issue raised, (b) note how the authors address the issue and what they conclude, (c) offer your own analysis or your critique of the authors’ work, and/or (d) offer your own proposal for future research that would more effectively address the issue."
        },
        {
            "type": "其他",
            "weight": 10,
            "note": "To volunteer attending any funded psychological research is recommended. This will help students to actually understand the procedure of experiments."
        }
    ],
    "prerequisite": "",
    "general_core": []
}