{
    "year": 109,
    "term": 1,
    "name": "古典小說與人生",
    "teachers": [
        "李志宏"
    ],
    "department": "GU",
    "code": "01UG032",
    "credit": 2,
    "serial": 959,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "正202"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎國文系（學）不得選修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本課程主要以中國古典短篇小說作品為研讀和討論的對象(每年度教學篇章安排將依課程需求作一適當調配)，教學過程中強調以敘事(narrative)的認識和分析為基礎，在問題導向中引導本課程學習者理解小說作為一種文化釋義形式的獨特藝術表現，並重視在古今互文閱讀和討論的過程中積極融入歷史意識、生命探索和自我辯證等等的思考面向。最終，培養學習者在多元問題視野中閱讀中國古典小說作品，從中深入了解小說的藝術性，以及認識小說與人生的聯繫關係。",
    "goals": [
        "了解中國古典小說發展的藝術風貌，認識不同文體小說創作的情感、精神與文化內涵，擴展文化藝術視野。",
        "提昇閱讀中國古典小說的基本方法，瞭解如何對於小說作品進行描述、分析、推理，增進藝術鑑賞的審美判斷能力。",
        "通過古今互文閱讀和問題思考，整合中國古典小說與現代人生、文化的聯繫關係，從中涵養個人的歷史感和人生觀，增進文學接受的藝術素養和美感精神。"
    ],
    "syllabus": "古典小說與人生課程大綱\n\n一、導論：課程內容介紹\n\n    1.課程大綱與實施方式說明\n\n    2.文學教育的反思──以〈夸父追日〉為例\n\n 二、中國古典小說發展與藝術概說\n\n    1.創作：在真實與虛構之間\n\n    2.美學：在傳知與教化之間\n\n三、古典小說閱讀與鑑賞\n\n    1.主題報告分組\n\n    2.古典小說閱讀方法──以〈美猴王〉為例\n\n 四、神話與傳說選讀與賞析\n\n●存在與生命經驗的想像\n\n   從蒙昧時代開始，人類以其原始而幼稚的心靈和思維，在觀察生活過程中創造出各種充滿幻想性的神話。神話作為原始先民探索世界、認識自我的起點，反映出先民對於所處宇宙天地的好奇與想像。在神話世界裡，人類通過各種夢幻時空的創造，試圖建構宇宙圖像、理解生命起源及尋求自我定位。因此，神話的神聖性及其文化意義，便充分展現在先民以其原始思維表達對自身存在的根本理解之上。\n\n    1.〈盤古開天闢地〉\n\n    2.〈女媧摶土造人〉\n\n    3.〈黃帝與蚩尤〉\n\n 五、神話與傳說選讀與賞析\n\n    ●存在與生命信仰的建構\n\n        人類具有一種獨特的能力，那就是想像(imagine)。在神話世界之中，原始先民通過形象化的創造賦予故事以充滿隱喻性的生命能量，所有的神話背後都隱含了原始先民在探索世界之際所建構的真理價值和象徵體系。神話作為宇宙、生命與自我的交會之所，既是現實生活之所在，也是想像世界之所在，「樂園」的探究與追尋，乃成為神話建立信仰的終極真實。唯有相信神話中的真實，才能感受到神話的詩意隱喻背後所具有的神聖力量。\n\n    1.女媧補天\n\n    2.鯀禹治水\n\n    3.羿與嫦娥\n\n 六、諸子寓言選讀與賞析\n\n    ●人生智慧的凝定\n\n        寓言是人類認識自然和認識社會的思維反映，經典寓言作品是前人生命經驗凝定後的智慧結晶，在借彼喻此的勸諭故事中，充滿各種人生哲理的啟示內涵。面對生活中各種價值難辨的混亂情況，思想深邃的寓言提供了人們反思如何尋得安身立命之道，其中所寄託的人文精神、處世態度與生命情操，足以涵養個人的思辨能力和人生智慧。\n\n    1.孟子：揠苗助長、齊人之福、五十步笑百步\n\n    2.韓非子：鄭人買履、守株待兔、自相矛盾\n\n    3.列子：樂天知命、杞人憂天\n\n  七、諸子寓言選讀與賞析\n\n  ●人生哲理的辯證\n\n      隨著時空的變遷，人類生命從自然走向文明，智慧在慾望的引導下也有所增長。是非善惡的判斷決定了人類日常生活的喜怒哀樂，「七情六慾」作為「成其為人」的基本條件，乃是人類得以脫離童年無知的世界，進入成年有序的世界的重要關鍵。在文明進展之際，樂園與生命自由的得與失，成為人類終其一生探究與追尋的永恆命題。 \n\n    1.莊子：渾沌之死\n\n    2.莊子：莊周夢蝶\n\n    2.莊子：庖丁解牛\n\n  八、筆記小說選讀與賞析\n\n    ●亂世之中的異想世界\n\n      魏晉六朝時期社會動盪不安，戰亂頻仍。面對生命困境，人們寄託於巫術、鬼神傳說和宗教信仰之上，以求安頓自我生命。因此人們雖然以為幽明殊途，但同時也認為人鬼乃是實有之事，因此對於鬼神故事多有記載。通過幻想以敘述異事，乃成為人們理解生命歸趨的重要方式。經過文人的蒐集整理、互相交流，各種神話、傳說或鬼神故事，因而得以迅速的擴展和流傳。\n\n    1.宗定伯、阮瞻、嵇康、秦巨伯、秦樹\n\n    2.蔣濟、趙泰、龐阿、買粉兒\n\n 九、筆記小說選讀與賞析\n\n   ●亂世之中的生命歸趨\n\n      魏晉六朝處於長期分裂、混亂的黑暗時代，人們生活在水深火熱之中，身陷於朝不保夕的生存處境之中。文人多妄想羽化登仙，永世享樂，多信神仙道術之事；平民百姓則是渴求擺脫貧困、饑餓和死亡。現實生活之不可期待，人們在輾轉求活之中，便將生命寄託在他界的幻想性建構之中，在想像中尋求生命的理想歸趨。\n\n    1.談生、李仲文女、徐玄方女、盧充\n\n    2.袁相根碩、黃原、劉晨阮肇、桃花源、白水素女\n\n  十、古今互文：相關主題影片欣賞與討論\n\n  十一、傳奇和話本小說選讀與賞析(分組報告一)\n\n    ●幽幻奇詭的異類姻緣\n\n      在中國古代小說在記述奇聞軼事時，對於異類世界總是充滿關注和想像。相應於現實社會，小說通過異類姻緣的奇幻書寫以反映出對於特定人情事理的深度思考，無不藉由人物交往行動的逼真描寫，深刻凸顯了對於現實生活的反思以及對於特定生活理想的永恆追求。\n\n      1.柳毅傳\n\n      2.白娘子永鎮雷峰塔\n\n  十二、傳奇和話本小說選讀與賞析(分組報告二)\n\n    ●人生如夢的警世錄\n\n       面對現實人生的世事無常，人們總在不得志之時發出浩嘆：人生該何去何從？人生如夢一場？為了理解人生之適，小說通過一場幻境的設置，讓人們得以穿越時空，在瞬間中感受一切關乎人生的禮讚、死亡的反思、信仰的挑戰和真理的追尋等生命哲思，並在前後境遇的對比，讓人們由此學習如何認識真正的「自己」，並找到人生意義。\n\n      1.枕中記\n\n      2.杜子春三入長安\n\n  十三、傳奇和話本小說選讀與賞析(分組報告三)\n\n    ●小小情事，淒婉欲絕\n\n      中國古代小說紀閨閣情事，綽有情致。通過「癡心女子負心郎」愛情悲劇的書寫，深刻而有力地揭露了封建門閥制度對於人性的壓抑和迫害。小說十分重視從現實生活出發，在故事開展過程中著力刻畫環境與人物性格的關係。依違在傳統禮教與愛情理想之間，男女主角思想性格的差異，始終深植於生活的土壤之中，體現出一代藝術匠心。\n\n      1.鶯鶯傳\n\n      2.杜十娘怒沉百寶箱\n\n   十四、傳奇和話本小說選讀與賞析(分組報告四)\n\n    ●任俠行義的豪情觀\n\n      任俠行義之士，旨在急人之難，救人於水火之中，而非博取人間名利。中國古代小說從一系列行動描寫上正面表現俠士的聰明機智、勇武過人，超凡技藝，無不賦予探之不盡的神祕性，同時也在赴湯蹈火、在所不辭的言語內容和豪爽行事書寫中，傳達出不計生死的傳奇色彩和超越常人的精神意志，顯得動人心魄。\n\n      1.崑崙奴、紅線、聶隱娘\n\n      2.趙太祖千里送京娘\n\n  (十五)傳奇和話本小說選讀與賞析(分組報告五)\n\n    ●誓同生死的愛情追求\n\n      不論出身是否存在貴賤之別，追求理想和幸福的生活，乃是人們共有的願望。如果說人們的幸福在於覓得良好的愛情婚姻歸宿，那麼人們勇於突破禮教束縛，展開對於理想愛情的主動追求，應該給予肯定。然而個性自由與外在環境的衝突，往往讓美好的愛情屈服於強大的社會規範之下。正邪力量的強烈對比，造就了小說迷人的藝術魅力。\n\n      1.連城\n\n      2.賣油郎獨占花魁\n\n  (十六)傳奇和話本小說選讀與賞析(分組報告六)\n\n    ●人間正義的永恆追求\n\n      公案小說往往鞭撻了傳統官吏斷獄不公的主觀和草率。對於平民百姓而言，任情用刑、濫殺無辜所造成的冤獄，直讓人感到惶惑不安，因此期待為官公正清廉，能夠為民喉舌並伸張正義的清官出現，乃是社會心理影響下所造就的藝術形象。在波瀾起伏的案情發展中，情節設計往往讓人如歷情境，耐人尋味。\n\n      1.臙脂\n\n      2.滕大尹鬼斷家私\n\n  (十七)傳奇和話本小說選讀與賞析(分組報告七)\n\n    ●人生總有意外的奇蹟\n\n      面對諸多欲望所引發的非分之想，總有人為達目的不擇手段，因而背棄倫理標準和道德規範，致使價值觀念混淆不清，造成社會混亂不安。面對如此亂象，如何理解人生分定，心存忠厚，莫要貪心強求，便屬重要。在前後境遇的對比之中，表明了人生總有意想不到的奇蹟。時來運轉，並非不可期待。\n\n          1.葉生\n\n          2.轉運漢巧遇洞庭紅 波斯胡指破鼉龍殼\n\n  (十八)學習成果發表與評量\n\n          1.總結回顧\n\n          2.期末考試",
    "methodologies": [
        {
            "type": "講述法",
            "note": "教師講述課程內容"
        },
        {
            "type": "討論法",
            "note": "課堂分組討論"
        },
        {
            "type": "合作學習",
            "note": "課堂分組專題報告"
        },
        {
            "type": "專題研究",
            "note": "課堂分組專題報告"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 40,
            "note": "平時預讀心得"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "依據參與和上台發言評分"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "依據出席相關規定評分"
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "分組書面專題報告(個人)，偉依規定繳交者，以零分計算"
        },
        {
            "type": "專題",
            "weight": 20,
            "note": "分組課堂口頭專題報告(共同)，報告當天未出席者本項成績扣10分"
        }
    ],
    "prerequisite": "",
    "general_core": [
        "人文藝術"
    ]
}