{
    "year": 109,
    "term": 1,
    "name": "大腦中的語言：心理語言學入門",
    "teachers": [
        "颯楊"
    ],
    "department": "GU",
    "code": "0HUG450",
    "credit": 2,
    "serial": 1080,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 5,
            "to": 6,
            "campus": "本部",
            "classroom": "誠304"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "This course is designed as an overview of topics pertaining to the relation between language and mind and can be considered to be an introduction to the field of psycholinguistics. It focuses on language as a phenomenon that is internal to human beings’ heads. Rather than analyzing language as a cultural, external object, it is analyzed here as a psychological, internal one. Thus, we’ll be discussing language not as you see them in textbooks but as they’re represented in the mind. Classes will be conducted in English.\nHuman beings naturally develop a system of knowledge that enables them to use language. In this course we will discuss:\n(i)\t How that system of knowledge is organized and what are its main components and properties\n(ii)\t How it is used unconsciously in real time in order to produce and comprehend linguistic expressions\n(iii)\tHow it develops in the individual from birth until puberty\n(iv)\tHow its properties are different in the case of second/foreign languages",
    "goals": [
        "To introduce the students to the exciting field of language and mind.",
        "To stimulate both creative thought and critical reading."
    ],
    "syllabus": "Week 1     Introduction\n\nWeek 2     Sounds (i): how different sounds are produced\n\nWeek 3     Sounds (ii): how babies distinguish between different sounds and how they\n\n           learn to produce them\n\nWeek 4     Sounds (iii): what is a sound? Some acoustic properties of sounds\n\nWeek 5     Sounds (iv): how are sounds perceived? Which properties are important?\n\nWeek 6     Sounds (v): occasional speech errors and what we can learn from them\n\nWeek 7     MID-TERM EXAM\n\nWeek 8     Words (i): different word categories across languages\n\nWeek 9     Words (ii): early words in child English and Chinese\n\nWeek 10    Words (iii): how words are organized in our head\n\nWeek 11    Words (iv): how words are organized in our head\n\nWeek 12    Words (v): why do we process words so fast?\n\nWeek 13    Sentences (i): how words are put together\n\nWeek 14    Sentences (ii): how words are put together\n\nWeek 15    Sentences (iii): basic sentences in child English and Chinese\n\nWeek 16    Sentences (iv): understanding sentences in real time: how do we do it?\n\nWeek 17    Sentences (v): understanding sentences in real time: how do we do it?\n\nWeek 18    TAKE-HOME FINAL EXAM DUE",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Classes will be a combination of general lectures and discussions."
        },
        {
            "type": "討論法",
            "note": "Students will be asked to think about one question per class, which will be used to start the discussion."
        },
        {
            "type": "實驗/實作",
            "note": "This is an important section in the class, as psycholinguistics is an experimental discipline. Students will be introduced to different experimental methods that psycholinguists use to study the mental representations involved in language production and comprehension in adult speakers and also language development in infants. Some of these techniques will be demonstrated in class, with students’ participation."
        },
        {
            "type": "媒體融入教學",
            "note": "This course definitely requires the use of audiovisual materials in the class; many lectures will include the use of video to show experiment demonstrations, results, and short documentaries on how language is represented in the mind."
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 40,
            "note": "The midterm exam will cover the first section of the course (sounds) and it will take place a bit earlier than other courses. It is divided in two parts: a section with True/False statements and another section with short exercises."
        },
        {
            "type": "期末考",
            "weight": 40,
            "note": "The final exam will cover the second and third sections of the course (words and sentences) and it will be a take-home exam, in order to give students more time to complete the answers. Its format is similar to the midterm except that it also features a question to be answered with a very short essay of around 200-300 words."
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "Students are expected to participate in discussions. When a reading is assigned as homework, they will be required to submit a question about it in class."
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Attendance is required."
        }
    ],
    "prerequisite": "",
    "general_core": [
        "人文藝術"
    ]
}