{
    "year": 110,
    "term": 1,
    "name": "亞太當代攝影媒體藝術的理論與批判研究",
    "teachers": [
        "哈德森"
    ],
    "department": "TM67",
    "code": "AHM0240",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 3138,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "青田405室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "to develop a knowledge and understanding of the key concepts involved in contemporary photomedia art in the Asia-Pacific region",
        "to train students to use correct terminology and understand relevant concepts in the discussion of contemporary photomedia art",
        "to improve students’ ability to undertake aesthetic, formal, and material analyses and comparisons of artworks",
        "to instruct students how to find and evaluate sources of art historical theory",
        "to promote students’ competencies in collecting and interpreting related literature and to encourage them to maintain a critical attitude toward scholarly opinions",
        "to give technical instructions for writing an academic text"
    ],
    "syllabus": "**Schedule of Session Topics** (to download a PDF of the full course guide, click on the linl at the end of this text)\n\n**1\\. Introduction**\n\nYou will receive electronic copies of the course guide and the Academic Writing for Art History guide, and will be given an overview of the course content, and an explanation of the assessment. This will be followed by definitions of key, course-specific terminology. Then, you will be given a presentation introducing the conceptual basis for the study of the Asia-Pacific region, informed by long histories of human migration, state formation, militarization, and colonization, and more recent developments in foreign policy, trade, investment, education, and cultural diplomacy.\n\nWhile the geographic boundaries of the Asia-Pacific are not universally agreed, its identity is defined, in part, in relation to other major geopolitical entities and constructs, such as the European Union, EurAmerica, the North Atlantic, the Middle East, and Latin America. We will consider the commonalities among, and differences between, Asia-Pacific societies, and the development of photography and moving image work in the region. \n\nWe will ask what are the challenges and what is gained, by considering photomedia in the context of the Asia-Pacific? This will be followed by an explanation of the distinctions that can be made between historical research, theoretical analysis, and critical writing on contemporary topics. Finally, longstanding debates about the essentially indexical or subjective nature of photography, and by extension all photomedia, will be addressed.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**2\\. Indigenity and Photography from Australia and Taiwan**\n\nWe will begin with an examination of artists of Australian Indigenous heritage, whose work has been discussed in and out of Indigenous discourse. Tracy Moffatt's early photogaphic work from the 1980s augured the career of one of Australia's most internationally successful contemporary artists. Moffatt represented Australia at the Venice Biennale in 2017, assisted by Melbourne curator and academic, Professor Natalie King.\n\nIt is worth noting that King has been instrumental in exhibiting Indigenous Australian photomedia in Asia. She curated Destin Deacon's solo exhibition, _Walk and Don't Look Blak,_ shown at the Tokyo Metropolitan Museum of Photography in 2006, among other venues. This was followed by _Shadowlife_, co-curated with Djon Mundine, and shown at the Kaohsiung Museum of Fine Arts in 2012, and other venues, and _Episodes: Australian Photography Now,_ co-curated with Youngmi Park, for the Dong Gang International Photo Festival, in South Korea in 2014. \n\nInterestingly, Moffatt and Brook Andrew have included details of Asian imagery in their work, in a way that, arguably, resists the essentializing, ethnographic approach to photographing Australian Indigenous subjects established in the colonial period. Another recurring approach of Australian Indigenous photomedia artists is the repurposing of institutional and private image archives for the creation of new images. A third approach is the use of photography to record the survival of traditional Indigenous hunting practices. This last approach can be paralleled to some extent with the work of Indigenous Taiwanese photographer, Chin Cheng-Tsai. \n\nKey works:\n\nTracey Moffatt, _Something More_ (1989) and _Scarred for Life_ (1994)\n\nBrook Andrew, _Sexy and Dangerous_ (1996) and _I Split Your Gaze_ (1997)\n\nRicky Maynard, _The Moonbird People_ (1985-1988)\n\nChin Cheng-Tsai, _Silent Gunshot_ (translation of Mandarin title, c. 2000–2003) and _Mountain Climber_ (translation of Mandarin title, n.d.)\n\nKey text:\n\nGordon Craig, Ryan Presley, Graham Akhurst, and Patrick Corrigan, _Over the Fence: Contemporary Indigenous Photography from the Corrigan Collection_, exh. cat., The University of Queensland Art Museum, 6 August–30 October 2016, Brisbane: The University of Queensland Art Museum, 2016.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**3\\. Indigeneity and Moving Image Work from New Zealand**\n\nThis session takes as its starting point the major moving image work by New Zealand artist of Maori heritage, Lisa Reihana: _in Pursuit of Venus \\[infected\\]_. Among the numerous exhibitions in which it has featured, it was shown in the Pulima Art Festival, called ‘Micawor,’ at the Museum of Contemporary Art, in Taipei in 2018. The pioneer of video art, Korean-born Nam June Paik, has been cited by Reihana as an important influence, and so his work is included in this session. The representation of indigenity in New Zealand cinema is also addressed with reference to examples such as Jane Campion's _The Piano_ (1993) and Taika Waititi's _Boy_ (2010).\n\nKey works: \n\nLisa Reihana, _in Pursuit of Venus \\[infected\\],_ (2015–2017)\n\nNam June Paik, various works over his career\n\nKey text:\n\nMarcia Langton, 'Cinemania Lisa Reihana: Asserting Agency and Authenticity of the First Peoples,' in _Lisa Reihana Cinemania_, Clare McIntosh (ed.), Sydney: Campbelltown Arts Centre 2018, pp. 32–45.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**4\\. The Decolonize Movement, Its Antecedents, and Photography's History** \n\nThe Decolonize movement, and Ariella Aïsha Azoulay's related discursus on 'Unlearning Imperialism' (2019) call attention to the continuing impact of imperialism and its injustices, around the world. To some extent, these recent developments build upon Edward Said's seminal theory of Orientalism (1978). But how do they relate to Homi Bhabha's Postcolonial theory (2004), identifying hybridity, ambivalence, and mimicry as forms of resistance by colonised peoples? We will discuss some of the ways in which photography’s origins in nineteenth-century, imperial Great Britain and France shaped the medium’s use globally, and how photography was, nevertheless, quite quickly adopted by the politically and socially marginalized. Further, we will consider what the implications were, when photography was an instrument of Asian imperialism, as during the Japanese colonization of Taiwan. Finally, we will see how, despite its sometimes contested status, the early development of the medium still holds considerable fascination for contemporary photographers, such as Hiroshi Sugimoto.\n\nKey text:\n\nCatherine Grant and Dorothy Price et al., ‘Decolonizing Art History,’ _Art History_, vol. 43, no. 1, February 2020, pp. 8–66 .\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**5\\. Colonial Legacies and Taiwanese Photomedia Art**\n\nWe will consider the legacies of Dutch, Spanish, Chinese, and Japanese colonialization, addressed in the recent work of Taiwanese artists. The use of image archives in artistic practice is often found in artworks addressing the colonial past, bringing to light underexamined aspects of history. Conversely, we will also consider how the development of new archives, such as the Asia Art Archive in Hong Kong, provides resources with which to gain a deeper understanding of artists' work.\n\nKey works:\n\nYao Jui-Chung, _Territory Takeover_ (1994)\n\nTsao Liang-Pin, _Becoming/Taiwanese_ (English title, c. 2016–2018)\n\nHou I-Ting, _Cold Chain_ (2019)\n\nKey text:\n\nSophie McIntyre, _Imagining Taiwan: The Role of Art in Taiwan’s Quest for Identity_, Leiden: Brill 2018, chapter 6: 'The Nation De-mythologised – Yao Jui-chung'\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**6\\. Taiwanese Photo Archive Research Project**\n\nTo understand better the research and interpretation that artists undertake when using archival images, we will conduct our own research into uncatalogued archival images. Working in small groups, you will be tasked with identifying as much historical information as possible about a group of historical photographs from Taiwan. You will conduct a close physical examination of the photogaphs, and using visual or written evidence, you will research online to confirm, as much as possible, their origins and subject matter. Further, you will interpret the historical circumstances and social relations represented in the images.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**7\\. Taiwanese Photo Archive Research Presentations** \n\nIn groups, you will report the results of your research to the class in a 15–20 minute non-assessed presentation, and discuss your conclusions.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**8\\. Colonial Legacies in Australian Photomedia**\n\nWe will focus on the recent body of work by Australian artist, Drew Pettifer, _A Sorrowful Act: The Wreck of the Zeewijk_ (2020), based on eighteenth-century Dutch archival records concerning the punishment of homosexuality, off the coast of what is now Australia. This will be related to earlier work of artists exploring landscapes and identity through a critical re-imaging of Australian visual history. \n\nKey works:\n\nDrew Pettifer, _A Sorrowful Act: The Wreck of the Zeewijk_ (c. 2020)\n\nTracy Moffatt, _Laudanam_ (1999)\n\nJacqui Stockdale, _Familija Suite_ (2005)\n\nSiri Hayes, _En plein air_ (2008)\n\nKey text:\n\nDrew Pettifer, _A Sorrowful Act: The Wreck of the Zeewijk_, with essays by Professor Ted Snell AM CitWA, Hon. Michael Kirby AC CMG, Professor Dennis Altman AO, Diederick Wildeman, Corioli Souter, Dr Amelia Barikin, and Dr Shelley McSpedden, exh. cat., Lawrence Wilson Art Gallery, Perth, 28 August 2020–5 December 2020, \\[Perth\\] Lawrence Wilson Art Gallery \\[2020\\]).\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**9\\. Intimacy and Sexuality in East Asian Photography**\n\nContinuing on the topic of sexuality in the last session, we will study the development of work in East Asian photography representing intimate relationships, nudity, and sexuality, with an openness not seen in the work of earlier generations. Starting with the pioneering, and sometimes controversial, Japanese photographer, Nobuyoshi Araki, we trace his influence (and that of other artists) on the late Chinese photographer and poet, Ren Hang, and current Taiwanese artists, Su Misu and Manbo Key. Legal, social, and ethical issues related to such images include the liberalization of laws concerning sexual practices and their visual representation in East Asia from after the end of the Second World War, the ongoing quest for equality before the law for LGBQTI+ communities, and the terms under which subjects agree to be photographed and consent to publication of images. \n\nKey works:\n\nNobuyoshi Araki, _Sentimental Journey_ (1971)\n\nRen Hang, _Athens Love_ (2015)\n\nSu Misu, _ihategoodbye_ (2016) and _I am a fake, but my heart is true_ (2016)\n\nManbo Key, _Father's Video Tapes_ (n.d.)\n\nKey text:\n\nShuxia Chen, ‘Ren Hang: Bodies Without Redemption,’ in _Gilded Age: Made in China Yearbook 2017_, Ivan Franceschini and Nicholas Loubere (eds), Canberra: ANU Press 2017, pp. 200–05.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**10\\. Gender and Japanese Photomedia**\n\nHere, we look at the current generation of women photomedia artists in Japan, whose work has helped redefine the photoartist paradigm there, from someone who is formally trained and belongs to a profession that serves social ends by representing its core values, to more personally motivated and independently sustained practice. We will consider the significant role that photobooks, which can be published without the support of gallery networks, played in their success.\n\nKey works:\n\nHiromix, _Seventeen Girl Days_ (1995)\n\nMiwa Yanagi, _Elevator Girls_  (1994–1998)\n\nMariko Mori, _Link_ (2000)\n\nMika Ninagawa, works from the _Into Fiction/Reality_ publication (2019)\n\nKey text:\n\nRossella Menegazzo, ‘Japanese Contemporary Photography: Re-Discovering Female Identity,’ _Women’s Studies_, vol. 43, 2014, pp. 1022–38.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**11\\. The Asia-Pacific in the Anthropocene**\n\nWe examine the representation of human influence on the landscape, with regard to the theory of the Anthropocene, as recently addressed in the curatorial theme of the 2020 Taipei Biennial, _You and I Don’t Live on the Same Planet_, co-curated by Bruno Latour and Martin Guinard, with public programs curator, Eva Lin. Projects address waste and environmental degradation in under-regulated industry, the vast, global networks of capital employing human and environmental resources, of which consumers may have little knowledge, and the dissociating effects of technology on human experience of nature. \n\nKey works:\n\nWang Hsiang-Lin, _Take Me Somewhere Nice_ (2020)\n\nSusan Norrie, _HAVOC_ (2006–2007) and _aftermath_ (2016)\n\nKey texts:\n\n\\[Taipei Fine Arts Museum\\] Y_ou and I Don't Live on the Same Planet_ \\[Taipei: Taipei Fine Arts Museum\\] 2020.\n\n\\[Ian Potter Museum of Art\\] _Susan Norrie: Field Work 2006-2016_, with photographs by Christian Cappuro, an interview by Kelly Gellatly, and a foreword by Peter Jopling AM QC, exh. cat. Ian Potter Museum of Art, Melbourne, 15 March to 3 July 2016, Melbourne: Ian Pottern Museum of Art 2016.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**12\\. Curatorship, Programming, and Publishing of Taiwanese Photomedia** \n\nHere, we study the many recent developments in the exhibition of Taiwanese photomedia, including in the National Taiwan Museum of Fine Arts' Taiwan Biennials, and the opening in 2021 of the National Center for Photography and the Image, in Taipei. A common motivation behind these diverse developments, one may infer, is the desire to build a more substantial, critically-informed, and conservation-framed body of knowledge concerning Taiwan's photomedia history, for domestic and internatonal audiences. We will visit an exhibition containing photomedia art in Taipei, to study curatorial practices. The venue will be determined by the exhibition schedules of galleries when the course is delivered.\n\nKey organizations:\n\nTaipei Fine Arts Museum\n\nNational Taiwan Museum of Fine Arts\n\nTaipei National University of the Arts\n\nNational Center for Photography and Images\n\nLighbox\n\n_Voices of Photography_\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**13\\. Between Art and Documentary** \n\nWe will study the continually shifting distinctions made along the continuum between art and documentary genres, a phenomenon in the interpretation of photography since at least the aesthetically distinguished reportage of Henri Cartier-Bresson, in the mid-twentieth century. As with Cartier-Bresson, the leading Taiwanese photographer, Chang Chao-Tang, sometimes employed what can be identified as Surrealist strategies in composing his photographs. Although, interpreting the significance of this approach has been complicated by the different cultural context in which he worked, from the movement's origins in Europe. \n\nIn relation to contemporary practice, we will ask whether the indexical aspects of photomedia make it significantly more documentary than other media. Conversely, to what extent might aesticization in photomedia complicate its 'truth claim'? Or, are such destinctions ultimately semantic?\n\nKey works:\n\nChang Chao-Tang, _Within, Without_ (1962)\n\nChen I-Hsuen, _Still Life Analysis_ (2014) and _Still Life Analysis II, The Island_ (2016)\n\nMong-jane Wu, _Babel of Towers: New Taipei City_ (2017)\n\nLee Grant, _The Fourth Kingdom III, Paradise Lost_ (n.d.)\n\nKey text:\n\nMia Yinxing Liu, ‘The Surrealist and the Documentary in Chang Chao-Tang’s Photography,’ _Art in Translation_, vol. 11, no. 1, 2019, pp. 75–96.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**14\\. Photobooks and Photomedia Publishing** \n\nBefore the advent of the internet, photobooks (here referring specifically to books conceived with the purpose of presenting a body of related photographic images, rather than books that use photos to support texts) played an important role in circulating photography outside, and sometimes long after, the conventional fine art print exhibition or popular press publications. We examine recent examples of photobooks from the Asia-Pacific, to consider how artists are now focussing on the materiality of books—their binding, paper quality, and size and shape—to provide a compelling, unique experience of photography, in the age of the ubiquitous online images.\n\nWe also take the opportunity to address the issue of legal requirements and ethical practices in the publication of photomedia, in print and online, by anyone other than the artist.\n\nKey artist:\n\nSim Chi Yin\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**15\\. Changing Artists' Roles: Participatory Projects and Artist Collectives** \n\nCollaboration underpins two significant developments in the visual arts over recent decades, including in photomedia: participatory art, in which audiences contribute to the realization of projects, and artist collectives, in which resources and responsibilites are shared. Academic, Claire Bishop (2012), has critiqued participatory art, when it is premised on little regard for, or even a rejection of, aesthetic concerns, in a quest for accessibility and inclusion. In the past, the applicability of aesthetic criteria to photography as a medium has been questioned by Pierre Bordieu (1965) and Rosalind Krauss (1984), among others. Ironically, a kind of 'anti-aesthetic' aesthetic has become well established in photography, artfully eschewing traditional standards of lighting, composition, and subject matter considered worthy of recording. Aspects of this approach can be identified in the work of Manbo Key, Su Misu, Chen I-Hsuen, and Simryn Gill.\n\nKey collective:\n\nRuang MES 56\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**16\\. Transnational Cultural Mobility** \n\nEver increasing internationalization of education and professional opportunities make mobility a feature of many artists' lives. In this session, we examine artists who have studied or worked outside the state in which they were born. We look at examples from the early photography of the Chinese artist, Ai Weiwei, the early photography and video of Taiwanese artist Yao Jui-Chung, the work of Singapore-born and Malaysian and Australian-resident, Simryn Gill, and other Asian-born or Asian-heritage artists working in Australia. We will ask how national origins and transnational experience are expressed in artists' work. At the end of the session, there will be a non-assessed quiz on the overall course content.\n\nKey work:\n\nAi Wei-Wei, _New York Photographs_ (1983–1993)\n\nSimryn Gill, _A Small Town at the Turn of the Century_ (1999–2000) and _Dalam_ (2001)\n\nYao Jui-Chung, _China Town Dizzy_ (2005)\n\nKey texts:\n\nKatherine Brickell, ‘Home Interiors, National Identity and Curatorial Practice in the Art Photography of Simryn Gill,’ _Cultural Geographies_, vol. 21, no. 3, 2014, pp. 525–32.\n\nDanier Palmer, '\"Asian\"' Photography in Australia,' _Photographies,_ vol. 14, no. 1, 2021, pp. 109–18.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**17.–18.    Individual Consultations**\n\nThe last two weeks of the course are set aside for individual consultations, by appointment, with the professor.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=f757afd786044524902c389356de0165&fno=a648b21f0eed4b22a921da238fd01f87)\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=60b9844460bb46d1bf9c7da1fcf82a2e&fno=5df49204d15b45f4b4cd1953b11cc26a)",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "The professor will deliver an approximately one hour presentation in 13 sessions."
        },
        {
            "type": "Group discussion",
            "note": "There will be a one-to-two hour discussion, led by the professor, in 13 sessions, based on key readings from the bibliography, and the case studies and topics listed in the weekly schedule of the syllabus, as well as the students’ individual class presentations."
        },
        {
            "type": "Problem base learning",
            "note": "Two sessions are dedicated to groupwork research on photography archive materials, followed by presentations on the results."
        },
        {
            "type": "Cooperative learning",
            "note": "See under the heading ‘Problem based learning.’"
        },
        {
            "type": "Field work",
            "note": "One session will include a site visit to an exhibition of photomedia, to be selected depending on the institutions’ programs when the course is delivered."
        },
        {
            "type": "Media, audio, visual materials",
            "note": "Throughout the course, students will be provided with Powerpoint Presentations containing visual materials, and PDFs of the key readings, and will view documentaries on course topics. Students will also be given a course guide and academic writing guide."
        },
        {
            "type": "Case studies",
            "note": "The majority of session topics contain case studies of artists or artists’ works, which will be presented by the professor in Powerpoint presentations, accompanied by selected readings from the literature, or chosen by individual students for their assessed class presentations."
        },
        {
            "type": "Other:",
            "note": "In the last two sessions, students are invited to make an appointment with the professor for an individual consultation about their final assignments."
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 80,
            "note": "There are two assignments: an oral presentation of a case study of an artwork, series, or project, with a Powerpoint or similar presentation, of around 45 minutes, worth 30%; and a written paper, in the form of a piece of scholarly criticism of an exhibition or art movement, with footnotes and bibliography, between 10 and 14 pages long, not including the bibliography and appendices, and worth 50%."
        },
        {
            "type": "Class discussion involvement",
            "weight": 10,
            "note": "This mark is based on your contribution to class discussion and activities, especially as demonstrating your reading of at least part of one of the provided texts each session. In this course, you should allow around three hours a week for reading, in preparation for classes."
        },
        {
            "type": "Attendances",
            "weight": 10,
            "note": "This mark is based on your attendance and punctuality in classes."
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}