{
    "year": 110,
    "term": 1,
    "name": "文藝復興時期雕塑",
    "teachers": [
        "Candida",
        "Syndikus"
    ],
    "department": "TM67",
    "code": "AHM0224",
    "credit": 3,
    "serial": 3135,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "青田405室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "To increase students’ knowledge of the diverse functions of sculpture.",
        "To increase students’ knowledge of the historical and cultural background of the works and to discuss the influence of theoretical thought on sculpture.",
        "To train students’ ability of analytical description and comparative analysis of form using the correct terminology.",
        "To improve students’ capacity of esthetic judgment.",
        "To instruct students how to read and interpret primary sources and evaluate them with regard to the relevant monuments.",
        "To promote students’ competencies to collect and interpret related literature and to encourage them to maintain a critical distance towards scientific opinions."
    ],
    "syllabus": "Course Arrangement: 16 weeks\n\n1\\. Introduction: The culture of the early Renaissance, humanists and artists; the political, social and economic situation in Florence. How can we imagine the life and career of an artist in Renaissance Florence? Who were the patrons of the arts?\n\n2\\. Lorenzo Ghiberti, major works. Lorenzo Ghiberti as writer: _The Commentaries_ (select paragraphs). Brunelleschi as a sculptor: Crucifix, S. Maria Novella, Florence, _c._ 1425.\n\n3\\. Jacopo della Quercia and Nanni di Banco, major works. Vasari’s _Vite_ and important sculptors, editions of 1550 and 1568.\n\n4\\. Donatello. Marble versus bronze: the versions of David (Florence, Bargello). Major works. The Campanile figures.\n\n5\\. Orsanmichele: Donatello, Ghiberti, Nanni di Banco. Donatello versus Brunelleschi: The decoration of the Old Sacristy of S. Lorenzo, Florence, around 1435.\n\n6\\. Donatello in Padua. Equestrian monuments of the mid-15th-century. The late works: St Mary Magdalen, St Luke, the pulpits of S. Lorenzo.\n\n7\\. Donatello versus Luca della Robbia: the singer pulpits (Florence, Opera del Duomo). Luca della Robbia and his workshop.\n\n8\\. Political grandeur and afterlife: The tombs of Leonardo Bruni and Carlo Marsuppini, chancellors of Florence, c. 1450, Florence, S. Croce. Desiderio da Settignano and Bernardo Rossellino.\n\n9\\. The portrait bust of the 15th century.\n\n10\\. Political representation and afterlife in Rome: Antonio del Pollaiuolo, tomb of Sixtus IV., St. Peter, Rome, 1484–93.\n\n11\\. Leonardo’s teacher, Verrocchio: Tomb of Giovanni and Piero de' Medici, 1472, Old Sacristy, S. Lorenzo, Florence. The group of Christ and doubting Thomas, 1467–83. Colleoni-Monument, Venice, 1479–88.\n\n12\\. Bertoldo di Giovanni and young Michelangelo: in the garden of the Medici. The emergence of a genius: Michelangelo's early works. From St. Peter's Pietà, 1497–99 to the David, 1401–04.\n\n13\\. Michelangelo: Tomb of Julius II, Moses, 1513–16; Slaves, c. 1520–25. The Medici Chapel, Florence, 1520–34.\n\n14\\. The Venetian environment: the Lombardo workshop. Padua, Chapel of St Anthony, 1500–1550. Jacopo Sansovino, major works.\n\n15\\. Baccio Bandinelli, Statues, 1520s–30s. Tribolo, Ammanati, Fountain sculpture, Neptune Fountain, Florence, Piazza della Signoria, 1560–75. Montorsoli. Giambologna.\n\n16\\. Benvenuto Cellini, _Saliera_ (salt cellar), 1540–43; Perseus, Loggia dei Lanzi, 1545–54. Cellini's _Autobiography_.\n\nAdditional events (for example museum visits) may be scheduled.",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "30 % Ex-cathedra-teaching"
        },
        {
            "type": "Group discussion",
            "note": "35 % Group discussion"
        },
        {
            "type": "Problem base learning",
            "note": "Reading of research literature, discussion"
        },
        {
            "type": "Field work",
            "note": "museum visits (if possible)"
        },
        {
            "type": "Media, audio, visual materials",
            "note": "ppt, film presentation"
        },
        {
            "type": "Case studies",
            "note": "35 % case studies"
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 10,
            "note": "Weekly homework: reading, preparation of topics, presentations, writing texts"
        },
        {
            "type": "Class discussion involvement",
            "weight": 10,
            "note": "1)\tTraining of different analytical methods. \n2)\tDiscussion of texts.\n3)\tc. 30 min. discussion after each presentation."
        },
        {
            "type": "Attendances",
            "weight": 10,
            "note": "Weekly attendance required."
        },
        {
            "type": "Presentation",
            "weight": 30,
            "note": "1)\t35–45 min. presentation with ppt about the topic of the term paper (see below); \n2)\tc. 30 min. discussion after each presentation."
        },
        {
            "type": "Case study reports",
            "weight": 40,
            "note": "Term papers of c. 15–20 pages to be submitted at a fixed deadline toward the end of the course period (date fixed at the beginning of the semester)"
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}