{
    "year": 110,
    "term": 1,
    "name": "藝術與建築保存",
    "teachers": [
        "哈德森"
    ],
    "department": "TM67",
    "code": "AHM0238",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 3136,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "青田405室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "to develop a knowledge and understanding of the key concepts involved in the conservation of art and architecture from the Renaissance to the present",
        "to train students to use correct terminology and understand relevant concepts in the discussion of the conservation of art and architecture",
        "to improve students’ ability to undertake aesthetic, formal, and material analyses and comparisons of artworks",
        "to instruct students how to find and evaluate sources of art historical theory",
        "to promote students’ competencies in collecting and interpreting related literature and to encourage them to maintain a critical attitude toward scholarly opinions",
        "to give technical instructions for writing an academic text"
    ],
    "syllabus": "**Schedule of Session Topics (to download a PDF of the full course guide, click on the link at the botom of this text)**\n\n**1\\. Introduction**\n\nIn the first session, you will be given an explanation of the syllabus and assessment for the course. This will be followed with a presentation by the professor on his experience of conservation science in researching Italian and Netherlandish Renaissance art. Finally, we will learn course-specific terminology. \n\n**2\\. Painter-Restorers from the Renaissance to the Nineteenth Century**\n\nConservation of some kind has probably existed as long as there have been artworks. However, this course will begin with the Renaissance, when public museums emerged for the first time, and with them the desire to display artworks optimally. Prior to the training of specialist art conservators in the twentieth century, an artist was usually called on when the appearance of an artwork was considered unsatisfactory. This might be because it was dirty, physically degraded, or simply looked old fashioned. In this session, we will consider what distinctions can be made between restoring the original appearance of an artwork, elaborating it, censoring it, and updating it, in the Renaissance. \n\nkey texts:\n\nBlondin, Jill E., ‘Power Made Visible: Pope Sixtus IV as Urbis Restaurator in Quattrocento Rome,’ _The Catholic Historical Review_, vol. 91, no. 1, January 2005, pp. 1–25.\n\nHoeniger, Cathleen, _The Renovation of Paintings in Tuscany, 1250–1500_, Cambridge 1995, pp. 101–26 (chapter 5: 'The Reframing of Gothic Altarpieces during the Renaissance’).\n\nkey works:\n\nTrecento artist, Neri di Bicci, and the Master of Marradi, _Virgin and Child between Saints_, and _Annunciation_, 1200s–1480s, Chiesa di Santi Jacopo e Filippo, Lecceto\n\nGiotto di Bondone, Baroncelli Altarpiece, 1330s, Basilica di Santa Croce, Florence\n\n**3\\. Nineteenth-Century Debates about the Preservation of Monuments**\n\nIn the second half of the nineteenth century, debates grew in France and Great Britain about the preservation and restoration of architectural heritage, particularly medieval, Gothic monuments. We will discuss the extent to which the arguments presented by leading advocates, such as William Morris, John Ruskin, and Eugène Viollet-le-Duc privileged aesthetics or history, and pragmatism or idealism. We will look in detail at some case studies of Viollet-le-Duc's practice.\n\nkey texts:\n\nMorris, William, ‘Manifesto of the Society for the Protection of Ancient Buildings,’ in _Historical and Philosophical Issues in the Conservation of Cultural Heritage, Readings in Conservation_, Nicholas Stanley-Price, Mansfield Kirby Talley Jr, and Alessandra Melucco Vaccaro (eds), Los Angeles 1996, pp. 319–21 (originally published in _Builder_, vol. 35, August 1877). \n\nRuskin, John, ‘The Lamp of Memory II,’ in _Historical and Philosophical Issues in the Conservation of Cultural Heritage, Readings in Conservation_, Nicholas Stanley-Price, Mansfield Kirby Talley Jr, and Alessandra Melucco Vaccaro (eds), Los Angeles 1996, pp. 322–23 (originally published in _The Seven Lamps of Architecture_, London 1849, pp. 18–20). \n\nViollet-le-Duc, Eugène Emmanuel, ‘Restoration’ in _Historical and Philosophical Issues in the Conservation of Cultural Heritage, Readings in Conservation_, Nicholas Stanley-Price, Mansfield Kirby Talley Jr, and Alessandra Melucco Vaccaro (eds), Los Angeles 1996, pp. 314–18 (originally published in _Dictionnaire Raisonné de l’architecture francaise du XIe au XVIe siècle_, vol. 8, 1854, pp. 14–34). \n\nkey monuments:\n\nCité de Carcassonne, Gallo-Roman period\n\nCathédrale de Notre-Dame, Paris, from 1163\n\n**4\\. Cesare Brandi, the Istituto Centrale del Restauro in Rome, and the Development of Conservation Ethics**\n\nFounded in 1939, the Istituto Centrale del Restauro in Rome was a pioneering centre of modern conservation. Cesare Brandi was its first director, and his Theory of Restoration, published in Italian in 1963, was one of the first sustained discussions of modern conservation ethics. While sometimes obscure, and occasionally even contradictory, it nevertheless formulated some key ethical propositions: that all artworks must be regarded as equally worthy of treatment, that artworks should be treated with regard for their individual circumstances and context, that an artwork's patina (appearance of age) must not be removed or disguised for purely aesthetic reasons, that a treatment must not impede any future treatment (must be reversible), that additions must be identifiable, and that creative restoration must be avoided. We will study how these and other conservation principles are applied—or not—in current practice.\n\nkey texts:\n\nAshley-Smith, Jonathan, 'The Ethics of Doing Nothing,' _Journal of the Institute of Conservation_, 2018, vol. 41, no. 1, pp. 6–15.\n\nBrandi, Cesare, et al., _Theory of Restoration_, revised by Dorothy Bell, Giuseppe Basile (ed.), translated by Cynthia Rockwell and Philip Rand, Rome and Florence 2005, the first edition, in Italian, was published in 1963.\n\nkey works:\n\nAntonello da Mesina, _Virgin and Child with Saints Benedict and Gregory_, and _Annunciation_, 1473, Museo Interdisciplinare Regionale, Messina (conserved at the Istituto Centrale del Restauro, Rome, c. 1942)\n\n**5\\. Early Scientific Identification of Forgeries: The Otto Wacker and Han van Meegeren Court Cases**\n\nFrom the early twentieth century, scientific testing in conservation was employed to help in the attribution of artworks, by providing information about their materials, technique, and condition that might support, cast doubt on, or exclude an attribution. However, problems soon emerged in determining unequivocal results. We will examine two high-profile cases of suspected forgeries, from the first half of the twentieth century, which illustrate the development of scientific testing in conservation, and the challenges in interpreting their results. In the Otto Wacker case of c. 1928–1932, microsample analysis of pigments and x-radiography played a part in identifying forged Van Gogh paintings. While, in the Han van Meegeren case of c. 1932–1947, many testing techniques were used, including medium analysis and the study of craquelure. These were said to confirm that Van Meegeren had forged paintings in the manner of Frans Hals, Pieter de Hoogh, and Jan Vermeer. In both cases, however, the identification of some of the suspected works as forgeries was disputed. We will consider how conclusive the technical analyses were, in terms of what was claimed at the time, and what has been learnt from subsequent investigations.\n\nkey texts: \n\nBreek, R., and Willem Froentjes, \"Application of Pyrolysis Gas Chromatography on Some of Van Meegeren's Faked Vermeers and Pieter de Hooghs,' _Studies in Conservation_, vol. 20, no. 4, November 1975, pp. 183–89.\n\nCoremans, Paul, _Van Meegeren’s Faked Vermeers and De Hooghs: A Scientific Examination_, London and Amsterdam 1949.\n\nTromp, Henk, _A Real Van Gogh: How the Art World Struggles with Truth_, Amsterdam: Amsterdam University Press 2010 (chapter 5: 'The Expert Tamed', pp. 129–70).\n\nVanpaemel, Geert, 'X-rays and the Old Masters: The Art of the Scientific Connoisseur,' _Endeavour_, vol. 34, no. 2, 2010, pp. 69–74.\n\nkey works:\n\nImitator of Vincent van Gogh, _Portrait of Vincent van Gogh_, c. 1925–1928, National Gallery of Art, Washington\n\nHan van Meegeren, _Christ at Emmaus_, 1936–1937, Boijmans van Beuningen Museum, Rotterdam\n\nHan van Meegeren, _Christ among the Doctors_, 1945, private collection, Johannesberg\n\n**6\\. Cleaning Controversies at the National Gallery London, and Later in the Brancacci Chapel, Florence, and the Sistine Chapel, Rome**\n\nOne of the most debated aspects of art conservation in the twentieth century was the cleaning of paintings. For some, the changing appearance of an artwork over time was an integral part of its historical and cultural significance. For others, cleaning brought an artwork closer to how the artist intended it to be seen when it was made. Some worried that lack of precision in analytical techniques meant that cleaning could not be guaranteed not to damage original parts of an artwork, however well intended and carefully conducted. We will consider how these and other views were argued, on the basis of technical evidence and cultural history, focussing on how conservators participated in these debates.\n\nkey texts: \n\nGombrich, Ernst, ‘Dark Varnishes: Variations on a Theme from Pliny,’ _The Burlington Magazine_, vol. 104, no. 707, February 1962, pp. 51–55.\n\nKeith, Larry, and Ashok Roy, 'Giampietrino, Boltraffio, and the Influence of Leonardo,' _National Gallery Technical Bulletin_, vol. 17, 1996, pp. 4–19.\n\nPlesters, Joyce, 'Dark Varnishes–Some Further Comments,' _The Burlington Magazine_, vol. 104, no. 716, November 1962, pp. 452–60.\n\nStarn, Randolph, 'Three Ages of \"Patina'' in Painting,' _Representations_, vol. 78, no. 1, Spring, 2002, pp. 86–115.\n\nkey works:\n\nMasaccio and Masolino, _Stories of Saint Peter_, c. 1424–1428, with additions by Filippino Lippi, 1481–1485, Brancacci Chapel, Basilica di Santa Maria del Carmine, Florence\n\nPaolo Uccello, _Battle_, late 1430s, National Gallery, London\n\nTiziano Vecellio, _Bacchus and Ariadne_, 1520–1523, National Gallery, London\n\nMichelangelo Buonarroti, _Old Testament Scenes_, 1508–1512, and _Last Judgment_, 1536–1541, Sistine Chapel, Vatican City\n\n**7\\. The Conservation of the Ghent Altarpiece by the Archives Centrales Iconographiques d’Art National et Laboratoire Central des Musées de Belgique**\n\nAt the end of World War II, the Ghent Altarpiece was found at the Aultaussee salt mine in Austria, where it had been hidden by the Nazis. On its return to Belgium, its condition was assessed as requiring treatment. The Archives Centrales Iconographiques d’Art National et Laboratoire Central des Musées de Belgique, in Brussels, undertook an extensive campaign of historical research, scientific analysis, and cleaning. This were documented in a detailed publication in 1953, including interpretations of technical observations that had a bearing on longstanding art historical questions. We will look at some of the discussions that ensued, in which technical evidence about the Altarpiece played a central part.\n\nkey texts: \n\nCoremans, Paul, (ed.), _L’Agneau Mystique au laboratoire: Examen et traitment_, Les Primitifs Flamands, III, Contributions à l’étude des primitifs flamands, 2, Antwerp 1953.\n\nPächt, Otto, _Van Eyck and the Founders of Early Netherlandish Painting_, foreword by Artur Rosenaur, Maria Schmidt-Dengler (ed.), trans. by David Britt, London, 1999, p. 121.\n\nkey work:\n\nHubert and Jan van Eyck, The Ghent Altarpiece, 1432, Cathédrale de Saint Bavon, Ghent\n\n**8. Examination Techniques: Infrared, Ultraviolet, and X-radiography Imaging, and Other Methods** \n\nOf the vast array of scientific conservation analyses now avaiable, we will study some of the most common types, including infrared, ultraviolet, and x-radiography imaging, and microsampling. You will be shown how to interpret the data provided by these tests, to understand aspects of the materials, technique, and condition of artworks, bearing in mind the physical limitations of each analytical technique. We will also discuss ethical choices in examinations, between invasive and non-invasive, and destructive and non-destructive testing. Examples will be drawn from the professor's past and current research projects, a test case specially produced for this course, with the kind assistance of the Research Center for Conservation of Cultural Relics at National Taiwan Normal University, and the technical analysis and treatment of Jan van Eyck's _Portrait of Margaret van Eyck_ (Groeningemuseum, Bruges) at the National Gallery, London, in 2009.\n\nkey text:\n\nDunkerton, Jill, 'The Restoration of 'Margaret, the Artist's Wife,' National Gallery, London, website \\[c. 2009\\], https://www.nationalgallery.org.uk/research/research-papers/the-restoration-of-margaret-the-artists-wife/the-restoration-of-margaret-the-artists-wife.\n\nkey work:\n\nJan van Eyck, _Portrait of Margaret van Eyck_, 1439, Groeningemuseum, Bruges\n\n**9\\. Paper and Parchment** \n\nWe will discuss the kinds of degradation that works on paper and parchment are prone to, and the specific treatments that have been developed to conserve them, with reference to examples of manuscripts and drawings.\n\nkey texts: \n\nMaggen, Michael, 'Conservation of the Aleppo Codex,' _Restaurator_, vol. 12, 1991, pp. 116–30.\n\nWagstaff, John, 'The Raphael Cartoons for the Vatican Tapestries: Conservation Treatments Past and Proposed,' _Conservation Journal_, October, 1992 no. 5, online publication, http://www.vam.ac.uk/content/journals/conservation-journal/issue-18/the-examination-and-conservation-of-the-raphael-cartoons-an-interim-report/.\n\nkey works:\n\nIsraeli, Aleppo Codex, tenth century, Ben-Zvi Institute and Hebrew University of Jerusalem\n\nRaphael Sanzio, Cartoons for Tapestries Depicting Scenes from the Lives of Saints Peter and Paul, 1515–1516, Royal Collection, on long term loan to the Victoria and Albert Museum, London\n\n**10\\. Easel Painting: The Leonardesque _Salvator Mundi_**\n\nThere has been no more prominent, intriguing, and controversial issue in art conservation since 2006 than Dianne Dwyer Modestini's cleaning and restoration of the Leonardesque _Salvator Mundi._ In the ensuing arguments for the painting's attribution, whether to Leonardo da Vinci, to Leonardo and an assistant, or solely to an assistant, conservation evidence and practice have been central considerations. \n\nkey text: \n\nSyson, Luke, '91. Leonardo da Vinci, _Christ as Salvator Mundi_,' in _Leonardo da Vinci: Painter at the Court of Milan_, Luke Syson (ed.), exh. cat., National Gallery, London, 9 November 2011–5 February 2012, London 2011, pp. 300–03.\n\nZöllner, Frank, 'Ausstellungsbesprechung, A Double Leonardo. On Two Exhibitions (and Their Catalogues) in London and Paris,' _Zeitschrift für Kunstgeschichte_, vol. 76, 2013, pp. 417–27.\n\nkey work:\n\nLeonardo da Vinci (and workshop?), _Salvator Mundi_, c. 1499 (?), private collection, location unknown\n\n**11\\. Ceramics and Glass: The Portland Vase**\n\nThe Portland Vase in the British Museum, London, is a superb example of Classical Roman cameo glass. Its history of breakages, dating from antiquity to the nineteenth century, and the series of restorations it has received, make it a fascinating and informative case study in the conservation of glass. Among other issues raised by this case is that of the lifespans of conservation treatments. We will also study examples of conservation treatments of ceramics. \n\nkey text:\n\nWilliams, Nigel, _The Breaking and Remaking of the Portland Vase_, London: British Museum  1989.\n\nkey work:\n\nItalian (Rome), Portland Vase, c. 1–25 A.D., British Museum, London\n\n**12\\. Sculpture: Tullio Lombardo's _Adam_**\n\nIn 2002, the plinth supporting Tullio Lombardo's Adam at the Metropolitan Museum of Art collapsed. The sculpture fell, and smashed into hundreds of fragments. A complete restoration of the sculpture was undertaken, with scarcely any signs of damage now visible. This case illustrates the importance of preventative conservation, and poses questions about the circumstances in which 'invisible' restoration is most appropriate.\n\nkey texts:\n\nChen Ruo-Xuan, and Shi Naai-Jung, 'Regenerating the Arts: Sculpture Conservation and 3D Panoramic Guides at the Juming Museum, Taiwan,' _Journal of the Institute of Conservation_, vol. 40, no. 3, 2017, pp. 242–51.\n\nRiccardelli, Carolyn, Michael Morris, George Wheeler, Jack Soultanian, Lawrence Becker, and Ronald Street, ‘The Treatment of Tullio Lombardo’s Adam: A New Approach to the Conservation of Monumental Marble Sculpture,’ _Metropolitan Museum Journal_, vol. 49, 2014, pp. 49–116.\n\nSyson, Luke, and Valeria Cafà, ‘Adam by Tullio Lombardo,’ _Metropolitan Museum Journal_, vol. 49, 2014, pp. 9–31.\n\nkey work:\n\nTullio Lombardo, _Adam_, c. 1490, Metropolitan Museum of Art, New York\n\n**13\\. Ancient Monuments: The Acropolis** \n\nSince 1975, a key phase in the long-running conservation works at the Acropolis in Athens developed from the initial rescuing of degraded masonry and sculpture to the reconstruction of buildings, incorporating as much of the surviving original materials as possible, as well as the cleaning of masonry and carvings. We will discuss the concept of anastylosis (alternatively spelled anastelosis), its origins, and use in the restoration of the Parthenon, and other ancient monuments. We will also consider the current debate concerning the renewal of concrete pathways at the Acropolis, which would provide greater access for the disabled, but, according to critics, likely impinge on the presentation of its heritage values.\n\nkey texts: \n\nJerome, Pamela, 'An Introduction to Authenticity in Preservation,' _APT Bulletin: The Journal of Preservation Technology_, vol. 39, nos 2–3, 2008, pp. 3–7.\n\nLambrinou, Lena, 'Preserving a Monument: The Example of the Parthenon,' _Conservation and Management of Archeological Sites_, vol. 12, no. 1, March, 2010, pp. 60–74.\n\nMallouchou-Tufano, Fani, 'The Restoration of Classical Monuments in Modern Greece: Historic Precedents, Modern Trends, Peculiarities,' _Conservation and Management of Archaeological Sites_, vol. 8, 2007, pp. 154–73.\n\nkey monument:\n\nPheidias (supervisor), Parthenon, c. 447–432 B.C. \n\n**14\\. Modern Architecture: Brutalism**\n\nBrutalist architecture emerged in the mid-twentieth century, distinguished by its extensive use of bare concrete, geometric forms, and minimal ornament. Though often economical and relatively quick to build, its typically machine-like, uncompromising aesthetic divided critics and the public. We will ask whether all architectural movements are worthy of preservation, and how Brutalist buildings can be made fit for today's uses without compromising their original designs.\n\nkey text:\n\nFarmer, Graham, and John Pendlebury, 'Conserving Dirty Concrete: The Decline and Rise of Pasmore’s Apollo Pavilion, Peterlee,' _Journal of Urban Design_, vol. 18, no. 2, 2013, pp. 263–80.\n\nkey buildings:\n\nLe Corbusier, with Shadrach Woods, George Candilis, and Nadir Afonso, Unité d'habitation, Marseille, 1947–1952\n\nVictor Pasmore, The Apollo Pavilion, Peterlee, 1969\n\nChamberlin, Powell, and Bon, Barbicon Centre and Estate, London, 1982\n\n**15\\. Conservation of Japanese Colonial Era Buildings in Taipei**\n\nThe area around the Graduate Institute of Art History is distinguished by its many 'Japanese-style' (or 'Modern Japanese-style') buildings dating from the Japanese colonial period, and some associated mature trees. Many of the buildings were residences, built for or by professors at the Taihoku Imperial University, subsequently, National Taiwan University. We will discuss their ownership history, the designation of the most significant examples as Monuments or Historic Buildings by Taipei City Government, and the many challenges in preserving them for the future—meeting high restoration costs with available funding from culturally appropriate public-private partnerships, determining how their historical associations may be communicated through on-site displays, and enabling local communities to contribute to researching, interpreting, and promoting the cultural significance of the sites. \n\nkey  buildings:\n\nex-residence of Professor Masashi Adachi, at No. 6, Lane 7, Qingtian Street (now Qingtian 76)\n\nex-guesthouse for Japanese naval officers, at No. 106, Lane 248, Section 1, Heping E Rd (now The Historical Grand Courtyard)\n\nkey text:\n\nMatsuda, Hiroko, 'Whose Home? Cultural Pluralism and Preservation of Japanese Colonial Heritage in Taipei City,' in _Sites of Modernity: Asian Cities in the Transitory Moments of Trade, Colonialism, and Nationalism_ (The Humanities in Asia, Book 1), Wasana Wongsurawat (ed.), Berlin: Springer 2016 pp. 85–102.\n\n**16\\. Charters, Legislation, and Agreements** \n\nIn the final group session, we will study the development of international heritage conservation charters, over the course of the twentieth and twenty-first centuries. We will identify the key philosophical developments over time, reflecting more diverse cultural traditions, as the modern, heritage conservation movement broadened from its largely European origins, to its current international scope. Then, we will focus on Taiwan's heritage conservation legislation and agreements, and their implications. This will be followed by a non-assessed, groupwork quiz on the course content.\n\nkey texts:\n\nChen Chien-Chung and Fu Chao-Ching, 'Globalization And Localization of Heritage Preservation In Taiwan: An Analysis Perspective Under the Cultural Heritage Preservation Act,' _The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences_, vol. 40, 5/W7, 2015 (25th International CIPA Symposium, 31 August–4 September 2015, Taipei), online publication, 2015, pp. 65–72.\n\nFirst International Congress of Architects and Technicians of Historic Monuments, _The Athens Charter for the Restoration of Historic Monuments_ (Athens Charter), 1931.\n\nSecond International Congress of Architects and Technicians of Historic Monuments, International _Charter for the Conservation and Restoration of Monuments and Sites_ (Venice Charter), 1964.\n\nInternational Council on Monuments and Sites, _The Nara Document on Authenticity_ (Nara Charter), 1994.\n\n**17.–18.  Individual Consultations** \n\nThe two last sessions of the course are set aside for individual consultations with the professor, to discuss research, writing, and presentation of the written assignment. Make an appointment by email.",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "The professor will deliver an approximately one hour presentation in 16 sessions."
        },
        {
            "type": "Group discussion",
            "note": "There will be a one-to-two hour discussion, led by the professor, in 16 sessions, based on key readings from the bibliography, and the case studies and topics listed in the weekly schedule of the syllabus, as well as the students’ individual class presentations."
        },
        {
            "type": "Problem base learning",
            "note": "In the sixteenth session, students will do a non-assessed groupwork quiz, based on the content of the whole course."
        },
        {
            "type": "Field work",
            "note": "A site visit to a conservation laboratory will be organized, if permission is received from the laboratory."
        },
        {
            "type": "Media, audio, visual materials",
            "note": "Throughout the course, students will be provided with Powerpoint Presentations containing visual materials, and PDFs of the key readings, and will view documentaries on course topics. Students will also be given a course guide and academic writing guide."
        },
        {
            "type": "Case studies",
            "note": "The majority of session topics contain case studies of artists or artists’ works, which will be presented by the professor in Powerpoint presentations, accompanied by selected readings from the literature, or chosen by individual students for their assessed class presentations."
        },
        {
            "type": "Other:",
            "note": "In the last two sessions, students are invited to make an appointment with the professor to discuss researching, writing, and presenting the written paper assignment."
        }
    ],
    "grading": [
        {
            "type": "Class discussion involvement",
            "weight": 10,
            "note": "This mark is based on your contribution to class discussion and activities, especially as demonstrating your reading of at least part of one of the provided texts each session. In this course, you should allow around three hours a week for reading, in preparation for classes."
        },
        {
            "type": "Attendances",
            "weight": 10,
            "note": "This mark is based on your attendance and punctuality in classes."
        },
        {
            "type": "Presentation",
            "weight": 80,
            "note": "A class presentation of approximately 45 minutes is worth 30%, and a written paper on the same topic, but including responses to feedback on the oral presentation, between 10 and 14 pages in length, not including the bibliography and appendices, is worth 50%."
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}