{
    "year": 107,
    "term": 1,
    "name": "氣候變遷研討",
    "teachers": [
        "莫家俊"
    ],
    "department": "LM23",
    "code": "GEC8002",
    "credit": 3,
    "serial": 3198,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "上課教室:文學院勤10樓地理系會議室。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "Global environmental challenges, such as climate change, require human responses on various scale-levels – ranging from the global to local. This course adopts a human geography perspective on studies in climate change. While we will particularly focus on climate change and cities, we will also pay attention to rural areas and development. Students interested in climate resilience, climate change mitigation and adaptation, and coupled social-environmental systems are especially encouraged to take this course.\n\nCities will be more and more vulnerable to the negative effects of global climate change. This is due to three main reasons: cities are immobile; cities are often located in low-elevated regions and deltas; and rapid and uncontrolled urbanization trends often pose significant challenges to urban and regional planners. Around 60 percent of people globally will live in urban areas by 2030. Especially secondary cities, urban settlements ranging in size between 10 per cent and 50 per cent of a nation’s largest city, are in dire need of developing strategies and policies which improve their climate resilience. On the one hand, climate change will increase rapid onset hazards, such as tropical storms, floods and cyclones. On the other hand, it will exacerbate slow onset hazards, such as drought, sea level rise, and changes in rainfall regimes and temperature Therefore, planners and scientists need to design a multitude of climate resilience planning strategies to respond to these diverse effects. At the same time, these planners and scientists are not working in a vacuum. They have to cooperate with local, national and international stakeholders. Climate resilience of rural hinterlands need to be taken into account as well. This to curb rural-to-urban migration flows. Hence, this course provides an holistic approach to climate resilience and sustainability. Not only will we discuss theoretical debates on climate resilience, and vulnerability, but this course also provides ample empirical evidence of both successful and unsuccessful planning strategies and challenges. While this course will primarily focus on Asia, we will also look at examples of other developed and developing countries. Furthermore, we will pay attention to Post-2015 sustainability agendas such as the New Urban Agenda, Sustainable Development Goals, and COP meetings of the United Nations Framework Convention on Climate Change (UNFCCC).",
    "goals": [
        "Understand and critically discuss theories on climate resilience, vulnerability, and sustainability.",
        "Be familiar with the negative effects of climate change on cities and rural hinterlands",
        "Map the different stakeholders and governance regimes affecting climate change planning.",
        "Evaluate the sustainability of climate resilience planning and policies across various geographical contexts."
    ],
    "syllabus": "Week 1. Lecture: Introduction to the Course Week 2. Lecture: Climate Change Adaptation and Mitigation Week 3. Lecture: What is Urban Climate Resilience (UCR) and Vulnerability? Week 4. Lecture: Principles of UCR Planning I: introduction, environmental governance and actors, planning strategies, disaster-risk reduction, policy making processes and evaluation. Week 5. Lecture: Principles of UCR Planning II: smart-cities, low-carbon development, built environment, ICT, urban agriculture, and ecosystem services. Week 6. Seminar: Student-led seminar I Week 7. Lecture: Regional Planning and Climate Change I: rural hinterlands, sustainable and smart-agriculture, food security, coastal communities, and natural resource management. Week 8. Seminar: Student-led seminar II Week 9. Lecture: Regional Planning and Climate Change II: climate migration, rural-to-urban migration flows, climate change adaptation and mitigation. Week 10. Seminar: Student-led seminar III Week 11. Lecture: Climate Change and Rural Development Challenges Week 12. Seminar: Student-led seminar IV Week 13. Reading week + preparation for Week 14 class. Week 14. Lecture: Reducing Emissions from Deforestation and Forest Degradation program Week 15. Seminar: Student-led seminar V Week 16. Lecture: International Actors and Transnational Governance: future trajectories in the climate change debate Week 17. Lecture: Wrap-up Lecture Week 18. Final Exam",
    "methodologies": [
        {
            "type": "講述法",
            "note": "This course consists of lecturers which are both theoretical and empirical. As we approach studies in climate change from a human geography perspective, we will primarily adopt a qualitative approach."
        },
        {
            "type": "討論法",
            "note": "Students are required to lead seminars to practice their presentation skills."
        },
        {
            "type": "媒體融入教學",
            "note": "We will make ample use of media and visual materials during formal lectures."
        },
        {
            "type": "專題研究",
            "note": "Students are required to write about country case studies in a group report."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 40,
            "note": "Students will organize a seminar on a country in Asia. They discuss the climate change challenges of the country and its cities, climate resilience planning, and evaluate its sustainability. Each group will also prepare a country report of around 5000 words excluding references. Doctoral students are expected individually to write a scientific article based on their report (optional for master students)."
        },
        {
            "type": "期末考",
            "weight": 30,
            "note": "This includes all the readings, discussions, and lectures."
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "In each class we will have class debates, video assignments, or other forms of class involvement."
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Everyone is required to attend the lectures and seminars, unless you have a valid reason not to come."
        }
    ],
    "prerequisite": "",
    "general_core": []
}