{
    "year": 110,
    "term": 2,
    "name": "新媒體與社會倡議",
    "teachers": [
        "蔡蕙如"
    ],
    "department": "EU02",
    "code": "SOU0130",
    "type": "選",
    "grade": null,
    "credit": 2,
    "serial": 685,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "誠208"
        }
    ],
    "programs": [],
    "comment": "此課程為大三選修",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "",
    "goals": [
        "Expanded observation/understanding/analysis of contemporary new media, cultural activism, and civil society in the learning process.",
        "Analysis of the changing media environment and society in the future through classroom discussions, group reports, and reflections."
    ],
    "syllabus": "**National Taiwan Normal University**\n\n**Spring 2022** **（****110-2****）**\n\n**SYLLABUS**\n\n**New Media and Social** **Initiative**\n\n**Department of**\n\nAdult and Continuing Education\n\n**College of**\n\nEducation\n\n**Instructor Name**\n\nHui-Ju TSAI\n\n**Office Location**\n\nH205-7F 724 （Education Building 7F 724）\n\n**Email Address**\n\n[hjtsai@ntnu.edu.tw](mailto:hjtsai@ntnu.edu.tw)\n\n**Office Hours**\n\nBy appointment. Can be in person Tuesday / Wednesday 13:00-15:00 or virtual office hours on other days.\n\n**Classroom Location**\n\nLiberal Arts BuildingII（誠208）\n\n**Class Meeting Days & Times**\n\nMonday 10:20-12:10\n\n**Course Catalog**  \n**Description**\n\nThis course will explore how new media affects the development and change of global civil society from different perspectives. From the changes of museum activism, cinemactivism, slacktivism, media activism, activist journalism, and gamification, we can see how culture has been involved in social issues and initiatives through various digital forms.\n\nFurthermore, from a historical perspective, civil society's concept, definition, and development are reviewed. Then, starting from the historical context, look at the formation and transformation of global civil society. What role did the medium/new medium play in this history?\n\nHow relevant issues and ideas are delivered/not delivered in various ways. The development of the Internet and the intervention of new media, how to become a new interactive mechanism in the public sphere, and how to become a powerful tool for communication/a new form of communication obstacle at various stages. What is the relationship between mainstream media, online media, and civil society? Furthermore, how it has caused considerable changes in the intervening years. This course combines theory and practice. In theory, the relevant theories and history of civil society and activism, policy formulation and development processes, media and communication theories are introduced and are based on actual case study analysis.\n\nOn the practical side, through case studies of success and failure, students will explore the essential elements of advocacy for new media and social issues (including identifying campaign goals, target audiences, designing response forms, understanding message structures, and multi-media channel communication methods), and Learn how to influence the political system through new media. Classes are based on lectures, interactions, case studies, group discussions, and dialogues. Students in this course will understand the development of civil society and related theories from the perspective of history and further understand the current situation of contemporary civil society from two significant approaches.\n\n**Required Text**\n\nPlease check the reading text on perusall\n\n**References**\n\n*   Robert R. Janes and Richard Sandell Editors (2019). MUSEUM ACTIVISM. Routledge.\n*   Hilda Chacon Editor (2018). Online Activism in Latin America. Routledge.\n*   JOHN G. MCNUTT Editor(2018). Technology, Activism, and Social Justice in a Digital Age. Oxford University.\n*   John Michael Roberts (2014) NEW MEDIA AND PUBLIC ACTIVISM Neoliberalism, the state and radical protest in the public sphere. Policy Press\n*   L. Ayu Saraswati(2021). Pain Generation: Social Media, Feminist Activism, and the Neoliberal Selfie. New York University.\n*   Cheryl Martens, Cristina Venegas, Etsa Franklin Salvio Sharupi Tapuy Editors (2020). Digital Activism, Community Media, and Sustainable Communication in Latin America. Palgrave Macmillan\n\n**Course Goals or Overview:** The goals of this course are as follows\n\n**Learning Objectives/Outcomes:** At the end of this course, students will be able to\n\n1\n\nExpanded observation/understanding/analysis of contemporary new media, cultural activism and civil society in the learning process\n\n2\n\nAnalyze the changing media environment and society in the future through classroom discussions, group reports, and reflections.\n\n**Online co-reading (Perusall): https://app.perusall.com/home**\n\n**Course code TSAI-Q73RX**\n\nThe goal of each reading assignment is to stimulate discussion by encouraging students to post good questions or comments, help others by answering their questions, and upvote good questions or comments to draw the attention of their classmates to essential ideas.\n\n**Assignments**\n\n**Weekly Reading Reflections(25%):**\n\nAssigned readings are meant to introduce and explain concepts that should build understanding and spark curiosity. To assess your understanding and to facilitate class discussion, by 6pm on Saturday each week, students will post:\n\n1.  a question\n2.  ![](file:///C:\\Users\\user\\AppData\\Local\\Temp\\msohtmlclip1\\01\\clip_image001.png) a paragraph reflection on that week’s reading materials (it might be an article or Video clips or audio clip)\n3.  an answer for others’ question on Perusall.\n\n**_Reminder:_** \\*An excellent post will (1) relate the readings to your personal experience or to a current cultural debate, (2) raise a question for class discussion, (3) provide an argument.\n\n\\*Students are encouraged to read and comment on other student posts prior to class on Monday.\n\n**\\*Get students enrolled**\n\nto create a Perusall account **(your full name+ student ID)** and enter your course code TSAI-Q73RX upon registration.\n\n**Course task(10%):**\n\nActive participation is crucial to your learning, and others enrolled in the class. Active participation includes contributing to the discussion by engaging with your classmates, posing questions relevant to the readings, lectures, and comments, listening when others are presenting (including the instructor, classmates, and guests).\n\n**Weekly news** **Group** **Presentation(10%):**\n\nEach group takes turns introducing activist cases (in Taiwan) related to the topic of the week. PPT has been submitted on the moodle at least 48 hours prior to the class. Each group has 5 minutes presentation with no more than 6 slides. \n\n**Midterm Group** **Presentation(25%):**\n\nEach group will introduce its initial action plan to the class. The presentation includes a topic, overview, context, questions, methods, funding, communication, and effectiveness. _PowerPoint submission deadline_: 13 April 2022.\n\n**Final Group Presentation(30%):**\n\nEach group will present its final action plan to the class. Students are encouraged to be creative in helping the class understand what issues they have done/ advocated during this semester. While these can be Powerpoint presentations, they may also take the form of a speech, rap, video, website, or other means of conveying what was done. The last class sessions (30 May) will be dedicated to presentations. _PowerPoint submission deadline_: 28 May 2022; **FINAL PROJECT COMPLETION REPORT submission deadline: 4 June 2022.**\n\n**\\*\\*\\*Intra-Group Member Peer Evaluation: submission deadline: 4 June 2022.**\n\n**Grading**\n\nEach assignment has individual guidelines and grading criteria. These will be available on MOODLE in advance of assignment deadlines. Your final grade will be based on the following distribution of points:\n\nAssignment\n\n% of Grade\n\nWeekly reading reflections (online co-reading at least five(5) times)\n\n**25%**\n\nCourse task\n\n**10%**\n\n**Weekly news** **Group** **Presentation** (1news+1 questions in 5mins)\n\n**10%**\n\n**Midterm Group** **Presentation (+ ppt)**\n\n**25%**\n\n**Final Group Presentation (+ ppt + final report)**\n\n**30%**\n\nTOTAL\n\n100%\n\n**Attendance:** As a component of active participation, attendance is required. In some cases, absences due to illness, religious observance, or university-sanctioned activities (i.e., sports, band, academic competition, etc.) may be excused on the condition that written documentation is provided at least 48 hours prior to missing class **(or in the case of illness, a note from a health care professional afterward).** Students are permitted three sick or personal leaves (including one unexcused absence) **\\[total: 3 times\\]**. \n\nEach additional unexcused absence will result in the reduction of **10-20 points** from your grade.\n\n**Course Schedule**\n\nNOTE: Course schedule/content is subject to change at Instructor discretion. Readings will be added as the semester progresses. MOODLE will reflect the most up-to-date reading assignments.\n\n**Weeks**\n\n**Dates**\n\n**Course content**\n\n**Weekly news presentation**\n\n**lecturing**\n\n**group discussion 15min**\n\n1\n\nFeb14\n\n**Welcome to the semester!**\n\n**Course and syllabus review & grouping.**\n\n**x**\n\n2\n\nFeb21\n\n**Introducing new media and public activism**\n\nFind a topic for your action plan:\n\nbrainstroming\n\n_**Keywords:**_\n\ngrassroots democracy_, deliberative forums,_ populism, digital democracy\n\n**3**\n\n**Feb28**\n\n**228 Peace Memorial Day**\n\n4\n\nMar7\n\n**E-democracy and public deliberation in the competent public sphere**\n\njournalism, Activism and the News Media\n\n**Get Super Specific:** Define Your Topic as a Question\n\nGroup 1\n\n_**Keywords**_\n\ndisinformation, objectivity, activist journalism, Advocacy _journalism, Maria Ressa_\n\n5\n\nMar14\n\n**Environmental Activism,** climate activism**,** animal rights activism\n\n**\\[**_tentative plan_**\\]Short talk:** Environmental Activism in Taiwan: Greenpeace Activists' Strategies and Prospects\n\n**x**\n\nGroup 2\n\n_**Keywords**_\n\nCOP26, Climate Liability, the Paris agreement, Greta Thunberg , carbon-free economy, animal rights, mainstream environmentalism\n\n6\n\nMar21\n\n**Tech activism, Data activism, game activism?**\n\n(1)Do a background check\n\n(2)Think about the audience\n\nGroup 3\n\n_**Keywords**_\n\nGamification, data activism, game activism\n\n7\n\nMar 28\n\n**Keynote speech****：****CINEMACTIVISM**\n\nHong Kong social movement film festival(香港社會運動電影節)\n\nDesign/ make your project\n\n_**Keywords:**_ Film Activism, [**social** **movements**](javascript:__doLinkPostBack('','ss~~DE%20%22SOCIAL%20movements%22%7C%7Csl~~rl','');), festival-informed practices\n\n**8**\n\n**Apr 4**\n\n**Children's Day**\n\n**9**\n\n**Apr 11**\n\n**Midterm: mid-term group presentation (PPT) submission****; Deadline: 23:59 Apr 13**\n\n**x**\n\n10\n\nApr 18\n\n**_Midterm_** _**Group Oral Presentation**_\n\n**x**\n\n11\n\nApr 25\n\n**Keynote speech**：**media reform activism**\n\n**_Taiwan Media Watch_** 鄭人豪 (The Policy Specialist): media reform activism & Hong Kong grassroots media\n\nx\n\n_**Keywords:**_ _Media reform,_ Radical Media, grassroots media, people’s media, media social responsibility\n\n12\n\nMay 2\n\n**Museum Activism,**\n\n**Gender and Art** **Feminist Visual Activism**\n\nProject progress discussion(1)\n\nGroup 4\n\n_**Keywords:**_ Museum Activism, GUERRILLA GIRLS\n\n13\n\nMay 9\n\n**public space and activism**\n\n_Documentary: culture jam_\n\nProject progress discussion(2)\n\nGroup 5\n\n_**Keywords:**_ surveillance, gentrification, community publics, state power\n\n14\n\nMay 16\n\n**\\[Workshop\\]** What makes a brilliant advocacy strategy?\n\n15\n\nMay 23\n\n**Activism in** **Latin America &** **Arab world**\n\nProject progress discussion(3)\n\nGroup 6\n\n_**Keywords:**_ Arab activist, feminism in Latin America\n\n16\n\n**May 30**\n\n_**Final Group Oral Presentation**_\n\nfirst draft ppt submission **Deadline: 23:59** **May** **27**\n\n**Intra-Group Member Peer Evaluation: submission deadline: 4 June 2022.**\n\n17\n\n**Jun 6**\n\n**Flex week(**Self-learning**):** _participate_ in _initiative activities_ and share your experience with your friends\n\n18\n\n**Jun 13**\n\n**Flex week(**Self-learning**):** continuing your action plan online with your groupmates, and communicate your appeal",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "Weekly theme concepts and theoretical case presentations"
        },
        {
            "type": "Group discussion",
            "note": "Students will have group discussions on related topics"
        },
        {
            "type": "Cooperative learning",
            "note": "Group discussions, puzzle solving, and practice for mid-term final proposals"
        },
        {
            "type": "Media, audio, visual materials",
            "note": "Use ppts, documentaries, news for discussing related topics"
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 25,
            "note": "online reading & the task for asking/ answering questions 5 times"
        },
        {
            "type": "Midterm Exam",
            "weight": 20,
            "note": "Mid-term group proposal presentation"
        },
        {
            "type": "Final exam",
            "weight": 25,
            "note": "final group presentation"
        },
        {
            "type": "Class discussion involvement",
            "weight": 15,
            "note": "weekly group discussion"
        },
        {
            "type": "Attendances",
            "weight": 15,
            "note": "In-class quiz (You can ask for leave up to three times, and 30% of the total points will be deducted if you exceed it. )"
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}