{
    "year": 109,
    "term": 2,
    "name": "寫作指導（二）",
    "teachers": [
        "陳正賢"
    ],
    "department": "LU21",
    "code": "ENU0238",
    "credit": 2,
    "serial": 1763,
    "group": "D",
    "quota": {
        "limit": 17,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "樸304"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎必須先修過【ENU0237  寫作指導（一）】",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "This two-semester course is to help students develop their ability to properly express themselves in written English. In the first semester, students are expected to acquire the fundamentals of English paragraph-writing, including structure (topic sentence, controlling idea, support and conclusion), outline, organization and coherence. In the second semester, students will extend their one-paragraph writing skills to three-paragraph short-essay writing. In addition, this course aims to equip students with analytic writing competence in response to different scenarios. In particular, course assignments will cover intensive writing practices in different modes, including description, narration, process, cause-effect, comparison-contrast, definition, and classification.",
    "goals": [
        "This class is to help students improve their skills in writing English paragraphs/essays."
    ],
    "syllabus": "**Course description:**\n\nThis two-semester course is to help students develop their ability to properly express themselves in written English. Specifically, it aims to (1) familiarize students with the fundamentals of paragraph structure (topic sentence, controlling idea, support and conclusion), (2) equip them with organizing skills to maximize the effectiveness of writing from paragraphs to short-essays, and (3) improve language skills for concise expressions of ideas. In the first semester, students are expected to review important topics of English paragraph-writing. In the second semester, students will extend their one-paragraph writing skills to three-paragraph short-essay writing. The course also develops students’ analytic writing competence in response to different scenarios. In particular, course assignments will cover intensive writing practices in different modes, including description, narration, process, definition, cause-effect, comparison-contrast, and classification.\n\n**Textbook:**\n\nLangan, J. (2011). _Essay skills_ (2nd ed.). Chicago, Il: McGraw-Hill. Cost of the book is $425.\n\n**Class Policies:**\n\n1\\. In this semester, students are expected to complete **four** writing assignments on **four** different modes—definition, cause-effect, comparison-contrast, and classification. Each assignment includes a draft and a revision.\n\n2\\. The expected length of each writing assignment is a **three-paragraph essay** of around **500-600** words.\n\n2\\. Students are expected to attend each class—attendance will be taken. Multiple absences may result in an automatic failing grade.\n\n3\\. Students who miss class are responsible for content. Any student who misses a class has the responsibility for obtaining copies of notes, handouts, assignments, etc.\n\n4\\. All typed assignments completed outside of class must be 1.5-spaced with 12 font size.\n\n5\\. Written assignments must be handed in on time.\n\n6\\. All cell phones MUST be turned off during class time. \n\n7\\. Academic honesty is expected at all times. Plagiarism will result in a serious grade penalty and may lead to an automatic failing grade.\n\n**Tentative Schedule: Guided Writing—Spring 2021**\n\n**Week**\n\n**Date**\n\n**Content**\n\n**Notes**\n\n1\n\n2/26\n\nIntroduction\n\n2\n\n3/5\n\nCh7 Introduction to Essay Development\n\n3\n\n3/12\n\nCh8 Writing the Essay\n\n4\n\n3/19\n\nCh9 Introductions, Conclusions, and Titles\n\n5\n\n3/26\n\nCh10 Patterns of Essay Development\n\n6\n\n4/2\n\n**School Day (No Class)**\n\n7\n\n4/9\n\nCh10 Patterns of Essay Development\n\n8\n\n4/16\n\n**Midterm Exam**\n\n9\n\n4/23\n\nCh10 + Ch 6: Definition\n\n10\n\n4/30\n\nCh10 + Ch 6: Cause and Effect\n\n11\n\n5/7\n\nCh10 + Ch 6: Cause and Effect\n\n12\n\n5/14\n\nCh10 + Ch 6: Comparison and Contrast\n\n13\n\n5/21\n\nCh10 + Ch 6: Comparison and Contrast\n\n14\n\n5/28\n\nCh10 + Ch 6: Classification\n\n15\n\n6/4\n\nCh10 + Ch 6: Classification\n\n16\n\n6/11\n\n**Final Exam**\n\n17\n\n6/18\n\n**Flexible Week**\n\n18\n\n6/25\n\n**Flexible Week**",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 60,
            "note": "Writing Assignments"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "Class Participation"
        },
        {
            "type": "其他",
            "weight": 20,
            "note": "Writing Journals"
        }
    ],
    "prerequisite": "◎必須先修過【ENU0237  寫作指導（一）】",
    "general_core": []
}