{
    "year": 109,
    "term": 2,
    "name": "英語會話（二）",
    "teachers": [
        "多德"
    ],
    "department": "LU21",
    "code": "ENU0270",
    "credit": 2,
    "serial": 1776,
    "group": "B",
    "quota": {
        "limit": 25,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 8,
            "to": 9,
            "campus": "本部",
            "classroom": "誠304"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "1",
    "classes": "2",
    "dept_group": "",
    "hours": 2,
    "description": "本課旨在提高學生英語會話之動機與信心，擴展其英語會話相關知識，及提昇其英語會話技巧。藉由導正參與會話之心態及學習與會話相關之言談特色、溝通策略、肢體語言及社會文化，學生可望在不同場合(如一般社交和工作面試)面對不同人士或使用不同溝通媒介(面對面或講電話)時以更輕鬆的心情及更適切的方式參與、進行（即開啟、延續、及結束）英語會話。本課程之授課方式主要以兩人對話型式討論相關文獻及運用演練所學之會話知識和技巧。學習評量包含學生個人的平時課堂參與、課堂小考、二至三段考以及小組與個人報告等。",
    "goals": [
        "Acquire the attitude that is conducive to having English conversation.",
        "Know the stages involved in the English conversation process.",
        "Acquire the skills to open, sustain and close an English conversation.",
        "Learn the vocabulary for topics commonly mentioned in daily conversations.",
        "Acquire the skills to perform FTA’s (Face Threatening Acts) like requesting, rejecting a request, hiding true feelings, and deflecting embarrassing questions.",
        "Learn how to conduct phone conversations.",
        "Acquire the knowledge and ability to conduct conversations at a job interview."
    ],
    "syllabus": "**Overview**\n\nStudents will improve their ability to express their ideas and opinions clearly and coherently in English through completing the course components to the highest possible standard. The instructor will facilitate by providing input, guidance and feedback as appropriate and necessary and, additionally, upon request.\n\n  \n\n**Course Components**\n\nThe course is divided into the components introduced below.\n\n  \n\n1\\. Conversation Groups\n\nStudents will take turns to lead conversation groups. They will be required to prepare engaging material and take responsibility for effectively leading their group to ensure a positive learning experience for all concerned. \n\n  \n\n2\\. YouTube Presentation\n\nStudents will select a video clip from YouTube to introduce to the class. They will be required to introduce the video, provide a complete transcript and explain any problematic vocabulary and/or phrases.\n\n  \n\n3\\. Debates\n\nStudents will debate self-selected topics in teams using a modified ‘Mace’ debate format.\n\n  \n\n4\\. English, Britain and Cultural Differences\n\nThe instructor will give short lectures on English, Britain and cultural differences in response to student questions.\n\n  \n\n5\\. Teacher For A Day\n\nStudents will work in groups to prepare and give a communicative language lesson in English. Instruction, examples and advice will be provided on communicative language learning, lesson planning and classroom management.\n\n  \n\nA weekly schedule will be arrived at through negotiation between instructor and students.\n\n  \n\n**Evaluation**\n\nAttendance and Active Participation 35%\n\nConversation Groups 15%\n\nYouTube Presentation 15%\n\nDebates 15%\n\nTeacher for a Day 20%",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 25,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "其他",
            "weight": 65,
            "note": "Conversation Groups, YouTube Presentation, Debates, Teacher for a Day"
        }
    ],
    "prerequisite": "",
    "general_core": []
}