{
    "year": 109,
    "term": 2,
    "name": "句法學導論",
    "teachers": [
        "丁仁"
    ],
    "department": "LU21",
    "code": "ENU0228",
    "credit": 3,
    "serial": 1827,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "誠305"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "3",
    "classes": "2",
    "dept_group": "",
    "hours": 3,
    "description": "As is well-known, syntax is one of the core courses in linguistics. It is the study of sentence structure. The earlier you take this course, the more awareness you’ll develop toward sentence structure. Such sensitivity to sentence structure will make you a keen learner for any language, not only English but also second foreign languages such as French, German, Japanese, etc., or even our native languages, such as Mandarin, Taiwan Southern Min, etc. After taking this course, you will be able to start doing interface studies of syntax with other fields in linguistics like sentence processing, L1 and L2 acquisition. You will also be equipped with the background for pursuing more advanced studies of syntax. \n\nRegarding the course content, this course is an introduction to generative theory, an influential syntactic framework founded by Chomsky, the most cited author alive in the world of academia. This framework is established through the study of central aspects of English grammar and the comparative study of English grammar as well as the grammar of other languages. Using homework problems and in-class exercises, we will construct a model of (a fragment of) English. Coursework emphasizes problem solving skills and syntactic argumentation. Special reference will be given to facts and analyses of Chinese when appropriate. This course will be of great help to students who want to explore a theoretical linguistic field such as syntax. For those students who are not so linguistically-oriented, this course will also be helpful in giving a clear concept of syntactic structure of English and in fact syntactic structure of language in general.",
    "goals": [
        "Students will be able to start doing interface studies of syntax with other fields in linguistics like sentence processing, L1 and L2 acquisition.",
        "Students will also be equipped with the background for pursuing more advanced studies of syntax."
    ],
    "syllabus": "Course description:\n\nAs is well-known, syntax is one of the core courses in linguistics. It is the study of sentence structure. The aim of the course is to develop your sensitivity and awareness toward sentence structure. Special reference will be made to the syntactic structure of English. \n\nRegarding the course content, this course is an introduction to generative theory, an influential syntactic framework founded by Chomsky, the most cited author alive in the world of academia. This framework is established through the study of central aspects of English grammar and the comparative study of English grammar as well as the grammar of other languages. Coursework emphasizes problem solving skills and syntactic argumentation. This course will be of great help to students who want to explore a theoretical linguistic field such as syntax, and also to students who want to obtain a clear concept of syntactic structure of English.\n\n教學進度與主題\n\nWeek 1 Orientation  \nWeek 2 Parts of speech and constituency  \nWeek 3 Structural relations  \nWeek 4-5 X-bar theory  \nWeek 6 Extending X-bar theory  \nWeek 7 No class (Spring break)\n\nWeek 8 Head movement\n\nWeek 9 Mid-term  \nWeek 10-11 Theta-roles and the lexicon  \nWeek 12-13 NP/DP movement, raising, control and empty categories  \nWeek 14-15 _Wh_ movement  \nWeek 16 Group term project presentation\n\nWeek 17-18 Self-directed learning: Individual term paper writing",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 25,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "Attendance/participation/group exercises"
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "小組口頭報告專題結果"
        },
        {
            "type": "專題",
            "weight": 20,
            "note": "個別書面報告專題結果, 3 pages minimum"
        },
        {
            "type": "其他",
            "weight": 15,
            "note": "小考"
        }
    ],
    "prerequisite": "",
    "general_core": []
}