{
    "year": 109,
    "term": 2,
    "name": "英文（二）",
    "teachers": [
        "柯珍宜"
    ],
    "department": "LU21",
    "code": "ENU0169",
    "credit": 3,
    "serial": 1758,
    "group": "D",
    "quota": {
        "limit": 25,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "誠305"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "In Freshman English, our course goals are as follows: (1) to introduce students to readings on a wide variety of themes; (2) to guide students how to think critically about the issues addressed in the readings; (3) to discuss, in English, these issues; (4) to help students become familiar with new vocabulary and aspects of Western culture, and discuss how they are used in the readings; and (5) to prepare students to be able to paraphrase passages from the readings and answer essay questions related to the readings. \n\nThe course, Freshman English for English majors, has several goals: \n \n1.      To introduce students to the basic and necessary reading skills that students will need to employ throughout their lives when reading or discussing materials that have been written in English.\n \n2.      To teach students to think critically about the issues addressed in the readings. \n \n3.      To provide classroom opportunities for the discussion of thoughts and ideas generated from students’ use of critical thinking skills.\n \n4.      To provide opportunities through the use of homework to allow students to show their understanding of the readings’ main ideas, supporting examples, vocabulary, idioms, phrases, the use of inference, and paragraph and essay construction. \n \n5.      To prepare students to be able to paraphrase passages from the readings, write summaries of the readings, and answer essay questions related to the readings.  \n \n6.     To provide students with opportunities to read essays or other readings which provide greater exposure and deeper understanding on topics of global interest.",
    "goals": [
        "To introduce students to readings on a wide variety of themes",
        "To teach students how to think critically about the issues addressed in the readings",
        "To discuss, in English, the issues addressed in the readings",
        "To help students become familiar with new vocabulary and culture points and discuss how they are used in the readings",
        "To prepare students to be able to paraphrase passages from the readings and answer essay questions related to the readings"
    ],
    "syllabus": "**Freshman English—Spring Semester 2021**\n\n**Mondays, 9:10—12:10,** **誠****305**    \n\n**Lecturer**: **Jean E. Curran**  **柯珍宜**                                **email:** [curran.jean@gmail.com](mailto:curran.jean@gmail.com)       \n\n**Office**: 誠714; **Office Hours:** Mondays, 16:00 – 18:00; Tuesdays, 10:00 – 12:00\n\n1.  **Course Description**\n\nThe second semester of Freshman English builds upon the knowledge and skills acquired in the first semester of the course. The goals of the course remain the same:\n\n1.  To introduce students to the basic and necessary reading skills that students will need to employ throughout their lives when reading or discussing materials that have been written in English.\n2.  To teach students to think critically about the issues addressed in the readings.\n3.  To provide classroom opportunities for the discussion of thoughts and ideas generated from students’ use of critical thinking skills.\n4.  To provide opportunities for students to show their understanding of the readings’ main ideas, supporting examples, vocabulary, idioms, phrases, the use of inference, and paragraph and essay construction.\n5.  To prepare students to be able to paraphrase passages from the readings, write summaries of the readings, and answer essay questions related to the readings. \n6.  To provide students with opportunities to read essays or other readings which provide greater exposure and deeper understanding on topics of global interest.\n\n1.   **Organization of the Course**\n\nThis is a reading and discussion course. Typically, one to two class sessions will be devoted to each reading.  There will be some lecturing, but this will be minimal.  The course is conducted primarily through discussion.  Students are expected to play an active role in the presentation and discussion of the class materials.\n\n1.  **Materials**\n\n**Textbook**: Goldthwaite, Melissa, Brereton, John, Bizup, Joseph, Fernald, Anne, and Peterson, Linda. (2016). _The Norton Reader_. _(Shorter Fourteenth Edition)._ Upper Saddle River, New York: W. W. Norton & Company.\n\n**Handouts**: Some of the reading materials this academic year will be from sources other than the textbook. These will be sent to you by email, or copied and distributed in class.\n\n1.  **Course Requirements**\n\n1.  **Preparation**: Students should prepare all reading material, vocabulary, and discussion questions prior to class.\n\n1.  **Attendance**: Attendance is required. If you miss class frequently, points will be deducted from your final grade for the course. If you miss class on a regular basis, this could be grounds for failing the course. Please arrive for class on time. \n\n1.  **Participation**:  It is expected that students will be active participants in class discussion.  A willingness to participate is more important than asking a perfect question or giving a perfect answer, and it is this willingness that is considered when assigning final grades for the course.\n\n1.  **Plagiarism**: Plagiarism is not acceptable and could result in a lower grade or failing the course.\n\n1.  **Homework**:  Homework primarily consists of preparing the readings and the associated vocabulary and questions.  Students may also be asked to complete written assignments related to some of the readings.\n\n1.  **Quizzes**: There will be periodic quizzes.\n\n1.  **Grading**: Your final grade for the course will be based on the following criteria.\n\nMidterm Examination                                                30%    \n\nFinal Examination                                                     30%    \n\nHomework, Quizzes, Attendance, & Participation          40%\n\nNote: It is expected that all students will be present for exams and quizzes. A make-up exam or quiz will not be given unless there is a documented family or health emergency.\n\n**FRESHMAN ENGLISH—Syllabus—Spring Semester 2021**\n--------------------------------------------------\n\n**Week**\n\n**Date**\n\n                         **Topic/Reading**\n\n**Source**\n\n1\n\nFebruary 22\n\nOrientation to Second Semester\n\n“John F. Kennedy Inaugural Address”\n\npg. 470-473\n\n2\n\nMarch 1\n\nHoliday—2/28 Peace Memorial Holiday\n\n3\n\nMarch 8\n\n“John F. Kennedy Inaugural Address”\n\n“Blue-Collar Brilliance”\n\npg. 470-473\n\npg. 262-269\n\n4\n\nMarch 15\n\n“Blue-Collar Brilliance”\n\npg. 262-269\n\n5\n\nMarch 22\n\n“Hidden Intellectualism”\n\npg. 237-241\n\n6\n\nMarch 29\n\n“Hidden Intellectualism”\n\n“Advice to Youth”\n\npg. 237-241\n\npg. 365-367\n\n7\n\nApril 5\n\nHoliday—Tomb Sweeping Day\n\n8\n\nApril 12\n\n“Advice to Youth”\n\nReview for Midterm Exam\n\npg. 365-367\n\n9\n\nApril 19\n\n**MIDTERM EXAM**\n\n10\n\nApril 26\n\nOffice of International Affairs—Class Activity\n\n11\n\nMay 3\n\n“To Siri with Love: How One Boy with Autism Became BFF with Apple’s Siri”\n\npg. 356-361\n\n12\n\nMay 10\n\n“Be a Gamer, Save the World”\n\npg. 220-223\n\n13\n\nMay 17\n\n“What Should a Billionaire Give—And What Should You?”\n\npg. 368-379\n\n14\n\nMay 24\n\n“What Should a Billionaire Give—And What Should You?”\n\npg. 368-379\n\n15\n\nMay 31\n\n“What Farm to Table Got Wrong”\n\n“We Don’t Need To Be Saved from Making\n\n  Smoothies”\n\nReview for Final Exam\n\npg. 224-227\n\nHandout:     _New York Times_\n\n16\n\nJune 7\n\n**FINAL EXAM**\n\n17\n\nJune 14\n\nTake-Home Assignment\n\n18\n\nJune 21\n\nTake-Home Assignment",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 30,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 30,
            "note": ""
        },
        {
            "type": "其他",
            "weight": 40,
            "note": "Homework, Quizzes, Attendance, & Participation"
        }
    ],
    "prerequisite": "",
    "general_core": []
}