{
    "year": 109,
    "term": 2,
    "name": "小說選讀",
    "teachers": [
        "林秀玲"
    ],
    "department": "LU21",
    "code": "ENU0024",
    "credit": 3,
    "serial": 1779,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 8,
            "to": 10,
            "campus": "本部",
            "classroom": "誠701B"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "The aim of this fiction selection course is to provide a general survey of the representative works of fiction by some major British novelists.  In addition to traditional discussion of characterization and plot, we will focus on the historical, social contexts of these works.   For example, Elizabeth Gaskell`s North and South, besides interweaving intriguing twisting plots of traditional romance, provides an acute social criticism of industrialization, class discrepancy, the discrepancy between mill owner and the workers, between the rich and the poor.   We will also pay particular attention on the depiction of London in the nineteenth and early twentieth centuries, especially represented in the works by Charles Dickens, Sir Arthur Conan Doyle, and Oscar Wilde.",
    "goals": [
        "to provide a general survey of the representative works of fiction",
        "focus on the historical, social contexts of these works"
    ],
    "syllabus": "Selective Readings in the Novels, Spring 2021\n\nProfessor Hsiu-ling Lin,\n\nBy appointment only through email: [hllinberkeley@yahoo.com.tw](mailto:hllinberkeley@yahoo.com.tw).\n\nThe aim of this fiction selection course is to provide a general survey of the representative works of fiction by some major British novelists in the Victorian and the early Modern periods. In addition to traditional discussion of characterization and plot, we will focus on the historical, social contexts of these works. For example, Elizabeth Gaskell\\`s _North and South_, besides interweaving intriguing twisting plots of traditional romance, provides an acute social criticism of industrialization, class discrepancy, the discrepancy between mill owner and the workers, between the rich and the poor. We will also pay particular attention on the depiction of London in the nineteenth and early twentieth centuries, especially represented in the works by Elizabeth Gaskell, Jane Austen, Charles Dickens, Rudyard Kipling, and Joseph Conrad, among others.\n\nWe will also focus on the prominent themes of these periods, such as “industrialization,” “romance,” and “spy fiction.” We will first watch various film adaptations of, and then read selections from, these novels. \n\nIndustrialization and Romance:\n\nElizabeth Gaskell, _North and South_,\n\nJane Austen, _Pride and Prejudice_,\n\n\\-----.  _Mansfield Park_,\n\nCharles Dickens, _Our Mutual Friend_.\n\nSpy Fiction:\n\nRudyard Kipling: _Kim_.\n\nJoseph Conrad, _Secret Agent_\n\nIan Fleming, Selection from _007_.\n\nSyllabus is subject to change, contingent upon the schedule. \n\n\\-------------------------------------------------------------------------------------\n\nGrading policy:\n\nClass Participation: 20%\n\nAttendance: 10%, 3 absences automatically resulting in failing the class.\n\nFinal paper: 70%, 5-8 pages long.  The paper should be written in English, If you are an English major, or English-native speaker; otherwise, you may choose to write your paper in Chinese.",
    "methodologies": [
        {
            "type": "講述法",
            "note": "lecture"
        },
        {
            "type": "討論法",
            "note": "discussion, group discussion, group presentation."
        },
        {
            "type": "專題研究",
            "note": "thematic studies"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "3 absences automatically resulting in failing the class"
        },
        {
            "type": "報告",
            "weight": 70,
            "note": "5-8 pages long.  The paper should be written in English, If you are an English major, or English-native speaker; otherwise, you may choose to write your paper in Chinese."
        }
    ],
    "prerequisite": "",
    "general_core": []
}