{
    "year": 109,
    "term": 2,
    "name": "英文（二）",
    "teachers": [
        "高瑪麗"
    ],
    "department": "LU21",
    "code": "ENU0169",
    "credit": 3,
    "serial": 1755,
    "group": "A",
    "quota": {
        "limit": 25,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "正302"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "In Freshman English, our course goals are as follows: (1) to introduce students to readings on a wide variety of themes; (2) to guide students how to think critically about the issues addressed in the readings; (3) to discuss, in English, these issues; (4) to help students become familiar with new vocabulary and aspects of Western culture, and discuss how they are used in the readings; and (5) to prepare students to be able to paraphrase passages from the readings and answer essay questions related to the readings. \n\nThe course, Freshman English for English majors, has several goals: \n \n1.      To introduce students to the basic and necessary reading skills that students will need to employ throughout their lives when reading or discussing materials that have been written in English.\n \n2.      To teach students to think critically about the issues addressed in the readings. \n \n3.      To provide classroom opportunities for the discussion of thoughts and ideas generated from students’ use of critical thinking skills.\n \n4.      To provide opportunities through the use of homework to allow students to show their understanding of the readings’ main ideas, supporting examples, vocabulary, idioms, phrases, the use of inference, and paragraph and essay construction. \n \n5.      To prepare students to be able to paraphrase passages from the readings, write summaries of the readings, and answer essay questions related to the readings.  \n \n6.     To provide students with opportunities to read essays or other readings which provide greater exposure and deeper understanding on topics of global interest.",
    "goals": [
        "To introduce students to readings on a wide variety of themes",
        "To teach students how to think critically about the issues addressed in the readings",
        "To discuss, in English, the issues addressed in the readings",
        "To help students become familiar with new vocabulary and culture points and discuss how they are used in the readings",
        "To prepare students to be able to paraphrase passages from the readings and answer essay questions related to the readings"
    ],
    "syllabus": "  \n1  \nFeb. 25Orientation  \nFeb. 28Holiday  \n2  \nMar. 3Self-Perception:  \n“Mother Tongue” by Amy Tan Handout (Norton Sampler)  \nMar. 6“Mother Tongue”Handout  \n3  \nMar. 10“You’re Short, Besides!”Essays from Contemporary Culture155-160  \nMar. 13“You’re Short, Besides!”ECC155-160  \n4  \nMar. 17“What’s in a Name?”ECC174-178  \nMar. 20“What’s in a Name?”ECC174-178  \n5  \nMar. 24“Weighing In”Handout, The Contemporary Reader58-59  \nMar. 27“The Symmetry of Beauty”Handout, TCR83  \n6  \nMar. 31“It’s Failure, Not Success”ECC38-39  \nApril 3Spring Vacation  \n7  \nApril 7“Are We Living in a Moral Stone Age?”ECC40-47  \nApril 10“Are We Living in a Moral Stone Age?”ECC40-47  \n8  \nApril 14“Ready To Lend a Hand”Handout, Newsweek  \nApril 17“Ready to Lend a Hand”  \n9  \nApril 21Review  \nApril 24Midterm  \n10  \nApril 28The Giver by Lois Lowry (First week: Chapters 1-10)Available at Bookman Books  \nMay 1The Giver  \n11  \nMay 5The Giver (Second Week: Chapters 11-20)  \nMay 8The Giver  \n12  \nMay 12The Giver (Last class: Chapters 21-23)  \nMay 15“Shooting an Elephant” by George OrwellECC144-146  \n13  \nMay 19“Shooting an Elephant”ECC144-146  \nMay 22The Food Chains That Link Us All”Handout: Time  \n14  \nMay 26“The Food Chains That Link Us All”  \nMay 29“The Food Chains that Link Us All”  \n15  \nJune 2Movie  \nJune 5“Spoiling for a Fight”Handout  \n16  \nJune 9“Spoiling for a Fight”Handout  \nJune 12Randy Pausch’s “Last Lecture”: Really Achieving Your Childhood Dreams (youtube)Watch in Class; Handout  \n17  \nJune 16Steve Jobs Stanford Commencement speech: “Do what you love”Handout  \nJune 19Review  \n18  \nJune 23Final Exam",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 35,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 45,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}