{
    "year": 109,
    "term": 2,
    "name": "英國文學：中古時期至十八世紀（二）",
    "teachers": [
        "張瓊惠"
    ],
    "department": "LU21",
    "code": "ENU0292",
    "credit": 2,
    "serial": 1804,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 8,
            "to": 9,
            "campus": "本部",
            "classroom": "正303"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "2",
    "classes": "2",
    "dept_group": "",
    "hours": 2,
    "description": "The purpose of this two-semester course is to introduce students to a range of writing in English from the medieval period up to the eighteenth century. This semester we shall be studying literature from the early seventeenth century up to the end of the eighteenth century. The ideas or themes we shall be considering include ambiguity, ambivalence, consolation, resistance, interiority, irony, escapism, sex, failure, intimacy, liberty, and slavery.\n\nHistorical context is provided in the seminars, but students will need to be doing their own background reading if they are to be successful in their work. Students are advised to bring English-Chinese dictionaries to class and to keep a notebook in which to add new vocabulary.",
    "goals": [
        "To improve students’ knowledge of British culture and written and spoken English through a thematically-related sample of British literature"
    ],
    "syllabus": "Course Description: what to study, why study, how to study, when to study  \n1\\. What to study  \nThis two-semester course introduces you to the English literature before the eighteenth century.  In the first semester, we study literary works up to the year 1603, the year when Queen Elizabeth died.  The works to be studied for the first semester includes Old English literature Beowulf, Middle English literature Chaucer, Everyman, Malory and Early Modern (or Renaissance) literature More, Sidney, Wyatt, Surrey, Ralegh, Spenser, Marlowe.   In the second semester, we study works of the seventeenth century and the eighteenth century.  Authors to be studied include Shakespeare, Donne, Jonson, Milton, Marvell, Bacon, Hobbes, Swift.\n\n2\\. Why study  \n(1) Reading these works is important to grasp the essence of Western Culture.    \n(2)   It helps you read advanced writings like articles in Time.  (e.g.: “The Merchant of Menace;” “utopia”).  The writers of Time are well-read in English literature. To know these writers, you have to read what they read.  \n(3)   It prepares you for graduate studies of literature.  \n(4)   It helps complete your education as an English major and as a global citizen.\n\n3\\. How to study  \n(1)   Abandon any negative thoughts about the course.  Experience and feel for yourself without being led by other senior course takers’ judgment.   \n(2)   Set up a constructive purpose, which can be one of the four reasons above, for studying this course.  \n(3)   While previewing, use the theme of the week to help you think.   \n(4)   During class discussion, use the questions given in class to guide your thinking process.  \n(5)   While studying for the exam, read and think like an anthropologist.  Treat the authors we are to study as ones who are both similar and radically different from us in terms of their mindset.  Our similarities with them help you grasp human nature or the universal in human society.  And our difference from them gives you a sense of wonder, which is an aesthetic experience, as well as improves your understanding of our time.  For it is only in comparison with an “Other” that we can discover our own peculiarity.  \n(6)   Other suggestions for study can be provided according to the particular nature of a certain text.\n\n4\\. When to study  \n(1)   Preview assigned readings (which I promise will only be a reasonable amount) before each class meeting.  \n(2)   Actively participate in class activities.  \n(3)   Review at least two weeks before the midterm and the final.\n\nGeneral Considerations  \n1\\. Text  \nThe Norton Anthology of English Literature.  10th Ed.  Vol. 1 (around NT$1360).  Available at , which is on 882().  Buy a copy for yourself by September 17, the coming Sat., so that you can preview the assigned readings for the next class meeting.\n\n2\\. Syllabus, Guiding Questions, Lecture Outlines  \nThe syllabus of the courses lists themes, texts, genres, and topics for discussion and important terms.  The syllabus represents the structure of the course and should be brought the class each meeting.  Guiding questions and lecture outlines are given from time to time to help you grasp the key issues in a certain period or text.\n\n3\\. Reading Assignments  \nThe next week’s reading, assigned and recommended, will be listed on a handout.  Should you be absent, please make arrangements for someone to pick up the handout for you. \n\nExtra credits  \n(1) Class participation: Active participation in classroom activities is encouraged. Those who voluntarily respond to questions or lectures can be given extra credits.  \n(2) Attendance: only three excused absences, with school’s official approval notes, are allowed. One absence without school’s approval will result in deduction of one point from you FINALIZED score. Except for unusual conditions, unexcused absence of more than three times will result in failing the class.  \n(3) Assignments: There are totally three assignments, for each assignment, five points at most will be given. In other words, five points will be deducted from your finalized score for each missed assignment. Late assignment will be given no more than 3 points.  \n(4) Online presentation: Each group gives me a ppt file for presentation, with written description for each slide. The files will be available and downloadable from my website in Moodle from early October on.  \n(5) The Midterm and the final employ a standard format with slight variations:  \nPart I Multiple-choice or match questions on materials in the lecture outline or in the textbook, which are ever highlighted in class discussion.  \nPart II Identification and short-answer questions: identify an ever-discussed passage by author, title and/or the speaker of the quoted passage. Short-answer question(s) related to the quotation.  \nPart III Essay Questions  \nThe essay questions usually constitute about 50 percent of the exam. The questions grow out of our discussion based on the themes of class meetings and the guiding (assignment) questions for thinking about a text.  \n(6) For extra credit, you may write a short paper on topics drawn from the texts not discussed in our class. Either you discuss a text in the textbook or relate a topic we have raised in class to a text not included in the textbook.\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=722f054eeb6141ed88338f1b8915d31c&fno=d212734f00a64d20950ff015ab54370e)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "文學導讀"
        },
        {
            "type": "討論法",
            "note": "小組討論（含課堂討論及數位學習平台之討論）"
        },
        {
            "type": "合作學習",
            "note": "分組作業"
        },
        {
            "type": "媒體融入教學",
            "note": "多媒體教材製作"
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 35,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 35,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}