{
    "year": 109,
    "term": 2,
    "name": "中級寫作（二）",
    "teachers": [
        "梁孫傑"
    ],
    "department": "LU21",
    "code": "ENU0288",
    "credit": 2,
    "serial": 1796,
    "group": "F",
    "quota": {
        "limit": 15,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "樸407"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎必須先修過【ENU0237  寫作指導（一）】、【ENU0238  寫作指導（二）】、【ENU0287  中級寫作（一）】",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "This two-semester second-level writing course aims to guide students to (1) practice basic academic writing convention, (2) sharpen analytical essay writing skills, (3) enhance essay coherence and cohesion, and (4) develop a clear writing style. The course will familiarize students with proper academic language and convention to compose five-paragraph short essays on the following five modes of writing: argumentation, definition, causal analysis, process analysis, and comparison and contrast. In addition to the different analytical modes of writing, the course will introduce students to organizing and editing strategies to fine-tune their essay writing. On the one hand, students will learn how to apply principles of coherence and cohesion in their writing to maintain consistent claims and to offer logical transitions at the levels of ideas, sentences, and paragraphs. On the other hand, students will learn how to develop a clear writing style by avoiding common sentence errors and improving concision and specificity in word choice and sentence formation.",
    "goals": [
        "1.　To help students student develop their ability to express themselves in writing essays in English",
        "2.　To help students write various kinds of essays in a well-organized manner"
    ],
    "syllabus": "2.  Course Description\n\nWeek\n\nDate\n\nReadings and Assignments\n\n02/21\n\nOrientation Meeting\n\n02/28\n\n**No Class**: Observed Holiday\n\n01\n\n03/06\n\n1.  Argumentation Revisited -1\n2.  Essay 01: Read the essay “Ban Those Books!” (300-301), and write an essay (of around 300 words) in response to it.\n\nDue: 11:50 pm on 03/10 (Tuesday)\n\n02\n\n03/13\n\n1.  Argumentation Revisited -2\n2.  Essay 02: Revise essay 01 into essay 02 of around 400 words\n\nDue: 11:50 pm on 03/17 (Tuesday)\n\n03\n\n03/20\n\n1.  Argumentation Revisited -3\n2.  Essay 03: Revise essay 02 into essay 03 of around 500 words\n\nDue: 11:50 pm on 03/24(Tuesday)\n\n04\n\n03/27\n\n1.  Argumentation Revisited -4\n2.  Essay 03: Revise essay 03 into essay 04 of around 500 words\n\nDue: 11:50 pm on 03/29(Tuesday)\n\n05\n\n04/03\n\n**No Class**: Observed Holiday\n\n06\n\n04/10\n\n**Personal Conference 01**\n\n07\n\n04/17\n\n**Personal Conference 02**\n\n08\n\n04/24\n\n1.  Description -1 (323-328)\n2.  Read the essay “The Copperhead” by Annie Dillard (available on Moodle).\n\n09\n\n05/01\n\n1.  Description -2\n2.  Essay 04: Choose one question from below, and write an essay (of around 300 words) as a response to the question\n\nDue: 11:50 pm on 05/03 (Tuesday)\n\n1.  What is Dillard’s attitude toward the poisonous copperhead she watched one evening? Fear, repulsion, or something else entirely?\n2.  How is her point of view presented through her choice of descriptive details?\n3.  Is her description objective or subjective, or both?\n4.  What descriptive words or phrases stand out for you, and why?\n\n10\n\n05/08\n\n1.  Description -3\n2.  Essay 05: Revise essay 04 into essay 05 of around 400 words\n\nDue: 11:50 pm on 05/10 (Tuesday)\n\n11\n\n05/15\n\n1.  Description -4\n2.  Essay 06: Revise essay 05 into essay 06 of around 500 words\n\nDue: 11:50 pm on 05/17 (Tuesday)\n\n12\n\n05/22\n\n1.  Description -5\n2.  Essay 06: Revise essay 06 into essay 07 of around 500 words\n\nDue: 11:50 pm on 05/24 (Tuesday)\n\n13\n\n05/29\n\n**Personal Conference 03**\n\n14\n\n06/05\n\n**Personal Conference 04**\n\n15\n\n06/12\n\nPresentation 01\n\n16\n\n06/19\n\nPresentation 02\n\n17\n\n06/26\n\nMake-up Assignments\n\n18\n\n07/03\n\nMake-up Assignments\n\nTentative Schedule\n\nWyrick, Jean. _Steps to Writing Well_. New York: Wadsworth, 2011.\n\nClassroom Policy\n\n1.  The last class meeting will be on the 19th of June in the 16th week. The weeks 17 and 18 will be weeks for make-up assignments.\n2.  Percentile Distribution\n    1.  Writing Assignments (70%): 2 group written reports, and 6 individual written reports\n    2.  Oral Report (15%): 1 group oral report, and 1 individual oral report\n    3.  Class Participation (15%): Students are expected to make intellectual contribution at each and every class meeting.\n3.  Late papers: There are two kinds of deadlines for paper submission. Papers submitted by the 1st deadline are graded with comments. The 2nd deadline is set within one week after the first deadline (e.g. if the first deadline is set at 11:50 pm on 03/10, the second deadline will be set at 11:50 pm on 03/17). A half grad will be deducted from an assignment each day that it late (e.g. an assignment graded as an A will become a B+ if it is submitted two days late). Papers submitted by the 2nd deadline will only receive a grade, with no comments. No papers will be accepted after the 2nd deadline.\n\nThis course is designed to help students write clear, concise and correct essays. Students will develop an appropriate writing style and format in terms of purposes, modes and strategies. The focus of this semester will be on exposition and argumentation, in addition to a general introduction to and practice of the bascis of writing a short essay.\n\nText\n\n  \n  \n \n\n  \n \n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=872e7d55277e4ebfbc4d0cc010a6b43f&fno=e4333550ef8844c7ac6a6ed9f626f1aa)\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=260ea6a2838a454886b978ca07191c20&fno=ef8b28b7c9a845958aaecfe980bb62a2)",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 15,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 15,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 70,
            "note": "four essays and some shorter pieces of writing"
        }
    ],
    "prerequisite": "◎必須先修過【ENU0237  寫作指導（一）】、【ENU0238  寫作指導（二）】、【ENU0287  中級寫作（一）】",
    "general_core": []
}