{
    "year": 109,
    "term": 2,
    "name": "中級寫作（二）",
    "teachers": [
        "多德"
    ],
    "department": "LU21",
    "code": "ENU0288",
    "credit": 2,
    "serial": 1794,
    "group": "D",
    "quota": {
        "limit": 15,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "誠304"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎必須先修過【ENU0237  寫作指導（一）】、【ENU0238  寫作指導（二）】、【ENU0287  中級寫作（一）】",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "This two-semester second-level writing course aims to guide students to (1) practice basic academic writing convention, (2) sharpen analytical essay writing skills, (3) enhance essay coherence and cohesion, and (4) develop a clear writing style. The course will familiarize students with proper academic language and convention to compose five-paragraph short essays on the following five modes of writing: argumentation, definition, causal analysis, process analysis, and comparison and contrast. In addition to the different analytical modes of writing, the course will introduce students to organizing and editing strategies to fine-tune their essay writing. On the one hand, students will learn how to apply principles of coherence and cohesion in their writing to maintain consistent claims and to offer logical transitions at the levels of ideas, sentences, and paragraphs. On the other hand, students will learn how to develop a clear writing style by avoiding common sentence errors and improving concision and specificity in word choice and sentence formation.",
    "goals": [
        "1.　To help students student develop their ability to express themselves in writing essays in English",
        "2.　To help students write various kinds of essays in a well-organized manner"
    ],
    "syllabus": "**Overview**\n\nTo improve the skills, sensibility and understanding necessary to produce well-organized and stimulating pieces of writing. The focus will be on academic writing, although not exclusively so. Over the semester students will complete three longer and numerous shorter pieces of writing.\n\n  \n\n**Course Components**\n\n  \n\nLonger Pieces of Writing:\n\n1\\. Comparison / Contrast Essay\n\n2\\. Cause and Effect Essay\n\n3\\. Descriptive Essay\n\n  \n\nShort Pieces of Writing:\n\n1\\. Free-Writing\n\n2\\. Timed Essays\n\n  \n\nStudents will receive instruction on the conventions of academic and creative writing, syntax, understanding the nature and power of vocabulary, and learn how to be both precise and concise.\n\n  \n\nStudents will be expected to read both self-selected and instructor-provided texts.\n\n  \n\nA weekly schedule will be arrived at through negotiation between instructor and students.\n\n  \n\n**Evaluation**\n\nLonger Pieces of Writing: 60%\n\nShort Pieces of Writing: 20%\n\nAttendance and Participation: 20%\n\n  \n\n**Notes**\n\nAssignments must be done on time. Late submissions will be penalized.\n\nAttendance is required. Being over 30 minutes late will be treated as an absence. \n\nGrades are not negotiable.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 80,
            "note": "three essays and some shorter pieces of writing"
        }
    ],
    "prerequisite": "◎必須先修過【ENU0237  寫作指導（一）】、【ENU0238  寫作指導（二）】、【ENU0287  中級寫作（一）】",
    "general_core": []
}