{
    "year": 109,
    "term": 2,
    "name": "中級寫作（二）",
    "teachers": [
        "林明佳"
    ],
    "department": "LU21",
    "code": "ENU0288",
    "credit": 2,
    "serial": 1791,
    "group": "A",
    "quota": {
        "limit": 15,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "樸402"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎必須先修過【ENU0237  寫作指導（一）】、【ENU0238  寫作指導（二）】、【ENU0287  中級寫作（一）】",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "This two-semester second-level writing course aims to guide students to (1) practice basic academic writing convention, (2) sharpen analytical essay writing skills, (3) enhance essay coherence and cohesion, and (4) develop a clear writing style. The course will familiarize students with proper academic language and convention to compose five-paragraph short essays on the following five modes of writing: argumentation, definition, causal analysis, process analysis, and comparison and contrast. In addition to the different analytical modes of writing, the course will introduce students to organizing and editing strategies to fine-tune their essay writing. On the one hand, students will learn how to apply principles of coherence and cohesion in their writing to maintain consistent claims and to offer logical transitions at the levels of ideas, sentences, and paragraphs. On the other hand, students will learn how to develop a clear writing style by avoiding common sentence errors and improving concision and specificity in word choice and sentence formation.",
    "goals": [
        "1.　To help students student develop their ability to express themselves in writing essays in English",
        "2.　To help students write various kinds of essays in a well-organized manner"
    ],
    "syllabus": "Instructor: Ming-Chia Lin, 林明佳, Ph. D. ([linmjia39@gmail.com](mailto:linmjia39@gmail.com))\n\nClass meetings: Fridays 1320-1510. Office Hours: By appointment.\n\n**Course objectives:**\n\nAt the end of this course, students will be able to\n\n1.     name the organizational components of expository essays;\n\n2.     use various writing strategies for three major types of essays, including the\n\nstrategies of lexico-grammatical patterns and rhetorical purposes;\n\n3.     identify potential interrelations between reader expectations and writing\n\npurposes;\n\n4.     edit and revise their own essays for better quality.\n\n**Delivery of instruction:**\n\n1\\.  Lecture\n\n2\\.  Group discussion & cooperation\n\n3\\.  Peer review & editing\n\n4\\.  Student presentation\n\n**Grading Policy:**        \n\n1.  60% for Essays & Revision\n2.  15% for Attendance & Participation\n3.  14% for Assignments & Peer feedback\n4.  11% for Weekly journals\n\nEssays: Students will write three essays, respectively _Process Analysis, Comparison and Contrast, and Cause and Effect Essays_. **Notably, _Cause and Effect Essay_ should be an integrated essay that involves at least two writing modes, such as integrating _Comparison and Contrast Essay_ into _Cause and Effect Essay, or integrating Cause and Effect Essay into Argumentative Essay_.** Students must submit their final essays (second draft) on time. Late essay submissions will be marked down by **35%. After three or more days of the deadline, submission will not be accepted**. **_Plagiarism_** **is strictly prohibited. Once _plagiarism_ is identified in journals, drafts, or final essays, the writing piece will be graded 0 (zero).**\n\nAttendance & Participation: Students must attend the class every week. Once students are absent from each class period, 2-point will be deducted from their participation score (except for the leaves approved by the instructor). Students’ participation will also be scored based on how much they contribute to peer-feedback and class discussions.\n\nAssignments and peer feedback: Assignments will be given over the course. For example, students will review and give feedback to the first essay draft of their peer. At the very end of two weeks of the semester, student need to work on their own individual learning project and writing a reflection paper, and submit it to the instructor.\n\nWeekly journal: Students will submit one journal entry each for at least 11 weeks. A journal entry will be graded 1 point for the final grade. Submitting more than 11 journal entries may result in extra credit. Students must submit their journals on time. _Plagiarized and repeated journal entries will result in 2-point deduction._\n\n**Tentative Schedule:**\n\nWeek\n\nDate\n\nTopic\n\nDeadline\n\n1\n\n26-Feb\n\nOrientation\n\n2\n\n05-Mar\n\nCommon grammatical mistakes, _plagiarism_, and style\n\n Journal 1\n\n3\n\n12-Mar\n\nIntroduction to Process Analysis Essay\n\n Journal 2\n\n4\n\n19-Mar\n\nBrainstorming and outlining Process Analysis Essay (Presenters 1-2)\n\n Journal 3\n\n5 \n\n26-Mar\n\nDiscussion of Process Analysis Essay (Presenters 3-5)\n\n Journal 4\n\n6 \n\n02-Apr \n\n**Holiday**\n\n7\n\n09-Apr\n\nPresentation and Peer review of Process Analysis Essay/\n\n Individual conference 1 (7 students by appointment)\n\nJournal 5\n\nProcess Analysis Essay first draft (exchange with group members before class)\n\n8\n\n16-Apr\n\nIntroduction to Comparison and Contrast Essay\n\nJournal 6\n\nProcess Analysis Essay second draft **_Due_**\n\n9\n\n23-Apr\n\nBrainstorming and outlining Comparison and Contrast Essay (Presenters 6-7)\n\n Journal 7\n\n10\n\n30-Apr\n\nDiscussion of Comparison and Contrast Essay(Presenters 8-10)\n\n Journal 8\n\n11\n\n07-May\n\nPresentation and peer review of Comparison and Contrast Essay/ Individual conference 2 (7 students by appointment)\n\n Journal 9\n\nComparison and Contrast Essay first draft (exchange with group members before class)\n\n12\n\n14-May\n\nIntroduction to Cause and Effect Essay\n\n Journal 10\n\nComparison and Contrast Essay second draft **_Due_**\n\n13\n\n21-May\n\nBrainstorming and outlining Cause and Effect Essay (Presenters 11-12)\n\n Journal 11\n\n14\n\n28-May\n\nDiscussion of Cause and Effect Essay (Presenters 13-15)\n\nCause and Effect Essay first draft\n\n(exchange with group members before class)\n\n15\n\n04-Jun\n\nPresentation and peer review of Cause and Effect Essay/ Individual conference 3 (7 students by appointment)\n\nCause and Effect Essay second draft **_Due_**\n\n16\n\n11-Jun\n\nWrap up and individual conference 4\n\nIndividual conference: 5 minutes for each student.\n\n17\n\n18-Jun\n\nIndividual project 1\n\n18\n\n25-Jun\n\nIndividual project 2\n\nReport for the project (self-evaluation and self-reflection) **_Due_**",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "實驗/實作",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 14,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 15,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 60,
            "note": ""
        },
        {
            "type": "其他",
            "weight": 11,
            "note": "weekly journal"
        }
    ],
    "prerequisite": "◎必須先修過【ENU0237  寫作指導（一）】、【ENU0238  寫作指導（二）】、【ENU0287  中級寫作（一）】",
    "general_core": []
}