{
    "year": 109,
    "term": 2,
    "name": "英語教學實習（二）（教）",
    "teachers": [
        "王宏均"
    ],
    "department": "LU21",
    "code": "ENUE210",
    "credit": 2,
    "serial": 1846,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 1,
            "to": 4,
            "campus": "本部",
            "classroom": "正303"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎必須先修過【ENUE110  英語教學實習（一）（教）】",
    "form_s": "4",
    "classes": "2",
    "dept_group": "",
    "hours": 4,
    "description": "Serving as a bridge between previous ELT coursework and actual, situated teaching, this course is designed to offer students an opportunity to observe, explore, and implement effective teaching ideas. It covers in-class micro-teaching, classroom observation, and practice teaching at a high school. The major activities in the first semester include analysis and discussion of teaching videos, visits to schools located in the Taipei area, and most importantly, in-class micro-teaching. For the micro-teaching, each student is required to write a lesson plan and then teach for 30 minutes, with all his/her classmates as students and observers. The micro-teaching is followed by a discussion session led by the instructor, with an aim to help improve students’ teaching techniques. To prepare students for the micro-teaching and practice teaching as well, a review of lesson planning and an introduction to procedures that may help teacher development are given at the beginning of the first semester. The second semester covers as its main activities visits to schools located outside the Taipei area, classroom observation, and practice teaching in a high school. In addition to work related to the micro-teaching and practice teaching, students are required to write various reports and participate in classroom discussion and evaluation. Outside the class, students need to study the assigned chapters in groups, brainstorm for its implications and write a one-page (or longer) reflection on each chapter.",
    "goals": [
        "designed to offer students an opportunity to observe, explore, and implement effective teaching ideas."
    ],
    "syllabus": "**\\*Please click** [教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=d68ced405f344d5fad1f206edd812afc&fno=91d822f79bd942bfad244580657b3a1a) **to download the PDF version of this syllabus.**\n\n**Instructor:** **王宏均****Hung-chun Wang, Ph.D.**\n\n**E-mail: wanghc@gapps.ntnu.edu.tw**\n\n**Office: Cheng 708**\n\n**Office hours: Thursday, 13:30-15:30; Friday, 15:30-17:30**\n\n*   **Course Description:**\n\nEnglish Teaching Practicum (II) is a hands-on practicum for pre-service English teachers in the English Department. It offers students a valuable opportunity to gain more classroom experience, and to develop and apply their teaching ideas in a middle-school classroom. In this semester, several experienced English teachers will be invited to give a talk to share their teaching experience and discuss essential ELT issues in Taiwan. Apart from lectures, invited talks, group work and other in-class activities, students will also have classroom observations (2 weeks) and practice teaching (2 weeks) at a middle school.\n\n*   **Delivery of Instruction:**\n\n1.  Lecture\n2.  Group work & discussion\n3.  Student presentation\n4.  Micro-teaching/practice teaching\n5.  Classroom observation\n\n*   **Grading Policy:**\n\n1.  Middle school supervisor’s evaluation of your practice teaching (由中學指導老師評分) – **20%**\n2.  NTNU instructor’s evaluation of your field teaching performance (由師大指導老師評分) – **15%**\n3.  Reflection on your observation of your middle school supervisor’s teaching –**5%**\n4.  Peer observation – **10%**\n5.  Teaching portfolio (including lesson planning and self-reflection) – **20%**\n6.  Reflection on lectures (submitted on Moodle) – **20%**\n7.  Attendance, assignments, and participation – **10%**\n\n*   **Classroom Policies:**\n\n1.  Class attendance is a fundamental requirement that will be strictly enforced in this course. Students are required to come to class or any group meeting held either at實習學校or at 師大 **on time**. Absence from **each class period** will result in a 2.5-point deduction from the final course grade (except for a valid excuse approved by the instructor). Absence from any group meeting at實習學校or師大will seriously affect the final course grade. In addition, students’ participation will also be scored based on how much they contribute to discussions in class and during teacher-student conferences.\n\n(2) Students are required to submit any of their assignments (e.g., lesson plans and reports) before it is due. Late assignments will be marked down by **30%**. Once they are two or more days late, they will NOT be accepted. \n\n(3) Dishonesty: Academic dishonesty is a misconduct that occurs in academic exercises. It involves plagiarism, cheating, fabrication, etc. Students will be penalized for academic dishonesty on any tests, assignments and exercises.\n\nThere is no set textbook for this course. Reading materials will be provided.\n\n1.  **Teaching Portfolio**\n\nStudents are required to hand in an individual teaching portfolio that must include **at least** the following components:\n\n1.  Table of contents\n2.  A self-introduction that includes their curriculum vitae, photo, teaching philosophy, and a brief autobiography written in English and Chinese\n3.  **At least 3 reports** on classroom observations (one report for one class period) in their middle school supervisor’s classes in Weeks 8 and 9\n4.  Lesson plans (original and revised drafts)\n5.  Reflections on their own practice teaching (one reflection report per lesson) (試教每課一份心得)\n6.  Observation reports (**3** reports per week; **6** reports in total): Students need to observe their classmates’ practice teaching for **at least 6 times (3 times per week)** and submit **at least 6 observation reports**. For each observation report, they need to prepare two copies, which will be documented in their own teaching portfolio and their classmates’, respectively. (試教週期間，每週觀察至少**三**位同學的教學，並寫成心得回饋，每週**三**份，每份皆須有兩份影本，一份影本自己留存，另一份影本提供給授課同學放到教學檔案夾中)\n7.  **In the portfolio, please present all of the documents “page by page” in an organized way.**\n\n1.  **Dress code**\n\nWhen students visit實習學校for classroom observation or practice teaching, they must follow the required dress code. Students who violate this rule will receive a 3-point deduction from the final course grade.\n\n*   **Tentative Schedule**\n\n**Week**\n\n**Date**\n\n**Content**\n\n1\n\n2/25\n\nIntroduction to the course\n\n2\n\n3/04\n\nRevision of the lesson plans for practice teaching & Matching of teaching schedule at實習學校and schedule at NTNU\n\n3\n\n3/11\n\n**Invited Talk 1: “Bringing the Four Skills Together” (Sessions 1 & 2)**\n\n\\***Reflection #1 due next week**\n\n4\n\n3/18\n\n**三民高中觀課與課後討論**\n\n\\***Reflection #2 due next week**\n\n5\n\n3/25\n\n**實習注意事項及作業說明** **&** **教學討論**\n\n6\n\n4/01\n\n**3/29 (****週一****): Orientation Meeting at** **師大附中****(13:00-13:50)**\n\n**4/01 Holiday**\n\n7\n\n4/08\n\n**Invited Talk 2: “Differentiated Instructions in English Classes” (Sessions 1 & 2)**\n\n**\\*Reflection #3 due next week**\n\n \n\n8-11\n\n(4/13-5/07)\n\n**4/15-5/06 (classroom observations & practice teaching at** **師大附中****)**\n\n**4/06-4/30 (classroom observations & practice teaching at** **和平高中****): This course schedule will be slightly adjusted for students having classroom observations and practice teaching at** **和平高中****.**\n\nWeeks 8 & 9\n\n見習週Classroom observations\n\nWeeks 10 & 11\n\n試教週Practice teaching\n\n**\\*Meeting with NTNU Instructor**\n\n\\*1st meeting: TBA\n\n\\*2nd meeting: TBA\n\n12\n\n5/13\n\nPresenting personal reflections on the practice teaching experience                  Workshop: TBA **(Reflection #7 due date: TBA)**\n\n13\n\n5/20\n\nPresenting personal reflections on the practice teaching experience                            \\***Reflection #4 due**\n\n14\n\n5/27\n\n**School visit & Classroom observations (****新莊高中****)**\n\n\\***Reflection #5 due next week**\n\n15\n\n6/03\n\n**School visit & Classroom observations (****三重商工****)**\n\n                        **\\*Reflection #6 due next week**\n\n16\n\n6/10\n\nGroup conferences & Submit teaching portfolios\n\n17\n\n6/17\n\nSelf-directed Learning (Replaced by the workshop)\n\n18\n\n6/24\n\nSelf-directed Learning (Replaced by the workshop)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Lecture and invited talks"
        },
        {
            "type": "討論法",
            "note": "Discussion"
        },
        {
            "type": "實驗/實作",
            "note": "Practice teaching"
        },
        {
            "type": "實地考察、參訪",
            "note": "Classroom observations"
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": "1.\tMiddle school supervisor’s evaluation of your practice teaching (由中學指導老師評分) – 20%; 2.\tNTNU instructor’s evaluation of your field teaching performance (由師大指導老師評分) – 15%; 3.\tReflection on your observation of your middle school supervisor’s teaching –5%; 4.\tPeer observation – 10%; 5.\tTeaching portfolio (including lesson planning and self-reflection) – 20%; 6.\tReflection on lectures (submitted on Moodle) – 20%; 7.\tAttendance, assignments, and participation – 10%"
        }
    ],
    "prerequisite": "◎必須先修過【ENUE110  英語教學實習（一）（教）】",
    "general_core": []
}