{
    "year": 108,
    "term": 2,
    "name": "政治生態學研討",
    "teachers": [
        "莫家俊"
    ],
    "department": "LM23",
    "code": "GEC8027",
    "credit": 3,
    "serial": 1558,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 5
    },
    "schedule": [
        {
            "day": 1,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "地理系會議室"
        }
    ],
    "programs": [],
    "comment": "上課教室：文學院勤10F地理系會議室。",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "Globally there are around 300 million indigenous peoples, consisting of approximately 5000 distinct cultures. They live in every part of the world – ranging from the Arctic Circle to tropical rain forests. It is estimated that indigenous peoples occupy 22% of the world’s surface and live in areas which occupy 80% of the planet’s biodiversity and ecosystems.  The natural environment forms an integral part of many indigenous peoples’ livelihoods, cultures, worldviews, and identities which are essential for their survival. However, many indigenous and local communities are threatened by deforestation, mining, restrictive government policies, and bad consequences of ‘development’. The main aim of this advanced course is to outline the key ideas and theories of political ecology, traditional ecological knowledge (TEK), and local natural resource management, and its underlying principles and approaches. This course allows students to appreciate the ecological, spiritual and socio-cultural values, and holistic nature of TEK, and critically analyze current discourses on natural resource conservation from a political ecology perspective. This course will be suitable for students both in human and physical geography, and for students in sustainability and social sciences. We will focus both on indigenous and local communities in Taiwan, but also in other parts of the world.",
    "goals": [
        "Understand and critically discuss theories on political ecology, nature conservation and traditional ecological knowledge systems.",
        "Be familiar with the negative effects of development interventions, land grabbing, economic development and nature conservation on local and indigenous peoples.",
        "Map the different stakeholders and governance regimes involved in nature conservation and rural development from  a political ecology perspective.",
        "Evaluate the sustainability of ‘bottom-up’ nature conservation programs across various geographical contexts."
    ],
    "syllabus": "Week 1: Introduction to the Course (3/2)\n\nWeek 2: Introduction to Political Ecology (3/9)\n\n**Week 3: Guest Lecture 1 (10:00-12:00) – Prof. Shu-Mei Huang (NTU) - [http://www.bp.ntu.edu.tw/?p=3349](http://www.bp.ntu.edu.tw/?p=3349) (3/16)**\n\n**Week 4: Guest Lecture 2 (10:00-12:00) – Prof. Lin-Yih Ren (TMU) -  [http://medhuman.tmu.edu.tw/people/bio.php?PID=47](http://medhuman.tmu.edu.tw/people/bio.php?PID=47) (3/23)**\n\nWeek 5: Indigenous Peoples in the World (3/30)\n\nWeek 6: De-growth and Post-Development Theories (4/6)\n\n**Week 7: Guest Lecture 3 (10:00-12:00) – Prof. Tjuku Ruljigaljig (****李馨慈** **– NTPU) - [http://www.indigenous.nptu.edu.tw/files/11-1121-68.php?Lang=en](http://www.indigenous.nptu.edu.tw/files/11-1121-68.php?Lang=en) (4/13)**\n\nWeek 8: Traditional Ecological Knowledge: What is TEK and why is it important? (4/20)\n\nWeek 9: Case studies in TEK (4/27)\n\nWeek 10: Adaptive capacity, Nature Conservation and Natural Resource Management (5/4)\n\nWeek 11: Eco and Indigenous Tourism: Curse or Development Opportunity? (5/11)\n\n**Week 12: Preparation for the field trip and Fieldtrip (5/18)**\n\nWeek 13: Global Climate Change and Sustainability (5/25)\n\nWeek 14: Land Grabbing, Mining, and Human Rights (6/1)\n\nWeek 15: Urban Political Ecology + Research Methods in PE (6/8)\n\nWeek 16: Wrap-up Lecture + talk about your essay (6/15) + opening up of take-home exam\n\nWeek 17: Reading week – take home exam (6/22)\n\nWeek 18: Reading week – take home exam + final deadline (6/29)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "This course consists of lecturers which are both theoretical and empirical."
        },
        {
            "type": "討論法",
            "note": "Students are required to lead seminars to practice their presentation skills."
        },
        {
            "type": "實地考察、參訪",
            "note": "We will visit an Indigenous Community in Taiwan"
        },
        {
            "type": "媒體融入教學",
            "note": "We will make ample use of media and visual materials during formal lectures."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 50,
            "note": "Write an essay and present it during class – choose a theme related to political ecology (a topic list will be provided) – 20%.\nPhoto-based essay during the fieldtrip – 20%\nAssignment on the guest lecture in the class – 10%"
        },
        {
            "type": "期末考",
            "weight": 30,
            "note": "This includes all the readings, discussions, and lectures."
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "In each class we will have class debates, video assignments, or other forms of class involvement."
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Everyone is required to attend the lectures and seminars, unless you have a valid reason not to come."
        }
    ],
    "prerequisite": "",
    "general_core": []
}