{
    "year": 111,
    "term": 1,
    "name": "氣候變遷研討",
    "teachers": [
        "莫家俊"
    ],
    "department": "LM23",
    "code": "GEC8002",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 1654,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 5
    },
    "schedule": [
        {
            "day": 2,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "地理系研討室五"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "Understand and critically discuss theories on climate resilience, vulnerability, and sustainability.",
        "Be familiar with the negative effects of climate change on cities and rural hinterlands",
        "Map the different stakeholders and governance regimes affecting climate change planning.",
        "Evaluate the sustainability of climate resilience planning and policies across various geographical contexts."
    ],
    "syllabus": "**【授課方式：16+2週】**\n\n**(!) Please note that in case you cannot attend the Monday class, I can have a make-up class for you every Tuesday Morning (2-4) (flexible schedule)**\n\n**Please see course syllabus (PDF) here:**  [教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=0c690e34f05a446d85df5f6ba3be6d45&fno=bbcb5a072c164097905f9a16967f714f)\n\nWeek 1. Lecture: Introduction to the Course  (9/27)  \nWeek 2. Lecture: Climate Change Adaptation and Mitigation  (10/4)  \nWeek 3. No class (10/11)  \nWeek 4. Lecture: What is Urban Climate Resilience (UCR) and Vulnerability? (10/18)  \nWeek 5. Lecture: Principles of UCR Planning I (10/25)  \nWeek 6. Lecture: Principles of UCR Planning II  (11/1)  \nWeek 7. Lecture: Regional Planning and Climate Change I (11/8)  \nWeek 8.  Regional Planning and Climate Change II (11/15)  \nWeek 9.    Workshop on Fieldtrip (11/22)  \nWeek 10.    Fieldtrip (11/29)  \nWeek 11. Student-seminar s (12/6)  \nWeek 12. Student-seminars   (12/13)  \nWeek 13.  Guest lecture (TBA) (12/20)  \nWeek 14.  Research Insights: Climate Change, REDD+ and Rural Development Challenges (12/27)  \nWeek 15.   Research Insights:: Environmental migration and climate change (1/3)  \nWeek 16.  Wrap-up lecture (1/10)  \nWeek 17.   Reading week (1/17)  \nWeek 18.  Reading week (1/24)",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "This course consists of lectures which are both theoretical and empirical. As we approach studies in climate change from a human geography perspective, we will primarily adopt a qualitative approach."
        },
        {
            "type": "Group discussion",
            "note": "Students are required to lead seminars to practice their presentation skills."
        },
        {
            "type": "Media, audio, visual materials",
            "note": "We will make ample use of media and visual materials during formal lectures."
        },
        {
            "type": "Case studies",
            "note": "Students are required to write about country case studies in small presentation report."
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 40,
            "note": "Students will organize a seminar on a country in Asia. They discuss the climate change challenges of the country and its cities, climate resilience planning, and evaluate its sustainability."
        },
        {
            "type": "Final exam",
            "weight": 40,
            "note": "This includes all the readings, discussions, and lectures. It will be an open-book exam OR Final Paper (you choose)"
        },
        {
            "type": "Class discussion involvement",
            "weight": 10,
            "note": "In each class we will have class debates, video assignments, or other forms of class involvement."
        },
        {
            "type": "Attendances",
            "weight": 10,
            "note": "Everyone is required to attend the lectures and seminars, unless you have a valid reason not to come."
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}