{
    "year": 108,
    "term": 1,
    "name": "體育（有氧舞蹈）",
    "teachers": [
        "于文蕙"
    ],
    "department": "PE",
    "code": "00UP024",
    "credit": 1,
    "serial": 2541,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "大韻律教室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "一、培養基本體能、身體律動及協調性，以促進良好體適能。  二、從身體活動中獲得運動的樂趣，進而培養運動興趣。  三、培養同儕之間的友誼，拓展良好人際關係。  四、藉由動、靜態的身體活動，能深入感受身體狀態及放鬆身心。",
    "goals": [
        "培養基本體能、身體律動及協調性，以促進良好體適能。",
        "從身體活動中獲得運動的樂趣，進而培養運動興趣。",
        "培養同儕之間的友誼，拓展良好人際關係。",
        "藉由動、靜態的身體活動，能深入感受身體狀態及放鬆身心。"
    ],
    "syllabus": "**●有氧舞蹈●**\n\n**※ 教學目標：**\n\n一、說明Free Style課程，包含多元化混合式有氧舞蹈學習之樂趣、重點及精髓。\n\n二、訓練基本體能、身體律動與協調性，促進良好的體適能，並從身體活動中獲得運動的樂趣，進而培養運動興趣。  \n三、透過老師動作示範解說及參考DVD教學帶學習有氧基本舞步，術語和簡易編排，提升學生自信心，體會有氧舞蹈的樂趣，藉由動、靜態結合的身體活動，能深入感受身體狀態及放鬆身心。  \n四、上課慣有的生活經驗分享，透過彼此分享生活百態，促進交流互動，無論喜怒哀樂都有抒發宣洩的管道，讓大家體驗情意方面的經驗，同時訓練同學的舞台魅力，面對人群時表現自我的能力，凝聚班上同學情感，學會更加珍惜身邊的人事物，遠離冷漠社會，投入溫馨懷抱。\n\n五、培養同儕之間的友誼，拓展良好人際關係，希望學生在學習基本舞步後，能在期末自行發揮創意排列組合自創出4個8拍的舞步，作為期末考檢核與分享。  \n六、結合現代的科技，讓學生思考如何與有氧舞蹈做結合，並將運動、健康以及歡樂持續傳遞、永續經營。  \n七、培養學生的責任心，從學校開始養成負責敬業的精神與態度。\n\n**※ 每週教學進度：**\n\n一、每週將有不同的主題，將有氧舞蹈與各種舞風融合，依學生的程度適時調整，帶給同學有氧舞蹈外更加認識舞蹈的多元化，以此開發肢體、培養運動樂趣。  \n二、複習前一週的組合動作，並與當週新的進度融合。  \n三、每週開放自願或抽點的方式讓同學上台分享生活中的喜怒哀樂，從中學習、得到感動。  \n四、學期中將有兩次的考試或隨堂的即興考試，包括個人上台示範教學呈現，特殊才藝表演等。  \n五、每週會請同學自編創意動作呈現。  \n\n**※ 教學方法：**\n\n一、講解有氧舞蹈基本動作步伐，術語和注意事項，以多元化混合式有氧舞蹈帶領同學學習有氧舞蹈。  \n二、透過分組的方式，使同學通過討論的過程中彼此交流，達到腦力激盪的效果。  \n三、結合科技使有氧舞蹈能有更多元化的形式呈現。  \n四、以嚴格規定請假規則的方式培養學生敬業的態度。  \n五、結合情境式的戲劇表演拓展學生舞台魅力。 \n\n**※作業/考試規劃：**\n\n一、分為課堂作業及期中考、期末考。\n\n二、《課堂》每週會有小組作業，以當週上課內容為基準，將舞蹈動作重新排列組合，並加入自編新動作，分組進行影片拍攝，再將影片上傳至班內群組及臉書不公開社團觀摩討論或者於下週上課時輪流上台呈現。\n\n三、《期中考》為了讓同學能打開自己的身心靈，將於期中做出一份報告，需在《戶外》拍攝結合舞蹈動作的三張照片，並寫下當時的心情和上課心得，目的是希望學生能感受大自然與身心靈的結合，拓展學生感知上的敏銳度。\n\n四、《期末考》每一位同學必須獨自呈現一段自編的有氧舞蹈並說出術語步伐名稱和簡單口條。\n\n**※評量方法與標準**  \n◆出缺席率 50 ％  \n◆戶外有氧舞蹈照片心得作業報告 20 ％  \n◆練習呈現 10 ％  \n◆有氧舞蹈動作和術語考試(有筆試)20 ％\n\n**※ 注意事項**\n\n1.因為有【前車之鑑】所以特別聲明：『請假超過三次者』---【必當】，看清楚→不管事假、公假或病假都《只有三次》假可以請，『不是不允許請公假』喔，是《只有三次》假可以請！是《只有三次》假可以請！是《只有三次》假可以請！很重要！所以重覆三次！如果一學期中有【太多公假】要請，那就不要來修這堂課了，先說清楚講明白，超過三次照規則辦理，不接受任何遊說，威脅和強迫。\n\n2.遲到10分鐘以上一律以缺席記錄。\n\n3.無故曠課兩次必當。  \n4上課請穿乾淨的運動鞋，務必穿著輕便運動服裝、攜帶毛巾與水。  \n5請準時出席，避免因遲到而影響其它同學。  \n6請假請以學校規定之正常程序辦理，假單請於請假日後一星期內繳交。  \n7課程內容會依學生實際狀況進行彈性調整。  \n8分組練習和呈現請發揮團隊精神及創意巧思。  \n**※****參考書目：于文蕙老師的書籍和DVD教學**",
    "methodologies": [
        {
            "type": "講述法",
            "note": "有氧舞蹈基本步伐動作，術語和注意事項"
        },
        {
            "type": "討論法",
            "note": "分組討論再一一呈現"
        },
        {
            "type": "實驗/實作",
            "note": "錄影教學"
        },
        {
            "type": "其他",
            "note": "戶外舞蹈肢體動作作業及心得呈現"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "戶外有氧舞蹈照片心得作業報告"
        },
        {
            "type": "期末考",
            "weight": 20,
            "note": "有氧舞蹈動作和術語考試(有筆試)"
        },
        {
            "type": "出席",
            "weight": 50,
            "note": "出/缺席率"
        },
        {
            "type": "其他",
            "weight": 10,
            "note": "練習呈現 10 ％"
        }
    ],
    "prerequisite": "",
    "general_core": []
}