{
    "year": 109,
    "term": 1,
    "name": "國學概論（一）",
    "teachers": [
        "曾暐傑"
    ],
    "department": "LU20",
    "code": "CHU0308",
    "credit": 2,
    "serial": 1787,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "樸304"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "1",
    "classes": "3",
    "dept_group": "",
    "hours": 2,
    "description": "國學概論，是以我國固有學術為對象，介紹國學體系，經史子集四部要籍的內容與讀法，國學研究的方法與途徑，啟導初學者認識國學的領域。",
    "goals": [
        "培育研究傳統中國學術與文化之基本素養，發揚古典風華，兼具現代視野。",
        "培育中學國文教師所應具備之專業學識與教學技巧，以養成健全之師資。"
    ],
    "syllabus": "> 讓我們一起創建國學的平行時空，化身時空旅人，回到先秦、選擇家派、學習精進，成為中國古代叱吒風雲的思想人物！我們將在討論中成長、辯論中對戰、攻訐中反思；我們不止穿越時空、更要縱橫歷史——從先秦到清代，親身經歷國學發展的脈絡與興衰。國學的發展不是一種講述，而是透過我自身的參與及體驗而來！我們不只要回到過去，更要回到未來！準備好！I want to play a game!\n> \n> 第一週不發放授權碼，將於課堂中宣佈授權碼發放日期及規則／第一週未到者不得領取授權碼／加退選結束前週次即開始點名，無論已選課未到或新選課者，未參與之週次須撰寫指定作業作為進度彌補／超前部署預防疫情，本學期選課人數以不超過60人為原則／國文系一年級同學不開放以授權碼方式加選課程\n\n**國學概論（一）****1091****新版課程****v2.0［2020.06.14］**\n\n**天字部****・****國學迫降**\n\n01 【國學論】國學不國學？國粹還是國之糟粕，當代視野下的反思\n\n02 【經典觀】經典是什麼？中國經傳系統的形成，及其永恆回歸的真理論述\n\n**地字部****・****哲思論辯**\n\n03 【學派論】思想家聯盟：九流十家誰說了算？論六家要旨中的家派思維\n\n04 【人性論】性善超級霸：性善不是TRUTH，複數真理下的人性理論\n\n05 【本體論】心靈是本質？我如何知道我是誰？我與這個世界的關係為何？\n\n06 【宇宙論】氣化的世界：鬼滅之刃很中國style，氣化宇宙觀的結構與探索\n\n07 【天人關係】真天人合一：假使我們沒有上帝，天對我們的意義是什麼？\n\n08 【修養論】良知是無敵？破山中賊易破心中賊難，王陽明的良知及其對反\n\n09 【諸子學】諸子聯盟・無限之戰（分組學派論辯）\n\n**玄字部****・****古典穿越**\n\n10 【電影評論】張藝謀《英雄》\n\n11 【政治論】不忍人之心：德性是帝王的唯一正解？以道德為主體的中國政治論述\n\n12 【經典活化】臺北孔廟・決戰春秋（時間另訂）\n\n**黃字部****・****經世致用**\n\n13 【經學論】經學已死嗎？漢代經學系統的形成，及其在歷史發展上的興衰流變\n\n14 【法制觀】不重視法制？中華法系的內在結構，以及古代法律與犯罪現場\n\n15 【經濟觀】性惡經濟學：一切思想都來自於物質，古代經濟學原理與思維\n\n16 【宗教觀】何以子不語？中國古代宗教信念，以及中古佛學的超越進化\n\n17 【生死觀】地下能有知？未知生，焉知死，然後，就沒有然後了——其實我們還有的選擇\n\n18 【國學行動】國學劇場／申論國學（小組專題成果或紙筆測驗二選一）\n\n說明\n--\n\n※本課程第一學期以「經」（經典）與「子」（哲思）部為主軸之設計，第二學期則討論「史」（史傳）與「集」（文學）的部分。課程內容以經史子集為基本架構，但內容與型式不限於經史子集。本學期的課程安排強調經部與子部的縱貫，希望建構經子之間的連續性與邏輯性，讓學生在思辨中建構宏觀的國學視野，以作為於「經學通論」與「中國哲學史」等課程中微觀研讀的先備知識與思考能力。\n\n※本課程的設計以宏觀、流變與概念的思辨去發掘國學的源流與意義，不擬針對個思想家或經學典籍逐一深入內涵討論，以與「中國哲學史」、「經學通論」、「諸子學通論」等課程做出區隔，讓彼此相輔相成，以期使學生在修習國文系課程的歷程中，能夠達到相輔相成、精熟學習的成果。是以課程中強調情境式與思辨式的過程，而不僅僅是國學常識的單向講述。\n\n※本系課程安排大一除了此門「國學概論」必修外，須同時修習「經學通論」，為了使兩門課程達到互補的功能，是以本門課程在「經史子集」的架構下，「經」的部分比重安排降低，以及引領學生反思經學的現代意義；並不於課程中詳述五經、十三經等專書之內容。\n\n※課程以思辨為主軸，知識性的論述與記誦將透過指定閱讀與劄記等方式與課程思辨做配合。",
    "methodologies": [
        {
            "type": "講述法",
            "note": "由教師講述國學相關知識脈絡，作為討論與思辨的引導"
        },
        {
            "type": "討論法",
            "note": "課堂以討論與思考為主體，讓學生在交流與交鋒中思辨真相"
        },
        {
            "type": "問題解決教學",
            "note": "以議題導向為核心設計，引導學生以國學解決古代與現代問題"
        },
        {
            "type": "合作學習",
            "note": "透過學習共同體的建構，整合國學家派，以創造協同性與差異性的情境"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 40,
            "note": "撰寫各單元秘笈劄記"
        },
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": "參與課堂討論與活動"
        },
        {
            "type": "出席",
            "weight": 100,
            "note": "出席為本課堂基本要求，是以本項成績不算在成績百分比中。無故缺課每次街扣學期總成績，採累進扣分機制，扣至0分為止。"
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "鹽鐵會議關鍵報告&期末新國學成果交流"
        }
    ],
    "prerequisite": "",
    "general_core": []
}