{
    "year": 110,
    "term": 2,
    "name": "西方中國研究專題與實務",
    "teachers": [
        "潘鳳娟"
    ],
    "department": "IM83",
    "code": "EAC8022",
    "credit": 3,
    "serial": 1331,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "東亞系第二教室"
        }
    ],
    "programs": [],
    "comment": "上課教室為校本部誠大樓9樓，或綜合大樓7樓。（請參考本系所網頁公告之課表）",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "Familiar with the history of Western Chinese studies.",
        "Improve the understanding of the topics in cultural encounters.",
        "Familiar with the research methods of classical sinology and contemporary area studies in the West.",
        "Improve the ability of reading, questioning, discussion, and critical thinking, and the ability to write academic papers."
    ],
    "syllabus": "**Course Overview**\n\n**This course covers a variety of topics on Chinese studies in the West, reflecting upon the history of the knowledge and issues concerning China through Western eyes. The course is constituted of three parts: the first part introduces and discusses the origin and the brief history of the Chinese knowledge constructed. The second part discusses the important topics that merit critical reconsideration, including the problems concerning the disciplinary debates on its methodology. Works of the prominent sinologists and Chinese scholars will be introduced and discussed. In the third part of this course, students are required to interview a Western scholar and produce an interview report on the basis of his/her integration of readings and interviews. Each student has to write a term paper concerning the Western Chinese studies at the end of the course.**\n\n**Learning Objectives** \n\n1.  **Provide students with a foundation for critical reading of academic publications.** \n2.  **Students will be able to discuss theoretical and substantive areas of Chinese studies in the West.** \n3.  **Students will be able to demonstrate the methods and tools used in Chinese studies.**\n\n**Course Outline**\n\n2/15 Course Introduction\n\n**2/22** **China Through Western Eyes:** **A Brief History of Western Chinese Studies 1**\n\nReading assignment:\n\nD.E. Mungello, _Curious Land: Jesuit Accommodation and the Origins of Sinology_ (Honolulu: University of Hawaii Press, 1988), Introduction +Chapter 2.\n\nGeorg Lehner, “From Enlightenment to Sinology: Early European Suggestions on How to Learn Chinese, 1770-1840,” in Philip F. Williams (ed.), _Asian Literary Voices” From Marginal to Mainstream_ (Amsterdam: Amsterdam University Press), pp.71-92.\n\n**3/1 China Through Western Eyes:** A Brief History of Western Chinese Studies 2\n\nReading assignment:\n\n Harriet T. Zurndorfer, _China Bibliography: A Research Guide to Reference Works About China Past and Present_ (Leiden: E.J. Brill, 1995), pp.1-55(Introduction).\n\n**3/8** **Methodological Reflections on Western Sinology and Chinese Studies 1**\n\nReading assignment:\n\nNicolas Standaert, _Methodology in View of Contact Between Cultures: The China Case in the 17th Century_ (Centre for the Study of Religion and Chinese Society, Chung Chi College, the Chinese University of Hong Kong, 2002). 64 pp\n\n**3/15 Methodological Reflections on Western Sinology and Chinese Studies 2**\n\nReading assignment:\n\nHans Kuijper, “Is Sinology a Science?” _China Report_, Vol. 36, No. 3 (2000), pp. 331-354.\n\n**3/22 Methodological Reflections on Western Sinology and Chinese Studies 3**\n\nReading assignment:\n\nPan Feng-Chuan, “Reflections on the Methodology of the Studies on Missionary Sinology,” _Monumenta Serica. Journal of Oriental Studies_, 68:2 (2020), pp. 423-438.\n\n**3/29 Sinologists and Scholars on Chinese Studies1: Missionaries**\n\nReading assignment (one of the three papers):\n\nYves Camus, “Jesuits’ Journeys in Chinese Studies.” (World Conference on Sinology, 2007 Beijing).\n\nAshley E. Millar, “The Jesuits as Knowledge Brokers between Europe and China (1582-1773): Shaping European Views of the Middle Kingdom,” London School of Economics, Working papers No. 105/07 (2007), 53pp. \n\nMary Jo Bane and Kenneth Winston, _Reflections on the Jesuit Mission to China_. Working paper of John F. Kennedy School of Government, Harvard University, 2010. (37pp).\n\n**4/5 Tomb Sweeping Day**\n\n**4/12 Midterm assignment**\n\nHand in a review of a book on China (Chinese studies) published within five years. (≥ 4000 characters without spaces)\n\n**4/19 Sinologists and Scholars on Chinese Studies2: French Sinologists (EU)**\n\nReading assignment:\n\nKnud Lundbaek, “The Establishment of European Sinology 1801-1815,” in Søren Clausen, Roy Starrs, Anne Wedell-Wedellsborg (eds.), Cultural Encounters_: China, Japan, and the West_ (Aarhus, Denmark: University Press, 1995), pp.15-54.\n\nHerbert Franke, “In Search of China: Some General Remarks on the History of European Sinology,” in Wilson, Ming & John Cayley (eds.), _Europe Studies China: Papers from an International Conference on the History of European Sinology_ (Taipei: The Chiang Ching-Kuo Foundation for International Scholarly Exchange, Han-Shan Tang Books, 1995), pp.11-25.\n\n**4/26 Invited Speech: Name Tabooing in Late Imperial China**\n\n      Speaker: Fr. Dr. Piotr Adamek, S.V.D (Fu Jen Catholic Univesity)\n\n     Place: R2, Cheng Building 9F\n\n     Time: 13:30-15:30\n\n    Reference: Piotr Adamek, _A Good _Son_ is Sad if He Hears the Name of His _Father (__Sankt Augustin, Germany: Institut Monumenta Serica; Leeds : Maney Publishing, 2015).\n\n**5/3 Sinologists and Scholars on Chinese Studies3: US**\n\nReading assignment:\n\nSymposium papers on Chinese studies and the disciplines published in _JAS_ vol,23, no,4 (1964), pp. 507-538.\n\n**5/10** **Practice (individual activities)**\n\nEach student must interview the author of the book reviewed (can be done via internet). Suggest to arrange it as early as possible.\n\n**5/17** **Practice****:** **Interview Report**\n\nEach student shares the experience of the interview and discussion before finishing the interview report. (≥ 4000 characters without spaces)\n\n**5/24 One on one meetings for term paper**\n\n20 minutes for each student. Meet in my office. Send by email your ideas for the term paper at least 3 days in advance.\n\n**5/31 Oral Presentation (proposal of the term paper)**\n\n20 minutes for each student, followed by a QA.\n\n**6/7 Flex Week: Revise and finish the term paper (No classroom activities)**\n\n**6/14 Flex Week: Revise and finish the term paper (No classroom activities)**\n\n**GRADING CRITERIA**\n\n1.  **Midterm assignment: Book review 15%**\n\n(≥ 4000 characters without spaces) of a book on China (Chinese studies) published within five years. Deadline of submission: April 12, 2022, 10pm\n\n1.  **Class involvement and discussion \\[including once guiding report of weekly reading assignment\\] 30 %**\n\nEach student is required to work as the reading guide, present the reading assignment and guide the discussion (Once of a semester for MA student, twice for PhD student).\n\n1.  **Interview and report 20 %**\n\n(≥ 4000 characters without spaces) Deadline of submission: 24 May 2022 10pm\n\n1.  **Term paper (oral presentation and paper) 35%**\n\n (≥ 10000 characters without spaces) Deadline of submission:14 June 2022, 10pm\n\n**All book reviews, interview reports, term papers must be uploaded via Moodle.**",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "The teacher gives a brief  introduction to  the main theme of the week, then followed by discussions of reading assignments."
        },
        {
            "type": "Group discussion",
            "note": "Each student is required to work as the reading guide, present the reading assignment and guide the discussion (Once  of  a semester for MA student, twice for PhD student)."
        },
        {
            "type": "Lab/Studio",
            "note": "Each student has to write a book review and interview the author of that book."
        },
        {
            "type": "Field work",
            "note": "Each student has to write a book review and interview the author of that book."
        },
        {
            "type": "Case studies",
            "note": "Write a term paper on the basis of the knowledge learned in the course"
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 15,
            "note": "Midterm assignment"
        },
        {
            "type": "Class discussion involvement",
            "weight": 30,
            "note": "Class involvement and discussion [including once guiding report of weekly reading assignment]"
        },
        {
            "type": "Presentation",
            "weight": 20,
            "note": "Interview and report"
        },
        {
            "type": "Case study reports",
            "weight": 35,
            "note": "Term paper (oral presentation and paper)"
        }
    ],
    "prerequisite": "◎Unavailable for M.A. program students (M.A. program courses excepted) and B.A. program students.",
    "general_core": []
}