{
    "year": 110,
    "term": 2,
    "name": "東南亞社會變遷專題研究討論",
    "teachers": [
        "張碧君"
    ],
    "department": "IM83",
    "code": "EAC8035",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 1334,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "東亞系第二教室"
        }
    ],
    "programs": [],
    "comment": "上課教室為校本部誠大樓9樓，或綜合大樓7樓。（請參考本系所網頁公告之課表）",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "To further understand the cultural and social changes of Southeast Asian countries.",
        "To acquire the ability to organize what has been learned.",
        "To enhance the ability to clarify a research design and academic writing.",
        "To further understand the cultural differences between Southeast Asian countries and being open-minded for a multi-cultural environment."
    ],
    "syllabus": "第一週「課程介紹」 第二週「東南亞文化與社會概況」 Readings: 1.Kahn, J. (1998). Southeast Asian Identities: Introduction. In Kahn, J. (Ed.), Southeast Asian Identities: Culture and the Politics of Representation in Indonesia, Malaysia, Singapore, and Thailand. pp. 1-27. Singapore: Institute of Southeast Asian Studies. 2.Tarling, N. (2004). Nationalist movements. In Nationalism in Southeast Asia: “If the people are with us”, pp. 86-115. 第三週「東南亞與（新）亞洲概念」 Readings: 1.Wee, C.J.W.-L. (2006). Introduction: Local Cultures, Economic Development, and Southeast Asia. In Wee, C. (Ed.), Local Cultures and the “New Asia.” pp. 1-27. 2.Yao, S. (2001). Introduction. In Yao, S. (Ed.), House of Glass: Culture, Modernity, and the State in Southeast Asia. pp. 1-23. 3.Ang, I. (2001). Desperately Guarding Borders: Media Globalization, “Cultural Imperialism” and the rise of “Asia.” In House of Glass. pp. 27-45. 第四週「國家與國族主義在東南亞社會之角色」 Readings: 1.Malhotra, K. (2006). Development Enabler or Disabler? The Role of the State in Southeast Asia. In Local Cultures and the “New Asia.” pp. 31-50. 2.Reid, A. (2010). Understanding Southeast Asian Nationalisms. In Imperial Alchemy: Nationalism and Political Identity in Southeast Asia. pp. 25-48. Cambridge University Press. 第五週「新加坡的國族建構與多元文化/種族主義」 Readings: 1.Wee. C. (2006). From Universal to Local Culture: The State, Ethnic Identity, and Capitalism in Singapore. In Local Cultures and the “New Asia.” pp. 129-157. 2.Chua, B. (1998). Racial Singaporeans: Absence after the Hyphen. In Southeast Asian Identities. pp. 28-50. 第六週「馬來西亞的國族主義與建構」 Readings: 1.Yao, S. (2001). Modernity and Mahathir’s rage: Theorizing State discourse of Mass Media in Southeast Asia. In House of Glass. pp. 27-45. 2.Salleh, H. (2000). Globalization and the Challenges to Malay Nationalism as the Essence of Malaysian Nationalism. In Suryadinata, L. (Ed.), Nationalism and Globalization: East and West. pp.132-174. Singapore: Institute of Southeast Asian Studies. 第七週「東南亞華僑華人的定義及其爭議」 Readings: 1.Wang, G. (1996). Soujourning: The Chinese Experience in Southeast Asia. In A. Reid. Ed. Sojourners and Settlers: Histories of Southeast Asia and the Chinese. Honolulu, University of Hawaii Press, pp. 1-14. 2.Reid, A. (1996). Flows and Seepages in the Long-term Chinese Interaction with Southeast Asia. In Sojourners and Settlers, pp. 15-50. 3.Skinner, G.W. (1996). Creolized Chinese Societies in Southeast Asia. In Sojourners and Settlers, pp. 51-93. 第八週「新、馬認同建構的比較」 Readings: 1.Stockwell, T. (2005). Forging Malaysia and Singapore: Colonialism, Decolonization and Nation-Building. In Nation-Building: Five Southeast Asian Histories, 191-220. 2.Lee, K.H. (2005). Writing Malaysia’s Contemporary History. In Nation-Building, pp. 163-190. 3.Lau, A. (2005). Nation-Building and the Singapore Story: Some Issues in the Study of Contemporary Singapore History. In Nation-Building, pp.221-250. 第九週「期中報告」 第十週「菲律賓的歷史敘述與被排除的他者」 Readings: 1.Hau, C. (2005). Rethinking History and “Nation-Building” in the Philippines. In Nation-Building: Five Southeast Asian Histories, pp. 39-68. 2.Hau, C. (2000). The “Cultural” and “Linguistic” Turns in the Writing of Philippine History. Journal of Commonwealth and Postcolonial Studies 7 (2): 89-122. 第十一週「印尼的全球化挑戰與新秩序時期」 Readings: 1.Suryadinata, L. (2000). National-building and Nation-Destroying: The Challenge of Globalization in Indonesia. In Nationalism and Globalization. pp. 38-70.\\* 2.Berger, M. (2001). (De)constructing the New Order: Capitalism and the Cultural Contours of the Patrimonial State in Indonesia. In House of Glass. pp. 191-212. 第十二週「泰國的文化國族主義與後現代化」 Readings: 1.Reynolds, C. (1998). Globalization and Cultural Nationalism in Modern Thailand. In Southeast Asian Identities. pp. 115-145. 2.Tejapira, K. (2001). The Post-modernization of Thainess. In House of Glass. pp. 150-170. 3.Ockey, J. (2001). On the Expressway, and under it: Representations of the Middle Class, the Poor, and Democracy in Thailand. In House of Glass. pp. 313-337. 第十三週「越南的民族文化與國族建構」 Readings: 1.Carruthers, A. (2001). National Identity, Diasporic Anxiety, and Music Video Culture in Vietnam. In House of Glass. pp. 119-149. 2.Thomas, M. & Heng, R. (2001). Stars in the Shadows: Celebrity, Media, and the State in Vietnam. In House of Glass. pp. 287-312 第十四週「東南亞與區域研究」 Readings: 1.Goh, B.L. (2011). Disciplines and Area Studies in the Global Age: Southeast Asian Reflections. In Decentring and Diversifying Southeast Asian Studies: Perspectives from the Region. pp. 1-59. 2.Acharya, A. (2010). “Asia Is Not One”. The Journal of Asian Studies, 69(4), 1001-1013. 第十五週「東南亞區域與知識生產」 1.Wang, G. (2011). Post-imperial Knowledge and Pre-Social Science in Southeast Asia. In Decentring and Diversifying Southeast Asian Studies: Perspectives from the Region. pp. 60-80. 2.Mirsepassi, A., Basu, A., and Weaver, F. (2003). Knowledge, Power, and Culture. In Localizing Knowledge in a Globalizing World: Recasting the Area Studies Debate, pp. 1-21. 第十六週「學期總結與討論」",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "以每週主題下所準備之教材進行背景知識的講述。"
        },
        {
            "type": "Group discussion",
            "note": "與學生進行討論。"
        }
    ],
    "grading": [
        {
            "type": "Class discussion involvement",
            "weight": 20,
            "note": "學生導讀：20%"
        },
        {
            "type": "Presentation",
            "weight": 80,
            "note": "文獻選讀報告：30%\n期末報告：50%"
        }
    ],
    "prerequisite": "◎Unavailable for M.A. program students (M.A. program courses excepted) and B.A. program students.",
    "general_core": []
}