{
    "year": 108,
    "term": 2,
    "name": "儀器分析（二）",
    "teachers": [
        "王忠茂"
    ],
    "department": "SU42",
    "code": "CMU0154",
    "credit": 2,
    "serial": 2797,
    "group": "A",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 4,
            "from": 8,
            "to": 9,
            "campus": "公館",
            "classroom": "Ｃ006"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "3",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "This course intends to cover principle of instruments used for analytical chemistry.It will include those instruments needed for general analytical purposes and research goals. The objective of this course aims at enhancing the knowledge of analytical techniques, broadening the view of basic analytical chemistry for the students and fortifying chemical concepts that correlate conventional wet analytical chemistry and instrumental applications.",
    "goals": [
        "This course intends to cover principle of instruments used for analytical chemistry.",
        "It will include those instruments needed for general analytical purposes and research goals.",
        "The objective of this course aims at enhancing the knowledge of analytical techniques."
    ],
    "syllabus": "​\n\nInstruments based on spectroscopic principles, such as elemental and molecular spectroscopy, and chromatographic theories, including gas and liquid chromatography, are the major contents. Different mass spectrometers that can be used as chromatographic detectors will be discussed in details as well. A portion of this course will encompass capillary electrophoresis, the powerful separation technique that may be used for trace and multi-mode analysis.  \nStudents are required to take notes during the class and finish reading assigned articles from different reference books and journals. No textbook will be specifically assigned for this course. Attendance and participating discussion during class hours will be considered in the final grade decision.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 30,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 40,
            "note": ""
        },
        {
            "type": "其他",
            "weight": 30,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}