{
    "year": 108,
    "term": 2,
    "name": "數學教學實習（二）（IB）",
    "teachers": [
        "謝豐瑞"
    ],
    "department": "SU40",
    "code": "MAUE310",
    "credit": 1,
    "serial": 2647,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 6,
            "to": 6,
            "campus": "公館",
            "classroom": "數學館M211"
        }
    ],
    "programs": [
        "國際教師學程-數學"
    ],
    "comment": "",
    "restrict": "◎必須先修過(也可以同時修)【MAUE210  數學教學實習（二）（教）】",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 1,
    "description": "Accompanying the course \" Teaching Practicum: Mathematics (II).\" This course requires pre-service teachers in IME (IBEC program) take an additional credit (one session, 50-minute). For this credit, they need to further demonstrate micro-teaching with the use of teaching materials (e.g., mathematics textbooks, handouts, …) of IBDP, observe high school mathematics classes in IB schools, and have their one-month practicum in IB schools.",
    "goals": [
        "To experience mathematics teaching and learning situations in contexts of regular senior high schools and of IBDP schools",
        "To advance the competences to realize teaching and learning theories in teaching practice under the consideration of real-life contexts",
        "To flexibly implement a variety of teaching skills",
        "To cultivate professional disposition of mathematics education"
    ],
    "syllabus": "**Course Description**\n\nThis course aims to enhance teacher candidates’ competences in practicing mathematics teaching. A platform is provided for observation, plan, action, discussion and reflection on teaching mathematics in order to understand that teaching is inquiry-based and student-centered. Teacher candidates are furnished with teaching experience in a senior or junior high school, and learning experience from competent school teachers. This course not only helps teacher candidates become better teachers, but also guides them through a self-discovery path that leads to a lifelong commitment to study mathematics education.\n\n \n\n \n\n![圓角矩形: The preservice teachers in IME (IBEC program) will need to take an additional credit (one session, 50-minute). For this credit, they need to further demonstrate micro-teaching with the use of teaching materials (e.g., mathematics textbooks, handouts, …) of IBDP, and observe high school mathematics classes in IB schools.](file:///C:/Users/math/AppData/Local/Temp/msohtmlclip1/01/clip_image001.gif)\n\nThe preservice teachers in IME (IBEC program) will need to take an additional credit (one session, 50-minute). For this credit, they need to further demonstrate micro-teaching with the use of teaching materials (e.g., mathematics textbooks, handouts, …) of IBDP, and observe high school mathematics classes in IB schools.\n\n**Aims / Programme Learning Objectives**\n\n< >To experience mathematics teaching and learning situations in contexts of regular senior high schools and of IBDP schoolsTo advance the competences to realize teaching and learning theories in teaching practice under the consideration of real-life contextsTo flexibly implement a variety of teaching skillsTo cultivate professional disposition of mathematics education\n\n**No.**\n\n**Programme Learning Objectives (PLO)**\n\n**Learning Objectives**\n\n**Related Assessment Task(s)**\n\n**1**\n\nPLO1\n\n1-1, 1-3, 2-1, 2-2, 3-1, 4-2, 4-3\n\n1, 4\n\n**2**\n\nPLO2\n\n1-1, 1-3, 1-5, 1-6, 2-2, 3-1, 3-2, 4-2, 4-3\n\n1, 2-1, 2-2, 2-3, 3\n\n**3**\n\nPLO3\n\n2-1, 2-2, 3-2\n\n2-2, 3\n\n**4**\n\nPLO4\n\n2-3, 2-4, 3-1, 3-3, 4-1, 4-2, 4-3\n\n1, 2-1, 2-2, 2-3, 3, 4\n\n**Learning Objectives**\n\n1-1\n\nEquipped with professional mathematics competences\n\n1-3\n\nBeing able to think mathematically and critically\n\n1-5\n\nBeing able to use mathematics as tools to learn other subjects\n\n1-6\n\nPossessing the capacities to view elementary mathematics from an advanced viewpoint\n\n2-1\n\nBeing able to communicate and express mathematically\n\n2-2\n\nPossessing the competences of transferring and contextualizing theories in mathematics and mathematics education\n\n2-3\n\nBeing able to lead or collaboratively work with peers\n\n2-4\n\nPossessing the competences of lifelong learning\n\n3-1\n\nBeing able to inquire and seek out answers to questions with a patient and diligent attitude, and a curious, but, open mind\n\n3-2\n\nPossessing the abilities to think, criticize, and reflect independently\n\n3-3\n\nBeing willing to work collaboratively\n\n4-1\n\nHaving good taste for mathematics\n\n4-2\n\nPossessing a consistent and firm attitude toward pursuing truths\n\n4-3\n\nPossessing a variety of beliefs regarding mathematics values and mathematics learning\n\n**Course Credits / Course Requirements**\n\nThis is a two-credit course. Meeting hours are 08:10 to 12:00 every Thursday.\n\nEvery teacher candidate is required to:\n\n< >Participate in class activities, including class engagement, presentations, peer evaluations, and small-group and whole-class discussions.Experience a one-month teaching practicum (normally five to six weeks) in a school with at least four sessions each week. During this time period, the teacher candidates have to take three videos of their own teaching, one is at the beginning (the third or fourth session), one is close to the end (the last third or fourth session), and one is about their integration of technology.Submit a teaching plan and a reflective report before and after teaching practicum respectively (App. 2 & 3).Provide peer evaluation to the teacher candidates whose teaching videos are played and discussed (App. 4-1, 4-2).![圓角矩形: The teacher candidates in IME have to take one credit additionally. The meeting hour is 13:20 to 14:10 every Thursday. That is, they will obtain 2+1 credits. In addition to the above in the regular classes, they are required to:1.All the teacher candidates take this course have to participate in two field observations and submit corresponding reports. Those in IME have to further observe at least two mathematics classes in IBDP schools and submit corresponding reports (App. 1).2.Participate in class activities, including class engagement, presentations, peer evaluations, and small-group and whole-class discussions.](file:///C:/Users/math/AppData/Local/Temp/msohtmlclip1/01/clip_image002.gif)![圓角矩形: 3.Conduct a micro teaching practice with the use of IBDP mathematics curriculum to peers (20 minutes).4.Submit a teaching plan and a reflective report before and after the micro teaching practice respectively (App. 2 & 3).5.Provide peer evaluation to the teacher candidates who is doing the micro teaching (App. 4-1, 4-2).6.Be one of the members to serve in one of the following activities for primary or secondary school students and submit a CAS report at the end of the semester: Fun-math Camps of Shi-Da Institute for Mathematics Education (http://www.sdime.ntnu.edu.tw/page1/super_pages.php?ID=page1&Sn=6), Math Camps of the Department of Mathematics in NTNU (http://www.math.ntnu.edu.tw/~mathcamp/), Sciences Camps of Yuan T. Lee Foundation Science Education for All, After-school Remedial Instruction of any secondary school, Back-to-Hometown service, Hoping Download (http://hopingdownload.ntnu.edu.tw/2017/), or other service activities (http://www.sce.ntnu.edu.tw/home/course/list.php?series=F). ](file:///C:/Users/math/AppData/Local/Temp/msohtmlclip1/01/clip_image003.gif)\n\nThe teacher candidates in IME have to take one credit additionally. The meeting hour is 13:20 to 14:10 every Thursday. That is, they will obtain 2+1 credits. In addition to the above in the regular classes, they are required to:\n\n1.  All the teacher candidates take this course have to participate in two field observations and submit corresponding reports. Those in IME have to further observe at least two mathematics classes in IBDP schools and submit corresponding reports (App. 1).\n2.  Participate in class activities, including class engagement, presentations, peer evaluations, and small-group and whole-class discussions.\n\n1.  Conduct a micro teaching practice with the use of IBDP mathematics curriculum to peers (20 minutes).\n2.  Submit a teaching plan and a reflective report before and after the micro teaching practice respectively (App. 2 & 3).\n3.  Provide peer evaluation to the teacher candidates who is doing the micro teaching (App. 4-1, 4-2).\n4.  Be one of the members to serve in one of the following activities for primary or secondary school students and submit a CAS report at the end of the semester: _Fun-math Camps_ of Shi-Da Institute for Mathematics Education (http://www.sdime.ntnu.edu.tw/page1/super\\_pages.php?ID=page1&Sn=6), _Math Camps_ of the Department of Mathematics in NTNU ([http://www.math.ntnu.edu.tw/~mathcamp/](http://www.math.ntnu.edu.tw/~mathcamp/)), _Sciences Camps_ of Yuan T. Lee Foundation Science Education for All, _After-school Remedial Instruction_ of any secondary school, _Back-to-Hometown service_, _Hoping Download_ (http://hopingdownload.ntnu.edu.tw/2017/), or other service activities (http://www.sce.ntnu.edu.tw/home/course/list.php?series=F).\n\n**Class Meetings**\n\n**No.**\n\n**Session**\n\n**Programme Learning Objectives**\n\n**Session 1-2**\n\n**Regular course**\n\n**Topic:** Teaching mathematics for understanding through inquiry-based and student-centered teaching approaches with the integration of technology.\n\n**Activities**\n\n1.  To engage in mathematical thinking through working on mathematics-related tasks, aiming to bring attentions onto that effective mathematical tasks promote and release mathematical thinking and afford opportunities for introducing aspects of mathematics and mathematical thinking to the attention of different learners. \\[theory of knowledge; connection and integration of MCK & MPCK\\]\n2.  To watch and discuss inquiry-based teaching videos and reflect on the method’s strength, weakness, opportunities and threats. \\[communication skills; acknowledging and respecting diversity and multiple perspectives; connections\\]\n\nPLO1\n\nPLO4\n\n**IME course**\n\n**Topic:** Good mathematics teaching\n\n*   Introduction to the course\n*   What is good mathematics teaching?\n*   The characteristics of mathematics education in IBDP\n\n**Activities:**\n\n1.  Discuss the picture of good mathematics teaching and its corresponding teaching behaviors (group work) \\[communication skills; acknowledging and respecting diversity and multiple perspectives; connections\\]\n2.  Compare the results in (1) with the characteristics of mathematics education in IBDP and the indicators in the teacher evaluation form (App. 5) (group work) \\[communication skills; prompting inter-cultural understanding and respect; acknowledging diversity and multiple perspectives; connections\\]\n3.  Prepare 10-minute presentations for (2) (group work) \\[collaboration and group work\\]\n\nPLO2\n\nPLO4\n\n**Session 3-4**\n\n**Regular course**\n\n**Topic:** Real mathematics teaching context\n\n*   Strategies for teaching, learning, and assessments\n*   Real mathematics teaching and learning situations in the context of local schools\n\n**Activities:**\n\n1.  Watch the videos of mathematics teaching by good mathematics teachers in regular senior high schools in Taiwan \\[observation; critical thinking; communication skills\\]\n2.  Discuss the teaching skills employed in these videos. The facets include which teaching methods are used to introduce mathematics ideas, which mathematics representations are used and linked, which mathematics competences would be developed, which formative assessments are employed, and the interaction between the teacher and students, and among students themselves, etc. \\[critical thinking; communication skills; developed in local and global contexts; focused on conceptual understanding; connections\\]\n\nPLO1\n\nPLO2\n\nPLO4\n\n**IME course**\n\n**Topic:** Real mathematics teaching context\n\n*   Strategies for teaching, learning, and assessments\n*   Real mathematics teaching and learning situations in the context of IB international schools\n\n**Activities:**\n\n1.  Watch the videos of mathematics teaching in IBDP lessons \\[observation; critical thinking; communication skills\\]\n2.  Discuss the teaching skills employed in these videos. The facets include which teaching methods are used to introduce mathematics ideas, which mathematics representations are used and linked, which mathematics competences would be developed, which formative assessments are employed, and the interaction between the teacher and students, and among students themselves, etc. \\[critical thinking; communication skills; developed in local and global contexts; focused on conceptual understanding; connections\\]\n3.  Comparing the teaching skills employed in the two contexts.\n\n_Note._ Practitioners from IBDP mathematics classes will be invited to discuss the teaching together.\n\nPLO1\n\nPLO2\n\nPLO4\n\n**Session 5-6**\n\n**Regular course**\n\n**Topic:** Developing lesson plans for the teaching practicum\n\n**Activities:**\n\n1.  To analyze the learning and teaching goals for the teaching practicum. \\[critical thinking; connection between theory and practice\\]\n2.  To discuss possible teaching approaches to reach the goals. \\[communication skills; acknowledging and respecting diversity and multiple perspectives on mathematics and its learning and teaching\\]\n3.  To design, plan and discuss mathematical tasks and activities. \\[communication skills; acknowledging and respecting diversity and multiple perspectives on mathematics and its learning and teaching\\]\n\nPLO1\n\nPLO2\n\nPLO3\n\n**IME course**\n\n**Topic:** Field-observations in IB schools (observation)\n\n**Activities:**\n\n1.  To experience the environment, culture, and atmosphere of the IB schools through observing the teacher’s mathematics teaching to the class. \\[prompting inter-cultural understanding and respect; acknowledging and respecting diversity and multiple perspectives\\]\n\nPLO1\n\nPLO2\n\nPLO3\n\nPLO4\n\n**Session 7**\n\n**Regular course**\n\n**Topic:** Field-observations in the practicum school\n\n**Activities:**\n\n1.  To experience the environment, culture, and atmosphere of the practicum school through observing the teacher’s mathematics teaching to the class which the teacher candidate will teach (the original teacher of the class will be the supervisor of the teacher candidate). \\[prompting inter-cultural understanding and respect; acknowledging and respecting diversity and multiple perspectives\\]\n2.  To observe, reflect on and discuss the learning and teaching of mathematics in practicum schools with the supervisor and the peers. \\[observation; critical thinking and reflection; communication skills\\]\n\n_Note._ The teacher candidates should observe their supervisor’s mathematics teaching to one class for the whole week.\n\nPLO1\n\nPLO2\n\nPLO3\n\nPLO4\n\n**IME course**\n\n**Topic:** Field-observations in IB schools (reflection and discussion)\n\n**Activities:**\n\n1.  To reflect on and discuss the learning and teaching of mathematics in IB schools with the instructor, practitioners from IBDP, and the peers. \\[observation; critical thinking and reflection; communication skills\\]\n\n_Note._ Practitioners from IBDP mathematics classes will be invited to discuss the teaching together.\n\nPLO1\n\nPLO2\n\nPLO3\n\nPLO4\n\n**Session 8-13**\n\n**Regular course**\n\n**Topic:** Teaching practicum\n\n**Activities:**\n\n1.  To discuss the teaching plan before teaching. \\[communication skills\\]\n2.  To teach in the practicum school. \\[teaching competence\\]\n3.  To reflect on what students have learnt and how to enhance students’ learning. \\[critical reflection\\]\n\nPLO1\n\nPLO2\n\nPLO3\n\nPLO4\n\n**IME course**\n\n**Topic:** Micro-teaching practice\n\n**Activities:**\n\n1.  To conduct micro-teaching practice (teacher candidates should prepare teaching plans in advance). \\[teaching competence\\]\n2.  To evaluate and discuss the micro-teaching. \\[critical reflection on teaching\\]\n\n_Note._ (1) Refer to the indicators of good mathematics teaching, the teaching and learning theories, and IB perspectives rather than only rely on your intuitions and feelings when preparing teaching practice and writing peer evaluation. (2) Practitioners from IBDP mathematics classes will be invited to evaluate the micro-teaching together when possible.\n\nPLO1\n\nPLO2\n\nPLO3\n\nPLO4\n\n**Session 14-16**\n\n**Regular course**\n\n**Topic:** Evaluation and reflection on the teaching practicum\n\n**Activities:**\n\n1.  To watch, evaluate, and discuss the mathematics teaching in the videos recorded in teacher candidates’ practicum. \\[communication skills\\]\n2.  To reflect on the beliefs about mathematics, and the learning and teaching in the context of the practicum school. \\[critical reflection\\]\n3.  To talk about what and how to improve the learning and teaching of mathematics. \\[disposition\\]\n\nPLO1\n\nPLO2\n\nPLO3\n\nPLO4\n\n**IME course**\n\n**Topic:** Micro-teaching practice\n\n**Activities:**\n\n1.  To conduct micro-teaching practice (teacher candidates should prepare teaching plans in advance). \\[teaching competence\\]\n2.  To evaluate and discuss the micro-teaching. \\[critical reflection on teaching\\]\n\n_Note._ (1) Refer to the indicators of good mathematics teaching, the teaching and learning theories, and IB perspectives rather than only rely on your intuitions and feelings when preparing teaching practice and writing peer evaluation. (2) Practitioners from IBDP mathematics classes will be invited to evaluate the micro-teaching together when possible.\n\nPLO1\n\nPLO2\n\nPLO3\n\nPLO4\n\n**Session 17-18**\n\n**Regular course**\n\n**Topic:** Evaluation and reflection on the teaching practicum\n\n**Activities:**\n\n1.  To watch, evaluate, and discuss the mathematics teaching in the videos recorded in teacher candidates’ practicum. \\[communication skills\\]\n2.  To reflect on the beliefs about mathematics, and the learning and teaching in the context of the practicum school. \\[critical reflection\\]\n3.  To talk about what and how to improve the learning and teaching of mathematics. \\[disposition\\]\n\nPLO1\n\nPLO2\n\nPLO3\n\nPLO4\n\n**IME course**\n\n**Topic:** Evaluation and reflection on the IBDP teaching\n\n**Activities:**\n\n1.  To watch, evaluate, compare, and discuss the mathematics teaching in the videos of teacher candidates’ micro teaching and the videos of IBDP lessons. \\[communication skills\\]\n2.  To reflect on the beliefs about mathematics, and the learning and teaching in the context of the IBDP school. \\[critical reflection\\]\n3.  To talk about what and how to improve the learning and teaching of mathematics. \\[disposition\\]\n\n_Note._ Practitioners from IBDP mathematics classes will be invited to evaluate the micro-teaching together.\n\nPLO1\n\nPLO2\n\nPLO3\n\nPLO4\n\n **Assessment tasks**\n\n**No**\n\n**Task**\n\n**Weighting**\n\n**Assessment mode**\n\n**Notations**\n\n**Regular course**\n\n1\n\nTeaching practicum\n\n1-1\n\nTeaching plan\n\n10%\n\nindividual & group\n\nAppendix 2\n\nThe teaching plan for the teaching practicum will be scored in subgroup\n\n1-2\n\nTeaching  \n\n50%\n\nindividual\n\n1-3\n\nReflective reports\n\n10%\n\nindividual\n\nAppendix 3\n\n2\n\nPeer evaluations\n\n10%\n\nindividual\n\nAppendix 4-1, 4-2\n\n3\n\nPerformance in class activities\n\n20%\n\nindividual & group\n\n**IME course**\n\n1\n\nMicro teaching\n\n1-1\n\nTeaching plan\n\n20%\n\nindividual & group\n\nAppendix 2\n\nThe teaching plan for micro teaching practice will be scored in subgroup\n\n1-2\n\nTeaching practice\n\n40%\n\nindividual\n\n1-3\n\nReflective report\n\n10%\n\nindividual\n\nAppendix 3\n\n2\n\nPeer evaluation\n\n15%\n\nindividual\n\nAppendix 4-1, 4-2\n\n3\n\nPerformance in class activities\n\n15%\n\nindividual & group\n\n**Books and Course Materials**\n\n< >Mathematics standard level (textbook of IBDP)Mathematics higher level (textbook of IBDP)2015 Guide: Approaches to Teaching and Learning (ATL) in the DPInformation on MY IB (e.g., the DP curriculum, subject briefs of mathematics, DP: From Principles into Practice, Diploma Programme assessment: principles and practice)Niss, M.[, & Højgaard, T.](http://pure.au.dk/portal/en/persons/tomas-hoejgaard(1f177a76-e41e-4213-a1e7-aa1af3c5398c).html) (Eds.) (2011). _[Competencies and mathematical learning: ideas and inspiration for the development of mathematics teaching and learning in Denmark](http://pure.au.dk/portal/en/publications/competencies-and-mathematical-learning(1613bf6f-cce8-414b-bc67-64063b43e970).html)._ Roskilde: IMFUFA, Roskilde university.Krathwohl, D. R. (2002). A revision of Bloom’s taxonomy: An overview. _Theory in to Practice, 41_(4), 212-218.Sessions 1 and 2 help teacher candidates critically reflect on successful mathematics teaching behaviors in local (regular courses in Taiwan) and international (courses in IB schools) contexts of mathematics education, and their similarities and differences. Sessions 3-18 support teacher candidates to develop feasible and suitable teaching plans with respect to the practicum school. In discussions, presentations, observations, designing lesson plans, teaching practices, evaluations, and writing reports, various approaches to learning are trained through inquiring, acting and reflecting individually and collaboratively.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "實驗/實作",
            "note": "教學實習"
        },
        {
            "type": "實地考察、參訪",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": "課堂表現、同儕評量"
        },
        {
            "type": "報告",
            "weight": 10,
            "note": "報告"
        },
        {
            "type": "其他",
            "weight": 60,
            "note": "教學實習"
        }
    ],
    "prerequisite": "◎必須先修過(也可以同時修)【MAUE210  數學教學實習（二）（教）】",
    "general_core": []
}