{
    "year": 109,
    "term": 2,
    "name": "後現代組織管理專題研究",
    "teachers": [
        "黃乃熒"
    ],
    "department": "ED00",
    "code": "EDD0141",
    "credit": 3,
    "serial": 380,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 9,
            "to": 10,
            "campus": "本部",
            "classroom": "教803"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "人類不可能脫離組織而生活。教育行政乃管理眾人之事，能夠促使眾人產生集體行動是重要課題。而組織乃當代幫助集體行動相當具優勢的設計。由於現代組織以技術-結構為主，是回應人類共通性經驗的產物，也被認為較具文明性，但是隨著社會的變遷，教育組織經營也日趨複雜，教育組織也變得有差別性及文化性，因為如此，反省個人的經驗有助於組織現象的理解，藉以創造教育經營的新的可能性，是要變成有效教育領導人焦點的能力，也是後現代教育行政專業的根本，甚至建立新的教育專業視野。反省經驗成為建構這堂課教學理論之核心觀念。\n    這堂課要能夠發揮功能，在於學習者有成為良好教育行政人員或管理者的企圖，以及有強烈的欲求理解自己的生活情境，深入討論教育行政運作的深層意義。這是你修這門課前應有的基本心態。\n    此外，組織與權力、信念體系都是生活的要素，也是教育行政經驗的來源，而且它們息息相關，沒有人能夠逃避這樣的建構，因為它是自我了解的重要歷程，當然首先你必須誠實面對自己。你們一定要對他有興趣，上這堂課才不會無聊。當然，假設這課程操作好的話，你自然會有興趣。\n    攸關於教學歷程的生活必受組織運作的影響，故此生活是體驗組織的總體表現，而理解組織是一種未來的建構，並透過自我經驗的反省加以顯現，因此，教育行政運作應該具脈絡性、未來性、前瞻性、統合性，那是充滿創意驚奇的歷程，那是確保行政工作得以永續投入的保證，也是願意促進教育組織文化昇華之探索的動能，此乃是後現代組織管理的重點。顯示所有教育行政的專業養成，必須從理解教育或教育行政組織現象著手。再則，理解組織除透過自我經驗反省之外，也要透國研讀與反省別人的經驗來補強昇華自我。事實上，個人不可能僅透過某個單一個體的建構能夠真正理解組織。這堂課企圖幫助人們反省自己的工作經驗，作為後現代組織管理的重要途徑，藉以提升教育組織內涵更為豐富，也更有道德，乃本課程的重要目的。\n    除此之外，由於反省自我經驗是一件困難的事情，因為人們心智容易受制習焉不察的文化價值，使得學習者的自我反省有其困難性，為了強化個體的自我反省張力，本課程先透過組織隱喻，了解人們解決組織問題有新的可能性，並藉此解放學習者的心智，促進教育組織創新的新可能性，包括機器、生態、頭腦、自我組織、文化、政治、心靈牢獄、宰制等隱喻等等。\n    現代的世界，幾乎所有人類都必須工作，而且他們大部份都在組織裡工\n作。而教育行政是一種組織工作的形式，我將定義它為：「對於教育組織理解、創造、評估及再創的管理」。此乃以後現代組織管理為主軸的定義。基於此，教育行政專業行動的建構，不僅僅透教學者課程的規劃，更重要的是學習者能夠創造自己的獨特見地，並透過對話強化理性的建構，以建立具有獨特性的經驗，也能學習多重性的經驗，故獨特與多元經驗是構成教育行政專業的重要元素。",
    "goals": [
        "成人學習的意義",
        "科目的學習脈絡"
    ],
    "syllabus": "人類不可能脫離組織而生活。教育行政乃管理眾人之事，能夠促使眾人產生集體行動是重要課題。而組織乃當代幫助集體行動相當具優勢的設計。由於現代組織以技術-結構為主，是回應人類共通性經驗的產物，也被認為較具文明性，但是隨著社會的變遷，教育組織經營也日趨複雜，教育組織也變得有差別性及文化性，因為如此，反省個人的經驗有助於組織現象的理解，藉以創造教育經營的新的可能性，是要變成有效教育領導人焦點的能力，也是後現代教育行政專業的根本，甚至建立新的教育專業視野。反省經驗成為建構這堂課教學理論之核心觀念。  \n    這堂課要能夠發揮功能，在於學習者有成為良好教育行政人員或管理者的企圖，以及有強烈的欲求理解自己的生活情境，深入討論教育行政運作的深層意義。這是你修這門課前應有的基本心態。  \n    此外，組織與權力、信念體系都是生活的要素，也是教育行政經驗的來源，而且它們息息相關，沒有人能夠逃避這樣的建構，因為它是自我了解的重要歷程，當然首先你必須誠實面對自己。你們一定要對他有興趣，上這堂課才不會無聊。當然，假設這課程操作好的話，你自然會有興趣。  \n    攸關於教學歷程的生活必受組織運作的影響，故此生活是體驗組織的總體表現，而理解組織是一種未來的建構，並透過自我經驗的反省加以顯現，因此，教育行政運作應該具脈絡性、未來性、前瞻性、統合性，那是充滿創意驚奇的歷程，那是確保行政工作得以永續投入的保證，也是願意促進教育組織文化昇華之探索的動能，此乃是後現代組織管理的重點。顯示所有教育行政的專業養成，必須從理解教育或教育行政組織現象著手。再則，理解組織除透過自我經驗反省之外，也要透國研讀與反省別人的經驗來補強昇華自我。事實上，個人不可能僅透過某個單一個體的建構能夠真正理解組織。這堂課企圖幫助人們反省自己的工作經驗，作為後現代組織管理的重要途徑，藉以提升教育組織內涵更為豐富，也更有道德，乃本課程的重要目的。  \n    除此之外，由於反省自我經驗是一件困難的事情，因為人們心智容易受制習焉不察的文化價值，使得學習者的自我反省有其困難性，為了強化個體的自我反省張力，本課程先透過組織隱喻，了解人們解決組織問題有新的可能性，並藉此解放學習者的心智，促進教育組織創新的新可能性，包括機器、生態、頭腦、自我組織、文化、政治、心靈牢獄、宰制等隱喻等等。  \n    現代的世界，幾乎所有人類都必須工作，而且他們大部份都在組織裡工  \n作。而教育行政是一種組織工作的形式，我將定義它為：「對於教育組織理解、創造、評估及再創的管理」。此乃以後現代組織管理為主軸的定義。基於此，教育行政專業行動的建構，不僅僅透教學者課程的規劃，更重要的是學習者能夠創造自己的獨特見地，並透過對話強化理性的建構，以建立具有獨特性的經驗，也能學習多重性的經驗，故獨特與多元經驗是構成教育行政專業的重要元素。",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 40,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 15,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 15,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}