{
    "year": 109,
    "term": 2,
    "name": "課程與教學新興議題研究",
    "teachers": [
        "甄曉蘭",
        "林君憶",
        "郝永崴"
    ],
    "department": "ED00",
    "code": "EDD0162",
    "credit": 3,
    "serial": 384,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 9,
            "to": 10,
            "campus": "本部",
            "classroom": "教804"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "課程與教學是學校教育的核心。本課程旨在深究課程與教學相關之當代新興議題。除了探究課程與教學議題，本課程亦探索全球與在地的課程改革與教學創新之關鍵概念及重要趨勢。此外，學生將選擇感興趣之課程改革或教學創新的主題，自主探究其中議題，並提交報告。",
    "goals": [
        "Explore emerging issues of curriculum and instruction",
        "Analyze the trends of curriculum change and instructional innovation",
        "Evaluate the agendas and development of curriculum change and instructional innovation locally and globally."
    ],
    "syllabus": "1\\. (2/25 CHEN) Intro of the course design; Trends and issues in curriculum studies\n\n2\\. (3/4 CHEN) Literacy vs. competency: Reexamining frameworks of 21st century skills\n\n3\\. (3/11 CHEN) Learning crisis: Rethinking learning opportunities and quality of schooling in 21st century\n\n4\\. (3/18 CHEN) Challenges in practice: Comparative analysis of curriculum polices for preparing 21st century skills in different countries (Taiwan, New Zealand, BC in Canada, Singapore, Hong Kong…)\n\n5\\. (3/25 CHEN) Implication and suggestion: Emphasis and strategies for implementation of competency-oriented curriculum\n\n\\*Assignment I: Report on personal explorative learning\n\n6\\. (4/1 NO CLASS) Spring Break/Self-directed Learning: Exploration on Personal Research Interest\n\n7\\. (4/8 LIN) Read and discuss: What is student agency? What are the challenges and opportunities to support “student agency” at school?\n\n8\\. (4/15 LIN - Meet at the Textbook Library and the Classroom) Explore and rethink: “Textbook design” for the competency-oriented educational reform\n\n9\\. (4/22 LIN) Read and discuss: “Scaffolding” to support growth in cognition and motivation\n\n10\\. (4/29 LIN)  Explore and Rethink: Teachers’ learning through “observation”. JP class videos for observing student agency\n\n11\\. (5/6 LIN) Student presentations; discussions on implications for C&I changes\n\n\\*Assignment II. Choose (1) An exploration of a self-selected textbook unit for competency-oriented education OR (2) An exploration of a provided class video– Lesson design to foster student agency with observation keys and findings. Written report due by 5/12.\n\n12\\. (5/13 HAO) Competency-based instruction\n\n13\\. (5/27 HAO) Competency-based assessment\n\n14\\. (5/28~6/2 HAO) Reflections on competency-based education. Online discussion in Moodle.\n\n\\*Assignment III: submission of a position paper\n\n15\\. (6/3 HAO) Learning science in curriculum and instruction\n\n16\\. (6/10 HAO) Current issues of learning technologies in curriculum and instruction (STEAM, computational thinking, AR VS. VR)\n\n17\\. (CHEN, LIN, HAO)  Self-directed Learning: Discussion with teacher/s on personal research interest (by appointment). Online or by-appointment meetings (optional)\n\n\\* Assignment: submission of a reflection paper with topics which we explore in the course.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        },
        {
            "type": "其他",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 60,
            "note": "Individual Study Assignments: 4,000-5,000 words for each（20%*3）"
        },
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": "Participation: Reading, discussion, and sharing（10%*3）"
        },
        {
            "type": "報告",
            "weight": 10,
            "note": "Self-evaluation and reflection on personal research interest (10%)"
        }
    ],
    "prerequisite": "",
    "general_core": []
}