{
    "year": 109,
    "term": 1,
    "name": "視覺效果與影像處理",
    "teachers": [
        "陳永賢"
    ],
    "department": "TM60",
    "code": "ATC0347",
    "credit": 3,
    "serial": 3123,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 4,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "美203"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "This course will take as its starting point the placing (installation) of video and photography within physical spaces of display and exhibition, from conventional galleries to internal and external sites replete with history and meaning.  The multiple and complex reading such installations produce will be examined by focussing on individual artists, specific concepts, techniques and methods of approach.  There will be visits to exhibitions and to sites, this latter with the aim of proposing ways of utilising the city and its spaces in conjunction with video and photographic imagery.  During the course students will work on proposals, and one of these will be realised at the end of the course as the final assessment.",
    "goals": [
        "To introduce students to concepts of site, context, display, and the presence and interaction of the viewer.",
        "To widen the understanding of the interrelationship of site and context to video and photographic imagery",
        "To examine the preceding in the context of contemporary and twentieth century art practice",
        "To work towards an exhibition of students personal video and photographic projects that addresses site, installation and viewer"
    ],
    "syllabus": "1        Introduction: Course outline and central ideas.\n\n2        Installation, an overview with reference to video and photography\n\n3        Site, context, the viewer in relation to video and photography\n\n4        Student presentations of own practice and ideas\n\n5        Video, photography, and the use of space\n\n6        Time and narrative\n\n7        Light and display\n\n8        Group discussion and presentation of ideas towards final presentation\n\n9        Artists focus:  Oursler, Egoyan (Steenbecket)\n\n10    Artists focus:  Marker, Greenaway\n\n11    Artists focus: video and photography as record of event. (Long, Fulton, Orozco)\n\n12    Artists focus: video sculpture (Nam Jun Paik, Gary Hill)\n\n13    Artists focus: student presentation on artists\n\n14    External site, possibilities inherent in site-specific work (group discussion, exploration)\n\n15     Memory\n\n16    Individual tutorials (final presentation)\n\n17    Exhibition visit (exact schedule dependant on availability)\n\n18    Final presentation\n\n(schedule will be flexible dependent on student numbers and to allow for exhibition visits etc)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Lectures will be informal, illustrated, and focus on artists, concepts, and methods of addressing context and site"
        },
        {
            "type": "討論法",
            "note": "After lectures (or during lectures), and as course progresses will become important method of examining ideas"
        },
        {
            "type": "實驗/實作",
            "note": "Studio work will be presented and discussed during the lessons.  It is expected that students will work on self-directed projects in their own time towards realization as final presentation"
        },
        {
            "type": "實地考察、參訪",
            "note": "Visits to exhibitions and sites (identified in discussion)"
        },
        {
            "type": "媒體融入教學",
            "note": "Visual images (pp) will accompany all lectures. Texts of lectures will be provided for students. When appropriate video will accompany lectures.  Projector will be required"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 25,
            "note": "individual discussion via email will also be accepted"
        },
        {
            "type": "出席",
            "weight": 15,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "Comprises presentation of ideas towards final presentation (installation proposals) and presentation/focus on student choice of artist."
        },
        {
            "type": "成果展覽",
            "weight": 30,
            "note": "Final presentation (either as realized installation or fully developed proposal for installation)"
        }
    ],
    "prerequisite": "",
    "general_core": []
}