{
    "year": 109,
    "term": 1,
    "name": "數位藝術專題研究",
    "teachers": [
        "邱誌勇"
    ],
    "department": "TM60",
    "code": "ATC0079",
    "credit": 3,
    "serial": 3112,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "美506"
        }
    ],
    "programs": [
        "數位人文與藝術學程",
        "大數據學程"
    ],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "課程包括理論闡述、數位藝術與電腦藝術的關係、Collage art、Constructive art、3D造形與動畫的研討與試作，並包含設計上的應用，使用軟體有CorelDraw、Photo-Paint、True Space、Front Page",
    "goals": [
        "從美學分析與實際製作來探討數位藝術與設計的風貌與可能性，讓學生對數位藝術與設計有深刻的體認與表現能力"
    ],
    "syllabus": "本課程將以「數位美學」為核心命題，討論當代科技的發展已經改變了藝術表現的形式，從創作過程、美學思維到典藏維護都面臨到觀念的挑戰與更新。儘管至今已有超過數以萬計的藝術家、藝術團體與博物館都已經利用數位科技來作為影像意念傳達的工具，然而在理論與美學上的探討卻相當薄弱。本課程主要藉由當代數位藝術的創作作品來討論數位藝術應有的論述觀點與美學內涵。因此，本課程主要涵蓋三大面向的探討：第一、探討數位藝術與傳統藝術在理論論述與美學思維上的異同。第二、數位藝術的特質與應有表現。第三、數位虛擬映展空間對觀影人的意義。從這三大方面中，本課程試圖提供學生一套完整的觀看數位藝術之觀點，並協助學生了解數位藝術的創作。課程內容包括：\n\n1.  概念釐清：原生數位與數位化\n2.  歷史發展：從機械複製到數位複製、數位原創\n3.  本質論述：科技藝術本體、身體與影像的互動關係、時間與空間的感知\n4.  美學論述：新數位影像與美學轉向、後媒材時代的美學、科技作為媒材\n5.  議題辯證：文字與影像的辯證、真實與虛擬的論辯、敘事與破敘事的論證\n6.  實例分析：早期案例、晚近案例\n\nThis course is aimed at instilling in students a comprehensive knowledge of New Media Arts as an influential force in human history. Students should gain an understanding how new media arts have developed and evolved into their present form as a way to transmit information and communicate. This knowledge base should offer students a framework to place their own future practice in. As New Media Arts have always developed alongside technological developments, the history of related technology will be one focus of the course alongside the analysis of how information has been communicated and transmitted in terms of content, aesthetics and cultural geographies over time. \n\nThe course entitled seminar in new media arts will be an introductory course and aims on three parts of studying the subject. 1. Discussing the most fundamental key concept of new media arts from philosophical, aesthetic and theoretical perspectives. 2. Elaborating different artistic categories of new media arts from digital photography, digital audio-visual expression, interactive design and installation, sound and sound installation to newly established interdisciplinary digital performance. The course will also includes the most recent social design concept. 3. Visiting relevant exhibitions. Field studies will be also conducted by course instructor. The student who attempts to take this course should engage with reading materials, in class discussion and group presentation as well as assignment for individual.\n\n**第一週：**課程內容解說與基本概念介紹\n\n**第二週：**數位與數位化\n\n**閱讀文獻**：\n\n*   Paul, Christiane. “A Short History of Technology and Art,” and “The Presentation, Collection, and Preservation of Digital Art.” p. 7-26.\n*   Shiff, Richard. “Digitized Analogies.” p. 63-70.\n\n**第三週：**從機械複製到數位複製（I）\n\n**閱讀文獻**：\n\n*   Benjamin, Walter. “The Work of Art in the Age of Mechanical Reproduction.”\n*   Wolf, Mark. “The Work of Art in the Digital Age.” p. 51-83.\n\n**第四週：**從機械複製到數位複製（II）\n\n**閱讀文獻**：\n\n*   Bolz, Norbert. “Aesthetics of Media: What Is the Cost of Keeping Benjamin Current?” _Mapping Benjamin: The Work of Art in the Digital Age_. Ed. Hans Ulrich Gumbrecht and Michael Marrinan. California: Stanford University Press, 2003. 24-29.\n*   Chartier, Roger. “From Mechanical Reproduction to Electronic Representation.” _Mapping Benjamin: The Work of Art in the Digital Age_. Ed. Gumbrecht, Hans Ulrich and Michael Marrinan. CA: Stanford UP, 2003. 109-113.\n\n**第五週：**本質論述（I）本體論\n\n**閱讀文獻：**\n\n1.  邱誌勇、許夢芸（2006）〈數位科技文化時代的美學思維〉。發表於文化產業、創意媒體與娛樂經濟國際學術論壇。崑山科技大學。\n2.  Heim, Michael. “The Essence of VR.” The Metaphysics of Virtual Reality. NY: Oxford, 1993. p. 109-128.\n\n**第六週：**本質論述（III）身體與影像的交織\n\n**閱讀文獻：**\n\nHansen, Mark. B. N. “Between Body and Image: On the Newness of New Media Art.” _New Philosophy for New Media_. London: MIT Press, 2004. p. 21-46.\n\n**第七週：**本質論述（III）時間與空間\n\n**閱讀文獻**：\n\n*   Berdon, Colin, and Suzette Worden. “The Virtual Curator: Multimedia Technologies and the Roles of Museums.” p. 63-86.\n\nSturken, Marita. “Motilities of Time and Space: Technologies of the Modern and the Posthuman.” p. 71-91\n\n**第八週：**美學論述（I）傳承與乖疑\n\n**期中報告：請針對期末報告撰寫****1500****字的大綱簡介與初步研究**\n\n**閱讀文獻**：\n\nHoltzman, Steven. _Digital Mosaics: The Aesthetics of Cyberspace_. NY: Touchstone, 1997. p. 119-132.\n\nBolz, Norbert. “Aesthetics of Media: What is the Cost of Keeping Benjamin Current?” p. 24-29.\n\n**第九週：**美學論述（II）新數位影像美學\n\n**閱讀文獻**：\n\n*   Thorburn, David, and Henry Jenkins. ‘Introduction: Toward an Aesthetics of Transition.” p. 1-16.\n*   Friedberg, Anne. “The Virtual Window.” p. 337-353.\n\n**第十週：**科技論述（I）科技作為媒體\n\n**閱讀文獻**：\n\nPaul, Christiane. “Digital Technologies as a Medium.” p. 67-138.\n\n**第十一週：**科技論述（II）科技作為工具\n\n**閱讀文獻**：\n\n*   Barck, Karlheinz. “Connecting Benjamin: The Aesthetic Approach to Technology.” p. 39-44.\n*   Paul, Christiane. “Digital Technologies as a Tool.” p. 27-66..\n\n**第十二週：文字與影像的論辯**\n\n**閱讀文獻**：\n\nKirschenbaum, Matthew. “The Word as Image in an Age of Digital Reproduction.” Hocks, Mary E. and Michelle R. Kendrick, eds. _Eloquent Images: Word and Image in the Age of New Media_. London: MIT Press, 2003. p. 137-156.\n\n**第十三週：真實與虛擬的論辯**\n\n**閱讀文獻**：\n\n1\\. Franck, Karen. “When I Enter Virtual Reality, What Body Will I Leave\n\nBehind?” p. 238-245.\n\n2.Sturken, Marita, and Lisa Cartwright. “Reproduction and Visual Technologies.” p. 109-150.\n\n**第十四週：新媒體與敘事**\n\n**閱讀文獻**：\n\n1\\. Redmond, Marie and Niall Sweeney. “Multimedia Production: Nonlinear\n\nStorytelling Using Digital Technologies.” p. 87-101.\n\n2\\. Arata, Luis. “Reflections on Interactivity.” p. 217-225.\n\n**第十五週：案例分析**\n\n**閱讀文獻**：\n\nBolter, Jay David and Diane Gromala. _Windows and Mirrors: Interaction Design, Digital Art, and the Myth of Transparency_. London: The MIT Press, 2003.\n\n*   Bolter, Jay and Diane Gromala. “Text Rain: The Digital Experience.” p. 8-28.\n*   Bolter, Jay and Diane Gromala. “Wooden Mirror: The Myth of Transparency.” p. 29-56.\n*   Bolter, Jay and Diane Gromala. “T-Garden: The Materiality of New Media.” p. 114-129. \n\n**第十六週：期末課堂報告（****I****）**\n\n**第十七週：期末課堂報告（****II****）**\n\n**第十八週：期末報告繳交與討論**",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 40,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 30,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}