{
    "year": 111,
    "term": 1,
    "name": "家庭生活評估與介入研究",
    "teachers": [
        "黃淑滿"
    ],
    "department": "EM06",
    "code": "HGM0253",
    "credit": 3,
    "serial": 459,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 0
    },
    "schedule": [
        {
            "day": 2,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "勤102"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "A",
    "hours": 3,
    "description": "家庭生活評估與介入是一個正在發展的領域。本課程將研讀有關家庭生活評估與介入的背景、理論基礎、操作方法，以及相關領域，包含家人關係評估與介入、親職評估與介入及與有特殊需求子女的家庭合作等具體方式。本課程將帶領修課學生實際評估有家庭教育需求的個人與家庭，介入與實施家庭生活教育，並評估其成效。希望能基於本領域已知的家庭科學理論與研究，在家庭生活評估與介入和家庭實踐領域進一步發展，未來能創建一個本土化的可行領域，透過家庭評估與介入來支持有需要的家庭。",
    "goals": [
        "了解家庭生活評估與介入的架構",
        "概述家庭生活評估和介入的理論",
        "了解家庭生活評估與介入的訓練教材",
        "了解維持個人在家庭中情緒或行為變化的過程",
        "幫助個人在家庭生活領域實現目標",
        "評估實踐家庭生活評估與介入之成效"
    ],
    "syllabus": "第1週  家庭生活評估與介入概論；職場現況\n\n第2週  家庭生活評估與介入架構 ；職場現況\n\n第3週  家庭生活評估與介入的理論根源 ；職場的應用\n\n第4週  家庭的根源：家庭生活教育；職場現況\n\n第5週   家庭生活評估與介入的理論應用、研究與實踐；職場行動研究\n\n第6週   家庭生活評估與介入的基本技能；職場現況\n\n第7週   家庭生活評估與介入的目標對象；職場現況\n\n第8週   家庭生活評估與介入的評估 ；職場現況\n\n第9週   家庭生活評估與介入的模式；職場現況\n\n第10週  家庭溝通與關係建立；職場現況\n\n第11週  以解決問題為導向的方法；職場現況\n\n第12週  家人關係評估與介入；職場現況\n\n第13週  親職評估與介入；職場現況\n\n第14週  特殊需求家庭的評估與介入；職場現況\n\n第15週  家庭生活評估與介入的未來發展；職場現況\n\n第16週  家庭生活評估與介入：建立企業，建立職業；職場現況",
    "methodologies": [
        {
            "type": "討論法",
            "note": "本課程應用討論法，由授課教師帶領修課學生，討論閱讀本課程參考書目及相關文獻後所提出的問題。"
        },
        {
            "type": "問題解決教學",
            "note": "本課程由授課教師示範並教授問題解決教學法，指導修課學生應用在執行個別家庭之家庭生活評估與家庭教育介入工作中。\n本課程應用問題解決教學法，修課學生在服務個別家庭之家庭生活評估與家庭教育介入歷程中發現的問題，於職場中提出，由職場督導引導討論並解決問題。"
        },
        {
            "type": "合作學習",
            "note": "本課程由授課教師教授合作學習法，修課學生在服務個別家庭之家庭生活評估與家庭教育介入歷程中，與個別家庭合作學習，釐清個別家庭的問題與教育目標，引出個別家人內在的能力與信心，在與個別家庭合作學習的過程中解決個別家庭的問題。"
        },
        {
            "type": "實地考察、參訪",
            "note": "本課程計畫實地考察，由授課教師和共同授課老師—即職場督導合作，帶修課學生參訪政府單位家庭教育中心、有家庭教育需求之社福相關機構，或非營利組織從事個別家庭服務工作者，了解職場現況。"
        },
        {
            "type": "專題研究",
            "note": "本課程由授課教師指導個別修課學生進行專題研究——不同需求之家庭生活評估與教育介入之實踐與成效評估專題。實踐的歷程由共同授課老師在職場定時督導。學期末的專題發表由授課教師和職場督導協同評量，並公開舉行觀課。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 15,
            "note": "課前閱讀作業：\t佔15%，目的在了解學生對家庭生活評估與介入相關理論與方法的理解程度與問題。"
        },
        {
            "type": "課堂討論參與",
            "weight": 15,
            "note": "課堂討論參與：佔15%，目的在解決學生對家庭生活評估與介入理論和方法所提出的問題。"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 40,
            "note": "個別家庭服務報告：佔40%，逐次服務個別家庭的家庭生活教育評估與介入計畫、執行記錄、與督導討論記錄與反思記錄的檔案評量，目的在評量修課學生服務個別家庭的表現。由授課教師和職場督導協同評量。"
        },
        {
            "type": "專題",
            "weight": 20,
            "note": "專題報告：佔20%，\t家庭生活評估與教育介入之實踐與成效評估專題報告，目的在了解學生將過去學習經驗應用在服務個別家庭的實踐與反思程度。由授課教師和職場督導協同評量。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}