{
    "year": 108,
    "term": 2,
    "name": "分項華語文教學實習：IB國際學校",
    "teachers": [
        "林振興"
    ],
    "department": "IM84",
    "code": "CLM0098",
    "credit": 3,
    "serial": 1306,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 12
    },
    "schedule": [
        {
            "day": 1,
            "from": 16,
            "to": 11,
            "campus": "本部",
            "classroom": "綜10樓華語系教室"
        }
    ],
    "programs": [
        "國際教師學程-華語文"
    ],
    "comment": "1.上課教室：綜10樓華語系教室。2.建議同時進行(或已完成)師培學院辦理之IB教育實習。3.建議修畢IB華語文四門課(語言學專題研究、人類學習與發展、數位華語教學專題研究、華語文教材教法研究)，再修習此課程。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course aims to cultivate teacher candidates’ competences of Chinese teaching practice. To complete this course, they have to demonstrate being capable of teaching Chinese language independently. Through learning by doing, teacher candidates have various opportunities to exercise teaching and learning theories by taking real contexts of local and international schools into consideration. Specifically, to systematically enhance teaching methods and strategies, they are required to visit Chinese centers, observe Chinese language lessons, design unit plans, practice course designs, and conduct teaching practicum in real classroom settings. Moreover, to become Chinese teaching professionals, they have to learn to improve themselves via self-reflection as well as constructive feedback from peers, instructors, and mentors in practicum schools. Furthermore, it is encouraged to set up communities of practices (CoP), either online or in physical settings, in order to support self-discovery learning and life-long commitment to Chinese education.",
    "goals": [
        "Understand the principles of and approaches to teaching Chinese as a second language in contexts of local institutes and international schools.",
        "Possess professional ability to link up teaching practices with teaching and learning theories, especially taking authentic learning into consideration.",
        "Appreciate how Chinese teaching and learning are carried out in different education settings (e.g., IB schools, local schools, or Chinese language centers) and reflect to teacher candidates’ own pedagogies.",
        "Design learning activities and teaching strategies that are appropriate to Chinese language learners with different backgrounds, including their first languages, nations and cultures.",
        "Demonstrate cross-cultural diversity awareness to design appropriate Chinese teaching materials that integrate global contexts.",
        "Experience Chinese teaching with plans that are embedded with IB principles.",
        "Develop a professional teacher profile, including vision statement, teaching philosophy, teaching experience, reflection on various teaching-related activities, and future plans as a Chinese educator."
    ],
    "syllabus": "**Class Meetings**\n\n_No._\n\n_Session_\n\n_Related_\n\n_LO_\n\n1\n\n**Topic:** **Course overview**\n\n*    Introduction to course, tasks and assignments \n*    Making sense of teaching Chinese as a second language with contemporary approaches to teaching, e.g., IB principles and practices.\n*    Review core components in teaching plans\n\n**Activities**\n\n*    “Show and Tell”: teacher candidates’ professional teacher profiles will be displayed. By knowing the expectation from the instructors, they can begin to prepare for their teacher profiles.\n*    “My learning journey”: teacher candidates are required to bring previous teaching plans that meet their satisfaction to the class in session 3. The plan can be made from any of these three courses: _Chinese Language Instructional Methods_ in advance, _IB philosophy and Practices_ or _Teaching and Learning in MYP/DP_.\n\n**\\[Unit 1\\]**\n\n**LO1,**\n\n**LO3,**\n\n**LO5,**\n\n**LO6**\n\n2\n\n**Topic: Good Chinese teaching**\n\n*    What consist of good Chinese teaching?\n*    Inquiry-based and student-centered teaching approaches.\n\n**Activities**\n\n*    “My ideal world”:\n\n1.  Each teacher candidate will come up with “a picture of good Chinese teaching” and list its corresponding teaching behaviors\n2.  Teacher candidates are randomly grouped (in three) and exchange ideas on the pictures. They can come up with an integral description by using picture and words that include common consensus of all members; a summary for “good Chinese teaching” is also needed.\n3.  Present group work (3-5 minutes per group)\n\n*    Within the lecture of inquiry-based approach, a dynamic, pedagogical cycle “inquiry-action-reflection” will be introduced before teacher candidates could connect their “ideal worlds” with the cycle.\n\n**\\[Unit 1\\]**\n\n**LO1,**\n\n**LO3,**\n\n**LO4**\n\n3\n\n**Topic: Good Chinese teaching**\n\n*    The characteristics of Chinese education in IBDP.\n*    Various strategies of teaching, learning and assessments\n*    Plan for a Chinese class in local and international settings\n\n**Activities**\n\n*    “Our ideal world”: surrounded by the pictures gathered from the previous week, teacher candidates are randomly grouped (in four) to list 20 indicators of good Chinese teaching, and then identify the relationship between the indicators and the characteristics of Chinese education in IBDP. Submit the result to Moodle for further discussion.\n*    Reflection task: in each group, every teacher candidate shares his/her teaching plan that was made from a previous course (3 minutes each). Then, groups discuss possible teaching plans by taking, if they like, both the “indicators for good Chinese teaching” and the characteristics of Chinese education in IBDP into consideration. They are expected to submit a draft teaching plan in week 5.\n\n**\\[Unit 1\\]**\n\n**LO1,**\n\n**LO2,**\n\n**LO3,**\n\n**LO4,**\n\n**LO5,**\n\n**LO6**\n\n**Topic: Good Chinese teaching**\n\n**Invited Talk: Experience sharing from IBDP Chinese teachers.**\n\n*    Reflective journal after the talk (due by next meeting).\n\n**\\[Unit 1\\]**\n\n**LO1,**\n\n**LO2,**\n\n**LO3,**\n\n**LO5,**\n\n**LO6,**\n\n**LO7**\n\n5\n\n**Topic: Field observation of Chinese teaching**\n\n*    No classroom meeting this week. In groups of four, teacher candidates need to observe at least one of authentic Chinese lessons.\n*    IB teacher candidates have to visit DP classes in IB schools while teacher candidates may visit classes in IB schools or local schools.\n\n**Activities**\n\n*    During the field observation in practicum school(s), teacher candidates are expected to experience the environment, culture and atmosphere, and to observe and reflect on the teaching and learning of the Chinese class.\n*    After the field observation, each teacher candidate has to submit a reflective journal, due by next meeting. When writing the journal, teacher candidates have to connect what they have learned in this course, e.g., ATL, ATT, indicators of good Chinese teaching, with what have observed, instead of writing depending on personal opinions.\n\n**\\[Unit 2\\]**\n\n**LO1,**\n\n**LO3,**\n\n**LO4,**\n\n**LO5,**\n\n**LO6,**\n\n**LO7**\n\n6-8\n\n**Topic: Micro teaching practice**\n\n*    Three topics (i.e., three groups) in Chinese education\n\n**Activities**\n\n*    See Course structures: micro-teaching to peers\n\n**LO2,**\n\n**LO4,**\n\n**LO7**\n\n9-10\n\n**Topic: Preparation for the teaching practicum**\n\n*    One-hour classroom meeting\n*    Individual group meetings to discuss teaching plans together with the course instructor and mentors from the practicum school.\n\n**Activities**\n\n*    Teacher candidates are encouraged to visit their practicum school(s) one week before the teaching practicum.\n\n**LO2,**\n\n**LO4,**\n\n**LO7**\n\n11-16\n\n**Topic: Teaching practicum**\n\n**Activities**\n\n*    For one week, the course instructor(s) visit teacher candidates’ practicum schools and observe their individual teaching for a complete lesson at least. A post-teaching meeting is to be held right after.\n*    Teacher candidates should keep weekly reflective journal for their learning during the period of teaching practicum.\n\n**\\[Unit 3\\]**\n\n**LO1,**\n\n**LO2,**\n\n**LO3,**\n\n**LO6,**\n\n**LO7**\n\n17\n\n**Topic: Individual group debriefing**\n\n**Activities:**\n\n*    Teacher candidates in groups will meet their instructors to discuss what they have learned from the experience of teaching practicum. Each group also has to propose who is going to present the group’s learning results in the Achievement Exhibition.\n*    Teacher candidates are supposed to receive written feedback from their mentors from the practicum school(s). The feedback will help the teacher candidates to reflect on their practicum experience – what is good – and develop a plan – what can be better – for improving their Chinese teaching.\n\n**LO4,**\n\n**LO7**\n\n18\n\n**Topic: The Achievement Exhibition**\n\n**Activities:**\n\n*    **“My learning journey (to be continued)”:** All mentors in the practicum school(s) are invited to this meeting. Each group gives a 5-minute oral presentation on what have learned, including reflection, critiques and suggestions, from the teaching practicum. Also, the teacher candidate’s teacher profile will be displayed to the public. Moreover, insights from each community of practice are welcomed.\n\n**All**\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=be0d6d8170044df3a16830daee430a74&fno=db92341c931440819fd43783712fbdcf)",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "實地考察、參訪",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "報告",
            "weight": 100,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}