{
    "year": 110,
    "term": 2,
    "name": "專項運動生理學",
    "teachers": [
        "鄭景峰"
    ],
    "department": "AM32",
    "code": "FPM0019",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 57,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 2,
            "to": 4,
            "campus": "公館",
            "classroom": "體育館三樓會議室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "透過綜評性文獻 (review articles) 的閱讀與討論，瞭解各運動專項的生理特質以及評估方式，進而提升運動專項知能，並提升學術研究能量。",
    "goals": [
        "瞭解各單項運動的運動生理學特質與訓練方法",
        "瞭解有氧耐力訓練與無氧耐力訓練的學理基礎",
        "培養英文文獻閱讀能力"
    ],
    "syllabus": "【授課方式：16+2週】\n\n教學目標  \n1\\. 瞭解各單項運動的運動生理學特質與訓練方法（課堂中所討論的運動專項，將依修課同學專長與興趣而定）。  \n2\\. 瞭解肌肉與能量適能訓練的學理基礎。  \n3\\. 培養英文文獻閱讀能力。  \n  \n  \n週次授 課 內 容  \n第一週：課程介紹（討論本學期所欲探討的運動專項，上課內容與主題將依修課學生興趣而有變動。）  \n第二週：Physical assessments of athletes  \n第三週：Muscular fitness and training  \n第四週：Overtraining and regeneration training  \n第五週：The science of cycling physiology and training part 1 & 2  \n第六週：A review on the mechanisms of blood-flow restriction resistance training-induced muscle hypertrophy  \n第七週：Is there an economical running technique? A review of modifiable biomechanical factors affecting running economy  \n第八週：Effects of taper on swim performance. Practical implications  \n第九週：Increases in lower-body strength\\` transfer positively to sprint performance: a systematic review with meta-analysis  \n第十週：Lactate threshold concepts: how valid are they?  \n第十一週：Design and interpretation of anthropometric and fitness testing of basketball players  \n第十二週：Vertical jump in female and male volleyball players: a review of observational and experimental studies; Post-activation potentiation: underlying physiology and implications for motor performance  \n第十三週：Strategies to improve running economy  \n第十四週：Developing maximal neuromuscular power: part 2 - training considerations for improving maximal power production; Physical attributes, physiological characteristics, on-court performances and nutritional strategies of female and male basketball players  \n第十五週：Methods of prescribing relative exercise intensity: physiological and practical considerations  \n第十六週：Warm-up and performance in competitive swimming; Chapter 3: Sprinting  \n第十七週：緩衝週  \n第十八週：自主學習",
    "methodologies": [
        {
            "type": "講述法",
            "note": "以講解方式授課。"
        },
        {
            "type": "討論法",
            "note": "以討論的方式針對特定主題進行討論。"
        },
        {
            "type": "專題研究",
            "note": "學生選擇有興趣之主題，進行課堂報告。"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "課堂參與情形。"
        },
        {
            "type": "出席",
            "weight": 30,
            "note": "出缺席與學習態度（缺課三次以零分計算）。"
        },
        {
            "type": "報告",
            "weight": 60,
            "note": "課堂報告。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}