{
    "year": 108,
    "term": 1,
    "name": "青少年與家庭研究",
    "teachers": [
        "吳齊殷"
    ],
    "department": "EM06",
    "code": "HGM0176",
    "credit": 3,
    "serial": 488,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 4,
            "from": 8,
            "to": 10,
            "campus": "本部",
            "classroom": "人發系會議室A"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "The purpose of this course is to provide students an in-depth and thorough examination of research on adolescence. Adolescence is a physical, psychological, and social developmental period. The tasks of this life course for adolescents are to look for an identity, and become emotionally self-sufficient and autonomous from parents. Adolescents become increasingly involved with extra-familial people, such as friends, classmates, teachers, or other school members. However, they must balance these activities with continued attachment to their families.\n\nThe whole course is divided into three sections. The first section will start on the intrapersonal level. We will examine the theories and empirical research on adolescent biological, psychological, and developmental aspects. The second section will move to the interpersonal level. Focus will be on the interactions and relations with their familial members and peer friends.  The final part of the course will examine how adolescents are located and function in the broader social contexts, such as school and neighborhood.",
    "goals": [
        "增進瞭解青少年理論和研究知識",
        "培養青少年領域的研究能力",
        "培養批判思考與獨立解決問題的能力",
        "提升科學研究倫理的知能和家庭領域的服務熱忱"
    ],
    "syllabus": "第1週(9/12)  \n(1)課程內容介紹、課程進度及要求說明  \n(2)Orientation to the Course\n\n第2週(9/19)  \n青少年研究的核心概念(I)  \nGiele, Janet Z. and Glen H. Elder Jr. (1998). Methods of Life Course Research: Qualitative and Quantitative Approaches: SAGE Publications.\n\n第3週(9/26)  \n青少年研究的核心概念(II)  \nGiele, Janet Z. and Glen H. Elder Jr. (1998). Methods of Life Course Research: Qualitative and Quantitative Approaches: SAGE Publications.\n\n第4週(10/3)  \n青少年研究的核心概念(III)  \nGiele, Janet Z. and Glen H. Elder Jr. (1998). Methods of Life Course Research: Qualitative and Quantitative Approaches: SAGE Publications.\n\n第5週(10/10)  \n國慶日(放假1日)\n\n第6週(10/17)  \n生命歷程研究的方法論(I)  \nGiele, Janet Z. and Glen H. Elder Jr. (1998). Methods of Life Course Research: Qualitative and Quantitative Approaches: SAGE Publications.\n\n第7週(10/24)  \n生命歷程研究的方法論(II)  \nGiele, Janet Z. and Glen H. Elder Jr. (1998). Methods of Life Course Research: Qualitative and Quantitative Approaches: SAGE Publications.\n\n第8週(10/31)  \n生命歷程研究的方法論(III)  \nGiele, Janet Z. and Glen H. Elder Jr. (1998). Methods of Life Course Research: Qualitative and Quantitative Approaches: SAGE Publications.\n\n第9週(11/7)  \n青少年與生命歷程研究的理論(I)  \nChapter 1. of The Life Course of A Sociological Perspective.  \nTo  \nChapter 5. of The Life Course of A Sociological Perspective.\n\n第10週(11/14)  \n青少年與生命歷程研究的理論(II)  \nChapter 6. of The Life Course of A Sociological Perspective.  \nTo  \nChapter 9. of The Life Course of A Sociological Perspective.\n\n第11週(11/21)  \n社會網絡研究方法與家庭生命歷程研究(I)  \nE. Bott. (2002). Urban Families: Conjugal Roles and Social Networks. In Social Networks, Edited by John Scott, Vol. II, Pp. 331-372. Rouledge.  \nE. Bott. (2002). Urban Families: The Norm of Conjugal Roles. In Social Networks, Edited by John Scott, Vol. II, Pp. 373-389. Rouledge.\n\n第12週(11/28)  \n社會網絡研究方法與家庭生命歷程研究(II)  \nB. Wellman. (2002). The Community Questions: The Intimate Networks of East Yorkers. In Social Networks, Edited by John Scott, Vol. II, Pp. 390-420. Rouledge.  \nB. Wellman. (2002). The Place of Kinfolk in Personal Community Networks. In Social Networks, Edited by John Scott, Vol. III, Pp. 82-107. Rouledge.\n\n第13週(12/5)  \n青少年主題之相關研究(I)  \nAdams, Bert N. (1988). Fifty Years of Family Research: What Does It Mean? The Journal of Marriage and Family, 50(1), 5-17.  \nEichelsheim, Veroni, I., M. Dekovic, K. Buist, W. Cook, and D. Johnson . (2009). The Social Relations Model in Family Studies: A Systematic Review. The Journal of Marriage and Family, 71(4), 1052-1069.\n\n第14週(12/12)  \n青少年主題之相關研究(II)  \nRyankerry, S., F. Schelar, and J. Manlove (2009). Family Structure History: Links to Relationship Formation Behaviors in Young Adulthood. The Journal of Marriage and Family, 71(4), 935-953.  \nGoldberg, Abbie E. (2010). Studying Complex Families in Context. The Journal of Marriage and Family, 72(1), 29-34.\n\n第15週(12/19)  \n青少年主題之相關研究(III)  \nWeininger, Elliot B., A. Lareau, and R. LaRossa. (2009). Paradoxical Pathways: An Ethnographic Extension of Kohn's Findings on Class and Childrearing. The Journal of Marriage and Family, 71(3), 680-695.  \nGareis, Karen C., R. C. Barnett, Karen A. Ertel, and Lisa F. Berkman. (2009). Work-Family Enrichment and Conflict: Additive Effects, Buffering, or Balance?. The Journal of Marriage and Family, 71(3), 696-707.\n\n第16週(12/26)  \n青少年主題之相關研究(IV)  \nXie, Yu and Haiyan Zhu. (2009). Do Sons or Daughters Give More Money to Parents in Urban China?. The Journal of Marriage and Family, 71(1), 174-186.  \nRossIngrid, A., P. Schoon, and Martin A. Sacker. (2009). Family and Nonfamily Role Configurations in Two British Cohorts. The Journal of Marriage and Family, 71(1), 1-14.\n\n第17週(1/2)  \n青少年主題之相關研究(V)  \nSelected Readings from Children of The Land.\n\n第18週(1/9)  \n期末檢討",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 70,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}