{
    "year": 110,
    "term": 2,
    "name": "體育（有氧舞蹈）",
    "teachers": [
        "于文蕙"
    ],
    "department": "PE",
    "code": "00UP024",
    "type": "必",
    "grade": null,
    "credit": 1,
    "serial": 2455,
    "group": "B",
    "quota": {
        "limit": 50,
        "additional": 5
    },
    "schedule": [
        {
            "day": 2,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "大韻律教室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "允許重複修 ◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "一、培養基本體能、身體律動及協調性，以促進良好體適能。  二、從身體活動中獲得運動的樂趣，進而培養運動興趣。  三、培養同儕之間的友誼，拓展良好人際關係。  四、藉由動、靜態的身體活動，能深入感受身體狀態及放鬆身心。",
    "goals": [
        "培養基本體能、身體律動及協調性，以促進良好體適能。",
        "從身體活動中獲得運動的樂趣，進而培養運動興趣。",
        "培養同儕之間的友誼，拓展良好人際關係。",
        "藉由動、靜態的身體活動，能深入感受身體狀態及放鬆身心。"
    ],
    "syllabus": "**●有氧舞蹈●**\n\n●注意看：只能請三次假(包括公假/事假/病假)，超過三次成績為『零』，全勤才能拿A+，喪假必須出示證明外只能請兩週假，\n\n※【加簽】同學一律不能請假※。請假未在期限內繳交假單者如同曠課，三次一樣GG。請仔細檢視這學期活動行程，無法達成規定者請勿選課以免佔用名額。  \n◆【彈性教學1週】-【授課方式：17+1週】安排非課程時間（不影響正常授課）將進行課外活動教學，基本上以舞蹈藝術表演欣賞為主並於開學後訂定正確時間，內容和說明事項，此課程如果請假同樣算在一學期只能請三次假內。  \n◆若因新冠武漢疫情之故再次影響教學進度，將於課堂說明線上教學及自主學習等細節。\n\n●有氧舞蹈●\n\n※ 教學目標：  \n一、說明Free Style課程，包含多元化混合式有氧舞蹈學習之樂趣、重點及精髓。  \n二、訓練基本體能、身體律動與協調性，促進良好體適能，並從身體活動中獲得運動的樂趣產生興趣並持之以恆。  \n三、上課慣有的生活經驗分享，透過彼此分享生活百態，促進交流互動，無論喜怒哀樂都有抒發宣洩的管道，讓大家體驗情意方面的經驗，同時訓練同學的舞台魅力，面對人群時表現自我的能力，凝聚班上同學情感，學會更加珍惜身邊的人事物，遠離冷漠社會，投入溫馨懷抱。\n\n※ 每週教學進度：  \n一、每週都有新的進度，包括不同舞步或主題，將有氧舞蹈融合各種舞風，依學生的程度適時調整，帶給同學基本有氧舞蹈外更加認識舞蹈的多元化，靈活度以此開發肢體、培養運動樂趣。  \n二、複習前一週或已經教過的舞蹈組合動作，並教授當週新進度，以融會貫通的串聯方式增加舞蹈動作組合及運動強度。\n\n※ 教學方法：  \n一、講解有氧舞蹈基本動作步伐，術語和注意事項，以多元化混合式有氧舞蹈帶領同學學習有氧舞蹈。  \n二、透過分組的方式，使同學通過討論的過程中彼此交流，發揮團隊精神達到腦力激盪的效果。\n\n※作業/考試規劃：  \n一、《課堂》每週會有小組作業，以當週上課內容為基準，將舞蹈動作重新排列組合或加入自編新動作，分組進行影片拍攝，再將影片上傳至班內群組及臉書不公開社團觀摩討論或者於下週上課時輪流上台呈現。  \n二、《期中作業》為了讓同學打開自己的身心靈，更瞭解自己，將於期中做出一份報告，學生必須走出〝戶外〞接近大自然體驗身體的自由與自在，拍攝喜歡的舞蹈動作至少三張照片(不超過6張)並寫下當時心境或半學期來學習有氧舞蹈的心得，目的是希望學生能感受大自然與身心靈結合所帶來的感動和領悟，拓展學生感知上的敏銳度。  \n三、《期末考》暫定兩種方式：  \n1.MV舞蹈呈現。將這學期所學的有氧舞蹈或其他舞蹈等動作編排串連呈現，各組自行發揮創意，注重團隊合作精神，彼此尊重與包容做為期末考評核和分享。  \n2.自編一段2分鐘以內有氧舞蹈動作呈現，音樂自選或採用老師的音樂皆可-(要以有氧舞蹈步伐為主也可溶入其他各種不同舞蹈元素)。\n\n※評量方法與標準  \n◆參考下面評量方法並將於課堂說明細節。\n\n※ 注意事項  \n• 1.上課請穿乾淨的運動鞋(也可不穿鞋但必須注意安全)，務必穿著輕便運動服裝、攜帶毛巾與水。  \n• 2.請準時出席，避免因遲到而影響其它同學。  \n• 3.請假請以學校規定之正常程序辦理，假單請於請假日後一星期內繳交否則視同曠課並扣分。  \n• 4. 課程內容會依學生實際狀況進行彈性調整。  \n• 5. 分組練習和呈現請發揮團隊精神及創意巧思。",
    "methodologies": [
        {
            "type": "講述法",
            "note": "有氧舞蹈基本步伐動作，術語和注意事項"
        },
        {
            "type": "討論法",
            "note": "分組討論再一一呈現"
        },
        {
            "type": "實驗/實作",
            "note": "錄影教學或課外活動記錄等"
        },
        {
            "type": "其他",
            "note": "戶外舞蹈肢體動作作業及心得呈現"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "必須是『戶外』有氧舞蹈照片及心得作業報告，不接受室內任何動作照片，否則該作業分數為零分。"
        },
        {
            "type": "期末考",
            "weight": 20,
            "note": "自編一段2分鐘左右有氧舞蹈動作呈現(可溶入其他各種不同舞蹈元素)但以有氧舞蹈動作為主."
        },
        {
            "type": "出席",
            "weight": 50,
            "note": "注意看：只能請三次假(包括公假/事假/病假)，超過三次成績為零，加簽同學一律不能請假。請假未繳假單者如同曠課，超過三次一樣GG。"
        },
        {
            "type": "其他",
            "weight": 10,
            "note": "練習呈現 10 ％"
        }
    ],
    "prerequisite": "",
    "general_core": []
}