{
    "year": 108,
    "term": 1,
    "name": "消費者行為",
    "teachers": [
        "蕭中強"
    ],
    "department": "OU57",
    "code": "BAU0013",
    "credit": 3,
    "serial": 2515,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 5,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "綜509國際會議廳"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎必須先修過【BAU0021  行銷管理】",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course is an introduction to the world of consumer behavior. The discipline borrows from several social sciences including psychology, sociology, and anthropology to explain behavior in the marketplace. In this course, the student will explore how perceptions, learning, memory, personality, and attitudes influence consumption behavior, how consumption changes during one’s life cycle, and how powerful cultural and subcultural influences are on consumers. This course is to provide you with a working knowledge of the major theories in the area of customer behavior. The goal of this course is not to simply learn the material, rather it is to integrate and apply the material. By the end of this course, you should be able to apply this knowledge to finish the group project and make the final presentation.",
    "goals": [
        "Develop an understanding of consumer behavior theories and apply this understanding in a marketing decision making context.",
        "Evaluate the principal theories of consumer behavior; critically assess strengths, limitations and analyze the current trends in consumer behavior",
        "Apply your consumer behavior research findings when designing and evaluating marketing strategies. Improve your abilities to discover original consumer insights that go beyond surface level intuitions."
    ],
    "syllabus": "W1 Opening speech\n\nW2 Ch1: Introduction\n\nW3 Ch2: Consumer research Ch3: Market segmentation\n\nW4 Ch4: Consumer motivation\n\nW5 Ch5: Consumer personality\n\nW6 Ch6: Consumer perception\n\nW7 Ch7: Consumer learning\n\nW8 Mid-term\n\nW9 Ch8: Consumer attitude\n\nW10 Ch9: Communication and attitude change\n\nW11 Ch16: Consumer decision making 1/2\n\nW12 Ch16: Consumer decision making 2/2\n\nW13 Ch10: Reference group and family influence\n\nW14 Ch11: Social class\n\nW15 Ch12: Culture\n\nW16 Ch13: Sub-culture\n\nW17 Ch14: Cross culture Ch15: Opinion leadership and new product diffusion process\n\nW18 Final exam",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Help students learn how to think and express in extemporaneous discussions"
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 40,
            "note": "Mid-term: First half materials covered in the semester"
        },
        {
            "type": "期末考",
            "weight": 40,
            "note": "Final exam: Second half materials covered in the semester"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "Participation"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Class Presence"
        }
    ],
    "prerequisite": "◎必須先修過【BAU0021  行銷管理】",
    "general_core": []
}