{
    "year": 108,
    "term": 1,
    "name": "國際經濟",
    "teachers": [
        "馮穎"
    ],
    "department": "OU57",
    "code": "BAU0063",
    "credit": 3,
    "serial": 2522,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 4,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "誠207"
        }
    ],
    "programs": [],
    "comment": "Students must have enough exposure to economics - 2 years of economics learning on any subject is the basic requirement - according to a top tier north American liberal arts college.",
    "restrict": "◎限大三大四修習",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course is divided into two parts. Part 1 is labeled “International Trade” and examines static models of trade (intra-temporal trade) while Part 2 is labeled “International Macroeconomics” and examines dynamic models of trade (inter-temporal trade) and monetary issues. \n\nThe primary objectives of Part 1 of this course are to rigorously examine economic models and empirical studies of international trade. This part of the course is primarily organized to present the evolution of thought in the branch of international economics which focuses on intra-temporal trade in goods and services. We will examine theories that offer explanations for why countries trade, that present various determinants of the pattern of trade, and that examine the positive and normative effects of trade.\n\nThe primary objectives of Part 2 of this course are to examine issues associated with intertemporal trade using balance of payments analysis, the behavior of nominal and real exchange rates, and relationships among countries’ business cycles.",
    "goals": [
        "To introduce the basic analytical tools to evaluate the economic issues associated with the interaction of a country with the international markets.",
        "Provide the analytical framework to understand the role that firms play in a country’s economic performance, such as productivity, current account balance and growth",
        "Provide rigorous treatment for how firms access international market through investment in customers and technology, and how these decisions affect the home and destination countries"
    ],
    "syllabus": "1\\. Introduction to international trade\n\n2 – 4. Classical models of International Trade\n\n5 Empirical Tests of Trade Patterns\n\n6\\. Trade Policy with perfect competition\n\n7\\. Trade with Imperfect Competition\n\n8\\. Gravity Models: Who trade with whom and the importance of geographic distance\n\n9\\. Midterm\n\n10 - 12. Firms in international trade\n\n13\\. Introduction to international macroeconomics\n\n14\\. National and International Accounts and Transactions\n\n15 - 17. Nominal and real exchange rates and monetary policy in an open economy\n\n18\\. Final",
    "methodologies": [
        {
            "type": "講述法",
            "note": "教師課堂講授"
        },
        {
            "type": "討論法",
            "note": "時事問題或理論應用問題的討論"
        },
        {
            "type": "問題解決教學",
            "note": "理論應用問題的習題解答"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": ""
        },
        {
            "type": "期中考",
            "weight": 20,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 40,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}