{
    "year": 109,
    "term": 2,
    "name": "指揮個別指導（四）",
    "teachers": [
        "許心"
    ],
    "department": "MM90",
    "code": "MUM0114",
    "credit": 1,
    "serial": 1975,
    "group": "B",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 0,
            "from": -1,
            "to": -1,
            "campus": "",
            "classroom": ""
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限本系(含雙主修)修習 ◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 1,
    "description": "In class, students gain a broader appreciation, and deeper understanding of the symphonic standard literature by music making. Practicing the method of rehearsing, conducting and teaching an ensemble, working though careful listening, executing details, examining details, team work and performing through standard master symphonic repertoire. The administrative aspects of orchestra management, in rehearsals, performance, daily management, librarian duties, run-out concert preparations, program note writing, personnel management, equipment coordination, rehearsal space maintenance, etc. are all part of the practicum covered area. Students gain a thorough knowledge in the on and off stage workings of running an ensemble. The score preparation is thoroughly examined through analysis in harmony, structure, compositional technique, historical background and all pertinent area related to the creation of the composition. The art of conducting technique is carefully studied and acquired to best interpret and express the repertoire studied.",
    "goals": [
        "增進指揮技法與知能"
    ],
    "syllabus": "1.依同學個別教學之需要設定   \n2.由各組教學研討會另訂之\n\n幫助學生深入了解指揮之技巧、音樂表現、對樂曲明確認識及掌握演出時所需具備的條件與風格。\n\n教材內容：\n\n    1. 巴洛克時期作品。\n\n    2. 古典時期作品。\n\n    3. 浪漫時期作品。\n\n    4. 現代時期作品。",
    "methodologies": [
        {
            "type": "講述法",
            "note": "個別指導課堂中講述所研讀之大師經典作品"
        },
        {
            "type": "討論法",
            "note": "個別指導課堂中討論所研讀之大師經典作品"
        },
        {
            "type": "問題解決教學",
            "note": "個別指導課堂中以引導、推理方式解決所研讀之大師經典作品"
        },
        {
            "type": "合作學習",
            "note": "個別指導課堂中與鋼琴合作組及器樂同儕合作學習演出大師經典作品"
        },
        {
            "type": "實驗/實作",
            "note": "個別指導課堂之外，參與專業及同儕之彩排、演出，學習實際展演大師之經典作品"
        },
        {
            "type": "實地考察、參訪",
            "note": "個別指導課堂之外，參與專業及同儕之團隊運作、彩排、演出，學習實際展演大師之經典作品"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "每周分配之曲目進度確實研讀執行"
        },
        {
            "type": "期末考",
            "weight": 20,
            "note": "期末分配之考試曲目完整確實展現"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "每周個別指導課堂分配之曲目確實研讀參與討論"
        },
        {
            "type": "出席",
            "weight": 20,
            "note": "每周個別指導課堂出席及確實參與"
        },
        {
            "type": "成果展覽",
            "weight": 10,
            "note": "學期中不定期之各大小型校內、校外演出、交流及展演"
        },
        {
            "type": "其他",
            "weight": 10,
            "note": "學期中每周個別指導課堂內外互動、互助、態度、表現、等"
        }
    ],
    "prerequisite": "",
    "general_core": []
}