{
    "year": 111,
    "term": 1,
    "name": "先進光學顯微技術",
    "teachers": [
        "呂杰翰"
    ],
    "department": "HU77",
    "code": "OEC9111",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 1342,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 2,
            "to": 4,
            "campus": "公館",
            "classroom": "Ｓ306"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "9",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "Understanding basic principles of advanced optical microscopy technologies",
        "Knowing the contribution and the roles that advanced optical microscopies play in the progress of the contemporary science"
    ],
    "syllabus": "先進光學顯微技術除了在微機電系統的檢測應用外，已逐步應用於生物系統中物理以及化學特徵的探討，在微系統的測量與檢測中具有相當重要的地位。因此本課程將介紹先進光學顯微技術，包含：可逆飽和光學線性螢光躍遷(RESOLFT)、單分子定位顯微術(SMLM)、結構照明顯微術(SIM)、掃描探針顯微技術、共軛焦顯微技術、層光顯微技術、單分子影像等。透過本課程的學習，延伸光電領域的學生在微系統檢測之知能。\n\nExcept for the inspection purpose of the microelectromechanical system, advanced optical microscopy technologies have been applied to the study of physicochemical properties in the biological system. It became the main workhorse for the identification and characterization of the microscopic environment in the living system. This course aims to introduce the concepts and principles underlying the advanced optical microscopies, which includes: RESOLFT, SMLM, SIM, scanning probe microscopies, confocal microscopy, light-sheet microscopy and technologies related to the aforementioned microscopies. By studying this course, the students’ abilities, and knowledges in the inspection of micro-systems can be improved.\n\n第1週   光學顯微技術簡介\n\n第2-3週   共軛焦顯微術及衍生技術\n\n第3-4週   以共軛焦為基礎的超解析顯微術\n\n第5-6週   掃描探針顯微技術\n\n第7-8週   光學線性螢光躍遷顯微術與應用\n\n第9-11週 單分子定位顯微術與單分子影像\n\n第12-13週 結構照明顯微術與光波前工程\n\n第14-15週 層光顯微術\n\n第16週    期末考\n\nWeek 1 Introduction to optical microscopy\n\nWeek 2-3 Confocal microscopy & derivative techniques\n\nWeek 3-4 Confocal based super-resolution microscopies\n\nWeek 5-6 Scanning probe microscopies\n\nWeek 7-8 Reversible Saturable Optical Fluorescence Transitions (RESOLF) and applications\n\nWeek 9-11 Single-molecule localization microscopies and single-molecule imaging\n\nWeek 12-13 Structured illumination microscopy and wave front engineering\n\nWeek 14-15 Light-sheet microscopy\n\nWeek 16 Final term",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "Concepts and principles of advanced optical microscopy technologies will be introduced in the lecture.\n先進光學顯微術的重要概念與原理將會於課堂中逐一介紹。"
        },
        {
            "type": "Group discussion",
            "note": "Important applications related to the topics will be covered in the class. Students are encouraged to ask questions and discuss the advantages and limitations with each other. \n與當週教學主題有關的重要應用會被選擇出做為課堂內的討論內容，學生會被鼓勵提出問題，並且透過彼此討論的方式理解技術的優勢與限制性。"
        },
        {
            "type": "Field work",
            "note": "We will visit labs that develop advanced optical microscopies."
        },
        {
            "type": "Case studies",
            "note": "During the semester, the students will choose a topic from recently published research papers and share his/her own opinions from studying this paper.\n學生在一學期中必須選擇一篇相關的文獻進行閱讀，並將自我學習的心得於課堂中分享。"
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 20,
            "note": "The students will need to write a report based on their study of the research paper for the oral presentation. The report should include three chapters: introduction, discussion, and conclusion. The words count should not be less than 500 words and the report should be written in English. \n\n學生必須完成一篇基於他們口頭報告內容的書面報告，報告須以英文寫成，並且包含三個章節，分別為導論、討論與結論，報告的字數必須超過500字"
        },
        {
            "type": "Final exam",
            "weight": 40,
            "note": "The final exam will be in an open book fashioned. The range includes all the topics appeared in the lecture. \n\n期末考將會以開書考的形式進行，內容包括當學期課程的全部主題。"
        },
        {
            "type": "Presentation",
            "weight": 40,
            "note": "The students will be asked to present a research paper that is related to the advanced microscopy technology. The presentation should include a brief introduction to the research and his/her own comment/discoveries through the studying. The length of the presentation should not exceed 10 minutes.\n\n學生將被要求報告一篇與先進光學顯微術有關的論文，報告內容除了對於內容簡短的介紹外，還必須包括他個人的發現與看法，報告的時間以10分鐘為限。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}