{
    "year": 108,
    "term": 1,
    "name": "新加坡華人社會與文化專題研究",
    "teachers": [
        "許振義"
    ],
    "department": "IM83",
    "code": "EAC8024",
    "credit": 3,
    "serial": 1389,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 1,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "上課教室為校本部誠大樓9樓，或綜合大樓7樓。（請參考本系所網頁公告之課表）",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "新加坡是大中華地區以外的唯一以華人為主的社會。新加坡開埠至今近200年，新加坡華社起源是什麼？組成成分是什麼？經過哪些演變？華人文化的重要載體是民間文藝，包括戲曲、講古、故事與傳說，歌謠等等，這些載體發生了什麼變遷？它們対新加坡以及更廣泛的中華文明世界有無影響？新加坡華人的文化身份認同是什麼？對臺灣社會有無借鑒意義？",
    "goals": [
        "認識近代至當代中國政治社會變遷對海外華人社會之影響",
        "認識中國民間文藝對新加坡華社的影響，以及它們的在地化與“再傳播”",
        "認識新加坡華人社會的不同成分以及不同時期的華人移民的不同身份認同"
    ],
    "syllabus": "新加坡是大中華地區以外的唯一以華人為主的社會。新加坡開埠至今近200年，新加坡華社起源是什么？組成成分是什么？經過哪些演變？華人文化的重要載體是民間文藝，包括戲曲、講古、故事與傳說，歌謠等等，這些載體發生了什么變遷？它們対新加坡以及更廣泛的中華文明世界有無影響？新加坡華人的文化身份認同是什么？對臺灣社會有無借鑒意義？\n\n本課程規劃移地研究一至二週( 須費至新加坡上課)\n\n第一講：課程介紹，英國海峽殖民地歷史，中國近現代移民過程，新加坡歷史\n\n【說明】引介本課程教學重點，並說明新加坡華人社會與文化之關鍵詞，以及三段対當代新加坡影響最重大的歷史。\n\n第二講：新加坡華人社會（一）\n\n【說明】認識廟宇、宗鄉會館、華文學校、海峽華人、中華總商會等対新加坡華人社會之影響。\n\n第三講：新加坡華人社會（二）\n\n【說明】認識中華文化背景之學術團體、文娛團體、媒體、慈善機構、“通商中國”等対新加坡華人社會之影響。\n\n第四講：新加坡華人社會（三）\n\n【說明】傳統上，新加坡的華人移民主要來自福建、廣東、海南，少數來自浙江。90年代以來，新加坡大量引入華人移民，新移民來自中國大陸五湖四海。新移民與老移民雖同屬華人，在文化和身份認同上差異不小，有時造成社會隔閡甚至裂痕。新移民社團和老移民的傳統會館也有異同。本節集中討論。\n\n第五講：新加坡華人社會（四）\n\n【說明】土生華人（亦稱僑生華人、峇峇娘惹）是新馬一帶于明中葉開始成型的特殊的族群，由于他們遷徙較早，在生活和文化上發生了極高程度的本土化，與《北京條約》之后南下的華人移民形成強烈對比。峇峇娘惹對新加坡華人社會影響很大，而且跨越從開埠至今的各個歷史時期，包括陳篤生、陳金聲、林文慶、宋旺相、林義順、陳振傳、李光耀、吳慶瑞、林金山、黃金輝、陳慶炎等。本節集中討論。\n\n第六講：華文教育與華校\n\n【說明】學校是文化的主要傳承機制之一。新加坡曾存在華文教育與華校，它們對新加坡社會有什么影響？新加坡政府1979年推行的雙語政策對新加坡華社的影響是什么？\n\n第七講：地方戲曲（福建戲、潮劇）\n\n【說明】討論中國民間文藝（福建戲、潮劇）如何引進新加坡，它的種類，以及它對新加坡社會有什么影響？隨著移民的進程，它們發生什么變遷？\n\n第八講：地方戲曲（粵劇、瓊劇、黃梅戲、越劇等）\n\n【說明】討論中國民間文藝（粵劇、瓊劇、黃梅戲、越劇等）如何引進新加坡，它的種類，以及它對新加坡社會有什么影響？隨著移民的進程，它們發生什么變遷？\n\n第九講：客家歌謠\n\n【說明】討論中國民間文藝（客家歌謠）如何引進新加坡，它的種類，以及它對新加坡社會有什么影響？隨著移民的進程，它們發生什么變遷？\n\n第十講：南音\n\n【說明】討論中國民間文藝（南音）如何引進新加坡，它的種類，以及它對新加坡社會有什么影響？隨著移民的進程，它們發生什么變遷？\n\n第十一講：南音作品賞析\n\n【說明】分析、欣賞具體南音作品，討論傳統南音作品與丁馬成南音創新作品之差異及后者的積極意義。\n\n第十二講：故事與傳說\n\n【說明】故事與傳說是傳承文化和價值觀的機制之一。\n\n第十三講：牛車水實地考察\n\n第十四講：虎豹別墅實地考察\n\n第十五講：廟宇與會館實地考察（上）\n\n第十六講：廟宇與會館實地考察（下）\n\n第十七講：期末成果發表\n\n第十八講：期末成果發表",
    "methodologies": [
        {
            "type": "講述法",
            "note": "製作PPT及動態影像教材，配合提綱，逐週講解。"
        },
        {
            "type": "討論法",
            "note": "課堂上提供閱讀材料，引發思辨過程及提升分析能力。"
        },
        {
            "type": "合作學習",
            "note": "一學期有一次小組合作作業，提供團隊合作之練習。"
        },
        {
            "type": "實驗/實作",
            "note": "期末作業採用實作練習。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 50,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 40,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}