{
    "year": 108,
    "term": 1,
    "name": "東亞研究專題討論",
    "teachers": [
        "胡元玲",
        "田正利",
        "林昌平",
        "江柏煒",
        "關弘昌"
    ],
    "department": "IM83",
    "code": "EAM0001",
    "credit": 3,
    "serial": 1393,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 1,
            "from": 9,
            "to": 10,
            "campus": "本部",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "1. 兩領域共同必修，碩士生皆須修習。2. 上課教室為校本部誠大樓9樓，或綜合大樓7樓。（請參考本系所網頁公告之課表）",
    "restrict": "◎課程不開放上修",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This class will introduce graduate students to some of the major topics related to East Asian Studies. It is organized around a framework that tries to understand the development approaches of East Asia among various perspectives.  The research approaches of East Asia include politics, economics, strategy, Sinology, history, and culture. The fundamental goal of this course is to explore whether East Asian Studies could be understand via comparative approaches, as well as in global perspectives.",
    "goals": [
        "學習運用各項東亞區域研究方法，探討東亞國家的政治制度、社會文化與經濟發展。",
        "熟習國內外探討東亞區域研究之重要文獻、資料庫與相關學術期刊，以利未來進行相關研究所需。",
        "應用各種所學之相關概念與研究方法在東亞區域研究的分析上。",
        "熟悉東亞各國的政治、經濟與社會文化發展背景，並蒐集與分析相關資訊以呈現研究結果。"
    ],
    "syllabus": "第一週  課程介紹與概論  \n•    授課大綱與授課方式說明  \n•    課程進度介紹  \n•    評分標準與期末研究報告撰寫方式\n\n  \n第二週  方法論（一）：區域研究、人文社會研究方法論  \n專題演講：江柏煒，1.東亞視野下的金門區域研究；2.東亞冷戰及其文化遺產的反思  \n\\[單元主題說明\\]  \n全球地域學是嘗試建立一種認識地方社會的認識論（epistemology）與方法論，也是一個關乎社會實踐與行動的概念。本單元以演講方式進行，會以金門為例，探討一個歷史的核心現場以及金門研究（或稱金門學）如何運用全球地域學的視角與方法，進而幫助我們釐清不同地區的連動關係、不同層次的網絡關係、不同時期的文化混融（cultural hybridism）等，以及重新得到一種新的描述地方社會之方法及其圖像。具體的內容有二部分，做為跨境流動的僑鄉金門，以及做為世界史及地域史交織的冷戰金門。\n\n  \n第三週  方法論（二）：東亞的形成及其文化網絡  \n\\[單元主題說明\\]  \n    東亞做為一個想像的共同體，其概念如何形成?有無現實意義?對臺灣來說，為何要討論東亞概念?這些命題，在本單元中將不斷地激發同學的思考。因此，以韓國延世大學白永瑞教授的《橫觀東亞：從核心現場重思東亞歷史》及新加坡南洋理工大學劉宏教授的《跨界亞洲的理念與實踐---中國模式、華人網絡、國際關係》兩本著作為起點，讓我們了解東亞的形成其文化網絡。  \n讀書報告：白永瑞，《橫觀東亞：從核心現場重思東亞歷史》，臺北：聯經出版社，2016。  \n讀書報告：劉宏，《跨界亞洲的理念與實踐---中國模式、華人網絡、國際關係》，南京：南京大學出版社，2013  \n延伸閱讀：霍布斯邦（Eric Hobsbawm）等著、陳思文等譯，《被發明的傳統》，臺北：城邦文化，2002。\n\n  \n第四週  東亞城市發展  \n    \\[單元主題說明\\]  \n    城市不但是一種政治制度，更是經濟、社會、文化的總和，也是物質文明的具體再現。本單元將以哈佛大學經濟學家愛德華．格雷瑟（Edward Glaeser）所著的《城市的勝利》，回顧與分析城市對於人類文明與當代的價值。進而以香港學者郭恩慈的《東亞城市的空間生產---探索東京、上海、香港的城市文化》一書，通過批判性的觀點，檢視三座東亞城市的空間與文化變遷。  \n讀書報告：愛德華．格雷瑟（Edward Glaeser）著、黃煜文譯，《城市的勝利》，臺北：時報出版，2012。  \n讀書報告：郭恩慈，《東亞城市的空間生產---探索東京、上海、香港的城市文化》，臺北：田園城市，2011。\n\n  \n第五週 東亞專題簡介及貿易與投資理論介紹  \n\\[課程資料說明\\]  \n1\\. (國際經濟學 : ) 國際貿易理論與政策，2016年，第10版，林柏生教授等譯，華泰文化。  \n2\\. 國際企業：台灣企業個案與本土觀點，2008年，第11版，謝國榮教授編譯，東華書局。  \n\\[單元主題說明\\]  \n本週將先簡介課程專題，包括理論、分析與應用及進行方式，並奠基理論基礎：介紹國際貿易之相關理論，例如：引力模型、重商主義、絕對利益、比較利益、海克夏-歐林的因素稟賦理論等，以及國際投資之相關理論，例如：國際產品的生命週期、追隨領導者、內部化理論、國際生產的折衷理論等理論。\n\n  \n第六週 個案分析與介紹：以東亞聚焦之哈佛個案為例  \n\\[課程資料說明\\]  \n哈佛個案：The Globalization of East Asian Pop Music (708479-PDF-ENG)      \n\\[單元主題說明\\]  \n本週將簡介個案研究方法與分析，並以東亞聚焦之哈佛個案：The Globalization of East Asian Pop Music 為例，藉由此個案演練，除了瞭解哈佛個案以及東亞流行音樂全球化之外，亦說明其分析與應用。\n\n  \n第七週  東亞聚焦之個案分析與討論  \n\\[課程資料說明\\]  \n1.    哈佛個案：The U.S. - China Trade War (719034-PDF-ENG)  \n2.    期刊個案：Hsu, Jinn-yuh. 2017. State transformation and the evolution of economic nationalism in the East Asian developmental state: The Taiwanese semiconductor industry as case study. Transactions of the Institute of British Geographers, 42, 166-178.  \n\\[單元主題說明\\]  \n基於前週之說明與舉例，本週將針對以上兩種不同的個案形態（哈佛個案與期刊個案）進行課堂討論，其中哈佛個案是關於美中貿易戰，而期刊個案是關於臺灣半導體產業為個案討論對象。\n\n  \n第八週  從2020東京奧運看賽事與經貿研究  \n\\[課程資料說明\\]  \n1\\. Aizawa, K., Wu, J., Inoue, Y., and Sato, M. 2018. Long-term impact of the Tokyo 1964 Olympic Games on sport participation: A cohort analysis. Sport Management Review, 21, 1, 86-97.  \n2\\. Agha, N., Fairley, S., and Gibson, H. 2012. Considering legacy as a multi-dimensional construct: The legacy of the Olympic Games. Sport Management Review, 15, 1, 125-139.  \n\\[單元主題說明\\]  \n本週課程著重在應用層面，從2020 東京奧運出發，藉由結合選讀/文獻與時事等回顧與討論，探討奧運，乃至於大型賽事舉辦對經貿之影響。\n\n  \n第九週  絲綢之路賞析與「一帶一路」瞭解與分享  \n\\[課程資料說明\\]  \n1.    多媒體應用。  \n2.    唐米樂 (Tom Miller) 著，林添貴譯，2017年，中國的亞洲夢 : 一帶一路全面解讀 對台灣、全球將帶來什麼威脅和挑戰，時報出版。  \n\\[單元主題說明\\]  \n本週課程著重在應用層面，從絲綢之路出發，藉由多媒體賞析與瞭解絲綢之路及「一帶一路」，並藉由選讀與報告，分享並評論「一帶一路」及其相關機會與挑戰等討論。\n\n  \n第十週  台灣的經濟轉型與社會  \n\\[課程資料說明\\]  \n1.    李宗榮、林宗弘編，《未竟的奇蹟：轉型中的台灣經濟與社會》，台北：中央研究院社會學研究所，2017年。  \n2.    林文斌著，《東亞金融政治》，台北：政大出版社，2013年。  \n\\[單元主題說明\\]  \n本週課程內容著重在台灣的經濟轉型與金融發展，並說明其產業變遷、政府政策與相對應的社會影響與變遷。\n\n  \n第十一週  中國的經濟轉型與社會  \n\\[課程資料說明\\]  \n1.    趙頂新著，《合法的政治性：當代中國的國家與社會關係》，台北：台大出版社，2017年。  \n2.    吳介民著，《尋租中國：台商、廣東模式與全球資本主義》，台北：台大出版社，2019年。  \n\\[單元主題說明\\]  \n本週課程內容著重在中國的經濟發展與轉型，說明其產業變遷、政府政策與相對應的社會影響與變遷，並說明對於國際間之影響。\n\n  \n第十二週  東南亞的經濟轉型與社會  \n\\[課程資料說明\\]  \n1.    強納森．迪波曼著、潭天譯，《國家為什麼會成功》，台北：天下文化，2018年。  \n2.    米爾頓．奧斯伯恩著、王怡婷著，《南向：面對東南亞》，新北市：好優文化，2017年。  \n\\[單元主題說明\\]  \n本週課程著重在東南亞國家的發展轉型，說明其產業變遷、政府政策與相對應的社會影響與變遷，並說明東協的過去、現在與未來。\n\n  \n第十三週 所得不均與社會不平等  \n\\[課程資料說明\\]  \n1.    理查．威金森、凱特．皮凱特著、溫澤元譯，《收入不平等》，台北：時報出版，2019年。  \n2.    理查．威金森、凱特．皮凱特著、黃佳瑜譯，《社會不平等》，台北：時報出版，2019年。  \n3.    Facundo Alvaredo, Lucas Chancel, Thomas Piketty, Emmanuel Saez, Gabriel Zucman等著、劉道捷譯，《世界不平等報告》，台北：衛城出版，2018年。  \n\\[單元主題說明\\]  \n本週課程著重在總體與個體之社會與收入不平等之說明，並以世界各國的現況報告進行分析，探討解決之政策方案。\n\n  \n第十四週 引言：方法與視角\n\n\\[單元主題說明\\]  \n本系列探討「二戰」這一重大歷史事件，透過三本亦文亦史的名著，將戰爭中的悲歡離合重新帶入視野，並連結新加坡二戰歷史作為參照。  \n\\[課程資料說明\\]  \n白睿文(Berry, Michael)著，李美燕、陳湘陽、潘華琴、孔令謙譯，《痛史：現代華語文學與電影的歷史創傷》(A History of Pain: Trauma in Modern Chinese Literature and Film)，台北：麥田出版社，2016年。  \nRicoeur, Paul. Kathleen Blamey and David Pellauer, trans. Memory, History, Forgetting.  Chicago: University of Chicago Press, 2006.  \n\n第十五週 鎮壓\n\n\\[單元主題說明\\]  \n歷史上重大屠殺事件，牽涉到的往往不僅是歷史研究，還關乎政治與國際關係。  \n\\[課程資料說明\\]  \n張純如(Chang, Iris)著，蕭富元譯，《被遺忘的大屠殺：1937南京浩劫》(The Rape of Nanking: The Forgotten Holocaust of World War  Ⅱ)，台北：天下文化出版公司，2007年。  \nYoshimura, Mako,  and Yoji Akashi. New Perspectives of the Japanese Occupation of Malaya and Singapore, 1941-45. Singapore: National University of Singapore Press, 2008.  \nMuzaini, Hamzah, and Brenda S.A. Yeoh. Contested Memoryscapes: The Politics of Second World War Commemoration in Singapore. London: Routledge, 2018.\n\n  \n第十六週 佔領    \n\n\\[單元主題說明\\]  \n胡蘭成是高度爭議的人物，其與張愛玲的愛恨糾結，反映出時代的困境與人性的幽微，並影響後來的文藝創作。  \n\\[課程資料說明\\]  \n三毛，《滾滾紅塵》，台北：皇冠出版社，2019年。  \n王德威著，涂航、余淑慧、陳婧祾譯，《史詩時代的抒情聲音：二十世紀中期的中國知識分子與藝術家》(The Lyrical in Epic Time: Modern Chinese Intellectuals and Artists through the 1949 Crisis)，台北：麥田出版社，2017年。  \n秦燕春，〈重審『抒情傳統』—— 再論唐君毅、胡蘭成交往的文化史意義〉，《臺灣東亞文明研究學刊》， 第16卷第1期，2019年6月，頁143-188。  \nLee, Geok Boi. Syonan: Singapore under the Japanese 1942-1945. Singapore: Singapore Heritage Society and Landmark Books, 2017.\n\n  \n第十七週 反抗\n\n\\[單元主題說明\\]  \n齊老師以一本書紀念一個時代，其深刻的情感經歷發人省思。  \n\\[課程資料說明\\]  \n齊邦媛，《巨流河》，台北：天下文化出版公司，2014年。  \n芮納‧米德(Mitter, Rana)著，林添貴譯，《被遺忘的盟友》(Forgotten Ally: China’s World War II, 1937-1945)，台北：天下文化出版公司，2014年。  \nBayly, Christopher Alan, and Tim Harper. Forgotten Armies: Britain's Asian Empire and the War with Japan. London: Penguin, 2005.  \n\n  \n第十八週 01/06/20 期末考週",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 15,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 15,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 70,
            "note": "期末書評報告"
        }
    ],
    "prerequisite": "",
    "general_core": []
}