{
    "year": 110,
    "term": 1,
    "name": "服務業行銷",
    "teachers": [
        "鄒蘊欣"
    ],
    "department": "OU57",
    "code": "BAU0060",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 2513,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "誠206"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎必須先修過【BAU0021  行銷管理】",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "熟悉服務業行銷的概念",
        "具備分析服務業行銷個案的能力",
        "訓練團隊合作完成服務業行銷的能力"
    ],
    "syllabus": "**教學大綱** (subject to change)\n\n**授課教師**\n\n鄒蘊欣 Cindy Yunhsin Chou\n\n**教學進度與主題**\n\n**Date**\n\n**Week**\n\n**Content**\n\nSep 24\n\nWeek 1\n\nCourse Introduction\n\nIntroduction to Services\n\nOct 1\n\nWeek 2\n\nIntroduction to Services (cont.) **(Develop Groups in Class)**\n\nOct 8\n\nWeek 3\n\nService Quality and Service leadership\n\nCompetition- confirming case and propose initial idea- team presentation for 5 mins\n\nOct 15\n\nWeek 4\n\nGuest speech\n\nTopic: 跨域服務行銷實務分享\n\nSpeaker: 台灣服務科學學會祕書長傅佩娸女士\n\nOct 22\n\nWeek 5\n\nConsumer decision-making process\n\nCompetition proposal discussion\n\nOct 29\n\nWeek 6\n\n3Cs competitive positioning in services\n\nCompetition proposal presentation\n\n**10/31 competition proposal submission deadline**\n\nNov 5\n\nWeek 7\n\nService Products\n\nNov 12\n\nWeek 8\n\nDesign thinking workshop\n\nTopic: 設計思考的洞見(insight)\n\nSpeaker: 淡水大學資訊傳播系助理教授林俊賢博士\n\nNov 19\n\nWeek 9\n\nPricing and Distribution\n\nNov 26\n\nWeek 10\n\nManaging people (I)\n\nDec 3\n\nWeek 11\n\nManaging people (II)\n\nDec 10\n\nWeek 12\n\nService environment\n\nDec 17\n\nWeek 13\n\nManaging the service process, and capacity and demand\n\nDec 24\n\nWeek 14\n\nBuilding and managing customer relationship\n\nDec 31\n\nWeek 15\n\nGroup Project Presentations\n\nAttendance will be checked as part of participation points\n\nJan 7\n\nWeek 16\n\nGroup Project Presentations\n\nAttendance will be checked as part of participation points\n\nJan 14\n\nWeek 17\n\n_No class (Self-learning)_\n\nJan 21\n\nWeek 18\n\n_No class, No exam (Self-learning)_\n\nNOTE: This schedule is subject to change. The student is responsible for learning of all changes.\n\n**作業細節****Details of Assessment:**\n\nThe information below provides some preliminary details on the critical course components. As the semester gets underway, more information on each component will be provided to the students.\n\n1.  **Competition:** The group project is to be completed by teams of four or five students. Your team is required to participate in the following competition. Your team will need to fulfil the chosen competition’s requirement and submit the proposal by the designated deadline.\n    1.  **[全國服務科學跨界共創大賽](https://www.s3tw.org.tw/innoconnect/Default.aspx)**  \n        數位轉型出題企業有五家：[https://www.s3tw.org.tw/innoconnect/List.aspx?tid=129](https://www.s3tw.org.tw/innoconnect/List.aspx?tid=129)\n\n地球永續出題企業有五家：[https://www.s3tw.org.tw/innoconnect/List.aspx?tid=131](https://www.s3tw.org.tw/innoconnect/List.aspx?tid=131)\n\n1.  出解題雙方認識與媒合：2021年7月1日-2021年9月30日\n2.  **組隊報名：****2021****年****9****月****15****日****\\-2021****年****10****月****31****日****23:59pm**\n3.  第一階段構想收件：2021年10月1日-2021年10月31日23:59pm  \n    計畫書規格與評選方式: 構想計畫書須依循**「需求洞察，創意發想，執行規劃」架構，規格為單面****A4****作品****(****包括附錄****)****，****20****頁以內，中文字體標楷體****12****級，英文字體****Times New Roman 12****級。**\n\n構想評選由主辦單位評審委員團進行書面審查>>  \n**審查項目：創新性與可行性****40%****、價值訴求****30%****、服務設計方法論與工具運用****30%**。\n\n1.  構想評選：2021年11月1日-2021年11月10日\n2.  創新創意工作坊：2021年11月20日(線上形式)\n3.  第二階段構想收件：2021年12月1日-2021年12月15日18:00pm\n\n企業決選：2021年12月15日-2021年12月31日  \n企業決選由企業代表與評審委員團進行書面審查>> **審查項目：出題企業需求符合程度：****50%****、實作可行性和創新性：****50%****。**\n\n1.  成果發表：2022年4月\n\n1.  **Group Project:** The group project is to be completed by teams of **four or five** students. Your group will be assigned a service industry, and your job is to identify two service providers within that industry. (If changing to online teaching, this assignment will be individual work, the below structure will be modified. The modified structure will be announced on Moodle)\n    1.  The first is to be a very successful service firm – one for which you can document quality service and a customer orientation.\n    2.  The other is just the opposite. Your job is to compare and contrast the service strategies employed (or lack thereof) by the two firms, and the customers’ reactions to these strategies.\n    3.  I recommend starting with a description of the industry as a whole (i.e., size, primary players, number of firms, etc.), and then moving to the specific firms. This will require a lot of digging, so I suggest you start early and become familiar with the many databases at your disposal. I will help in this regard, but there’s no substitute for persistence (midterm report).\n    4.  Note: at the end of the semester, you will need to support your findings with research (i.e., facts), so statements like “everybody knows the Ritz is known for its service” will get you nowhere. You can obtain this research from external sources (e.g., Consumer Reports, JD Power Ratings, ACSI scores) or you can do some of your own. For instance, you could interview some of the customers and/or employees of your service firms, and then compare and contrast their perceptions of the two firms.\n    5.  Also, since obtaining feedback is a fundamental principle of services marketing, you could also conduct a survey. The majority of the grade will not be on the survey per se, but rather on how well you integrate and present the findings. Your grade will reflect the amount of effort you devote to the project and also how well you present and support your findings.\n    6.  The project presentation will take place in the middle and at the end of the semester where in you will have 15-20 minutes to summarize your project and findings. Managing the presentations is up to you. Professionalism and ingenuity will be rewarded.\n2.  **Class Participation:** This course is designed to be 50% lecture and 50% interactive exercises. You are responsible for the breadth and depth of this interaction. Come to class prepared and willing to share your experiences, trials, and thoughts. Please note: these are NOT “free points,” regardless of whether you generally like to speak up in class and attendance does not fulfill your participation Services Marketing/Chou requirement. I expect you to attend class and I’m looking for you to add to the class environment. Points will be rewarded accordingly.\n3.  **Group Project/Case Participation:** Each member of the group project teams will be evaluated by the project leader at the end of the semester. If it is determined that one or more members is not participating in the group project, I reserve the right to lower grades to a level commensurate with participation.\n4.  **Other stuff:** In the interest of fairness, late assignments will be penalized 5 points per day. If you find yourself behind, I recommend taking the penalty as opposed to submitting an assignment of poor quality. All assignments should be typed, double spaced, and written using proper grammar and punctuation. Careful proof reading is strongly recommended.",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "教科書與期刊文章的講授與討論"
        },
        {
            "type": "Group discussion",
            "note": "服務業行銷管理個案討論"
        },
        {
            "type": "Problem base learning",
            "note": "服務業行銷管理個案研討"
        },
        {
            "type": "Cooperative learning",
            "note": "服務業行銷管理個案撰寫與報告"
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 60,
            "note": "Competition (30%)\nGroup project report II (30%)"
        },
        {
            "type": "Class discussion involvement",
            "weight": 20,
            "note": "Individual"
        },
        {
            "type": "Attendances",
            "weight": 20,
            "note": "Individual"
        }
    ],
    "prerequisite": "Prerequisite course: 【BAU0021  Marketing Management】",
    "general_core": []
}