{
    "year": 110,
    "term": 1,
    "name": "電子商務",
    "teachers": [
        "洪秀瑜"
    ],
    "department": "OU57",
    "code": "BAU0052",
    "credit": 3,
    "serial": 2511,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "樸106"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎必須先修過【BAU0048  企業管理概論】、【BAU0021  行銷管理】",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "本課程企圖介紹電子商務沿革、驅動因素、影響、以及未來趨勢的各種實務應用，涉及的範圍將包括網路實際業務案例的鑑往知來、新興科技形塑未來商務環境的探討等，課程以講述沿革與探討、討論個案為主，也許將邀請若干業師到課堂參與討論。\n這門課的學生將被要求實際動手精通搜尋引擎搜尋命令語法、有效用且有效率的理解他人觀點並發展自己觀點、順暢表達Inventing the Wheel的見解描述或是Reinventing the Wheel的重點整理等。",
    "goals": [
        "瞭解網際網路等科技的演進為企業經營帶來的衝擊及機會，並著重其中引發的經營管理議題。",
        "瞭解既存商務的領導公司所帶動發展的科技與商模等重要議題。",
        "透過個案討論及實務演練，體驗電子商務應用及實務操作，以面對未來挑戰",
        "企管學科乃在於培養人的品質，本課程藉用電子商務的發展過程以練習如何善用把已知及可調資源、迎向未知與挑戰。"
    ],
    "syllabus": "歡迎來到電子商務課程。這個課程將分為三個部分共十四個主題，分別由架構技術面、管理面、應用面來瞭解電子商務的重要課題。架構與技術面中，本課程特別就近年來重要的電子商務科技加以深入探討，包含網路安全、金融區塊煉技術，電子付款、巨量資料管理等。在管理面上，本課程著重於電子商務經營的策略、B2B, B2C, C2C，電商平台業者等不同商業模式以及個人想要微型創業時網路商店的規劃、設計及評估等核心議題。在創新應用面上，涵蓋網路行銷、社群商務及行動商務等探討。\n\n本課程將能夠有效的協助同學瞭解當代電子商務的走向及實際運用，讓同學建立電子商務完整的概念。課程內容包括觀念講授，課堂討論與交流，以及同學自己的實際操作。透過深入觀察以及自己組隊實作，同學將可以更有效的學習最新的電子商務知識與發展技術，同時體驗網路創業與團隊共創的學習歷程。\n\nWelcome to E-Commerce World! This course will provide you with an overview of the basic principles of electronic commerce and the related concepts, which are reflected in current environment of the global economy.\n\nCourse are comprised by three major elements: (1) the fundamental technologies that provide you toolboxes to run a e-commerce business, (2) the business models and managerial strategies, and (3) related marketing strategies to run a successful e-commerce business. In the course, you will develop a deeper understanding of the critical attributes of a successful participant in today’s ever-changing markets. You are expected to participate in class discussion regarding different cases in Taiwan and other countries to build your knowledge of e-commerce by gaining insights from others’ successful and failure cases. Moreover, for practical application and my teaching goal of learning by doing, you and your team members will utilize fundamental concepts learned in this course, integrating with computer skills to create an (virtual/simulating) online business in the end of this semester. These learning experiences will not only enrich your knowledge about  e-commerce but also inspire your entrepreneurship and team memberships.  \n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=15bac995dc554c619379132d39befc1e&fno=6eacce414f7e4e8eafc1d8de59ccf3d4)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "基本概念"
        },
        {
            "type": "討論法",
            "note": "課堂討論"
        },
        {
            "type": "問題解決教學",
            "note": "個案討論、實做演練"
        },
        {
            "type": "合作學習",
            "note": "群組作業"
        },
        {
            "type": "媒體融入教學",
            "note": "多元媒體教材融入"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": "上課發言與參與"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 60,
            "note": "期中報告（30%）/期報告（30%）"
        }
    ],
    "prerequisite": "◎必須先修過【BAU0048  企業管理概論】、【BAU0021  行銷管理】",
    "general_core": []
}