{
    "year": 108,
    "term": 1,
    "name": "高齡者運動休閒專題研究",
    "teachers": [
        "林儷蓉"
    ],
    "department": "AM31",
    "code": "SRM0106",
    "credit": 3,
    "serial": 44,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 0
    },
    "schedule": [
        {
            "day": 4,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "綜602"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "本課程初步探究老化的基本概念，並以此為基礎，了解老年人族群在運動休閒上的需求、參與行為、面臨的困境等。此外，本課程探討老年人運動休閒發展與相關政策，以使學生能掌握老人運動休閒發展與政策的脈動，進而強化其學術研究及就業的競爭力。",
    "goals": [
        "體認運動休閒活動在老年生活中所扮演的角色",
        "掌握老人運動休閒發展與政策的脈動",
        "透過課堂討論與小組報告，使學生具備參與討論與自我表達能力",
        "關懷老人在運動休閒上參與行為及面臨的困境"
    ],
    "syllabus": "週次\n\n每周主題\n\n隨堂作業與活動\n\n9/12\n\n課程介紹\n\n閱讀任一本中文高齡學\n\n9/19\n\n課程調整至11/2星期六晚間7:00-9:00\n\n台北小巨蛋參觀「仙角百老匯」\n\n校外教學\n\n9/26\n\n何謂老化？\n\n課堂討論\n\n10/3\n\n心理與認知老化\n\n1\\. Labouvie-vief, G., & Blanchard-fields, F. (1982). Cognitive ageing and psychological growth. Aging and Society, 2(2), 183-209\n\n2\\. Salthouse, T. A. (2009). When does age-related cognitive decline begin? Neurology of aging, 30, 507-514\n\n課堂討論\n\n10/10\n\n國慶日放假一天\n\n10/17\n\n社會心理學中的老化理論- 撤退理論、活躍理論\n\n1\\. Hochschild, A. R. (1975). Disengagement theory: a critique and proposal, American Sociological Review, 40(5), 553-569\n\n2\\. Reitzes, D. C., Mutran, . J., & Verrill, L. A. (1995). Activities and self-esteem: continuing the development of activity theory, Research on Aging, 17(3), 260-277\n\n文獻閱讀\n\n10/24\n\n社會心理學中的老化理論~持續理論、社會交換理論\n\n1\\. Atchley, R. (1989). The continuity theory of normal aging. The Gerontologist, 29(2): 183–190.\n\n2\\. Dowd, J. J. (1975). Aging as exchange: a preface to theory, Journal of Gerontology, 30(5), 584-594\n\n10/31\n\n社會心理學中的老化理論-\n\n選擇最適化與補償理論、社會情緒選擇理論\n\n1\\. Baltes, P. B. (1997). On the incomplete architecture of human ontogeny: selection, optimization, and compensation as foundation of developmental theory. American Psychologist, 52(4), 366-380\n\n2\\. Carstensen, L. L. (1992). Social and emotional patterns in adulthood: support for socioemotional selective theory. Psychology and aging, 7(3), 331-338\n\n3\\. Carstensen, L. L., Isaacowitz, D. M., & Charles, S. T. (1999). Taking time seriously: a theory of socioemotional selectivity. American Psychologist, 53(3), 165-181\n\n11/7\n\n老化理論的實證\n\n1\\. Zhang, W., Radhakrishnan, K. (2018). Evidence on selection, optimization, and compensation strategies to optimize aging with multiple chronic conditions: a literature review. Geriatric Nursing, 39(5), 534-542\n\n2\\. Charles, S. T., Mather, M., & Carstensen, L. L. (2003). Aging and emotional memory: the forgettable nature of negative images for older adults. Journal of Experimental Psychology: General, 132(2), 310-324\n\n11/14\n\n老人大學及社區據點參訪  \n\n11/21\n\n生命周期與休閒行為\n\n1\\. Iso-Ahola, S.E., Jackson, E., & Dunn, E. (1994). Starting, ceasing, and replacing leisure activities over the life-span. Journal of Leisure Research. 26(3), 227-249\n\n2\\. Nimrod, G. (2007). Expanding , reducing, concentrating and diffusing: post retirement leisure behavior and life satisfaction. Leisure Sciences, 29, 91-111\n\n11/28\n\n高齡者休閒效益\n\n1\\. Regheb, M. G., & Griffith, C. A. (1982). The contribution of leisure participation and leisure satisfaction to life satisfaction of older persons, Journal of Leisure Research, 14(4), 295-306\n\n2\\. Coleman, D. (1993). Leisure and health: the role of social support and self-determination, Journal of Leisure Research, 25(2), 111-128\n\n12/5\n\n高齡者休閒教育\n\n1\\. Michael J. M., & Mark S. S. (1994). Leisure education: its effect on older adults, Journal of Physical Education, Recreation & Dance, 65(4), 36-41\n\n2\\. Dupuis, S. L. (2002). Intergenerational education programs in leisure and aging courses: older adult and student experiences, SCHOLE: A Journal of Leisure Studies and Recreation Education, 17, 73-86\n\n12/12\n\n環境與高齡運動休閒\n\nCauwenberg, J. V., Nathan, A., Barnett, A., Barnett, D. W., & Cerin, E.(2018). Relationships between neighborhood physical environmental attributes and older adults’ leisure-time physical activity: a systematic review and meta-analysis. _Sports Medicine, 48_(7), 1635-1660\n\n12/19\n\n退休與適應\n\nLee, Y., Chi, I., & Palinkas, L. A. (2019). Retirement, leisure activity engagement, and cognition among older adults in the United States. _Journal of Aging and Health, 31_(7), 1212-1234\n\n12/26\n\n科技休閒\n\n1\\. Genor, R., Kulczycki, C., Marston H., Freeman, S., Musselwhite, C., & Rutherford, H. (2018). E-leisure and older adults: findings from an international exploratory study. Journal of Therapeutic Recreation Journal, 1, 1-18\n\n1/2\n\n疾病與休閒\n\nYu, H., Chiang, T., Chen, D., Tu, U., & Chen, Y. (2018). Trajectories of leisure activity and disability in older adults over 11 years in Taiwan. Journal of Applied Gerontology, 37(6), 706-727\n\n1/9\n\n期末報告：\n\n台灣高齡者運動休閒參與之過去、現在與未來",
    "methodologies": [
        {
            "type": "講述法",
            "note": "本課程之進行以針對所講授之主題提出問題來激發學員對此一主題之思考，並以小組討論與課後作業來評估學習成效。"
        },
        {
            "type": "討論法",
            "note": "專題討論：主題認選之同學先就所認選之主題口頭報告（50分鐘為原則），其他同學於報告後給予評論（每人5分鐘為原則），再進行師生討論。"
        },
        {
            "type": "實地考察、參訪",
            "note": "實地參訪：實地參訪老人安養中心"
        },
        {
            "type": "專題研究",
            "note": "以「台灣高齡者運動休閒參與之過去、現在與未來」為題進行資料收集與分析，進行小論文之撰寫"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 50,
            "note": "每周閱讀筆記及導讀"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "討論參與（依參與討論發言或回應每周主題內容）"
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "期末報告（依主題撰寫與分享）"
        }
    ],
    "prerequisite": "",
    "general_core": []
}