{
    "year": 107,
    "term": 1,
    "name": "國際財務管理",
    "teachers": [
        "安用吉"
    ],
    "department": "OM55",
    "code": "MBM0048",
    "credit": 3,
    "serial": 2417,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 10,
            "to": 12,
            "campus": "本部",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "上課教室：雲508室",
    "restrict": "◎必須先修過【BAU0038  經濟學（一）】、【BAU0036  會計學（一）】、【BAU0040  統計學（一）】 ◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "The course extends financial decision-making to the international setting. Topics include the foreign exchange market, predicting exchange rate movements, hedging exposures with various derivative and other alternatives, the challenges of raising funds internationally and the process and documents of international trade. The course makes extensive use of case studies and there is an expectation that students will make recommendations to real life problems and justify their decisions. This is a challenging course with a significant theory content which requires class attendance and participation in addition to the appropriate independent study and thought to be successful. \nThe first half of the course covers the determination of foreign exchange rates, and the basics of trading in financial markets and governmental exchange rate policy. The second half, which is the focus of the course, deals with the impact of foreign currency exchanges and global capital markets on firms’ investment, financing, and risk management policies. We also discuss currency speculation strategies and the impact of monetary policy on exchange rates.",
    "goals": [
        "Describe and understand the basic types of foreign exchange rate quotations",
        "Demonstrate a knowledge of the international monetary system, and an ability to calculate and interpret values for various exchange rate problems.",
        "Understand the categorization and effect of foreign exchange exposure",
        "Understand parity conditions, especially the interest rate parity.",
        "Outline and apply theories of international finance which are used by firms to forecast exchange rates",
        "Explain foreign exchange exposure and compare instruments and techniques available to manage it",
        "Apply theories of international finance to case studies so as to analyze, evaluate and then articulate solutions to real world problems",
        "Compare costs and sources of capital for international and domestic firms.",
        "Identify and design the basic risk management strategies to effectively conduct netting, hedging, and offsetting foreign exchange exposure.",
        "10.　Understand the diversification effect of international portfolio investment."
    ],
    "syllabus": "•Week 1: introduction\n\n•Week 2: foundations of international finance (Ch.1,2,3)\n\n•Week 3: foreign exchange market (Ch.5)\n\n•Week 4: LOOP, triangular arbitrage, and bid-ask spread (Ch.5)\n\n•Week 5: IRP (Ch.6)\n\n•Week 6: PPP (Ch.6)\n\n•Week 7: various other relations (Ch.6)\n\n•Week 8: various other relations (Ch.6), midterm review\n\n•Week 9: midterm exam\n\n•Week 10: currency derivatives (Ch.7)\n\n•Week 11: interest rate derivatives (Ch.14)\n\n•Week 12: foreign exchange risk management (Ch.8,9,10)\n\n•Week 13: foreign exchange risk management (Ch.8,9,10)\n\n•Week 14: international portfolio management (Ch.15)\n\n•Week 15: case study\n\n•Week 16: mini-conference\n\n•Week 17: mini-conference, final review\n\n•Week 18: final exam",
    "methodologies": [
        {
            "type": "講述法",
            "note": "39 hours per semester"
        },
        {
            "type": "討論法",
            "note": "9 hours for mini conference and group project"
        },
        {
            "type": "問題解決教學",
            "note": "18-hour self-study (2 assignments per semester)"
        },
        {
            "type": "專題研究",
            "note": "12-hour commitment per semester"
        },
        {
            "type": "其他",
            "note": "I will use Socrative quite extensively. You will share your understanding by answering assessment questions such as quizzes or quick question polls."
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 30,
            "note": "The exam will cover all the topics discussed up to the time. The exam will consist of multiple choice questions and quantitative problems. Unless I indicate otherwise, everything discussed in class may appear in the exam."
        },
        {
            "type": "期末考",
            "weight": 40,
            "note": "The final exam will take place during the final exam week. It is cumulative and will cover the entire course materials. The final exam will be more challenging than the midterm exam."
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "The purpose of group project is to get familiar with recent developments of international financial markets to make up the under-coverage of them in the lectures. Groups of two people must be formed and should stay together until the end of semester. Each group could choose a topic by themselves such as the Trans-Pacific Partnership or the impact of Brexit. There are many other interesting topics. For example, Taiwan’s gross domestic product (GDP) slides deeper into recession now. Taiwan’s annual GDP growth rate was 0.72% in 2015, much lower than that of other countries in Asia. How would that affect the Taiwan dollar? Another interesting topic is how Donald Trump’s presidency will affect the US dollar. Strengthen or weaken the US dollar? Here’s one more topic. Have you ever come across the argument that Germany benefits from the Euro while other Euro countries pay. Why? Or why not? I welcome any “dangerous ideas”1, so please do feel free to choose any topics. My emphasis is on economic insight and inspiration, not on popularity or formality.The project will be judged by your report (no more than 10 pages, one-half spaced with 12 points) and presentation. Don’t make your introduction any longer than two pages. If you go on much more than two pages, you may tire out your readers. You should discuss what inspires you to choose your topic. The next section, the main body of your report, is where you tell your audience. This section should be at least five pages long, perhaps six or seven. Before going on to your conclusion, I urge you to discuss some practical implications. The last page of your report should be a bibliography section. List up all your references such as books, journal papers, news sources, and websites."
        },
        {
            "type": "專題",
            "weight": 10,
            "note": "You place yourselves in the role of the decision maker as you read through the situation and identify the problem you are faced with. The next step is to perform the necessary analysis - examining the causes and considering alternative courses of actions to come to a set of recommendations. I expect every student to come to class prepared to discuss the assigned readings. I will call on every student, and I will expect each of you to discuss ideas from each assigned reading and consistently throughout each class.\nNote that you are required to buy a few Harvard business cases which cost around 100 Taiwan dollars per case."
        }
    ],
    "prerequisite": "◎必須先修過【BAU0038  經濟學（一）】、【BAU0036  會計學（一）】、【BAU0040  統計學（一）】",
    "general_core": []
}