{
    "year": 111,
    "term": 1,
    "name": "文化跨界心理學",
    "teachers": [
        "王麗斐"
    ],
    "department": "EM01",
    "code": "PCC8019",
    "type": "必",
    "grade": null,
    "credit": 2,
    "serial": 411,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 8,
            "to": 9,
            "campus": "本部",
            "classroom": "教619"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 2,
    "description": "",
    "goals": [
        "Forming an integrative understanding through reading theories and researches related to social-cultural context and psychology.",
        "Develop knowledge and skills in cross-cultural psychology.",
        "Promote cultural intelligence, familiar social cultural tradition of at least one country other than students’ country of origin.",
        "Increase self-awareness, understand the influence of ethnic culture and nation’s social context on individual’s development and adjustment."
    ],
    "syllabus": "**教學進度與主題**（可說明每週進度）**Schedule**\n\n1st Week: Welcome and Class introduction--Objectives, contents, schedule, and evaluation system\n\n2nd Week: First two weeks at NTNU: surviving and cultural shock\n\n3rd Week: Developing Cross-Cultural Competencies\n\n4th Week: Monthly updates of overall experience during the 1st month \n\n5th Week: 1st cultural exploration activity\n\n6th Week: Cross-Cultural Collaboration Journey\n\n7th Week: Issues related to cross-cultural adjustment 1: social system and contextual factors\n\n8th Week: Issues related to cross-cultural adjustment 2: personal factors\n\n9th Week: Promoting international education: Cross-cultural immersion experiences\n\n10th Week: Process, reflection and feedback\n\n11th Week: Interpersonal Perspectives in cross-cultural coping\n\n12th Week: Intrapersonal Perspectives in cross-cultural coping\n\n13th Week: Monthly updates of overall experience during the 2nd month\n\n14th Week: 2nd cultural exploration activity\n\n15th Week: Counseling Psychology in the Confucius societies\n\n16th Week: Wrap up & Integration",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "Lectures, discussion, and reflections."
        },
        {
            "type": "Group discussion",
            "note": "It is encouraged that students share their thoughts and experience to promote understanding on their crossing border and cultural experiences."
        },
        {
            "type": "Lab/Studio",
            "note": "Through cultural activities to explore one’s cross-border/cultural experience and learn the interaction among social context, cultural traditions, and human mental process."
        },
        {
            "type": "Media, audio, visual materials",
            "note": "Using PowerPoints and videos to enhance interest in learning and understanding of the topics."
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 40,
            "note": "You will write reflection weekly note before class to reflect your learning from cross-cultural experiences. You can write reflections on your own personal reactions, reading, and responses experienced in relation to dialogues, exchanges, and outside-of-class cross-border experiences. You can be specific and discuss the following three dimensions: (1) Learning of the week; (2) (cross-cultural) challenges you encountered; (3) coping strategies/skills you used to solve the problems. We will discuss and share your reflection during classes."
        },
        {
            "type": "Class discussion involvement",
            "weight": 10,
            "note": "Actively engage in class discussions, share your thoughts and experiences."
        },
        {
            "type": "Attendances",
            "weight": 20,
            "note": "You are required to attend every class and participate in all cultural activities. If you cannot come to any classes or activities due to emergency reasons, please email or call the instructor beforehand. If you miss a cultural immersion activity, you will need to reschedule and discuss with the instructor."
        },
        {
            "type": "Presentation",
            "weight": 10,
            "note": "Oral report (on the topic that students choose to conduct on one’s project)"
        },
        {
            "type": "Case study reports",
            "weight": 20,
            "note": "Conduct a project to integrate one’s own cross-border cultural experience and cross-cultural psychology theories/knowledge."
        }
    ],
    "prerequisite": "◎Unavailable for M.A. program students (M.A. program courses excepted) and B.A. program students.",
    "general_core": []
}