{
    "year": 109,
    "term": 1,
    "name": "當代策展理論與實務",
    "teachers": [
        "哈德森"
    ],
    "department": "TM67",
    "code": "AHM0237",
    "credit": 3,
    "serial": 3143,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 5,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "青田406室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "Curatorship ranges very widely in nature, from routine administrative record keeping, to auguring major cultural movements, and contributing novel ideas to public discourses. This course reflects the varied nature of curatorship in its structure. The first section is dedicated to curatorship of collections—beginning with the historical development of the role of collection curator in the West, before addressing aspects of acquiring, researching, cataloguing, conserving, and deaccessioning art today. The second section is dedicated to curatorship of exhibitions—beginning with a brief history of major recurrent international exhibitions, including the Paris Salon, the Royal Academy of Arts exhibitions, the Venice Biennale, and documenta. Then, we will consider the varied scholarly and economic aims of the many kinds of exhibitions staged today—whether large or small, recurrent or unique—and how exhibition design and focus contribute to these ends. The third section concerns curators’ working relationships beyond their own organisations, specifically, relationships with artists, the academy, and society. Demands on curators in the public sector have been growing for some time. In addition to the traditional demonstration of expertise, in wall labels, catalogues, and public presentations, curators are increasingly expected to contribute to attracting and engaging with large and diverse audiences. The fourth section attends to issues for curatorship in the Asia-Pacific region—including negotiating local, regional, and global priorities; acknowledging indigeneity and post-colonial identities; and the varieties of state support and censorship of art exhibitions in the region.\nThe course will be delivered as a series of seminars with set readings, discussions, guest presentations where they can be arranged, site visits, documentary screenings, a fieldwork and in-class groupwork project, and an assignment in three parts, to design an exhibition, and write its catalogue and wall texts.",
    "goals": [
        "For students to have first-hand experience of, and an understanding of the operations of, a range of public and private organizations that exhibit art in Taiwan",
        "For students to gain a greater knowledge and understanding of the key practices and principles involved in the contemporary curatorship of art and across a range of related museum and arts industry activities, in Taiwan, across Asia, and internationally",
        "For students to be able to research, analyse, discuss, and write about issues in the contemporary curatorship of art following academic conventions",
        "For students to develop their skills in presenting interpretations about art and objects to specialists and non-specialists",
        "For students to undertake exhibition curation in a virtual environment",
        "For students to become more conscious of the impact of curatorship on how art is produced, experienced, appreciated, and conserved in contemporary society"
    ],
    "syllabus": "**Schedule of Session Topics** (To download a PDF of the course guide, click on the link at the bottom of this section.)\n\n1\\. Introduction\n\nIn the first session, students will be provided with electronic copies of this course guide and the Academic Writing for Art History guide, and an overview of the course content, and explanation of the assessment. This will be followed by a presentation on key, course-specific terminology. Then, students will be introduced to a groupwork activity, to map and categorize the range of art-exhibiting organizations in Taipei. We will add to this project over the course, to build a body of knowledge about the varieties of curatorship, and the spaces in which they occur, across the city.\n\n**I. Curating Collections**\n\n2\\. The Evolving Role of the Curator, and the Place of Curators in Current Organizational Structures \n\nWe will study the historical evolution of the role of curator in public art museums, through a close examination of the case of the National Gallery, London. We will focus on key historical figures responsible for acquiring, displaying, and caring for its collection, since its founding in the nineteenth century, including Charles Eastlake, Ralph Nicholson Wornum, and Martin Davies. We will consider the importance for the development of curatorship as a profession, of the emergence of specialized graduate qualifications from the 1980s. Subsequently, we will study the organizational structures of leading collection-based art museums internationally in the present, to see where curators are currently placed. We will also continue work on the Taipei art-exhibiting organizations mapping project.\n\nprovided text:\n\nHartley, Lucy, '‘How to Observe’: Charles Eastlake and a New Professionalism for the Arts,' _Journal of Art Historiography_, no. 18, June, 2018, pp. 1–20.\n\n3\\. Collection Development\n\nPublic art collections may grow from unsolicited donations or planned purchases. Here, we study the case of the Felton Bequest purchases for the National Gallery of Victoria, in Melbourne, which began in 1904, and through its trust fund, still continue, well over a century later. There is a traditional strategy for acquisitions to 'develop strengths or fill gaps' in collections. However, museum acquisition practices are much less theorized than the collection development of libraries, due to the frequently unique nature, or more limited availability, of artworks. In any case, we will see how curators write acquisition proposals to justify their recommendations, and we will examine where works are acquired, whether from auction houses, dealers, commercial galleries, or private vendors. We will end the session with the first installment of the 'Six Meaningful Objects' exercise, to explore ways in which objects can be interpreted to develop narratives or otherwise be introduced to audiences in an engaging and meaningful way.\n\nprovided texts:\n\nArt Gallery of New South Wales, 'Art Acquisition Policy,' Art Gallery of New South Wales website, written 9 December 2015, revised 11 January 2018, https://www.artgallery.nsw.gov.au/about-us/corporate-information/policy-documents/art-acquisitions/accessed 15 March 2019.\n\nMarshall, Christopher, ‘Between Beauty and Power: Henry Moore’s _Draped Seated Woman_ as an Emblem of the National Gallery of Victoria’s Modernity 1959–68’, _Art Bulletin of Victoria_, vol. 46, 2006, pp. 36–49.\n\n4\\. Cataloguing and Provenance Research\n\nTraditionally, cataloguing of acquisitions has been performed, or supervised by, curators. Museum cataloguing software provides for the entry of a vast array of data, but still requires knowledge of cataloguing standards, as well as specialized research skills. In particular, tracing the provenances of paintings, drawings, manuscripts, books, and objects requires knowledge of collectors' marks, inventories, sale catalogues, and archives. Recent charges of false provenances being provided by a high-profile international dealer in Asian antiquities to leading museums the world over demonstrate the need for rigorous provenance checking of acquisitions. We will continue the 'Six Meaningful Objects' exercise.\n\nprovided text:\n\nArlt, Robert, and Lucie Folan, 'Research and Restitution: the National Gallery of Australia’s Repatriation of a Sculpture from Chandavaram,' _Journal for Art Market Studies,_ vol. 2, no. 2, 2018, pp. 1–17, https://www.fokum-jams.org/index.php/jams/article/view/43, sighted 30 May 2020.\n\n5\\. Conservation Issues for Curators\n\nCurators must have a sound knowledge of conservation principles when handling and displaying artworks. Curators may also be required to contribute to decision-making about the conservation of artworks in their collections. So, what level of conservation training should a curator have, and, conversely, what level of art historical training should a conservator have, so that they can work together harmoniously, to achieve the most appropriate outcomes for artworks? We will consider the case of the c. 2010–2012 restoration of Nicolas Poussin's _Crossing of the Red Sea_ in the National Gallery of Victoria, Melbourne. The repainting of the fairly extensive paint losses was based substantially on the composition recorded in a version attributed to Charles Le Brun, now in a private collection. We will ask how the conservator decided which details of the composition in the private collection version were reliable enough to copy in the repainting of the Melbourne painting, and which were not. And we will ask what role curators played in the decision-making for the restoration of the Melbourne painting.\n\nprovided text:\n\nBenson, Laurie, and Carl Villis, '_The Crossing of the Red Sea_ in the National Gallery of Victoria, Melbourne,' _Kermes,_ anno 27, nos 94–95 (_Nicolas Poussin: Technique, Practice, Conservation_), 2014, pp. 1–10.\n\n6\\. Restitution and Deaccessioning\n\nAs ethics came to the fore in museum operations over the twentieth century, injustices from further and further in the past began to require responses. Eighteenth-century Napoleonic depredations, questionable nineteenth-century British imperial collecting and outright looting, twentieth-century Nazi-era forced sales and confiscations, and the contemporary illicit art trade, all pose challenges to museums' claims to legal title and ethical standards. These issues affect many of the leading art museums in the world today, and in some instances have led to the return of objects. We will examine restitution debates, museum associations’ guidelines on deaccessioning, and recent British and American deaccessioning practices aimed at creating greater diversity in collections.\n\nprovided text:\n\nAssociation of Art Museum Directors, _AAMD Policy on Deaccessioning_, 9 June 2010, amended October 2015, Association of Museum Directors website, https://aamd.org/sites/default/files/document/AAMD%20Policy%20on%20Deaccessioning%20website\\_0.pdf, sighted 11 July 2020.\n\n**II. Curating Exhibitions**\n\n7\\. Biennials, Triennials, and Other Major Recurrent Exhibitions\n\nLarge-scale perennial exhibitions profoundly affected the artworld over the twentieth century, leading Terry Smith and others to redefine contemporary art largely in relation to this phenomenon. However, the long histories of the Paris Salon and the Venice Biennale provide a background for the transformative impact of Harald Szeeman's documenta 5, in 1972, and the subsequent exponential growth of the biennial format internationally. We will focus on the Taipei Biennial, as one of what Anthony Gardner and Charles Green have called the 'second wave' of biennials, which have challenged the North Atlantic metropolitan centres of the art world. \n\nprovided text:\n\nGreen, Charles, and Anthony Gardner, _Biennials, Triennials, and documenta: The Exhibitions that Created Contemporary Art_, Chichester: Wiley-Blackwell, 2016 (chapter 4 '1989: Asian Biennialization,' pp. 110–43).\n\n8\\. Blockbusters and 'Focus' Exhibitions\n\nBlockbusters may be critically impugned, but are indisputably of considerable operational importance to many large museums in the West. These big exhibitions typically consist of high-profile loans from a single institution, and are intended to attract large attendances. The _Treasures of Tutankhamun_ exhibition that toured six venues in the United States between 1976 and 1979, drawing more than 8,000,000 visitors, is a key early example of the genre. One justification given for blockbusters is that they cross-subsidize more research-intensive, and less popular, 'focus' exhibitions. We will consider how the National Palace Museum, Taipei, balances the popular appeal of blockbusters and the scholarly value of 'focus' exhibitions.\n\nprovided texts:\n\nJune Chi-Jung Chu, 'The Relationship Between Museums and Blockbuster Exhibitions: A Case Study of Taiwan,' paper presented at Museum 2015 Tokyo: the Agile Museum, Meiji University, Tokyo. 13–16 January 2015, published on the Academia website, https://www.academia.edu/10403020/The\\_relationship\\_between\\_museums\\_and\\_blockbuster\\_exhibitions\\_a\\_case\\_study\\_of\\_Taiwan, sighted 18 July 2020.\n\nO’Reilly, Chiara, and Anna Lawrenson, 'Revenue, Relevance and Reflecting Community: Blockbusters at the Art Galley of New South Wales,' _Museum & Society_, November 2014. vol. 12, no. 3, pp. 157–70, accessed online, https://journals.le.ac.uk/ojs1/index.php/mas/article/view/257, sighted 18 July 2020.\n\n9\\. Exhibition Design\n\nDisplays of artworks, artefacts, and objects have changed considerably over time, through such major genres as the _kunstkammer_, the salon hang, the traditional gallery hang, the white cube, and site-specific and immersive installations. In this session, studenets will study the history of collection and exhibition displays. Then, students will be given a demonstration of Ortelia Curator exhibition design software, and hands-on experience, to create their own exhibition designs for your assignments.\n\nprovided text:\n\nDorothee Richter, 'A Brief Outline of the History of Exhibition Making,' _ONCURATING.Org_, issue 6 (1, 2, 3, - - - Thinking about Exhibitions), \\[2010\\] pp. 28–37.\n\n10\\. Audience Focus: 'The Dictatorship of the Viewer'?\n\nA major development in museums since the end of the twentieth century, has been a shift from the focus on exhibits, to audiences, with increasing emphasis on attendance figures and engagement metrics, justifiable with reference to such seemingly unimpeachable principles as access and inclusion, and finding points of comparison in art movements such as Relational Aesthetics. Nevertheless, American art critic Hal Foster has recently written of a divide that has emerged between 'scholarly curators and flashy exhibition-makers.' We will consider the role of spectacle in contemporary exhibition-making, with reference to acclaimed examples, such as the Turbine Hall commissions at Tate Modern, London, since 2000, examples that divided opinion, such as the 2003 Venice Biennale _Dreams and Conflicts: The Dictatorship of the Viewer,_ as well as the much criticised _Björk_ exhibition at the Museum of Modern Art, New York, in 2015.\n\nprovided texts:\n\nFoster, Hal, _What Comes after Farce?: Art and Criticism at a Time of Debacle_, London and New York: Verso, 2020, ('Exhibitionists', pp. 114–23). \n\nRugoff, Ralph, '50th Venice Biennale,' _Frieze_, issue 77, 2003, p. 94.\n\n**III. Curatorial Relationships** \n\n11\\. Curators and Artists\n\nThere is a tension at the heart of the curator-artist relationship, arising from the curator's inevitable imposition of meaning on an artwork through the influence they have over how it is displayed, which is in contrast with the autonomy traditionally ascribed to artistic expression. Worse, curators are sometimes criticized as artistic 'gatekeepers,' promoting art that is to their taste, or guarding a coterie of artists who they promote in exchange for preferential treatment in the display of the artists' works. We will focus on the phenomena of artists pre-empting such oppositions, by taking on the role of curators themselves, in such memorable examples as Marcel Broodthaers’ _Musée d’Art Moderne—Département des Aigles_ (_Museum of Modern Art—Department of Eagles_) an incarnation of which was shown in the artist's house in Brussels, in 1968, _Raid the Icebox 1 with Andy Warhol_ at the Rhode Island School of Design Museum of Art, Providence, in 1970, Hans Haacke’s _Manet-PROJEKT’74_, at the Paul Maenz Gallery, Cologne, in 1974, and Claes Oldenburg's _Mouse Museum_ and _Ray Gun Wing,_ at the Museum Ludwig, Cologne, in 1977. We will consider how appropriate the phrase 'Institutional Critique' is as a descriptor of such  interventions. Consideration will also be given to artist-run spaces as another way for artists to attempt to circumvent curatorial control.\n\nprovided text:\n\nSmith, Terry, _Thinking Contemporary Curating_, New York: Independent Curators International 2012 (chapter three: 'Artists as Curators/Curators as Artsist,' pp. 101–38).\n\n12\\. Curators and the Academy\n\nWe will begin with more assignment presentations. Then, we will discuss the role of research in curating. We will ask whether museum curators necessarily share the aim of academics, to produce new knowledge, and whether curators enjoy the same degree of intellectual independence as academics. We will consider what makes an exhibition scholarly, and how scholarship is manifest in museum publications.\n\nprovided text:\n\nGaskell, Ivan, 'Magnanimity and Paranoia in the Big Bad Art World,' in _The Two Art Histories: The Museum and the University_, Charles W. Haxthausen (ed.), Williamstown MA: Sterling and Francine Clark Art Institute 2002, pp. 14–24.\n\n13\\. Curators and Society: The Curatorial\n\nWe will begin with more assignment presentations, if necessary. Then, we will discuss the transition from the traditional idea of the curator as a politcally-neutral 'public servant' to the growing politically-engaged curator paradigm. Is 'the curatorial' dedicated to virtuously serving increasingly diverse audiences, and enhancing access to art for marginalised groups within society? Does the approach also serve its own ends, whether by substituting social values for artistic ones, equating intellectual rigour with elitism, and justifying such approaches with 'motherhood' statements that noone can disagree with?\n\n**IV. Curatorship in the Asia-Pacific Region**\n\n14\\. Taiwan's Local, Regional, and International Identities, and the Role of Governments\n\nIf required, we can begin with more assignment presentations. Then, we will consider three Taiwanese experiences of internationalization. First, at the local level. the artist and curator-run space VT Artsalon, in Taipei, has embarked on an ambitious program of exhibitions with international collaborators. Second, the Southern Branch of the National Palace Museum, Taibao, has been formed by competing politics and evolving policies to foster economic development in the south of Taiwan, as well as pursuing exhibition programs and collecting stategies that position Taiwan as a cultural hub in Asia. Third, we will learn about Taiwanese artists included in the Asia-Pacific Triennial of Contemporary Art in Brisbane, and how their identities were represented. We will also assess how the region's various forms of government impact on the curating of exhibitions, through legislation, policy, funding, and censorship. \n\nProvided texts:\n\nHiroyuki, Arai, Iwasaki Sadaaki, Okamoto Yuka, and Nagata Kozo (eds), _Non-freedom of Expression—A Long Trail for Liberation_, exh. cat., Museum of Contemporary Art, Taipei, 18 April–7 June 2020.\n\nWei Chu-Chiun, 'From National Art to Critical Globalism: The Politics and Curatorial Strategies of the Taiwan Pavilion at the Venice Biennale,' _Third Text_, vol. 27, no. 4, 2013, pp. 470–84.\n\nWu Chiah-Hsuan, 'Curation as the Medium: An Analysis of Taiwan's Post-alternative Spaces' International Links: The Example of VT Artsalon,' in: _Very Period: 1997–2017, Taiwanese Contemporary Art and VT Artsalon_, Wu Chia-Hsuan (ed.), Taipei: Garden City Publishers, 2017, pp. 68–94.\n\n15\\. Indigeneity in Postcolonial Societies\n\nIn the last group session, we will address issues arising from the curating of indigenous cultures, in postcolonial societies in the Asia-Pacific region. This will be followed by a course review quiz and reflection.\n\nProvided text:\n\nMcintyre, Sophie, 'Navigating ‘Austronesia': Contemporary Indigenous Art from Taiwan and the Pacific,' _Art Monthly_, no. 232, August 2010 ('Bountiful OzPacifica' Issue), pp. 45–48.\n\n16–18. Individual Consultations\n\nThe last three sessions of the course are set aside for individual consultations with the professor to discuss research, writing, and presentation of the final assignment. \n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=5bd149e557544266be3a7f0c727b114d&fno=510db34240ce4d779672584ffdad5dc9)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "There will be an approximately one hour presentation by the professor in 15 sessions."
        },
        {
            "type": "討論法",
            "note": "The professor or a student giving their class presentation will lead a one-to-two hour discussion in 15 sessions, based on key readings from the bibliography, as well as the individual student assignment work-in-progress presentations."
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": "There will be a groupwork project to locate and categorize art ex-hibiting organizations in Taipei. And in the final session there will be a groupwork quiz on the course content."
        },
        {
            "type": "實地考察、參訪",
            "note": "There will be a site visit to Taipei Biennial at the Taipei Fine Arts Museum, and other exhibitions, depending on availability, to analyse exhibition conceptualization and design."
        },
        {
            "type": "媒體融入教學",
            "note": "Throughout the course, students will be provided with digital copies of the course guide, the Academic Writing for Art History guide, Powerpoint presentations containing images and texts to be discussed in class, the provided readings, and access to Oretlia Curator exhibition design software."
        },
        {
            "type": "專題研究",
            "note": "A number of session topics contain case studies concerning museums, exhibitions, or museum projects, that will be presented by the professor in Powerpoint presentations, accompanied by provided readings from the literature."
        },
        {
            "type": "其他",
            "note": "In the last three sessions, students are invited to make an appointment with the professor for an individual consultation about their assignments."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 80,
            "note": "There is one assignment in three parts: Part 1 is to write a scholarly exhibition essay and catalogue, worth 40%; Part 2 is to write four exhibition didactic wall texts, worth 20%, and Part 3 is to present an exhibition concept and design using Ortelia Curator or similar software, worth 20%."
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "This mark is derived from an assessment of attendance, punctuality, and the quality of contributions to class discussion and activities, especially as demonstrating engagement with one of provided texts in the sessions."
        }
    ],
    "prerequisite": "",
    "general_core": []
}