{
    "year": 109,
    "term": 1,
    "name": "Ｄｕｒｅｒ與義大利專題研究",
    "teachers": [
        "Candida",
        "Syndikus"
    ],
    "department": "TM67",
    "code": "AHM0153",
    "credit": 3,
    "serial": 3138,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 1,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "青田405室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "By accompanying the prominent German painter, printmaker, and art theorist Albrecht Dürer on his way across the Alps to Venice, this course will provide a comparative view of two major cultural centers of the Late Middle Ages and the Renaissance in Germany and Italy. On the basis of relevant case studies, the artistic scenes of Nuremberg and Venice will be explored and contrasted. Although Dürer’s œuvre will be in the focus of interest, selected works of Dürer’s contemporaries in Germany and Italy will be thoroughly studied, too. \nThe course theme further offers a broad range of topics that help understand the diversity and mutual impact of the cultural areas north and south the Alps. Dürer’s special interests, which were determining factors for his two Italian journeys, undertaken in the years 1494–95 and 1505–07, will serve as a red thread for the course. As a consequence, special attention will be on the following topics: The expansion of Humanism in literature, philosophy and the arts; the development of (linear) perspective in Italian and German Renaissance art; the research of the human body by means of anatomy, as it was taught at the Universities of Padua and Venice; the development of printing and book-production in Venice, Nuremberg and other European cities.",
    "goals": [
        "擬至西方藝術重鎮進行境外教學，實際觀看藝術作品，落實風格與形式分析研究之教學，培養學生鑑識作品的能力。",
        "增進對Dürer之藝術以及文藝復興時期西方藝術的南、北交流與相互影響之認知。"
    ],
    "syllabus": "1.        Germanyand Italy in the Late Middle Ages and Renaissance—A Comparative View(Introduction)\n\n2.        Fifteenth-Century Painting in SouthernGermany\n\n3.        On the Road to Venice: Dürer’s Topographical Watercolors\n\n4.     “He is still the bestpainter”—Giovanni Bellini, Andrea Mantegna and Fifteenth -Century Art inVenice\n\n5.        Dürer’s Self-Portraits: 1493 (Paris,Louvre Museum); 1498 (Madrid, Prado Museum); 1500 (Munich, Alte Pinakothek)\n\n6.        The _Fondacodei Tedeschi_ at the Rialto Bridge—Trading Center and Living Quarters of theGermans in Venice\n\n7.        The Venetian Altarpiece around 1500\n\n8.        Dürer’s _Feast of the Rosegarlands_ at San Bartolomeo, 1506 (NationalGallery, [Prague](https://en.wikipedia.org/wiki/Prague))—GermanArt for a Venetian Church\n\n9.        Rome as a Model—The Study of Classical Artin Fifteenth-Century Italy\n\n_10._    _Dürer as Book Illustrator_\n\n11.    Book-Art in Venice around 1500\n\n12.     Map-Makingin Nuremberg and Venice: Jacopo de’ Barbari’s woodcut map (1500) and HartmannSchedel’s _NurembergChronicle_ (1493)\n\n13.    Art and Anatomy—The Faculty of Medicine atthe University of Padua and its Impact on the Arts\n\n14.     Printmaking in Germany:Schongauer, the “pretty Martin”\n\n_15._    Albrecht _Dürer and the Italian Printmaker Marcantonio Raimondi: German and Italian PrintingCulture—Inspiration and Rivalry_\n\n_16._    _Art Theory South and North the Alps: The Invention of Linear Perspective_\n\n_17._    _Dürer as an Art Theorist—Canons of Proportion and Geometrical Construction_\n\n_18._    _Dürer and his Legacy_",
    "methodologies": [
        {
            "type": "講述法",
            "note": "30 % ex-cathedra-teaching (communication of relevant learning contents)"
        },
        {
            "type": "討論法",
            "note": "35 % group discussion"
        },
        {
            "type": "問題解決教學",
            "note": "Substantial part of the teaching are: 1) Analysis approaches and methods concerning artworks and their cultural, political, and economic backgrounds, and 2) Instruction of how to read respective original sources and secondary literature."
        },
        {
            "type": "合作學習",
            "note": "Students are taught how to discuss together course contents, research topics and methodological approaches."
        },
        {
            "type": "實地考察、參訪",
            "note": "Visits to museums might be part of the course"
        },
        {
            "type": "媒體融入教學",
            "note": "PowerPoint Presentation, E-learning"
        },
        {
            "type": "專題研究",
            "note": "35 % case studies"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 10,
            "note": "Homework: preparation of topics, weekly reading."
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "Discussion of art works and texts (original sources, secondary literature). |\nca. 30 min. discussion after each presentation."
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Weekly attendance at the course is required."
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "30–45 min. presentation with PowerPoint of the term paper topic; ca. 30 min. discussion after each presentation."
        },
        {
            "type": "專題",
            "weight": 50,
            "note": "Term paper of ca. 15 pages to be submitted toward the end of the semester."
        }
    ],
    "prerequisite": "",
    "general_core": []
}