{
    "year": 109,
    "term": 1,
    "name": "圖像學",
    "teachers": [
        "哈德森"
    ],
    "department": "TM67",
    "code": "AHM0020",
    "credit": 3,
    "serial": 3132,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 1
    },
    "schedule": [
        {
            "day": 4,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "青田405室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "In art history, 'iconography' can be said to be the identification of the subject matter or meaning of images. The term 'iconology' is sometimes used to refer specifically to the wider study of the significance of images in their cultural contexts. The two practices are inter-related, and for the purposes of this course, the term 'iconography' refers to any interpretation of the subject matter, meaning, or significance of images.\nThis course will investigate how iconography has been formulated and practiced by some of the leading figures in academic art history since the late nineteenth century. It will begin with an historical account of the Hamburg School of art history, and the scholarship of its pioneers, Aby Warburg and Erwin Panofsky. You will be shown how the identification of the subject matter of artworks, and appraisal of their cultural significance, through the study of textual and visual sources, became central concerns of art history.\nSubsequently, you will study the application of iconographic methodology to prehistoric, Classical, and early modern Christian images. We will then use this knowledge in a two-week groupwork project to identify the subjects of unidentified or minimally identified early modern prints. This will be followed by a series of weekly case studies comparing iconographic interpretations of individual artworks by various scholars. Through this process, you will identify when two or more interpretations of an artwork are independent of each other, complementary, or competing. In addition, you will assess the evidential basis of iconographic analyses, to determine which, among competing analyses, is the more persuasive.\nThe course will conclude with a comparison of iconography and semiotics, and a consideration of the limits of iconography in the study of contemporary art.",
    "goals": [
        "For students to acquire a knowledge of the historical origins of iconography in the field of art history",
        "For students to acquire skills in iconographic analysis",
        "For students to be able to discern when iconographic analyses of a work of art by various scholars are independent, complementary, or competing.",
        "For students to be able to verify, question, or reject evidence presented in support of iconographic interpretations in the literature.",
        "For students to be able to present their own iconographic analyses, orally and in writing, following common academic conventions of form and content.",
        "For students to recognize the areas in the study of art in which the application of iconographic analysis is conventional, and those in which it is less applicable."
    ],
    "syllabus": "**Schedule of Session Topics** (To download a PDF of the course guide, click on the link at the bottom of this section.)\n\n1\\. Introduction\n\nIn the first session, students will receive electronic copies of the course guide and the Academic Writing for Art History guide, and will be given an overview of the course content, and an explanation of the assessment. This will be followed by definitions of key, course-specific terminology. Then, students will be given a presentation providing a brief survey of some precursors to academic iconography, such as Cesare Ripa's _Nova iconologia_ (Padua: Pietro Paulo Tozzi 1618), illustrating some of the ways the symbolic content of images has been interpreted, whether or not systematically, in early modern Europe.\n\n2\\. Aby Warburg: Iconography and _Pathosformel_\n\nIn this session, we will read Aby Warburg’s study of Botticelli’s _Birth of Venus_ (Galleria degli Uffizi, Florence). Warburg confirmed the identifications of the figures in the painting made by earlier scholars, with reference to the Classical and Renaissance texts he argued the artist probably drew upon to devise the composition. In addition, Warburg cited a number of Classical images and texts he thought the artist was inspired by to give his image an expressive feeling of lively movement—an example of _pathosformel_. Warburg developed this approach in his later creation of the Mnemosyne Atlas, a visual tool developed to trace the recurrence of certain kinds of images in various cultures over time. Although aspects of Warburg's approach to the interpretation of art historical images has sometimes been viewed as idiosyncratic, his dedication to understanding the history of image cultures, and the extensive library he amassed in order to pursue this research arguably made a significant contribution to the development of academic art history in general, and iconography as one of its chief concerns, in particular.\n\nprovided text:\n\nWarburg, Aby, ‘Sandro Botticelli's _Birth of Venus_ and _Spring_: An Examination of the Concepts of Antiquity in the Italian Early Renaissance (1893),’ in _The Renewal of Pagan Antiquity: Contributions to the Cultural History of the European Renaissance_, with an introduction by Kurt W. Forster, translated by David Britt, Los Angeles: Getty Research lnstitute for the History of Art and the Humanities 1999, pp. 89–156.\n\n3\\. Erwin Panofsky's Codification of Iconographic Methodology\n\nErwin Panofsky was, to a considerable extent, responsible for the establishment of iconography as a key discipline in art history, formulating a structured method of iconographic analysis. His own iconographic studies of Renaissance images remain among the most renowned, even if they have sometimes had a mixed critical fortune. In particular, generations of art historians have debated the validity of Panofsky's theory of disguised symbolism in early Netherlandish art. Nevertheless, the fact that so many leading scholars have felt compelled to reappraise Panofsky's interpretations, demonstrates the prominent role he has played in the field of iconographic studies.\n\nprovided texts:\n\nNash, Susie, 'Erwin Panofsky's _Early Netherlandish Painting. Its Origins and Character_, 1953,' in _The Books that Shaped Art History: From Gombrich and Greenberg to Alpers and Krauss_, Richard Shone and John-Paul Stonard (eds), London: Thames and Hudson 2013, pp. 88–101 (especially pp. 98–99).\n\nPanofsky, Erwin, _Studies in Iconology: Humanistic Themes in the Art of the Renaissance_, New York: Oxford University Press 1939 ('Introductory,' pp. 1–8).\n\nPanofsky, Erwin, _Early Netherlandish Painting. Its Origins and Character_, Cambridge MA: Harvard University Press 1953 (chapter 5: 'Reality and Symbol in Early Flemish Painting: “Spiritualia sub metaphoris Corporalium,”’ pp. 131–48).\n\n4\\. Iconography, Gender, and Sexuality in Prehistoric Figurines\n\nIn anthropology, the 'symbolic revolution,' in which humans first developed the use of images to communicate meanings, has often been identified as a defining stage in the development of human society, distinct from the animal kingdom. Although, some argue for the primacy of verbal communication of symbolic meaning. In any case, one might assume that the earliest images had simple meanings. However, recent scholarship finds some examples of surprising sophistication. Many of the most renowned examples of prehistoric carving have clear sexual content, such as the celebrated Hohle Fels _Woman_dating from 28,000–25,000 B.C. (Naturhistorisches Museum, Vienna). Traditionally, scholarship has classified such imagery as either female or male. Recently, however, some scholars have argued that many figurines are intentionally ambiguous, displaying female and male forms, depending on the angle from which they are viewed. Other aspects of the figurines have been interpreted as representations of women's technologies.\n\nprovided text:\n\nNowell, April, and Melanie L. Chang, ‘Science, the Media, and Interpretations of Upper Paleolithic Figurines,’ _American Anthropologist_, vol. 116, no. 3, 2014, pp. 562– 77.\n\n5\\. Classical Iconography\n\nWe will study the identification of the twelve 'canonical' gods in Classical Greek and Roman sculpture, painting, ceramics, and other media. A principal focus of our discussion will be the pediment, metope, and frieze sculptures, and the lost cult statue of the Parthenon in Athens. As well as the identification of individual figures, we will consider the significance of the programs of decoration in and around the building, especially as they would have been experienced in ritual processions.\n\nprovided text:\n\nNeils, Jenifer, ‘Reconfiguring the Gods on the Parthenon Frieze,’ _The Art Bulletin_, vol. 81, no. 1, March, 1999, pp. 6–20.\n\n6\\. Christian Iconography\n\nWe will use Albrecht Dürer's major print series _The Life of the Virgin_ and _The Engraved Passion_ to begin our exploration of Christian iconography, comparing Dürer's treatment of his subjects with examples in other media by medieval and Renaissance artists. This will be supplemented with images of the Apostles, the Evangelists, and saints. An introduction to Princeton University’s ‘Index of Medieval Art’ will also be provided.\n\nprovided text:\n\nHudson, Hugh, ‘Paradise for Ever: More on the Patronage and Iconography of the ‘Triptych with the Miracles of Christ’ in the National Gallery of Victoria,’ _Oud Holland_, vol. 126, no. 1, 2013, pp. 1–16.\n\n7\\. Iconography Groupwork Project, Part 1: Identifying Unidentified or Minimally Identified Early Modern Images\n\nWorking in groups of two or three, you will choose from a selection of early modern prints in the collection of the National Gallery of Victoria, in Melbourne. Using the knowledge gained in previous sessions, augmented by online research resources, you will try to devise more precise titles for the works than their current ones.\n\n8\\. Iconography Groupwork Project, Part 2: Presentations and Discussion\n\nEach group will give an approximately 30 minute presentation to the class on the works assigned to them in the last session, and the results of their iconographic analyses.\n\n9\\. Rival Interpretations of Petrus Christus’ _Virgin of the Dry Tree_\n\nChristus' tiny panel painting _Virgin of the Dry Tree_ (Museo Thyssen-Bornemisza, Madrid), depicting the Virgin and Child within the bare branches of a thorny bush, may seem at first sight a straightforward, sacred image. However, there are various interpretations of its distinctive branches. Art historians are in agreement that the whole image depicts the emblem of the religious Confraternity of the Dry Tree, to which, incidentally, Christus belonged. However, Maryan Ainsworth, and others, have seen the confraternity's emblem as deriving from scripture, whereas Hugo van der Velden argued for a more direct link with a putative lost sculptural cult image in a real tree. But if the dry tree image in the painting refers to a real tree, why does a not dissimilar dry tree motif appear in the design for a tabard of a provost of the Confraternity of the Holy Blood, also from Bruges? We will consider whether one of the published interpretations is more compelling, whether they are actually mutually exclusive, and whether there might be yet another explanation.\n\nprovided texts:\n\nAinsworth, Maryan W., with contributions by Maximiliaan P.J. Martens, _Petrus Christus: Renaissance Master of Bruges_, exh. cat., Metropolitan Museum of Art, New York, 14 April–31 July, 1994, New York: Metropolitan Museum of Art 1994 (cat. '18. Madonna of the Dry Tree,' pp. 162–65).\n\nVan der Velden, Hugo, ‘Petrus Christus's Our Lady of the Dry Tree,’ _Journal of the Warburg and Courtauld Institutes_, vol. 60, 1997, pp. 89–110.\n\n10\\. Hieronymus Bosch: Alchemical Versus Christian Interpretations \n\nBosch's imagery is surely among the most bizarre and intriguing in all of Western art history, notwithstanding that it usually contains clearly Christian or moralizing subject matter or associations. We will take as a case study, the _Garden of Earthly Delights_ triptych (Museo del Prado, Madrid), said by Laurinda S. Dixon to contain numerous allusions to alchemy, while Joseph Leo Koerner has explained its fantastic imagery in terms of warnings of the threat to Christians posed by the devil.\n\nprovided texts:\n\nDixon, Laurinda S., _Bosch_, London and New York: Phaidon Press Limited 2003 (chapter 8: 'Science and Salvation: _The Garden of Earthly Delights_ Triptych,' pp. 227–77).\n\nKoerner, Joseph Leo, _Bosch and Bruegel: From Enemy Painting to Everyday Life_, Princeton and Oxford: Princeton University Press 2016.\n\n11\\. Bellini, Dossi, and Titian's _Feast of the Gods_ and the Role of Conservation Evidence in Iconographic Analysis\n\nAs charming an image as Bellini, Dossi, and Titian’s _The Feast of the Gods_ (National Gallery of Art, Washington) has naturally attracted much attention from art historians. In some cases, recognisable attributes easily identify some of its figures as Classical gods, but others are not so clearly identifiable, and the question of whether the composition as a whole derives from a particular source remains open. Conservation evidence from microsamples, x-radiography, and infrared reflectography helps to reconstruct the evolving form of the composition over its complex history of execution, by as many as three artists, according to some leading scholars. But does conservation evidence help clarify iconographic issues as well? We will compare Edgar Wind's and Susan Nalezyty’s interpretations of the painting, in light of these questions.\n\nprovided texts:\n\nBull, David, and Joyce Plesters, _The Feast of the Gods: Conservation, Examination and Interpretation_, Washington, 1990.\n\nNalezyty, Susan, ‘Giovanni Bellini's “Feast of the Gods” and Banquets of the Ancient Ritual Calendar,’ _The Sixteenth Century Journal_, vol. 40, no. 3, Fall, 2009, pp. 745–68.\n\nWind, Edgar, _Bellini's Feast of the Gods: A Study in Venetian Humanism_, Whitefish MT 2007.\n\n12\\. Giorgione’s ‘Myth and Enigma’\n\nGiorgione's _Tempest_ (Galleria dell’Academia, Venice) is surely among the most discussed paintings of all time. Of the countless interpretations, we will examine the classic study of Salvatore Settis, and the more recent one of Rudolf Schier, and ask whether it is certain that the painting has a unified subject at all.\n\nprovided texts:\n\nSchier, Rudolf, 'Giorgione's _Tempesta_: A Virgilian Pastoral,' _Renaissance Studies_, vol. 23, no. 4, 2008, pp. 476–506.\n\nSettis, Salvatore, _Giorgione’s_ Tempest_: Interpreting the Hidden Subject_, translated by Ellen Bianchini, Chicago: University of Chicago Press 1990.  \n\n13\\. Titian’s Women\n\nPanofsky’s lofty iconographic interpretation of Titian’s _Sacred and Profane Love_ (Galleria Borghese, Rome) is another of his classic, erudite studies that is so thoroughly embedded in art historical consciousness of the work that virtually every author who has written about the painting since has had to address Panofsky's study, even if only to criticise it. We will compare Panofsky's philosophical interpretation with the more worldly interests of Rona Goffen and Deborah Howard.\n\nprovided texts:\n\nGoffen, Rona, _Titian's Women_, New Haven CT: Yale University Press 1997 (chapter: 'Titian's _Sacred and Profane Love_ and Marriage,' pp. 33–44).\n\nHoward, Deborah, ‘Contextualising Titian’s “Sacred and Profane Love”: The Cultural World of the Venetian Chancery in the Early Sixteenth Century,’ _Artibus et Historiae_, vol. 67, 2013, pp. 185–99.\n\nPanofsky, Erwin, _Studies in Iconology, Naturalistic Themes in the Art of the Renaissance,_Oxford: Oxford University Presss 1939, pp. 148–60.\n\n14\\. Albrecht Dürer’s _Melencolia I_\n\nThe wealth of complex, curious, and sometimes bizarre imagery in this celebrated print seems designed to test the viewer's mental accuity. A classic interpretation is that of Raymond Klibansky, Erwin Panofsky, and Fritz Saxl, which we will compare with the more recent interpretation of Philip M. Sohm.\n\nProvided texts:\n\nKlibansky, Raymond, Erwin Panofsky, and Fritz Saxl, _Saturn and Melancholy: Studies in the History of Natural Philosophy, Religion and Art_, London: Nelson 1964.\n\nSohm, Philip M., ‘Dürer's “Melencolia I”: The Limits of Knowledge,’ _Studies in the History of Art_, vol. 9, 1980, pp. 13–32.\n\n15\\. Homoeroticism or its Absence in Caravaggio’s Male Subjects\n\nArt historians began to discuss in depth the potentially homoerotic content of early modern images from the 1970s. Subsequently, distinctions were made between homoerotic and homosocial content. After half a century or so, where has the discussion led? We will consider studies of Caravaggio's images of young and old men, proposed by David Posner, Leo Bersani and Ulysee Dutoit, and Genevieve Warwick. Among the questions we will ask is what relevance an artist's biography has in the interpretation of their works.\n\nIn this last group session, we will conclude with a consideration of how iconography relates to semiotics, and a discussion of the extent to which iconography is or is not a pertinent analytical technique in the study of contemporary art. This discussion will be followed by a review quiz of the course content. The quiz is not formally assessed, but does contribute to your mark for course preparation, attendance, and participation.\n\nprovided texts:\n\nBersani, Leo, and Ulysee Dutoit, _Caravaggio’s Secrets_, Cambridge MA and London: MIT, 1996.\n\nPosner, David, ‘Caravaggio’s Homoerotic Early Works,’ _Art Quarterly_, vol. 34, 1971, pp. 301–24.\n\nWarwick, Genevieve, ‘Allegories of Eros: Caravaggio’s Masque,’ in _Caravaggio: Realism, Rebellion, Reception_, Genevieve Warwick (ed,), Newark DE: University of Delaware Press 2006, pp. 82–90.\n\n16–18. Individual Consultations\n\nThe last three sessions of the course are set aside for individual student consultations with the professor to discuss research, writing, and presentation of the final assignment. \n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=26a30f895a17489592755591327c81d9&fno=9207dac4839649abb07993563ed5c449)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "An approximately one hour presentation in 13 sessions, by the Professor"
        },
        {
            "type": "討論法",
            "note": "A one-to-two hour discussion in 13 sessionss, led by the Professor or students giving their class presentation, based on set readings and the case studies listed in the weekly schedule of this syllabus"
        },
        {
            "type": "問題解決教學",
            "note": "A non-assessed groupwork project will be undertaken over two weeks, to identify the iconography of unidentified or minimally identified  early modern prints online"
        },
        {
            "type": "合作學習",
            "note": "Students in the class are required to ask questions and engage in discussion after each other’s class presentations, and so assist each other to explore their topics. In the final session, there will be a non-assessed groupwork review quiz on the course content."
        },
        {
            "type": "媒體融入教學",
            "note": "Students will be provided with electronic copies of the course guide, Academic Writing for Art History guide, Powerpoint presentations containing images and texts to be discussed in the sessions, and key texts from the literature, as detailed in the Weekly Schedule of Topics, and they will be shown documentaries in class on course topics."
        },
        {
            "type": "專題研究",
            "note": "The majority of session topics contains one or more case studies of iconographic analysis, introduced by the professor or by students giving their class presentations."
        },
        {
            "type": "其他",
            "note": "In the last three sessions, students are invited to make an appointment with the professor for an individual consultation about their assignments, before submission."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 50,
            "note": "A written paper, in essay form, between 10 and 14 pages long, excluding the bibliography and appendices"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "An oral presentation, with visual aids, of around 45 minutes"
        }
    ],
    "prerequisite": "",
    "general_core": []
}