{
    "year": 110,
    "term": 2,
    "name": "書報討論",
    "teachers": [
        "張俊傑"
    ],
    "department": "HM77",
    "code": "OEC8159",
    "credit": 2,
    "serial": 1138,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 7,
            "to": 8,
            "campus": "公館",
            "classroom": "應用科學大樓B1演講廳"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "允許重複修 ◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 2,
    "description": "",
    "goals": [
        "To enable students to understand the latest developments and trends in various fields of optoelectronic engineering and technology.",
        "Learn professional ethics and service concepts through expert speeches.",
        "From the discussion process, learn to analyze and solve problems\nThrough open-ended discussions, students learn communication skills and a cooperative attitude.",
        "From the discussion process, learn to analyze and solve problems\nThrough open-ended discussions, students learn communication skills and a cooperative attitude.",
        "Student research and dissertation study reports to strengthen foreign language communication skills."
    ],
    "syllabus": "【Teaching method: 16+2 weeks】\n\nThis course is mainly to provide students with a platform for optoelectronic engineering and technology discussion and to share ideas and discussions with experts and scholars to further stimulate the learning field to further broaden the learning and mutual learning effect. Students can share and report their experiences through the lectures of academic experts, current research progress reports, and research journal articles.\n\nWeek1        Introduction\n\nWeek2-15   Sharing by experts and scholars\n\nWeek16       Final report\n\nWeek17-18  Self-learning",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "Invite experts and scholars to give speeches"
        },
        {
            "type": "Group discussion",
            "note": "The course adopts open-ended discussion, encourages students to ask questions and gives extra points."
        },
        {
            "type": "Problem base learning",
            "note": "Open discussion allows published students to address their problems."
        }
    ],
    "grading": [
        {
            "type": "Class discussion involvement",
            "weight": 30,
            "note": ""
        },
        {
            "type": "Attendances",
            "weight": 70,
            "note": ""
        }
    ],
    "prerequisite": "The course can be retaken ◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}