{
    "year": 110,
    "term": 1,
    "name": "社會領域課程概論",
    "teachers": [
        "蘇淑娟"
    ],
    "department": "LU23",
    "code": "GEU0241",
    "type": "選",
    "grade": null,
    "credit": 2,
    "serial": 1978,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 5
    },
    "schedule": [
        {
            "day": 5,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "正106"
        }
    ],
    "programs": [],
    "comment": "限大三、大四選修。    必須先修過「社會領域課程概論」，才能修「社會領域探究與實作」。",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "十二年國教課程的社會學習領域是傳統社會科教學與教育的改革契機，藉由本課程我期望能引導學習者：(1)深刻認識、批判九年一貫教育及十二年國教的社會領域及其對教師教學方式及理念上的影響；(2)熟悉分段能力指標，並能據以貼切設計、發展相符應的具體學力指標與教學課程內容，以為教師作為進一步增長個人教學知能之基本訓練；(3)熟諳校本位教學內容發展的方法及其意義；(4)熟悉社會領域研究議題的教學與野外實察設計，以回應校本位教學與學生生活經驗為本的社會領域學習。透過課程安排，教師引導學生進行「生活空間尺度」的野外實察活動之設計與實察，反省社會學習領域如何整合以學生生活經驗為本的跨領域的學習內容、並養成跨領域的批判思維。",
    "goals": [
        "認識領域教學概念在社會學科教學的意義與重要性",
        "熟悉分段能力指標，並能據以貼切設計、發展相符應的具體學力指標與教學課程內容",
        "熟諳校本位教學內容發展的方法及其意義",
        "熟悉社會領域研究議題的教學與野外實察設計工作",
        "能反省社會學習領域如何整合以學生生活經驗為本的跨領域學習內容、並養成跨領域的批判思維"
    ],
    "syllabus": "十二年國教課程的社會學習領域是傳統社會科教學與教育的改革契機，本課程將引導學習者：(1)認識九年一貫教育改革及十二年國教的社會領域對教師教學方式及教育理念的影響；(2)熟悉公民素養與能力指標的概念，並據以貼切設計、發展相符應的具體學力指標與社會領域的教學課程內容，以為教師作為增長教學知能之基本訓練；(3)熟諳特色課程/校本位教學發展的方法及其意義，如何成為社會領域的要內涵；(4)熟悉社會領域研究議題的教學與野外實察設計，以回應校本位教學與生活經驗為本的社會領域學習。\n\n透過課程安排，教師引導學生進行「生活空間尺度」的野外實察活動之設計與實察，反省教育的意義與反省社會學習領域如何整合以生活經驗為本的跨領域的學習內容並養成跨領域的批判思維。\n\n我國108年的十二年國民基本教育課程綱要之社會領域之理念，主要為：社會領域的功能為傳遞文化與制度，培養探究、參與、實踐、反思及創新的態度與能力；理念為涵育新世代的公民素養，以培育公民面對各種挑戰時，能做出迎向「共好」的抉擇，並具社會實踐力。《社會領域課程綱要》根植於《十二年國民基本教育課程綱要總綱》「適性揚才、終身學習」之目標，以人文與社會科學相關知識為基礎，循序發展。課程包括「歷史」、「地理」及「公民與社會」三學科的旨趣與探究方法，呈現以下特色：\n\n一、以學生為學習主體，考量不同背景（包括文化、族群、城鄉、性別及身心特質等）學生的多元生活經驗，並兼顧生涯探索及發展，提供自主學習空間。\n\n二、顧及不同地區、族群及學校類型的特色，提供課程發展之彈性。\n\n三、社會領域透過多重策略達成領域內的縱向連貫、區隔與橫向整合：\n\n（一）各教育階段領域/科目皆以涵育公民素養為指引，透過不同主題或形式的探究與實作活動，提供本領域中各科目的協同及議題融入的空間。（二）各教育階段領域/科目皆強調根植於生活世界的體驗與思辨，兼顧知識內容、情意態度與實踐能力的多方面綜合發展。（三）考慮各學習階段的循序發展以及本領域內各科目間互補合作需要，對學習內容做有意義的區隔，避免內容過多與不必要的重複。",
    "methodologies": [
        {
            "type": "講述法",
            "note": "課堂講授與討論"
        },
        {
            "type": "討論法",
            "note": "期中分組報告與討論"
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        },
        {
            "type": "其他",
            "note": "期末報告寫作與展覽"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "討論參與"
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "分組報告"
        },
        {
            "type": "成果展覽",
            "weight": 50,
            "note": "分組報告展覽"
        },
        {
            "type": "專題",
            "weight": 20,
            "note": "個人報告"
        }
    ],
    "prerequisite": "",
    "general_core": []
}