{
    "year": 108,
    "term": 1,
    "name": "財務會計",
    "teachers": [
        "陳天佑"
    ],
    "department": "O",
    "code": "O5M0007",
    "credit": 3,
    "serial": 2492,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 10,
            "to": 12,
            "campus": "本部",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "教室：雲和502室  密集授課：自10/14（一）至11/22（五）每週一、三、五第A-C節上課，詳情請參閱課綱。",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "The course will be taught in lectures and tutorials. Lectures will be used to emphasize concepts and to identify and clarify main points in specific topics. Tutorials will be used to promote discussions and practical applications of concepts taught through exercises. A critical understanding of accounting theory and its application in practice will be developed through lectures and tutorials \n\nGeneric competencies are extremely important for professional accountants and such competencies are influenced since early childhood through parental guidance, peer group influence and the teaching mode adopted in primary and secondary schools.  Universities also have a role to play in ensuring that MBA graduates meet the generic competencies requirement of the major employers in the market.  All accounting courses use innovative teaching strategies, eg. the use of integrated case studies, group discussions, project reports and presentations, to sharpen students’ cognitive or intellectual, behavioural, communication and language skills.  In this course, students build up their professional knowledge and develop their critical thinking skills.  Class discussions as a whole and in small groups of three or four also develop their communication and team-building skills.",
    "goals": [
        "equip students with the basic understanding of the principles and concepts of accounting",
        "develop students’ ability to apply the basic principles of accounting theory for the preparation of financial and related information to meet internal and external obligations",
        "develop students’ understanding of internal control on cash and receivables as a key element of corporate governance"
    ],
    "syllabus": " **Class Schedule**\n\n**session**\n\n**Date**\n\n**Time**\n\n1\n\n2019/10/14(Mon.)\n\n18：40-21：20\n\n2\n\n2019/10/16(Wed.)\n\n18：40-21：20\n\n3\n\n2019/10/18(Fri.)\n\n18：40-21：20\n\n4\n\n2019/10/21(Mon.)\n\n18：40-21：20\n\n5\n\n2019/10/23(Wed.)\n\n18：40-21：20\n\n6\n\n2019/10/25(Fri.)\n\n18：40-21：20\n\n7\n\n2019/10/28(Mon.)\n\n18：40-21：20\n\n8\n\n2019/10/30(Wed.)\n\n18：40-21：20\n\n9\n\n2019/11/01(Fri.)\n\n18：40-21：20\n\n10\n\n2019/11/04(Mon.)\n\n18：40-21：20\n\n11\n\n2019/11/06(Wed.)\n\n18：40-21：20\n\n12\n\n2019/11/08(Fri.)\n\n18：40-21：20\n\n13\n\n2019/11/11(Mon.)\n\n18：40-21：20\n\n14\n\n2019/11/13(Wed.)\n\n18：40-21：20\n\n15\n\n2019/11/15(Fri.)\n\n18：40-21：20\n\n16\n\n2019/11/18(Mon.)\n\n18：40-21：20\n\n17\n\n2019/11/20(Wed.)\n\n18：40-21：20\n\n18\n\n2019/11/22(Fri.)\n\n18：40-21：20\n\n**Course Outline**\n\n1       Accounting and the business environment (Chapter 1) (2 sessions)\n\n2       Recording business transactions (Chapter 2) (2 sessions)\n\n3       Measuring business income: the adjusting process (Chapter 3) (2 sessions)\n\n  Test  (1 session)\n\n4     Completing the accounting cycle (Chapter 4) (2 sessions)\n\n5     Merchandising operations and the accounting cycle (Chapter 5) (2 sessions)\n\n6    Internal Control, managing cash, and making ethical judgments (Chapter 8) (2 sessions)\n\n7        Accounts and Notes Receivable (Chapter 9) (2 sessions)\n\n  Case discussion for assessment in small groups ( 1 session)\n\n  Examination (1 session)\n\n  Examination marking and tabulation of grades (1 session)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Lectures: Concepts and general knowledge of financial accounting are presented by using PowerPoint slides. A two-way communication approach is encouraged. Students are required to read all reading materials before attending class and to ask questions on what they read at the start of each class, after which the instructor will ask questions to ensure that all students come prepared. A macro and micro approach is used on how the specific topic affects the economy, the industry and the firm and a linkage is provided between the topic discussed and other topics in the course. Examples are drawn from various industries in Hong Kong and North America."
        },
        {
            "type": "討論法",
            "note": "Tutorials: Questions for discussion will be raised in the class during the tutorial time. Students work on classic examples during workshops and relevant cases are discussed with the instructor providing overall direction and moderating students’ input. If time permits during tutorials, assignments can be worked on."
        },
        {
            "type": "其他",
            "note": "tside classroom consultation: Additional help will be provided outside of official class time for those needed students. Students’ questions will not be answered directly, but indirectly through a series of questions posed by the instructor, with the answers to each question serving as a stepping stone towards the answer the student is looking for."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 10,
            "note": "Assignments"
        },
        {
            "type": "期中考",
            "weight": 30,
            "note": "Examinations"
        },
        {
            "type": "期末考",
            "weight": 30,
            "note": "Examinations"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "Group Case Discussions in Class"
        },
        {
            "type": "其他",
            "weight": 20,
            "note": "Test"
        }
    ],
    "prerequisite": "",
    "general_core": []
}