{
    "year": 107,
    "term": 1,
    "name": "創新設計（一）",
    "teachers": [
        "曾俊儒"
    ],
    "department": "TU68",
    "code": "VDU0253",
    "credit": 3,
    "serial": 3122,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 5
    },
    "schedule": [
        {
            "day": 4,
            "from": 16,
            "to": 11,
            "campus": "本部",
            "classroom": "設計系2B教室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎必須先修過【VDU0019  電腦繪圖】",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "本課程為設計課程，藉由工作坊形式(workshop)為引導學生藉由草圖、比例模型、基本造型進行設計思考發想(design thinking)、小組討論(group discussion)、動手製作(making)的實體物件與作品發表(presentation)，引導學生實驗與創新，產生新的原創觀點。",
    "goals": [
        "Acknowledge the design process and technology to develop innovation in design",
        "Enrich the basic knowledge in design from different scale and discipline",
        "Cultivate wide range of design concept for innovation design",
        "Develop the skill of solving problems in design field"
    ],
    "syllabus": "The main objective of this course is to inspirestudents to consider issues related to the use of information technology indeveloping intelligent technologies for the user needs. Through basic courseinstruction, students are encouraged to develop and apply their imagination andcreativity to the creation of actual smart products. As such, the coursecontent includes the following: (1) Basic course instruction introducingconcepts in smart products and the integration of different design methods,including wireless transmission technologies, hardware systems planning, andbasic domain knowledge to give students a basic understanding in differentrelevant domains. (2) Field work to familiarize students with existing productsand the current state of development of hardware and software in the smartliving field, and to apply currently mature technologies for the development offeasible innovations. In addition, through onsite investigations and interviewswith potential users, the students will develop a better understanding of userrequirements which will be reflected in an improved design foundation of futureproducts, systems and services. (3) Lectures and seminars hosted by healthcareprofessionals to provide students with a better understanding of clinicalpractice, relevant smart devices, systems and services, and the user needs.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "實驗/實作",
            "note": ""
        },
        {
            "type": "實地考察、參訪",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 20,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 40,
            "note": ""
        }
    ],
    "prerequisite": "◎必須先修過【VDU0019  電腦繪圖】",
    "general_core": []
}