{
    "year": 110,
    "term": 2,
    "name": "藝術史學史",
    "teachers": [
        "諾斯邦"
    ],
    "department": "TM67",
    "code": "AHM0033",
    "credit": 3,
    "serial": 3025,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 3,
            "to": 5,
            "campus": "本部",
            "classroom": "青田406室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "Development of the History of Art and Cognition",
        "Works and Key Discourses in the History of Art and Cognition",
        "Methodology and Related Works in the History of Art and Cognition"
    ],
    "syllabus": "**Art Historiography Spring Semester 2022**\n\n**The course focuses on the history, methods, and trends of the discipline of art history. It develops an understanding of the important theoretical developments that took place in the discipline from the Renaissance to the present. Prominent art historians and their theories are commented through the reading of exemplary texts. Their reception and influence  are analyzed and contextualized. Changing methods of interpretation are carefully examined and compared through the scope of a selection of texts that cover different hermeneutic approaches and perspectives.**\n\n**Course arrangement: 16 + 2 Weeks (16 weeks of in-person session + 2 weeks of flexible individual advising)** \n\n**Week 1: 15 February:**            **Introduction: Presentation of the topics**\n\n**Week 2:  22 February:**           **Common reading and discussion:**\n\n*   Margot and Rudolf Wittkower, “Chapter 5: Genius, Madness, and Melancholy,” in _Born Under Saturn. The Character and Conduct of Artists. A Documented History from Antiquity to the French Revolution_, New York: New York Review Book, 2007, pp. 98-132 (originally published in 1963 by Random House, 1963\n\n**Week 3: 1 March**                   **Common reading and discussion:**\n\n*   Amanda DuPreez, “Approaching Aby Warburg and Digital Art History: Thinking Through Images,” in Kathryn Brown (ed.), _The Routledge Companion to Digital Humanities and Art History_, New York and London: Routledge, 2020, pp. 374-385 \n\n**Week 4: 8 March**                   **Common reading and discussion:**\n\n*   Felix Thürlemann, _More Than One Picture. An Art History of_ the Hyperimage, 2013, (English Translation: 2019), Introduction “Practices of the Hyperimage,” pp. 1-19, and Chapter 2 “Art Historians’ Image Practice,” pp. 87-140 (+ notes, pp. 193-202) \n\n**Week 5: 15 March     Oral presentations: Michael Baxandall, _Patterns of Intention. On the Historical Explanation of Pictures_, New Haven and London: Yale University Press, 1985**\n\n*   1\\. Chapter 2: “Intentional Visual Interest: Picasso’s _Portrait of Kahnweiler_,” pp. 41-73\n*   2\\. Chapter 4: “Truth and Other Cultures: Piero della Francesca’s _Baptism of Christ_,” pp. 105-137\n\n**Common reading:**\n\n*   **“Introduction: Language and Explanation,” pp. 1-11**\n\n**Week 6:  22 March    Presentations: Linda Nochlin,  _Bathers , Bodies, Beauty: The Visceral Eye_, Cambridge: Harvard University Press, 2006**\n\n*   1\\. Chapter 1: “Renoir’s _Great Bathers_: Bathing as Practice, Bathing as Representation,” pp. 3-53\n*   2\\. Chapter 3: “The Man in the Bathtub: Picasso’s _Le Meurtre_ and the Gender of Bathing,” pp. 101-152\n\n**Common reading:** \n\n*   **1\\. “Epilogue,” pp. 293-308**\n*   **2\\. “The Imaginary Orient,” in _Art in America_, 1984, pp. 119-131, and pp. 186-191** \n\n**Week 7: 29 March     Oral presentations: Lorenzo Pericolo, _Caravaggio and Pictorial Narrative. Dislocating the_ Istoria _in Early Modern Painting_, London: Harvey Miller Publishers, 2011**\n\n*   1\\. Part 2: “Blending Genres: Lyrical and Comical Interactions in Caravaggio’s Early Paintings” “Comedy of Errors,” pp. 121-134; and Chapter 4: “Money and Seduction: Narrative Patterns in Caravaggio’s Two Versions of _The Fortune Teller_,” pp. 135-156\n*   2\\. Part 3: “The Misplaced Hero: The Challenge of the _Istoria_ in Caravaggio’s Early Religious Narratives,” “Truth in Painting,” pp. 199-210; and Chapter 7: “_The Calling of Saint Matthew_ in Retrospective: Experimenting with Narrative Disconnections,”  pp. 211-242\n*   3\\. Part 6: “Reaction to Change: The Afterlife of Caravaggio’s Poetics of Dislocation,” “The Black Tide of Caravaggio’s Painting,” pp. 481-494; and Chapter 16: “The Antichrist of Spanish Painting: Diego Velázquez’s _Supper at Emmaus_ and the Two Versions of _La Mulata_,” pp. 517-538 \n\n**Common reading:**\n\n*   **“A Matter of Optics and Rhetoric: The Aporia of Pictorial Narrative Before, During, and After Caravaggio’s Time**\n\n**Caravaggio’s Nonsense,” pp. 15-34**\n\n**Week 8: 5 April          Holyday**\n\n**Week 9:  12 April       Presentations: Victor Stoichita, _The Self-Aware Image. An Insight Into Early Modern Meta-Painting_, 1997 (New, Improved and Updated with an Introduction by Lorenzo Pericolo, Turnhout: Harvey Miller Publishers, 2015)**\n\n*   1\\. Chapter 6: “The Intertextual Machine,” pp. 141-179\n\n**Common reading:**\n\n*   **Chapter 1: “Embrasures,” pp. 39-51**\n\n**Week 10: 19 April**      **Presentations: Alexander Nagel, _Medieval Modern Art Out of Time_, London and New York: Thames & Hudson, 2012** \n\n*   1\\. Chapter 2: “Learning to live without artistic periods,” pp. 22-26; “; Chapter 3: “If you go far back enough, the West is not ‘Europe’,” pp. 27-33; Chapter 4: “Airplanes and altarpieces,” pp. 34-43; Chapter 5: Works become environments and environments become works,” pp. 44-57\n*   2\\. Chapter 7 and 8: “Painting as Second Order Observation,” pp. 69-83 and “The Debate Over Idolatry Persists,” pp. 84-96\n*   3\\. Chapter 13: “The year 1962: mosaic resonance,” pp. 155-169 and Chapter 14: “The year 1962: “Aux frontières de l’illimité et de l’avenir,” pp. 169-177\n*   4\\. Chapter 16: “Limits of the diaphane,” pp. 210-227; Chapter 17: “Relics and reproducibles,” pp. 228-240\n*   5\\. Chapter 18: “Cathedral thinking,” pp. 241-247; Chapter 19: “Instead of cathedrals, machines for living,” pp. 248-262; Chapter 20: “Cathedral of erotic suffering,” pp. 263-274, Chapter 21: “The entropy of medievalism,” pp. 275-278\n\n**Common reading:** \n\n*   **Chapter 1: “Not a Longer History, A Different History,” pp. 7-21**\n\n**Week 11: 26 April**      **Hanneke Grootenboer, _Treasuring the Gaze. Intimate Vision in Late Eighteenth-Century Eye Miniatures_, Chicago and London: University of Chicago Press, 2012**\n\n*   1\\. Chapter 3: “The Crying Image. The Withdrawal of the Gaze,” pp. 89-123\n*   2\\. Chapter 4: “Intimate as Extimate: The Gaze as Part-Object,” pp. 125-160\n\n**Common reading**\n\n*   **“Introduction: An Overlooked Episode in Vision’s History,” pp. 1-16**\n\n**Week 12:  3 May**        **Presentations: Tamara Trodd, _The Art of Mechanical Reproduction. Technology and Aesthetics from Duchamp to the Digital_, Chicago and London: University of Chicago Press, 2015** \n\n*   1\\. Chapter 2: “Seeing Machines,” pp. 47-98 (notes: pp. 268-275)\n*   2\\. Chapter 5: “Painting at a Standstil,” pp. 181-218 (notes: pp. 284-288)\n\n**Common reading:**\n\n*   **“Introduction The Art of Mechanical Reproduction,” pp. 1-18**\n\n**Week 13:  10 May**      **Presentations: Mechthild Fend, _Fleshing Out Surfaces. Skin in French Art and Medicine, 1650-1850_, Manchester: Manchester University Press, 2017** \n\n*   1\\. Chapter 2: “The Surface’s Substance,” pp. 17-63\n*   2\\. Chapter 3: “Nervous Canvas,” pp. 65-104\n*   3\\. Chapter 4: “Sensitive Limit,” pp. 107-140\n*   4\\. Chapter 7: “Hermetic Borderline,” pp. 237-273\n\n**Common reading:**\n\n*   **Chapter 1: “Introduction,” pp. 1-14** \n\n**Week 14: 17 May      Presentations: Ivo Blom, _Reframing Luchino Visconti: Film and Art_, Leiden: Sidestone Press, 2018**\n\n*   Chapter 1: “Pictorial Citation: _Il Bacio_ and Other Citations in _Senso_,” pp. 33-50 and Chapter 5: “Costume and Painting in _Senso_,” pp. 99-122\n*   Chapter 2: “Archaeology of the Set (I): Greuze and _The Leopard_, pp. 51-68 and Chapter 3: “Archaeology of the Set (II): The Conversation Pieces in _Conversation Piece_,” pp. 69-80\n*   Chapter 7: “Staging in Depth: Objects and People,” pp. 141-174\n\n                                   **Common reading: “Introduction: Intervisuality, Theory and History,” pp. 9-29**\n\n**Week 15: 24 May      Presentations: Anna Grasskamp, _Objects in Frames. Displaying Foreign Collectibles in Early Modern China and Europe_, Berlin: Reimer, 2019**\n\n*   1\\. Chapter 1: “Porcelain in Frames: The Europeanization of Chinese Ceramics through Sixteenth-Century Metal Mounts,” pp. 25-52\n*   2\\. Chapter 2: “Staging the Foreign: Global Arts at Emepror Kangxi’s Observatory, pp. 53-86\n*   3\\. Chapter 3: “Framing Foreign Naure: Coral Fragments between Form and Figure, Potential Images and Potential Spaces,” pp. 87-126\n*   4\\. Chapter 4: “Curating Foreign Nature: Coral Specimens on Display in Late Ming Visual and Material Culture,” pp. 127-162\n\n                                   **Common reading:** \n\n*   **“Introduction: Objects in Frames,” pp. 9-24 and Conclusion: Displaying Collectibles in Early Modern China and Europe,” pp. 163-178**\n\n**Week 16: 31 May      Presentations: Marni Reva Kessler, _Discomfort Food The Culinary Imagination in Late Nineteenth-Century Art_, Minneapolis and London: Univesity of Minnesota Press, 2021**\n\n*   Chapter 1: “Edouard Manet’s _Fish (Still Life) and the Melancholy of the Mullet_,” pp. 1-46\n*   Chapter 2: “Clarifying and Compounding Antoine Vollon’s _Mound of Butter_, pp. 47-94\n*   Chapter 3: “Gustave Caillebotte’s _Fruit Displayed on a Stand_, and the Ghost of the Lost City,” pp. 95-149\n*   Chapter 4: “Edgar Degas’s Beef and the Double Life of Edouard Manet’s _Ham_,” pp. 151-203\n\n                                   **Common reading:** \n\n*   **“Beginnings,” pp. xv-xxv**\n\n**Week 17-18:              Flexible individual advising**\n\n**The first sessions are devoted to the common reading of selected texts which will be discussed and commented in the classroom. The next sessions are reserved for individual presentations on selected chapters of books. In order to facilitate the discussion between presenters and the other participants of the course, everybody is asked to read carefully the introduction or texts that are mentioned as common reading in the program. No more than 2 presentations (chapters) are planned each week.**\n\n**Instructions for the oral presentations and term papers:**\n\n1.  **Oral Presentation (duration 30-45 minutes)**\n\nStudents who present are requested to provide a handout with their name and student number with the following information: \n\n•       Title, date, publisher etc. of the book presented (when it is a translation, please indicate the first edition in the original language and the original title)\n\n•       Short biography and bibliography of the author \n\n•       The chapter of the book that is summarized and analyzed\n\n•       The articulation of the oral presentation (it may be related to the structure of the chapter) \n\n•       The reception of the book (reviews, references in later publications)\n\n•       Bibliography \n\n1.  **Oral Presentation and Final Term Paper**\n\n**Though the oral presentation constitutes an intermediary stage to the final term paper, its content should ideally comprise the main issues that will be integrated in the final version of the term paper.**\n\n**Content and Structure**\n\n•       In the introduction, present the text you are analyzing, when and how it was published, who is the author (education, career, publications) and what is the general content of the book (you may summarize briefly the book in which the text was published) \n\n•       In the analysis, present the main stakes of the text/chapter you are reviewing. \n\n•       Describe the structure and the content of the text/chapter. The analysis of the text/chapter should give the detail of the form and the content of the thesis it embraces. You may comment key passages and paraphrase them.\n\n•       Try to describe in which way the argumentation is structured, for example in taking into account what is the point of departure of the argumentation and what is the final outcome and destination of the text. \n\n•       You may also challenge the pertinence of the argumentation by confronting some issues presented in your text with other studies. You may in this respect compare what different scholars wrote on these critical aspects.\n\n**Method**\n\nThe review must be based on a critical reading of the part assigned to comment. It begins with a thorough summary, describing the content, the structure, and methods the author used to build his/her argumentation. After having defined these aspects, it is necessary to replace the text in its context. This must be done through the presentation of the author, his/her career and significant publications.  It is also necessary to take into account the review(s) collected on the text under scrutiny. The reflections and comments provided during the discussion that took place in the classroom should be integrated in the final version of the term paper. Your analysis will have more strength if you provide the socio-historical as well as intellectual context in which the author and the text are inscribed. Some authors do explicitly refer to other scholars / texts / to legitimize their own point of view in their argumentation. They may explicitly frame their research within a specific intellectual, scientific, methodological context. The text and its significance can be also measured in term of its reception and how other scholars do refer, comment on the text either in positive or negative way. It is therefore necessary to have not only a look at the career of the authors, their methods, the influences they received from their \"masters\", but also to take into account the way the text was support(ed) or contradict(ed) by other scholars through the writings to which the text may respond and echo.\n\n**Quotations and footnotes (Final Term Paper)**\n\n            Your term paper focuses essentially on the text you are reviewing. You must in this respect report thoroughly the page numbers you are referring to in the footnotes, no matter you are quoting or paraphrasing. (For the technical details, see the booklet “Academic Writing for Art History”). You also have to make clear who is speaking, and where each idea comes from, when the author of the main text mentions secondary texts and studies. \n\nYou must also indicate the sources you have consulted for your analysis and review (books, articles, DVDs, websites, etc.)\n\n            The footnotes serve also to provide the reader with further information you cannot put in the main text. This can be helpful, when you want to keep some continuity to the argumentation of the main text.\n\nLength: 10-15 pages, Times New Roman, line space 1.5 (bibliography, appendix etc. not included)\n\nFor more details, see the booklet “Academic Writing for Art History”\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=9469e89546684b99a8575a27520d9774&fno=829af9b16dc84e7d865822ea7a5981b7)\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=880d561a5dc9486aa420b1147e4e96f9&fno=7fc532a6717340f5978c1d1900d0ad10)\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=b241621aaf914b0f802bbf1285e5207d&fno=298af21097a4485289f85b7d5f7ed200)",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": ""
        },
        {
            "type": "Group discussion",
            "note": ""
        },
        {
            "type": "Problem base learning",
            "note": ""
        },
        {
            "type": "Case studies",
            "note": "Assignments are presented at the beginning of the semester"
        },
        {
            "type": "Other:",
            "note": "Each student will give an oral presentation and submit a term paper based on the oral presentation."
        }
    ],
    "grading": [
        {
            "type": "Class discussion involvement",
            "weight": 30,
            "note": ""
        },
        {
            "type": "Presentation",
            "weight": 60,
            "note": ""
        },
        {
            "type": "Case study reports",
            "weight": 10,
            "note": ""
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}