{
    "year": 110,
    "term": 2,
    "name": "繪畫史研究導論",
    "teachers": [
        "諾斯邦"
    ],
    "department": "TM67",
    "code": "AHM0115",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 3026,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 3,
            "to": 5,
            "campus": "本部",
            "classroom": "青田405室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "To impart in-depth knowledge on Western painting.",
        "To analyze and understand the historical development of Western painting.",
        "To cultivate student’s abilities to observe, understand, compare and interpret works.",
        "To shape student’s abilities to question and solve issues related to Western painting. To encourage their critical thinking.",
        "To train students to collect, study, and analyze primary and secondary sources, to select and comment the literature related to a specific topic."
    ],
    "syllabus": "**Introduction to Western Painting Spring Semester 2022: styles, influences, genres and methodologies**\n\n**This course focuses on the history, styles and genres of Western painting, and helps to develop an understanding of major periods of this medium from the Renaissance until the Twentieth Century. Paintings are addressed in their cultural contexts, and artistic genres (religious, mythology and history paintings; portraiture; landscape; still-life etc.) are presented in accordance with their historical emergence. Each lesson discusses a period focusing on major motifs and/or stylistic features (Renaissance, Mannerism, Baroque, Classicism, Romanticism, Realism, Impressionism, Symbolism, Abstraction, Post-modernism…). It analyzes the influences of artists and/or artworks on specific genres, topics, and subject matter related to the periods in question. Methods of interpretation are commented and works are analyzed under the scope of different hermeneutic approaches and perspectives.** \n\n**Course arrangement: 16 weeks of in-person sessions + 2 weeks of flexible individual advising.** \n\n**Week 1: 16 February 2022**\n\n**Introduction**\n\nThe first session provides an overview of the course by questioning why painting has occupied a prominent place in  the history of Western art. We will first introduce some aspects regarding the material of which painting is made, such as pigments and binder, the tools and supports used by painters, (palettes, brushes, panels, canvases…), as well as the sites of production such as the _atelier_ where we can analyze the different manners painters concretely documented the art of painting.\n\nReference texts:\n\n\\-        Philip Sohm, “Palettes as Signatures and Encoded Identities in Early-Modern Self-Portraits,” in _Art History_,  Vol. 40 no. 5, 2017, 994-1025\n\n\\-        Victor Stoichita, “Margins,” in _The Self-Aware Image. An Insight into Early Modern Metapainting_, (New, Improved and Updated Edition With an Introduction by Lorenzo Pericolo), London and Turnhout: Harvey Miller Publisher, 2015 / London: Reaktion Books, 1995, pp. 67-99\n\n\\-        Tristan Weddigen, “The Alchemy of Colors, Titian Portrays His Pigment Merchant Alvise ‘dai’ Colori’ dalla Scala,” in Koja, Stephan; Henning, Andreas. Titian. Lady in white. Dresden: Sandstein Verlag, pp. 50-63\n\n**Week 2: 23 February**\n\n**Painting and its Founding Myths**\n\nIn this session we will focus on the founding myths of painting and see the importance given more specifically to the art of portraiture. We will question the implications such conceptions had on the understanding of the function of painting and see, in parallel, how the early modern development of easel painting was deeply influenced by the great authority Byzantine icons had gained after 1204, when they flooded into Italy after the Fourth Crusade.  \n\nReference texts:\n\n*   Michele Bacci, “ The Myth of the Archetypal Image,” in _The Many Faces of Christ. Portraying the Holy in the East and West 300 to 1300_, London: Reaktion Books, 2014, pp. 17-94 (part 1: pp. 17-30, part 2: 30-47, part 3: pp. 47-58, part 4: pp. 58-68, part 5: pp. 69-83, part 6: pp. 83-94)\n\n\\-        Boudewijn Bakker, “_Au vif – naar’t leven – ad vivum_. The Medieval Origin of a Humanist Concept,” in Nicolette C. Sluijter-Seijffert, Anton Willem Adriaan Boschloo, Jacquelyn N. Coutré, Stephanie S. Dickey (eds.), _Aemulatio: Imitation, Emulation and Invention in Netherlandish Art from 1500 to 1800: Essays in Honor of Eric Jan Sluijter_, Zwolle: Waanders Publishers, 2011, pp. 37-52\n\n\\-        Hans Belting, “The Coat of Arms and the Portrait: Two Media of the Body,” in _An Anthropology of Images: Picture, Medium, Body_, (translated by Thomas Dunlap), 2011, pp. 62-83 https://books.google.com.tw/books?id=vP9CngEACAAJ&printsec=frontcover&hl=fr&source=gbs\\_ge\\_summary\\_r&cad=0#v=onepage&q&f=false\n\n\\-        Victor Stoichita, “The Shadow Stage,” in _A Short History of the Shadow_, London: Reaktion Books, 1997, pp. 11-41 \n\n**Week 3: 2 March**\n\n**Painting as a Window**\n\nAlong the development of linear perspective, Leon Battista Alberti in his treatise _De Pictura_  (_On Painting_, 1435) defines the painted panel as an open window. Following Victor Stoichita’s seminal study on the self-aware image, the window is not just a metaphor, but a motif - like the representations of embrasures, niches, doors and frames - that “acts as the archetypal matrix of painting.” While it brings about the dialectic between the interior and the exterior, it also marks visually, to quote Lorenzo Pericolo’s words, “the self-staging of painting in painting.” We will analyze the different ways these devices are used to stage the fictiveness of painting.\n\nReference texts:\n\n\\-        Lynn F. Jacobs, _Thresholds and Boundaries. Liminality in Netherlandish Art (1385-1530)_, London and New York: Routledge, 2018\n\n\\-        Joseph Masheck, “Alberti’s “Window”: Art-historiographic Notes on an Antimodernist Misprison’,  in _Art Journal_, Vol. 50, No. 1, 1991, pp. 35-41\n\n\\-        Klaus Krüger, “Andrea Mantegna: Painting’s Mediality,” in _Art History_, Vol. 37, No. 2, 2014, pp. 222-253\n\n\\-        Lorenzo Pericolo, “What Is Metapainting? _The Self-Aware Image_ Twenty Years Later,” in Victor Stoichita, _The Self-Aware Image. An Insight into Early Modern Metapainting_, (New, Improved and Updated), London and Turnhout: Harvey Miller Publisher, 2015, pp. 11-31\n\n\\-        Victor Stoichita, “Embrasures,” and “Margins,” in _The Self-Aware Image. An Insight into Early Modern Metapainting_, (New, Improved and Updated Edition With an Introduction by Lorenzo Pericolo), London and Turnhout: Harvey Miller Publisher, 2015, pp. 39-51 and pp. 67-99\n\n**Week 4: 9 March**\n\n**Painting as _Istoria_**\n\nIn the middle of the second book of his treatise on painting (_De Pictura_, 1435), Alberti introduces the term and delineates the principles of _istoria_ which he considers as the painter’s greatest work. We will measure the importance granted to the concept of narrative painting after Alberti in the classic theory of art, and how painters followed, questioned, or challenged the concept of _istoria_. \n\nReference texts:\n\n\\-        Alexander Nagel, _Michelangelo and the Reform of Art_, Cambridge: Cambridge University Press, 2000\n\n\\-        Lorenzo Pericolo, “The Invisible Presence: Cut-In, Close-Up, and Off-Screen in Antonello da Messina’s Palermo _Annunciate_,” in _Representations_, Vol. 107, No. 1, 2009, pp. 1-29\n\n\\-        Lorenzo Pericolo, “A Matter of Optics and Rhetoric: The Aporia of Pictorial Narrative Before, During, and After Caravaggio’s Time,” in in _Caravaggio and Pictorial Narrative. Dislocating the_ Istoria _in Early Modern Painting_, London and Turnhout: Harvey Miller Publishers, 2011, pp. 35-120\n\n**Week 5: 16 March** \n\n**_Disegno_** **/ _Colorito_**\n\nThe new humanist ideal of painting as a liberal art established the principle of a practice essentially governed by the intellect, promoting the primacy of _disegno_ – to be understood as both drawing and design – as the prime vector of the expression of the idea and manifestation of the form. _Colorito_ (color and coloring) was therefore relegated in classic theories to a subordinated role, often qualified as a cosmetic expedient. We will see that the debate between drawing and color had different implications in terms of how to appreciate a work, oposing the discursive and intellectual dimension of drawing to the sensual and tactile qualities of color. \n\nReference texts:\n\n\\-        Frederika H. Jacobs, “Aretino and Michelangelo, Dolce and Titian: Femmina, Masculo, Grazia,” in _Art Bulletin,_ Vol. 82, No. 1, 2000, pp. 51-67\n\n\\-        Jacqueline Lichtenstein, _The Eloquence of Color. Rhetoric and Painting in the French Classical Age_, Berkeley: University Of California Press, 1993 \n\n**Week 6 : 23 March**\n\n**Mannerism: ‘Stylish Style’, ‘Hyper Art’**\n\nThe session will introduce the paradoxes of a “stylish style” or “hyper art” which began in Tuscany and Rome during the first three decades of the 16th century and spread all over Europe in the most prestigious courts. Practiced by erudite artists and addressed to a knowledgeable audience, mannerist paintings used to challenge the beholders with an exuberant and refined aesthetic. Mannerist painters demonstrated their individuality and originality, if not their eccentricity, by shifting the attention from what is represented to the manner the representation is presented. We will see how artistic virtuosity became a means to provide  personal reinterpretations of common motifs or to introduce uncommon topics that responded to the demanding culture of the _Wunder- and Kunstkammern_.\n\nReference texts\n\n\\-        Louis Alexander Waldman, “New Light on the Capponi Chapel in S. Felicita,” in _The Art Bulletin_, Vol. 84, No. 2,  2002, pp. 293-314\n\n\\-        Regina Stefaniak, “Amazing Grace: Parmigianino's ‘Vision of Saint Jerome’,” in _Zeitschrift für Kunstgeschichte_, Vol. 58, No.  1, 1995, pp. 105-115\n\n\\-        Sharon Gregory, “The unsympathetic exemplar in Vasari’s Life of, Pontormo “ in _Renaissance Studies_, Vol. 23, No. 1, 2009, pp. 1-32\n\n\\-        Larry Silver, “Pieter Bruegel and the Problem of Vision,” in in Bertram Kaschek, Jürgen Müller and Jessica Buskirk (eds.), _Pieter Bruegel the Elder and Religion_, Leiden and London: Brill, 2018, pp. 57-78 \n\n\\-        Tiffanie P. Townsend, “A “Red-Headed” Temper: Rosso Fiorentino and Vasari’s Fiery Portrait,” in Julia C. Fischer, _Breaking with Convention in Italian Art_,  Newcastle-upon-Tyne: Cambridge Scholers, 2017, pp. 87-98 https://books.google.com.tw/books?id=f8I3DwAAQBAJ&pg=PA97&lpg=PA97&dq=A+“Red-Headed”+Temper:+Rosso+Fiorentino+and+Vasari’s+Fiery+Portrait&source=bl&ots=BObrUg47pH&sig=ACfU3U0Ls6Wlexiw-adq2rzNEjZPBwC2Eg&hl=en&sa=X&ved=2ahUKEwjMnuOv4J\\_vAhXDyYsBHU28BFYQ6AEwC3oECA0QAw#v=onepage&q=A%20“Red-PaHeaded”%20Temper%3A%20Rosso%20Fiorentino%20and%20Vasari’s%20Fiery%20Portrait&f=false\n\n\\-        Michel Weemans, “Pieter Brugel’s _Hunters in the Snow_ and _Insidious Auceps_ as Trap Images,” in Bertram Kaschek, Jürgen Müller and Jessica Buskirk (eds.), _Pieter Bruegel the Elder and Religion_, Leiden and London: Brill, 2018, pp. 245-276\n\n**Week 7: 30 March**\n\n**The Painter’s Kitchen**\n\nThe development of collections and the threat cast by Protestant iconoclasm challenged the production of religious work which had constituted so far the major prospect for painters. We will follow the shifts taking place in the second half of the 16th century in the production of a new type of paintings such as Pieter Aertsen’s rhyparographic works representing food stalls, Vincenzo Campi’s food vendors, or Annibale Carracci’s butcher’s shops. We will discuss the paradoxes of these representations which present low subjects with a highly refined and minute technique. These paradoxes are meant to activate an analogy between painting and  cooking. Both arts transform raw materials into sublimated products meant to wake up all the senses.\n\nReference texts:\n\n\\-        Reindert L. Falkenburg, “Pieter Aertsen Rhyparographer,” in J. Koopmans (eds.), _Humanist Rhetoric Rhetoric – Rhétoriqueurs,_ 1995, pp. 97 – 217\n\n\\-        Reindert L. Falkenburg, “Pieter Aertsen’s _Kitchen Maid_  in Brussels: A Peek Into the Kitchen of Art,” in Jan Frans van Dikkhuizen, Paul Hoftijzer, Juliette Roding and Paul Smith (eds.), _Living in Posterity. Essays in Honourr of Bart Westerweel_, Hilversum: Uigeverij Verloren, 2004, pp. 95-105\n\n\\-        Charlotte Houghton, “This Was Tomorrow: Pieter Aertsen’s _Meat Stall_ as Contemporary Art,” in _Art Bulletin_, Vol. 86, No. 2, 2004, pp. 277-300\n\n\\-        Sheila McTighe, “Foods and the Body in Italian Genre Paintings About 1580: Campi, Passarotti, Carracci,” in _The Art Bulletin_, Vol. 86, No. 2, 2004, pp. 301-323\n\n\\-        Denis Ribouillault, “Regurgitating Nature: On a Celebrated Anecdote by Karel van Mander about Pieter Bruegel the Elder,” in _Journal of Netherlandish Art History_, Vol. 8, No. 1, 2016\n\n\\-        Marlise Rijks, “Defenders of the image: Painted collectors’ cabinets and the display of display in Counter-Reformation Antwerp,” in H. Perry Chapman Frits Scholten Joanna Woodall (eds.), _Arts of Display / Het vertoon van de Kunst_, Leiden and Boston: 2015, pp. 54-82\n\n**Week 8: 6 April**\n\n**Baroque Painting and the Counter-Reformation**\n\nIn response to Protestant iconoclasm, the Counter Reformation redefined the role of painting in the exercise of faith. Condemning the excesses of Mannerism, a return to simplicity and clarity was prescribed, while incongruities potentially able to undermine the persuasive power of the religious images were banned. We will see which strategies painters of the Counter-Reformation proposed to reaffirm the role of painting and how images  contributed to serve as important mediators with the divine, making it gloriously visible and palpable. \n\nReference texts:\n\n\\-        Erin E. Benay, “Touching Is Believing: Caravaggio’s Doubting Thomas in Counter­Reformatory Rome,” in Lorenzo Pericolo and David M. Stone,( eds), _Caravaggio: Reflections and Refractions_, Burlington: Ashgate, 2014, pp. 59-82\n\n\\-        Pamela M. Jones, _Altarpieces and Their Viewers in the Churches of Rome from Caravaggio to Guido Reni_, Aldershot: Ashgate, 2008\n\n\\-        Lorenzo Pericolo, “The Misplaced Hero: The Challenge of the Istoria in Caravaggio’s Early Religious Narratives,” in _Caravaggio and Pictorial Narrative. Dislocating the_ Istoria _in Early Modern Painting_, London and Turnhout: Harvey Miller Publishers, 2011, pp. 199-296\n\n\\-        Victor Stoichita, “Visions and Paintings,” in _Visionary Experience in the Golden Age of Spanish Art_, London: Reaktion Books, 1995, pp. 45-77\n\n\\-        Heinrich Wölfflin, _Principles of Art History. The Problem of Development of Style in Later Art_, New York: Dover Publications, 1950\n\n**Week 9-10: 13 and 20 April**\n\n**Baroque Painting in the Netherlands**\n\nThe wealth of the complex bourgeois society of the Protestant Netherlands stimulated types and scales of paintings that addressed different kinds of tastes and needs. We will address the new context of production and reception that characterizes the free market of art during the Dutch Golden Age, and discuss the specific theoretical context in which pictorial practice was discussed and understood at the time.   \n\nReference texts:\n\nStephanie S. Dickey, “_Saskia as Glycera_: Rembrandt’s Emulation of an Antique Prototype,” in Nicolette C. Sluijter-Seijffert, Anton Willem Adriaan Boschloo, Jacquelyn N. Coutré, Stephanie S. Dickey (eds.), _Aemulatio: Imitation, Emulation and Invention in Netherlandish Art from 1500 to 1800: Essays in Honor of Eric Jan Sluijter_, Zwolle: Waanders Publishers, 2011, pp. 233-247\n\nJoanna Woodall, “Laying the Table: The Procedures of Still Life,” in _Art History_, Vol. 35, No. 5, 2012, pp. 976-1003\n\nCeleste Brusati, “Perspectives in Flux: Viewing Dutch Pictures in Real Time,” in Angela Vanhaelen and Bronwen Wilson (eds.) _The Erotics of Looking: Early Modern Netherlandish Art_, Chichester: Wiley Blackwell, 2013, pp. 42-67\n\nEmmanuelle Hénin, “Parrhasios and the Stage Curtain: Theatre, Metapainting and the Idea of Representation in the Seventeenth Century,” in _Art History_,  Vol. 33, No. 2, 2010, pp. 248-261 \n\n**Week 11: 27 April**\n\n**Rococo: 18th Century French Painting**\n\nThe founding of the _Académie royale de peinture et de sculpture_ by the painter Charles Le Brun in 1648 was followed by a series of initiatives meant to develop the arts under the royal patronage of Louis XIV. In 1666, conferences discussing the merits of the paintings of the royal collection were organized, and in 1667 paintings of the members of the Royal Academy were for the first time exhibited in public. After 1737, when the _Salon_ took place annually and then biennially, the career of a painter used to depend more and more   on this venue. At the same time the normative and conservative position of the Academy regarding the hierarchy of genres could also constitute an obstacle to personal ambition. We will pay attention to the critical discourse which developed at the time in response to the works exhibited at the _Salon_. We will also analyze the different ways painters responded to critics and how they tried to cope with, or began to challenge the normative discourse of the Academy.\n\nReference texts:\n\n\\-        Oskat Bätschmann, _The Artist in the Modern World: The Conflict Between Market and Self-Expression_, Cologne: DuMont, 1998\n\n\\-        Ewa Lajer-Burcharth, “Chardin’s Craft,” in _The Painter’s Touch: Boucher, Chardin, Fragonard_, Princeton: Princeton University Press, 2018, pp. 86-175\n\n\\-        Ewa Lajer-Burcharth, “Fragonard’s Seduction,” in _The Painter’s Touch: Boucher, Chardin, Fragonard_, Princeton: Princeton University Press, 2018, pp. 176-237\n\n\\-        Kevin Chua, “In the Shadow of Brutus,” in _Representations_ , Vol. 121, No. 1,  2013, pp. 107-139\n\n\\-        Frédérique Desbuissons, “A Ruin: Jacques-Louis David’s _Sabine Women_,” in _Art History_, Vol. 20, No. 3, 1997, pp. 432-448 \n\n\\-        Danielle Lenhard, “Unraveling the Curtain: Subversive Folds, Cleland’s _Memoirs_, and the Sublime in Jean-Honoré Fragonard’s _Le Verrou_,” in _Rutgers Art Review_, Vol. 25, 2010, pp. 43-62\n\n\\-        Jennifer Milam, “Playful Constructions and Fragonard's Swinging Scenes,” in _Eighteenth-Century Studies_, Vol. 33, No. 4, The Culture of Risk and Pleasure, pp. 543-559\n\n\\-        Andrew Stewart, “David's 'Oath of the Horatii' and the Tyrannicides,” in _The Burlington Magazine_, Vol. 143, No. 1177 (Apr., 2001), pp. 212-219\n\n**Week 12-13: 4 and 11 May**\n\n**Romanticism**\n\nThe period between 1750 and 1830 has a double face and cannot be summarized through the traditional stylistic concepts of neo-classicism and romanticism. It constitutes a change of paradigms and marks on the one hand a pictorial disintegration of the conventions of central perspective and a distancing from what Werner Hofmann has coined “monofocal” aesthetic. Many works began to question classic rules, by not obeying to the principle of the single point of view, refusing the concept of the three unities (unity of action, unity of time, and unity of place), or transgressing the forbidden principle of mixing different levels of reality. These transgressions announced the new pictorial reality which would characterize the art of the 20th century.\n\nReference texts:\n\n\\-        Nina Amstutz, “Caspar David Friedrich and the Anatomy of Nature,” in _Art History_, Vol. 37, No. 3, pp. 454-481\n\n\\-        Leo Costello, “'This cross-fire of colours': JMW Turner (1775-1851) and the Varnishing Days Reconsidered,” in _The British Art Journal_; Vol. 10, No. 3, 2009, pp. 56-68\n\n\\-        Jonathan Crary, “Géricault, the Panorama, and Sites of Reality in the Early Nineteenth Century,” in _Grey Room_, Vol. 9 2002, pp. 5-25\n\n\\-        Elisabeth A. Fraser, “Delacroix’s _Sardanapalus_: The Life and Death of the Royal Body,” in _French Historical Studies_, Vol. 26, No. 2, 2003, pp. 315-349\n\n\\-        Hélène Ibata, “Painting as Event: Performance and Gesture in Late Turner,” in _Interfaces_, Vol. 40, Gestures and Transmission, 2018, http://preo.u-bourgogne.fr/interfaces/index.php?id=599\n\n**Week 14-15: 18 and 25 May**\n\n**Modernity (Realism, Impressionism and Post-Impressionism)**\n\nThe dramatic metamorphoses of the urban experience accelerated by the transformations of big cities, the expansion of traffic as well as the new travelling speed offered by the railway, contributed to reconsider the issue of movement: modernity became the synonym of what Charles Baudelaire called in his 1863 essay _The Painter of Modern Life_ “the transitory, the fugitive, the contingent.” Painters and photographers, before the invention of cinema tried to restitute the new fragmentary and mobile gaze of the city dwellers, inventing new points of views, new perspectives, new visual narratives that responded to the stimuli offered by the modern urban life. In parallel, the democratization and popularization of museums offered a new regime of perception. The progressive openness of the museum collections to non Greco-Roman antiquities, the discovery of artefacts from other civilizations and cultures permitted to question the classic aesthetic canon and open painting to new formal experimentations.\n\nReference texts:\n\n\\-        Bridget Alsdorf, “Painting the Femme Peintre,” in _Women Artists in Paris, 1850-1900_, New Haven: Yale University Press, 2017, pp. 25-39\n\n\\-        Jamie Horrocks, “Pre-Raphaelite Primitivism and the Periodical Press: Florence Claxton’s _The Choice of Paris_,” in _Visual Culture in_ Birtain, Vol. 18, No. 2, 2017, pp. 217-246\n\n\\-        Jane Langley, “Pre-Raphaelites or ante-Dürerites?” in _The Burlington Magazine_ , Vol. 137, No. 1109 1995, pp. 501- 508\n\n\\-        Steven Z. Levine, “Monet’s Series: Repetition, Obsession,” in _October_, Vol. 37, 1986, pp. 65-75\n\n\\-        Daisuke Miyao, “The A Travers Cinema: Japonisme and the Lumière Brothers’s Films, in _Japonisme and the Birth of Cinema_, Durham: Duke University Press, 2020, pp. 17-57\n\n\\-        Linda Nochlin, “The Imaginary Orient,” in _Art in America_, Vol. 71, 1983, pp. 119-131, and pp. 187-191\n\n\\-        Victor I. Stoichita, “Vaporization and/or Centralization: On the (Self-)Portraits of Manet and Degas,” in _RACAR : Revue d'art canadienne Canadian Art Review_, Vol. 26, No. 1-2, 1999, pp. 13-28\n\n\\-        Merel van Tilburg, “The Figure In/On the Carpet: Félix Vallotton and Decorative Narrativity,” in _Konsthistorisk tidskrift/Journal of Art History_, Vol. 83, No. 3, pp. 211-227\n\n\\-        Aileen Tsui, “The Phantasm of Aesthetic Autonomy in Whistler’s Work: Titling _The White Girl_,” in _Art History_, Vol. 29, No. 3, 2006, pp. 444-475\n\n\\-        Jennifer Wild, “Seeing Through Cinema. Projection in the Age of Cubism,” in _The Parisian Avant-Garde in the Age of Cinema, 1900-1923_, Oakland CA: University of California Press, 2015, pp. 23-61\n\n\\-        Alastair Ian Wright, “On Seeing and Being Seen: Beholding Class in Ford Madox Brown’s _Work_,” in _Oxford Art Journal_, Vol. 40, No. 3, 2017, pp. 419-447\n\n**Week 16: 1st June**\n\n**Abstraction**\n\nThe Autumn Salon of 1905 inaugurates the art of the 20th century with the scandal and the polemic created by the Fauves. Ordinary rules based on the principle of imitation of appearance are dramatically transgressed. Color is not any more meant to reproduce the local tone but is transposed freely in orchestrations of complementary colors. With the development of abstraction, the necessity to represent something identifiable is radically called into question. Later, the theories of modernism and the concept of medium specificity championed by Clement Greenberg brought a definitive end to the Renaissance principles which had defined painting as a window and support to a narrative.\n\nReference texts:\n\n\\-        Clement Greenberg, “Modernist Painting,” 1965\n\n\\-        Harold Rosenberg, “American Action Painters,” in _Art News_, December 1952, pp. 22-23, 48-50\n\n\\-        Melissa Renn, “_Life_’s Pioneer Painters: Dorothy Seiberling and American Art in _Life Magazine_, 1949–1968,”O in Rachel Esner and Sandra Kisters (eds.), _The Mediatization of the Artist_, Basingstoke: Palgrave Macmillan, 2018, pp. 79-95\n\n\\-        Jeffrey Strayer, “Planarity, Pictorial Space, and Abstraction,” in K. Purgar (ed.), _The Palgrave Handbook of Image Studies_, Basingstoke: Palgrave, 2021, pp. 187-202\n\n**Week 17-18**\n\n**Flexible individual advising**\n\n**Teaching Methods**\n\nFor each lesson students are given a handout. It includes the essential bibliography mentioning monographs, academic studies, articles, documents, archives, and/or critics related to the topic. It provides the list of works (illustrations) analyzed during the lesson\n\nEach session tends to tackle a specific issue. Its goal is to present, analyze, and discuss the most important theoretical and practical aspects related to the topic in question. The outlines and the main issues are introduced at the beginning of each lesson. A brief summary of the previous lesson introduces the new issues which will be discussed. If questions related to previous lessons are still pending, they are answered, and/or recontextualized.\n\nThe topics are addressed through a close reading and detailed analysis of a single, or a group of works of art. The main issues related to a subject are examined through concrete examples. Different points of view are privileged in order to open new perspectives on well or-less known objects. I select various scientific texts, documents and sources and comment on them. Images, texts, and documents are used in order to present original and critical approaches.\n\nStudents’ abilities to gather, investigate and analyze art history resources are trained through personal contributions, such as the essays they are asked to present orally during the semester, and complete in a 10-page length written paper by the end of the semester. The topics are carefully chosen in order to propose issues that are closely related to the main topic of the course. Their relevance depends also on their accessibility. When selecting the topics I always take into account the literature at disposition. The students are in this respect given a selected bibliography which helps them to access the topic with the most appropriate tools. Students are also asked to complete their research with other readings.\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=90b2e3f4238743fcbaa87239199f8ea4&fno=1c9ee2a486194c8fa85984f11653a0c5)",
    "methodologies": [
        {
            "type": "Field work",
            "note": "Study visits are organized when possible and according to the course topic – depending on the cultural actuality (exhibitions, events etc.)"
        }
    ],
    "grading": [
        {
            "type": "Attendances",
            "weight": 20,
            "note": "During the course the skills of the students are tested through questions intended to tackle problems in direct relationship to the topic. They are trained in the observation of artworks. They are taught how to describe a work (from the more general to the more specific), to understand its structure, its content, and its meaning. They are asked to compare works (or documents) with similar or contradictory examples. They are taught to identify and to interpret the different meanings of a work. Their aesthetic sensitivity and their critical thinking are encouraged through an acute observation and analysis of the works, documents, and academic writings introduced throughout the course. If the content presented seems to be unclear to the students, it is clarified through questions and answers."
        },
        {
            "type": "Presentation",
            "weight": 50,
            "note": "Students’ abilities to formulate a specific issue on a specific topic related to the course attended are trained, and improved. They are asked to present and structure their argumentation coherently, to produce a critical research based on an acute observation of the works analyzed, and to find possible solutions in a 30 minute time-lapse. The discussions, comments, and critics formulated during and/or after their oral presentation are always thought in a constructive way. They are intended to encourage the students to improve their critical approach, to redirect their previous intentions."
        },
        {
            "type": "Shows/ Exhibitions",
            "weight": 30,
            "note": "Students are asked to hand out a final paper respecting some formal, but essential points according to the common use in the academic field of art history (table of contents, quotations and correct referencing, presence of bibliography, illustrations etc.). Students are given a style sheet on which they can take example. The content should be well structured, written correctly, and thoroughly documented."
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}