{
    "year": 110,
    "term": 2,
    "name": "義大利文藝復興初期藝術",
    "teachers": [
        "哈德森"
    ],
    "department": "TM67",
    "code": "AHM0179",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 3029,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 3,
            "to": 5,
            "campus": "本部",
            "classroom": "青田405室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "Abilities in analysis of works of art and architecture and in gathering and exploring resources relative to art historical research.",
        "Abilities in formulating and investigating special topics in art history.",
        "Basic abilities to identify and analyse art works.",
        "Abilities in practical application of art history knowledge.",
        "Aesthetic sensitivity and concern for humanities",
        "Independent judgment and critical thinking",
        "Comprehension of cultural heritage conservation and preservation",
        "Global vision in cross-culture issues and international-exchange affairs and respect for the diversity and difference between arts and cultures"
    ],
    "syllabus": "**Schedule of Session Topics** (Course structure: 16 + 2; 16 weeks of in-person sessions + 2 weeks of flexible sessions) To download a PDF of the full course guide, click on the link at the bottom of this field.\n\n**1\\. Introduction**\n\nIn the first session, you will be given an explanation of the syllabus and the assessment for the course. This will be followed by a presentation providing a brief history of late medieval Florence, focussing on its society, government, economy, and culture. Special attention will be given to the city's most important architectural project of the time, the building of the Cattedrale di Santa Maria del Fiore. This continued from the end of the thirteenth century to the end of the fifteenth, and is emblematic of the close relationship between the city's government, professional guilds, and the Catholic Church, which provided the administration, and ideological basis, for a great deal of the city's art production. We will also practice course-specific terminology.\n\n**2\\. A Renaissance Artist's Career in Documents**\n\nPaolo Uccello (c. 1397–1475) is one of the best-documented artists of the fifteenth century, so we will take him as an example, to trace the life and career of a Florentine early Renaissance artist through documents, from the social status of his parents' families, training under a master, matriculation in the artists' guild, membership of the artist's confraternity, setting up of a workshop, and workshop practices, such as the use of modelbooks. We will consider the differences between documented commissioned works and undocumented speculative production for the open market, and the division of labor between the master and assistants. We will use Uccello's tax records (_catasti_) to investigate his economic status, and look at the special professional roles he occasionally played, such as assessing the value of fellow artists' works to resolve disputes, and apparent engagement in Florentine 'soft power'—an artist in the service of the commune's friends and allies, as an extension of diplomatic service for the state.\n\n**3\\. Gothic Tradition and Classical Revival in Early Renaissance Sculpture**\n\nThe 1401 competition between Lorenzo Ghiberti and Filippo Brunelleschi for the commission for the second set of bronze doors for Florence's Battistero di San Giovanni (Baptistery) provides a point of departure for this survey of early Renaissance sculpture in Florence. We will read excerpts from Ghiberti’s _I commentari_ (_Commentaries_) and Antonio Manetti’s _Vita di Filippo Brunelleschi_ (_Life of Filippo Brunelleschi_) to investigate these sculptors' knowledge of Classical models, and how such influences were integrated with the prevailing International Gothic style. Then, we will examine the emergence of the young Donatello out of Ghiberti's workshop, and his independent work for the Cathedral and Orsanmichele, alongside Brunelleschi, Ghiberti, and Nanni di Banco, later to be joined by Verrocchio.\n\n**4\\. Altarpieces and Mural Paintings by Masolino and Masaccio for Family Chapels in Florentine Churches**\n\nChurches were ubiquitous sites for artistic patronage throughout the Italian Renaissance. In this session, we will examine how artists responded to the requirements of ecclesiastic authorities, the aspirations of religious and private patrons, communal traditions, contemporary politics, and their own ambitions, to realise increasingly veristic and iconographically sophisticated images, in altarpieces and mural paintings for churches. We will focus on Masolino and Masaccio's three collaborations in Florence: the Carnesecchi and _Sant'Anna Metterza_ altarpieces and the Cappella Brancacci mural paintings.\n\n**5\\. Pioneers of Single-Point Perspective: Brunelleschi, Masaccio, and Uccello**\n\nOur study of the development of single-point perspective will be based on the evidence of drawings, the _sinopie_ and surfaces of mural paintings, the underdrawing, incisions, and surfaces of paintings on canvas and panel, and fifteenth-century written sources, notably Leon Battista Alberti's _De pictura_, Manetti’s _Vita di Filippo Brunelleschi_, and inventories of the Medici family possessions. We will investigate the celebrated, lost examples of single-point perspective by Brunelleschi (known only from written sources), and surviving works of Masaccio and Uccello, to determine the universal or conventional nature of perspective, and its varied significance.\n\n**6\\. Mural Paintings by Fra Angelico and Filippo Lippi for Florentine Convents** \n\nMendicant religious orders in Florence, notably the Dominicans, Franciscans, Carmelites, and Servites, were prolific and learned patrons of art. Art was used in the religious observances of the brothers and sisters, and as a means to communicate their missions to the public. Some orders included artists who produced artworks for their needs, such as the Dominican, Fra Angelico, and Carmelite, Filippo Lippi, and in this session we will focus on their work. \n\n**7\\. Mural Paintings by Domenico Ghirlandaio for the Florentine Commune**\n\nThe Palazzo Vecchio was the seat of the Florentine government in the fifteenth century. Its decoration promoted the religious and secular values of the Republic through the representation of patron saints, Classical heroes, communal symbols, and Florentine history. The iconography was informed by the Humanist writings of the fifteenth-century Florentine Chancellors: Coluccio Salutati, Leonardo Bruni, Carlo Marsuppini, Poggio Bracciolini, Benedetto Accolti, Bartolomeo Scala, and Niccolò Machiavelli.\n\n**8\\. Florentine _Palazzi_ I: Images of Honour and Devotion in the Home**\n\nFlorence's leading families, among them the Medici, Strozzi, Rucellai, Pitti, and Pazzi, built imposing _palazzi_ in the fifteenth century, and filled them with religious and secular artworks, as is known from inventories and surviving works. While intended primarily for the use and enjoyment of the patron's family, domestic artworks would have been seen by their relatives, friends, business associates, and honoured guests, especially when located on a facade, in a courtyard, reception room, and occasionally also in a garden. We shall focus our discussion on Donatello's _David with the Head of Goliath_ probably made for the old Medici _palazzo_, and ask how its erotic representation of the male body could be consistent with the promotion of virtue and honour found in the iconography of so many domestic artworks.\n\n**9\\. Florentine _Palazzi_ II: Representations of Women and Women’s Agency** \n\nWomen's agency in Italian early Renaissance  public life was greatly circumscribed by patriarchal religious beliefs, laws, and customs. Nevertheless, women routinely contributed significantly to domestic life as wives, mothers, and widows. A variety of artworks was made for use in the home, which represent women in their subject matter, or refer to women through their coats of arms, or allude to women through their function, such as _deschi da parto_ (birth trays). Even if such artworks were usually commissioned or purchased by men, they provide an opportunity to discuss gender relations.\n\n**10\\. Villas in the Florentine _Contado_** \n\nFor elite Florentine families, a villa in the _contado_ (countryside) provided a retreat from urban life—a place where artworks, alongside nature, provided an ambience for diversion, relaxation, healthy living, and self-improvement. The cultural aspirations of Florentines for their villas is reflected in Alberti's short treatise of c. 1438, called _Villa_.\n\n**11\\. The Body, Sexuality, and Race**\n\nItalian early Renaissance art is well known for its candid representations of female and male nudity, but to what extent does nudity allude to sexuality or race, and what attitudes to hetero- and homosexuality can be inferred from visual and textual sources? \n\n**12\\. Florentine Artists in Prato**\n\nLocated just over 20 kilometres north-west of Florence, and under its authority from the mid-fourteenth century, the town of Prato has a distinctive history as a centre for textile production, and with the wealth from the industry its citizens commissioned artworks from the leading Florentine artists of the late Middle Ages and early Renaissance. In particular, they provided what is now the Cattedrale di Santo Stefano with mural painting cycles, bronze screens, a candelabrum, and a marble pulpit from which to show the city's venerated relic of the Virgin's girdle.\n\n**13\\. Piero della Francesca in San Sepolcro, Arezzo, and Urbino**\n\nSan Sepolcro was from the fifteenth century another town over which Florence had authority. Piero della Francesca was born there, and after working as a young man in Florence, he returned to produce mural and panel paintings in the city and in neighbouring territories, as well as writing and illustrating treatises on mathematics, geometry, and perspective. \n\n**14\\. The Vivarini and Bellini in Venice and The East**\n\nIn the early fifteenth century, Venetian authorities sometimes turned to Florentine artists for major artistic commissions. However, from the middle of the century, the reputation of Venetian artists grew throughout the city's territories and as far as Constantinople, thanks to the work of artists such as Alvise, Antonio, and Bartolomeo Vivarini, Giovanni d'Alemagna, and Jacopo, Gentile, and Giovanni Bellini.\n\n**15\\. Donatello and Mantegna in Padua, Verona, and Mantua**\n\nDonatello worked in Padua on commissions for the Basilica di Sant'Antonio and the Equestrian Monument for Erasmo da Narni. As well as local sculptors, his work profoundly influenced the Paduan school of painting, which emerged from the workshop of Francesco Squarcione, master of Mantegna and Marco Zoppo, among others. Mantegna earned a reputation for altarpieces, mural paintings and smaller works displaying his profound knowledge of Classical art and literature, elegant compositions, refined execution, and for Keith Christiansen, a moral power unequalled by any other early Renaissance artist. Mantegna became the court artist in Mantua, and in the Palazzo Ducale he painted the ducal family in mural paintings of unparalleled spleandour and wit.\n\n**16\\. Rome**\n\nIn Rome, popes, cardinals, and elite families commissioned artworks from leading Italian artists, often invited from Florence. These commissions celebrated the city's Classical past and its temporal and sacred authority, while embracing recent developments in the arts. At the end of the session, we will have an unassessed quiz on course content.\n\n**17–18.   Individual Consultations**\n\nThe last two weeks of the semester are set aside for individual consultations with the professor, by appointment, to discuss the research, writing, and presentation of the second assignment.\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=6b9ccde8037d4f0dbdfff5a694dc248c&fno=944553d90b84415b87c3ea9f85426614)",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "The professor will deliver an approximately one hour presentation in 16 of the 18 weeks of the course."
        },
        {
            "type": "Group discussion",
            "note": "Classes will include a one or two hour discussion each week, in 16 of the 18 sessions, led by the professor, based on key readings from the bibliography, and the case studies and topics listed in the weekly schedule of the syllabus, as well as the students’ class Presentations."
        },
        {
            "type": "Cooperative learning",
            "note": "In the final session there is an unassessed groupwork quiz on the course content."
        },
        {
            "type": "Field work",
            "note": ""
        },
        {
            "type": "Media, audio, visual materials",
            "note": "Students will be provided with Powerpoint presentations and set readings in PDF form, and will view documentary videos."
        },
        {
            "type": "Case studies",
            "note": "Each of the weekly topics contains a number of case studies that will be presented by the professor in the Powerpoint Presentations, accompanied by selected readings from the literature on these case studies."
        },
        {
            "type": "Other:",
            "note": "In the second last week, students are invited to make an appointment with the professor for an individual consultation about their assignments."
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 50,
            "note": "Paper"
        },
        {
            "type": "Class discussion involvement",
            "weight": 20,
            "note": "This mark is based on evidence of having read some of the provided texts in preparation for classes, attendance, punctuality, and contribution to class discussion and activities."
        },
        {
            "type": "Presentation",
            "weight": 30,
            "note": "Oral presentation"
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}