{
    "year": 110,
    "term": 2,
    "name": "國際教育與發展研究",
    "teachers": [
        "李浡"
    ],
    "department": "IM86",
    "code": "IWM0086",
    "credit": 3,
    "serial": 1372,
    "group": "",
    "quota": {
        "limit": 35,
        "additional": 3
    },
    "schedule": [
        {
            "day": 2,
            "from": 10,
            "to": 12,
            "campus": "本部",
            "classroom": "誠106"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "Learning fundamental issues regarding development and education",
        "Understanding economic, political, cultural and social forces in relation to education in varying contexts",
        "Exploring major educational issues in Global Community",
        "Through exploring and discussing these issues and phenomena, students are expected to develop analytic, synthetic, evaluative and critical ability"
    ],
    "syllabus": "**Objectives:**\n\nThis curriculum is aim to instruct the students to recognize the concept of International Education and Development. Apart from providing overviews of global education and the international development, trace the trends of education policy; this curriculum also provides new empirical evidence on the international organizations and Education for all, higher education, inequality in education as well as Technical and Vocational Education and Training (TVET) and so on. This evidence challenges key elements of the existing conventional wisdom, leading to more balanced policy conclusions. Fresh insights into the use of the various modalities, which are in a complex process of education reform also offered. Taking stock and reflecting on how education should be designed in the future to promote economic development (with a focus on growth, poverty reduction and social justice) are core themes. Lastly, while much of what is said refers to a variety of developing countries in different regions of the world (Africa, Asia and Pacific and Latin America), particularly attention is paid to the development challenges of Africa.\n\n**Schedule:**\n\n1.  Education for Sustainable Development 2020: A roadmap ESD for 2030\n2.  Education Policy Outlook 2019: Working Together to Help Students Achieve Their Potential\n3.  Education at a Glance 2021: Financial and Resources Invested in Education\n4.  Education at a Glance 2021: The Output of Educational Institutions and the Impact of Learning\n5.  Global Higher Education Development in OECD Countries\n6.  TVET and Development: A Human Capability and Social Justice Approach\n7.  Adult Learning and Education (ALE)\n8.  Teacher Training for Education Development\n9.  Pedagogy, Curriculum, Teaching Practices and Teacher Education in Developing Countries\n10.   Education in The Digital Age: Healthy And Happy Children\n11.   Global Talent Management: Necessity, Challenges, and the Roles of HRD\n12.   A Summary of the Covid-19 Pandemic: Shocks to Education and Policy Responses\n13.   Low-Performance Students: Dilemma and Measures\n14.   Children in Conflict Area and Education in Emergencies\n15.   Teaching Excellence through Professional Learning and Policy Reform: Lesson from around the World\n16.   Invest in Education Early, Smartly and for All\n17.   Access to Education, Participation and Progression\n18.   Ensure Inclusive and Equitable Quality Education and Promote Lifelong Learning Opportunities for All\n19.   An Assessment of Global Competence: in the 2018 PISA Assessment\n20.  PISA 2018 Results: What School Life Means for Students’ Lives\n21.   Global Education Monitoring Report Gender Review 2020: Meeting Our Commitments to Gender Equality in Education\n22.   Trends Shaping Education 2019\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=51a6961531274d45b90eb4716729b5f6&fno=ffbbf9af4e5f4b6aae95419c212a8c97)",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "自編講義共計22章，除教師以ppt講述，並邀請同學共同講述述各章節內容"
        },
        {
            "type": "Group discussion",
            "note": "各章節講述結束前，由教師及負責講述之章次設定問題並進行分組討論"
        },
        {
            "type": "Problem base learning",
            "note": "就時下國際與國內所面臨之問題進行討論，以尋求解決之方案"
        },
        {
            "type": "Media, audio, visual materials",
            "note": "以 youtube 或video 融入教學課程"
        }
    ],
    "grading": [
        {
            "type": "Midterm Exam",
            "weight": 30,
            "note": "依教師指定之期中考題目如期完成報告及ppt"
        },
        {
            "type": "Final exam",
            "weight": 30,
            "note": "依教師指定之期末考題目如期完成報告及ppt"
        },
        {
            "type": "Class discussion involvement",
            "weight": 20,
            "note": "分組討論能提出可行的論點，所屬組別作出貢獻"
        },
        {
            "type": "Attendances",
            "weight": 10,
            "note": "每周出席及參與討論討論"
        },
        {
            "type": "Presentation",
            "weight": 10,
            "note": "能妥善準備所需報告內容餅接受詢問"
        }
    ],
    "prerequisite": "◎Unavailable for M.A. program students (M.A. program courses excepted) and B.A. program students.",
    "general_core": []
}