{
    "year": 110,
    "term": 2,
    "name": "員工心理與職涯發展專題研究",
    "teachers": [
        "林怡君"
    ],
    "department": "IM86",
    "code": "IWM0079",
    "credit": 3,
    "serial": 1376,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "正105"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "員工心理素質的提升，可幫助企業人力資本強化，進而提升員工潛能。學生藉此課程的學習，能夠瞭解在工作中必需處理的員工問題、員工與主管之間的衝突、現代人因各種情況造成的心理壓力、以及因情緒所產生的身心問題等。透過認識壓力，學生將學習如何從外在的行為和談話的模式去提升對於員工的協助，及如何運用諮商的技巧來幫助員工減輕心理的困擾，使員工更能夠面對職場的挑戰，員工的職涯發展也能更加順遂。轉換職場壓力成為創新進步動力，協助企業順利完成轉型或升級。",
    "goals": [
        "能探討企業人力資本管理、員工生涯／職涯諮詢、職場逆境情緒面對等員工理論。",
        "能進行職場身心潛能開發、工作管理、問題解決等員工輔導之研究。"
    ],
    "syllabus": "Week 1  Introduction, Syllabus Review\n\nWeek 2  Career Counseling Today\n\nWeek 3  John Holland: A typology Approach\n\nWeek 4  Krumboltz’s learning theory of career counseling\n\nWeek 5  Sociological Perspective of work and career development\n\nWeek 6  Case: The case of the Depressed Worker\n\nWeek 7  Trait-and Factor and Personal-Environment-Fit\n\nWeek 8  Case: Generating a PEF analysis\n\nWeek 9   Mid term\n\nWeek 10  A Learning Theory of Career Counseling (LTCC)\n\nWeek 11  Case of the reluctant Decision Maker\n\nWeek 12  A multicultural Career counseling Model for Ethic Women\n\nWeek 13  Case: The case of Questionable Future Status\n\nWeek 14  Interview\n\nWeek 15  Career Counseling Center\n\nWeek 16  Interview Report\n\nWeek 17  Interview Report\n\nWeek 18  Final Exam",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Text book, PowerPoint slides and video clips will be used to introduce the topics relevant to international business management"
        },
        {
            "type": "討論法",
            "note": "Students will be divided into groups. Each group will discuss assigned cases derived from textbook and present their answers to the whole class for class discussion"
        },
        {
            "type": "合作學習",
            "note": "Students will collaborate on a group project to analyze the feasibility of an international business venture."
        },
        {
            "type": "專題研究",
            "note": "Students will complete a group project report to analyze the feasibility of an international business venture."
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 20,
            "note": "A mid-term exam will be given to evaluate students’ comprehension of the course materials. The test format will include multiple choice and short essay questions."
        },
        {
            "type": "期末考",
            "weight": 20,
            "note": "At the end of the semester, a final exam will be given to evaluate students’ comprehension of the course materials. The test format will include multiple choice and short essay questions."
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "Students are expected to attend each class, prepare discussed readings and assignments and actively participate in class discussions."
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Class attendance is required. Please come to the class on time and notify the instructor ahead of time if you will be late or absent for a class."
        },
        {
            "type": "報告",
            "weight": 25,
            "note": "A 30 minute in-class interview report with PPT in the scheduled week is required."
        },
        {
            "type": "專題",
            "weight": 15,
            "note": "Case analysis report for integrating cases will be assigned as a group project. Each group will present an integrating case and their answers to case questions in class."
        }
    ],
    "prerequisite": "",
    "general_core": []
}