{
    "year": 110,
    "term": 2,
    "name": "人力資源需求評估研究",
    "teachers": [
        "賴志"
    ],
    "department": "IM86",
    "code": "IWM0066",
    "credit": 3,
    "serial": 1367,
    "group": "",
    "quota": {
        "limit": 35,
        "additional": 3
    },
    "schedule": [
        {
            "day": 5,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "誠105"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "認識人力資源發展需求及其評估的意涵。",
        "瞭解人力資源發展需求評估的理論基礎、定位、重要性與功能。",
        "學會人力資源發展需求評估要素、內容，以及常用程序、方法和技術。",
        "瞭解人力資源發展需求評估的實務（計畫和運用）和重要課題。",
        "涵養溝通、表達的技巧與培養人際關係。"
    ],
    "syllabus": "1\\. **Course Schedule: 16+2 weeks**\n\n2\\. Week 17th: Self-directed learning, the learners are requested to read the reading materials and write reports during the class hours.\n\n3\\. Week 18th: Self-directed learning, the learners should complete the report writing during the class hours, and upload/ submit it before the due day.\n\n**Course Description:** \n\nThis course will develop the knowledge, skills, and attitude of learner, to identify needs and determine if that are necessary and then can be treated with a developmental project or training solution, and/or through appropriate approaches. For performing a needs assessment, there are many techniques that will be most effective. It depends on the situation where you will conduct the analysis. Since that, the main focus of this course is to develop the appropriate concepts and proficiencies in selecting and using needs assessment techniques. For achieving the course goals, the learner will also be requested to present the results of your assignments.\n\n**Course Rationale:**\n\nNeeds assessment is an important step of organizational development and is also a fundamental area of training and development, career development, and organizational development.\n\n**Course Goals:** \n\nStudents will:\n\nA.    Realize the conceptual definition, rationale, nature, and levels of needs assessment.\n\nB.     Understand needs assessment as a basic part of the human resource development processes.\n\nC.     Understand the types of human resource needs.\n\nD.    Understand the approaches and processes of needs assessment.\n\nE.     Develop the skills to identify needs of human resource development.\n\nF.      Demonstrate competence in proposing the plan to conduct the needs assessment.\n\nG.    Demonstrate competence in performing needs assessment.\n\nH.    Demonstrate competence in identifying training and development needs of the cases.\n\nI.       Demonstrate competence in proposing and revising a needs assessment report.\n\nJ.      Understand the issues related to needs assessment from the practical area.\n\nK.    Understand the research trends and issues related to needs assessment.\n\n**Course Format:**\n\n1\\. Lectures by the instructor, invited scholars or experts\n\n2\\. Sharing with the lecture and classmates\n\n3\\. Reviewing related needs assessment reports, papers, or theses.\n\n4\\. Conducting the case study on practices of human resource development\n\n5\\. Presentations by students- presenting the result of review and case study\n\n**Schedule-2022 Spring (Weeks: 16+2)**\n\n \n\n**Week** \n\n**Topics**\n\n1\n\nCourse Introduction\n\n2\n\nBasic Concepts of Needs Assessment for Human Resource\n\n3\n\nBasic Concepts of Needs Assessment for Human Resource- Part I\n\n4\n\nBasic Concepts of Needs Assessment for Human Resource- Part II\n\n5\n\nA practical guide to needs assessment- Ch.1 and Ch.2\n\n6\n\nVerifying Importance of Needs Assessment Issues\n\n7\n\nA practical guide to needs assessment- Ch.3 and Ch.4\n\n8\n\nA practical guide to needs assessment- Ch.5 and Ch.6\n\n9\n\n Midterm Examination, Case Study Design/ Developing/ Preparation\n\n10\n\nA practical guide to needs assessment- Ch.7and Ch.8\n\n11\n\nNeeds Assessment Issues in practical field A\n\n12\n\nA practical guide to needs assessment- Ch.9 and Ch.10\n\n13\n\nHR Needs Assessment Issues in Article Papers (9)\n\n14\n\nCase Study Results Sharing \n\n15\n\nCase Study Results Sharing \n\n16\n\nCase Study Results Sharing, Final Review and Reflection \n\n(16+1)\n\n(Self study on needs assessment issues research trends)\n\n(16+2)\n\n(Self study on needs assessment issues research trends)",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "Lectures by instructor, invited scholars or experts"
        },
        {
            "type": "Group discussion",
            "note": "Reviewing related needs assessment reports, papers, or theses; sharing with lecture and classmates"
        },
        {
            "type": "Media, audio, visual materials",
            "note": "Selected film and ppt files will be adopted."
        },
        {
            "type": "Case studies",
            "note": "Case studying on practices of human resource development"
        },
        {
            "type": "Other:",
            "note": "Presentations by students- presenting the result of review and case study"
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 20,
            "note": "Reading Assignments (Individual) / 20 % The assignment of reading\twill focus on theses or journal articles that topics were related to the needs assessment issues."
        },
        {
            "type": "Midterm Exam",
            "weight": 20,
            "note": "Midterm Examination / 20 % The exam will cover all contents delivered before the exam is administered (i.e., lecture material, required text, material presented in class and through reading assignments)."
        },
        {
            "type": "Class discussion involvement",
            "weight": 10,
            "note": "Participation (Class discussion involvement) / 10%"
        },
        {
            "type": "Attendances",
            "weight": 10,
            "note": "Attendance / 10%"
        },
        {
            "type": "Presentation",
            "weight": 20,
            "note": "Chapter Presentation / 20 % Each student is assigned to select one chapter of the textbook for introduction to the content and discussions in class."
        },
        {
            "type": "Case study reports",
            "weight": 20,
            "note": "Case Study Reports (Group Assignments) / 20 % The assignment will adopt qualitative research approach, follow the case study method, and use interview to collect practical data from some typical case organizations."
        }
    ],
    "prerequisite": "◎Unavailable for M.A. program students (M.A. program courses excepted) and B.A. program students.",
    "general_core": []
}