{
    "year": 109,
    "term": 2,
    "name": "設計史",
    "teachers": [
        "長友大輔"
    ],
    "department": "TU68",
    "code": "VDU0008",
    "credit": 2,
    "serial": 3122,
    "group": "",
    "quota": {
        "limit": 45,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "設計系2A教室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本課程教授近代百年設計，以平面設計為主軸，同時亦對當時設計運動所影響的設計相關領域，包括產品、服飾、室內與建築設計風格，做關聯性的介紹。透過近代百年設計發展主要運動的介紹，建立學生對於設計史的知識與設計文化涵養的紮根，並學習思考設計運動時代下的美學思潮脈絡與發展關係。",
    "goals": [
        "1. To understand the importance of design in each historical moment",
        "2. To acknowledge historical design movement and its outcomes",
        "3. To expand knowledge of historical designer and their masterpieces",
        "4. To understand how society affects the culture and design development",
        "5. To apply the knowledge of lectures to students' professional development"
    ],
    "syllabus": "課程簡紹\n\nThis class goes through a brief history of design in the western and eastern cultures by looking at specific art and design movements in history.  \n \n\n課程目標\n\n1.  Acknowledge the fundamental knowledge in the design history\n2.  Learn the important design movements in the past history\n3.  Discuss with group to develop presentation for a part of design history\n4.  Apply design history to foresee the design industry in Taiwan  \n     \n\n教學進度與主題\n\nThis class is to understand how design industry has evolved in the past in western and eastern countries to define the importance of design. There are three levels of focus on this class, which are Design Ability, Socio-cultural Dynamics, and the brief history of Modern Design. During the session of Design Ability, the class points the origin of design as tool development, while Socio-cultural Dynamics session argues how design development was sensitive to its local culture.  The last session is to go through the brief history of Modern Design which is a new approach to the design development after the industrial revolution.  \n \n\n毎週進度\n\n週次                上課日期        課程進度、内容、主題\n\n1                      2/24                第一週課程紹介。\n\n2                      3/3                  Lecture 1: The orgin of Design \n\n3                      3/10                Lecture 2: Ancient Design from Greek to Gothic in architectural design\n\n4                      3/17                Lecture 3: Design Style development: Braque\n\n5                      3/24                Lecture 4: Industrial Revolution and its effect\n\n6                      3/31                School Holiday\n\n7                      4/7                  Lecture 6: The brief history of Modern Design\n\n8                      4/14                Group Discussion\n\n9                      4/21                Group Presentation\n\n10                    4/28                Lecture 7: BAUHAUS Workshop for modernity\n\n11                    5/5                  Lecture 8: Design revolution with Digital Media\n\n12                    5/12                Lecture 9: Pop Art and Design\n\n13                    5/19                Lecture 10: Organic Design\n\n14                    5/26                Lecture 11: Mass Production and Design\n\n15                    6/2                  Lecture 12: Democratic Design\n\n16                    6/9                  Final Exam \n\n17                    6/16                Site Visit: NTNU graphic design gallery\n\n18                    6/23",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Lecture with PowerPoint slides for transfering knowledge"
        },
        {
            "type": "討論法",
            "note": "Discussion about specific topics about the lecture"
        },
        {
            "type": "問題解決教學",
            "note": "Find related study about certain topic about design history"
        },
        {
            "type": "專題研究",
            "note": "Research report about specific topic given during the class"
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 30,
            "note": "Exam with multiple choices"
        },
        {
            "type": "期末考",
            "weight": 40,
            "note": "Research presentation about specific topic given during the class"
        },
        {
            "type": "出席",
            "weight": 20,
            "note": "Class attendance"
        },
        {
            "type": "報告",
            "weight": 10,
            "note": "Report about specific topic given during the class"
        }
    ],
    "prerequisite": "",
    "general_core": []
}