{
    "year": 107,
    "term": 1,
    "name": "工業科技教育概論",
    "teachers": [
        "林坤誼"
    ],
    "department": "HU71",
    "code": "ITU0010",
    "credit": 2,
    "serial": 1223,
    "group": "",
    "quota": {
        "limit": 35,
        "additional": 5
    },
    "schedule": [
        {
            "day": 1,
            "from": 7,
            "to": 8,
            "campus": "本部",
            "classroom": "科310"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本課程主要著重在探討科技教育之意涵、歷史演進、以及未來的發展趨勢，使學生瞭解科技與科學、科技與工程之間的差異，並讓學生瞭解臺灣、美國、英國、紐西蘭、澳洲等國家的科技素養標準之內涵，進而介紹科技教育課程的設計理念、教學策略的應用、以及評量方式的設計，藉此使學生能夠適切的瞭解科技教育的基本概念。",
    "goals": [
        "使學習者能夠了解科技教育之意涵、歷史演進、以及未來發展趨勢。",
        "使學習者瞭解科技與科學、工程之間的差異。",
        "使學習者瞭解世界各國的科技素養標準之內涵。",
        "使學習者瞭解科技教育課程設計、教學策略與評量的意涵。"
    ],
    "syllabus": "第一週：課程內容簡介、上課規範、以及評分方式。\n\n第二週：科技教育的意涵、科技與科學之異同、科技與工程之異同（教材10）。\n\n第三週：臺灣、英國、美國科技教育專業學會簡介；課後作業：請瀏覽美國和英國的科技教育專業學會網站，並繳交1頁A4的重點摘要。\n\n第四週：臺灣、美國科技教育的歷史演進與未來發展；課後作業：請針對臺灣或美國科技教育未來的發展提出你的見解，並繳交1頁A4的重點摘要（教材3、5、11、13）。\n\n第五週：英國、香港科技教育的歷史演進與未來發展；課後作業：請針對英國或香港科技教育未來的發展提出你的見解，並繳交1頁A4的重點摘要（教材6、7、13、18）。  \n\n第六週：紐西蘭、澳洲科技教育的歷史演進與未來發展；課後作業：請針對紐西蘭或澳洲科技教育未來的發展提出你的見解，並繳交1頁A4的重點摘要（教材1、13、16、25）。\n\n第七週：日本、韓國科技教育的歷史演進與未來發展；課後作業：請針對日本或韓國科技教育未來的發展提出你的見解，並繳交1頁A4的重點摘要（教材17、26）。\n\n第八週：世界各國科技教育發展對臺灣科技教育發展的啟示。\n\n第九週：期中考。\n\n第十週：九年一貫課程綱要規劃理念、內涵簡介、以及現階段的實行現況與問題（教材8）。\n\n第十一週：高中課程綱要規劃理念、內涵簡介、以及現階段的實行現況與問題（教材2、12）。\n\n第十二週：辯論：自然與生活科技領域該合併？或分道揚鑣？\n\n第十三週：科技教育的發展趨勢（STEM）。\n\n第十四週：科技教育的哲學理念、杜威動手實作哲學理念（教材14）。\n\n第十五週：科技教育的課程設計、活動導向的科技教育課程設計（教材9、21）。\n\n第十六週：科技教育的教學策略、科技教育的評量方式（教材15、19、20）。\n\n第十七週：新興科技教育課題介紹、重要科技教育文獻導讀（教材24）。\n\n第十八週：期末考。",
    "methodologies": [
        {
            "type": "講述法",
            "note": "講述科技教育之意涵、歷史演進、未來發展趨勢、以及世界各國的科技素養標準等內涵。"
        },
        {
            "type": "討論法",
            "note": "針對重要的科技教育課題或問題進行討論。"
        },
        {
            "type": "問題解決教學",
            "note": "介紹問題解決教學策略與科技實作活動的整合策略，以及問題解決教學策略教學過程中的學生學習反應與因應策略。"
        },
        {
            "type": "合作學習",
            "note": "透過小組合作發展科技教育實作活動，或者針對科技教育重要課題構思解決策略。"
        },
        {
            "type": "其他",
            "note": "透過辯論教學法以針對重要的科技課題進行討論。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "主要設計與課堂內容相關的學習單，一方面協助學生回顧課堂的學習重點，另一方面亦可深化與擴展其學習的內涵。"
        },
        {
            "type": "期中考",
            "weight": 15,
            "note": "命題型式包含是非題、選擇題、填充題、簡答題、、申論題、以及自評等六種型式。"
        },
        {
            "type": "期末考",
            "weight": 15,
            "note": "命題型式包含是非題、選擇題、填充題、簡答題、、申論題、以及自評等六種型式。"
        },
        {
            "type": "課堂討論參與",
            "weight": 25,
            "note": "主要指學生的課堂討論參與狀況，以及在課堂中主動發問與回答問題的表現情形。"
        },
        {
            "type": "出席",
            "weight": 25,
            "note": "主要指學生的出缺席狀況，以及在課堂中主動發問與回答問題的表現情形。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}