{
    "year": 107,
    "term": 2,
    "name": "繪畫史研究導論",
    "teachers": [
        "諾斯邦"
    ],
    "department": "TM67",
    "code": "AHM0115",
    "credit": 3,
    "serial": 3008,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 5
    },
    "schedule": [
        {
            "day": 3,
            "from": 7,
            "to": 9,
            "campus": "校外",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "教室:藝史所專用教室(青田街5巷6號4樓)",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course introduces the student to the history, styles, and genres of Western painting, and develops an understanding of major periods of this medium from the Renaissance until the 20th century under the scope of significant methodologies covering the field of Western art history. Paintings are addressed in their cultural context and artistic genres are presented in accordance with their historical emergence (religious painting, mythology, history painting; portraiture, landscape, still-life, etc.). Each lesson discusses a period focusing on major stylistic genres (Renaissance, Mannerism, Baroque, Classicism, Romanticism, Realism, Impressionism, Symbolism, Avant-Gardes, etc. It analyzes the influences of artists and/or artworks on specifc genres, topics or subject matter related to the Zeitgeist in question. Prominent art historians and art theories related with each period or genre are commented and contextualized. Changing methods of interpretation are carefully examined and works are analyzed under the scope of different methodological approaches and perspectives.",
    "goals": [
        "To impart in-depth knowledge on Western painting.",
        "To analyze and understand the historical development of Western painting.",
        "To cultivate student’s abilities to observe, understand, compare and interpret works.",
        "To shape student’s abilities to question and solve issues related to Western painting. To encourage their critical thinking.",
        "To train students to collect, study, and analyze primary and secondary sources, to select and comment the literature related to a specific topic."
    ],
    "syllabus": "**Renaissance**\n\n\\-       Florence 1400-1475: Emulation and Paragone\n\n\\-       Northern Renaissance and Italy\n\n\\-       Venice: Between North and Byzantium\n\n\\-       High Renaissance: Looking for Beauty\n\nLeonardo da Vinci / Raphael / Michelangelo\n\n**Mannerism**\n\n\\-       Giulio Romano and the Palazzo Tè: A Playful Deconstruction\n\n\\-       Eccentricity: Pontormo, Parmigianino\n\n\\-       Tintoretto and Entrepreneurship\n\n\\-       Rudolph II and Prague\n\n**Baroque**\n\n\\-       The Carracci / Caravaggio\n\n\\-       The Art of Counter Reform / The Dutch Reform and Art\n\n**Rubens / Rembrandt**\n\n\\-       The Golden Age in the Netherlands: Genres, Specialization and Art Market\n\nSteen and Vermeer\n\n**Rococo**\n\n\\-       Scenes galantes and the Art of Intimacy\n\nWatteau, Boucher and Fragonard\n\n\\-       Public Exhibitions. The Salons and Art Critic\n\n**Neo-Classicism / Romanticism**\n\n\\-       Jacques-Louis David and Classicism\n\n\\-       Sublime! The Art around 1800\n\nFuseli, Caspar David Friedrich, Goya, Turner, Delacroix\n\n**Realism**\n\n\\-       The Pre-Raphaelites / Courbet\n\n\\-       The Invention of Photography\n\n**Impressionism / Symbolism**\n\n\\-       The Painters of the Modern Life\n\nManet, Caillebote, Degas, Monet\n\n\\-       Whistler and the Art for Art’s Sake\n\n\\-       Secrets and Ambiguity: Redon, Khnopff, Klimt  \n  \n\n**Teaching Methods**\n\nFor each lesson students are given a handout. It includes the essential bibliography mentioning monographs, academic studies, articles, documents, archives, and/or critics related to the topic. It provides the list of works (illustrations) analyzed during the lesson\n\nEach session tends to tackle a specific issue. Its goal is to present, analyze, and discuss the most important theoretical and practical aspects related to the topic in question. The outlines and the main issues are introduced at the beginning of each lesson. A brief summary of the previous lesson introduces the new issues which will be discussed. If questions related to previous lessons are still pending, they are answered, and/or recontextualized.\n\nThe topics are addressed through a close reading and detailed analysis of a single, or a group of works of art. The main issues related to a subject are examined through concrete examples. Different points of view are privileged in order to open new perspectives on well or-less known objects. I select various scientific texts, documents and sources and comment on them. Images, texts, and documents are used in order to present original and critical approaches.\n\nStudents’ abilities to gather, investigate and analyze art history resources are trained through personal contributions, such as the essays they are asked to present orally during the semester, and complete in a 10-page length written paper by the end of the semester. The topics are carefully chosen in order to propose issues that are closely related to the main topic of the course. Their relevance depends also on their accessibility. When selecting the topics I always take into account the literature at disposition. The students are in this respect given a selected bibliography which helps them to access the topic with the most appropriate tools. Students are also asked to complete their research with other readings.",
    "methodologies": [
        {
            "type": "實地考察、參訪",
            "note": "Study visits are organized when possible and according to the course topic – depending on the cultural actuality (exhibitions, events etc.)"
        }
    ],
    "grading": [
        {
            "type": "出席",
            "weight": 20,
            "note": "During the course the skills of the students are tested through questions intended to tackle problems in direct relationship to the topic. They are trained in the observation of artworks. They are taught how to describe a work (from the more general to the more specific), to understand its structure, its content, and its meaning. They are asked to compare works (or documents) with similar or contradictory examples. They are taught to identify and to interpret the different meanings of a work. Their aesthetic sensitivity and their critical thinking are encouraged through an acute observation and analysis of the works, documents, and academic writings introduced throughout the course. If the content presented seems to be unclear to the students, it is clarified through questions and answers."
        },
        {
            "type": "報告",
            "weight": 50,
            "note": "Students’ abilities to formulate a specific issue on a specific topic related to the course attended are trained, and improved. They are asked to present and structure their argumentation coherently, to produce a critical research based on an acute observation of the works analyzed, and to find possible solutions in a 30 minute time-lapse. The discussions, comments, and critics formulated during and/or after their oral presentation are always thought in a constructive way. They are intended to encourage the students to improve their critical approach, to redirect their previous intentions."
        },
        {
            "type": "成果展覽",
            "weight": 30,
            "note": "Students are asked to hand out a final paper respecting some formal, but essential points according to the common use in the academic field of art history (table of contents, quotations and correct referencing, presence of bibliography, illustrations etc.). Students are given a style sheet on which they can take example. The content should be well structured, written correctly, and thoroughly documented."
        }
    ],
    "prerequisite": "",
    "general_core": []
}