{
    "year": 107,
    "term": 1,
    "name": "專題討論：課程、教學與評量",
    "teachers": [
        "譚克平"
    ],
    "department": "SD45",
    "code": "SED0091",
    "credit": 2,
    "serial": 2585,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 4,
            "from": 3,
            "to": 4,
            "campus": "公館",
            "classroom": "教室自排"
        }
    ],
    "programs": [],
    "comment": "任課教師希望修課同學能具備科學教育/數學教育基礎。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本課程旨在培養對於課程、教學與學習之重要發展及當前相關議題之瞭解，並經由設計、分析及執行之過程中，發展適切的科學課程、教學、及評量之理念、模式及策略。",
    "goals": [
        "瞭解課程、教學及學習理論之發展與研究，鑑識國內外當前主要相關議題，並能進行比較、分析、評論。",
        "熟悉重要教學理論及學習理論發展現況，藉以分析教學實務案例，促進達成有效科學教學及學習。",
        "瞭解科學課程的重要沿革，運用教學與學習理論對課程進行不同層次的分析與設計。"
    ],
    "syllabus": "**由以下內容選擇其中10項主題，配合學生自選主題，進行教學。**\n\n1. Next Generation Science Standards.\n\nMore: Osborne, J. (2014). Teaching scientific practices: Meeting the challenge of change. Journal of Science Teacher Education, 25, 177-196.\n\n2. AAAS (2000). Atlas.\n\nMore:  Lederman, N. G., & Lederman, J. S. (2014). Is nature of science going, going, going, gone? Journal of Science Teacher Education, 25, 235-238.\n\n3.  Akerson, V. A., & Young, T. A. (2008). Why research on interdisciplinary language arts and science instruction? In V. L. Akerson (Ed.) Interdisciplinary language arts and science instruction in elementary classrooms: Applying research to practice. Mahwah, NJ: LEA.\n\nMore: Richards, J. C. (2008). Interdisciplinary teaching: History, theory, and interpretations. In V. L. Akerson (Ed.) Interdisciplinary language arts and science instruction in elementary classrooms: Applying research to practice. Mahwah, NJ: LEA.\n\n4. Sadler, T. D. (2008). A sociocultural perspective on scientific literacy and learning science. In V. L. Akerson (Ed.) Interdisciplinary language arts and science instruction in elementary classrooms: Applying research to practice. Mahwah, NJ: LEA.\n\n5. Anderson, R. D. (2007). Inquiry as an organizing theme for science curricula. In S. K. Abell & N. G. Lederman (Eds.), Handbook of research on science education. Mahwah, NJ: LEA.\n\n6. Aikenhead, G. S. (2007). Humanistic perspectives in the science curriculum. In S. K. Abell & N. G. Lederman (Eds.), Handbook of research on science education. Mahwah, NJ: LEA.\n\n7. Graves, I., & Phillipson-Mower, T. (2008). Using critical literacy in the science classroom. In V. L. Akerson (Ed.) Interdisciplinary language arts and science instruction in elementary classrooms: Applying research to practice. Mahwah, NJ: LEA.\n\n8. Davis, E. A., & Krajcik, J. S. (2005). Designing educative curriculum materials to promote teacher learning. Educational Researcher, 34(3), 3-14.\n\n9. Beyer, C. J., Delgado, C., Davis, E. A., & Krajcik, J. (2009). Investigating teacher learning supports in high school biology curricular programs to inform the design of educative curriculum materials. JRST.\n\n10. Stern, L., & Ahlgren, A. (2002). Analysis of students’ assessments in middle school curriculum materials: Aiming precisely at Benchmarks and Standards. JRST, 39(9), 889-910.\n\n11.Krajcik, J., McNeill, K. L., Reiser, B. (2007). Learning-goals-driven design model: Developing curriculum materials that align with national standards and incorporate project-based pedagogy. SE, 91, 1-32.\n\n12.Powerll, D. A. & Aram, R. J. (2008). Children publish in science as a way of knowing. In V. L. Akerson (Ed.) Interdisciplinary language arts and science instruction in elementary classrooms: Applying research to practice. Mahwah, NJ: LEA.\n\nMore: Sandoval, W. A., & Millwood, K.A. (2005). The quality of students’ use of evidence in written scientific explanations. Cognition and Instruction, 23(1), 23-55.\n\n13.Ford, M. (2008). Disciplinary authority and accountability in scientific practice and learning. SE, 92, 404-423.\n\n14.Morge, L. (2005). Teacher-pupil interaction: A study of hidden beliefs in conclusion phases. IJSE, 27(8), 935-956.\n\n15.She, H. C. (2004). Facilitating changes in ninth grade students’ understanding of dissolution and diffusion through DSLM instruction. RISE, 34(4), 503-525.\n\nMore: Ebenezer, J., Chacko, S., Kaya, O. M., Koya, S. K., Ebenezer, D. L. (2009). The effects of common knowledge construction model sequence of lessons on science achievement and relational conceptual change. JRST.\n\n16.Osborne, J., Erduran, S., & Simon, S. (2004). Enhancing the quality of argumentation in school science. JRST, 41(10), 994-1020.\n\n17.Martin, A. M., & Hand, B. (2009). Factors affecting the implementation of argument in the elementary science classroom. A longitudinal case study. RISE, 39(1), 17-38.\n\nMore: B. M. Hand (Ed.) (2007). Science inquiry, argument and language, pp.87-138. Rotterdam: Sense.\n\n18.Enfield, M., Smith, E. L., Grueber, D. J. (2008). “A sketch is like a sentence”: Curriculum structures that support teaching epistemic practice of science. SE, 92(4), 608-630.\n\n科學教育學刊，學習環境專刊。",
    "methodologies": [
        {
            "type": "講述法",
            "note": "課程進行過程中，教師將依課程內容和進度指定與課程主題相關的作業以幫助學生學習。"
        },
        {
            "type": "討論法",
            "note": "上課時就閱讀文獻之摘要內容提出約10分鐘之報告，並另外提出兩個問題，供上課討論。"
        },
        {
            "type": "實地考察、參訪",
            "note": "依進度安排"
        },
        {
            "type": "專題研究",
            "note": "每位學生必須選擇個人有興趣的研究主題，除可參考指定閱讀文獻外，應針對重要相關議題尋找文獻（SE、IJSE、JRST、RISE等重要科教期刊論文），整理不同觀點及證據。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 70,
            "note": "學生必須依規定之要求完成作業並按時繳交。"
        },
        {
            "type": "課堂討論參與",
            "weight": 10,
            "note": "每次上課，學生必須於課前閱讀完畢指定閱讀資料，提出至少1頁(A4，單行間距)之書面報告，於上課前一天中午前傳送給授課教師及其他同學。"
        },
        {
            "type": "專題",
            "weight": 20,
            "note": "撰寫一篇10頁(A4，1.5行間距)之專題書面報告，並於期末就書面報告內容提出口頭報告，報告時間約為20分鐘(含討論)。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}