{
    "year": 108,
    "term": 1,
    "name": "學校健康服務專題研討",
    "teachers": [
        "高松景"
    ],
    "department": "EU05",
    "code": "HEC9005",
    "credit": 2,
    "serial": 747,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 2,
            "from": 8,
            "to": 9,
            "campus": "本部",
            "classroom": "正104"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "9",
    "dept_group": "",
    "hours": 2,
    "description": "學校健康服務專題研討",
    "goals": [
        "學校健康服務"
    ],
    "syllabus": "課程簡介: 未來只有一種產業，叫服務業。學校健康服務（School Health Services）也就是學校保健工作，無論是傳統的學校衛生工作三三模式（健康教學、健康服務與健康環境）或是當前健康促進學校（Health-Promoting School）六大策略，學校健康服務都是整體學校衛生工作重要的一環。面對社會的變遷與學校教育的變革，學校健康服務應如何創新服務，貼近學生健康成長需求，增進學生健康？ 學校是促進青少年健康的最佳場所，促進青少年健康也是學校教育重 要的目標。WHO(2015)提出「提昇青少年健康照護服務品質的全球標準」， WHO（2017）再進一步提出「全球加快青少年健康行動（AA-HA!）」倡導各國應支持青少年健康行動可採取「參與、行動、創新」等策略。學校健康服務包含範圍很廣：健康檢查、缺點矯治、傳染病防治、學生傷病處理、 健康管理、健康咨詢、學生健康促進活動、教職員工健康促進活動..等。 本課程特別導入管理學及社會行銷的觀點，來探討如何創新學校健康服務，並從健康促進學校的推動模式來探討規劃學校本位學校健康服務計畫。 本課程與教學設計係以學習者為中心，在探究、發表、論證、與實作中淬練學生成為協作性的學習者；教學方法採「問題導向學習PBL」、小組合作學習、世界咖啡館、開放空間會議、校外參訪、資源人物座談…等多元教學方法。期在透過小組探究學校健康服務實務主題中，引導學生後設性思考，培育學生成為倡議創新學校健康服務的專業人才。 教學進度: 1.相見歡、課程簡介 2.定位學校健康服務的意涵與內容：從全球及國內增進青少年健康演變來探討 3推動學校健康服務的組織團隊：參訪學校健康中心之經營與管理（衛生組長與學務主任的角色） 4青少年需要怎樣的健康服務？問題導向學習PBL+開放空間會議 5啟動學校健康服務：探討國內學校健康檢查制度（邀請資源人物座談） 6.學校健康服務PBL探究主題（一）缺點矯治（視力不良、齲齒） 7學校健康服務PBL探究主題（二）學生健康管理與健康自我照顧 8.學校健康服務PBL探究主題（三）學生健康諮詢與輔導（邀請資源人物座談） 9學校健康服務PBL探究主題（四）校園傳染病防治與緊急傷病學生處理 10整合社區青少年醫療照顧服務：青少年親善門診（邀請資源人物座談） 11健康服務點子大蒐集--國內外學校創新健康服務作法比較（期中報告） 12發想健康服務點子：社會行銷理論之應用 13學校健康服務PBL探究主題（五）學生健康促進活動 14學校健康服務PBL探究主題（六）教職員工健康促進 15師生的健康需求我看到了！如何規劃學校本位健康服務企畫案 16小組自主探究 17小組發表學校本位健康服務企畫案（一）（期末報告） 18小組發表學校本位健康服務企畫案（二）（期末報告）",
    "methodologies": [
        {
            "type": "講述法",
            "note": "配合學習單並ppt簡報，有系統論述學校健康服務的核心概念及重要主題"
        },
        {
            "type": "討論法",
            "note": "依教學目標，適切採取六六討論法、小組討論、PBL、世界咖啡館、開放空間等討論方法，以促進學生間互動、對話，交流觀點"
        },
        {
            "type": "合作學習",
            "note": "採學習共同體的小組協同學習及分組合作學習，針對爭議性的性教育議題進行觀點交流與觀點取替，來促進學生對話與學習。"
        },
        {
            "type": "實驗/實作",
            "note": "透過進行規劃學校本位健康服務企業案的實踐,來反思學校健康服務的議題"
        },
        {
            "type": "實地考察、參訪",
            "note": "參訪學校健康中心及學校健康促進工作，瞭解推動學校健康服務組織運作"
        },
        {
            "type": "媒體融入教學",
            "note": "播放DVD影片、自製PPT等輔助媒體"
        },
        {
            "type": "其他",
            "note": "邀請學校健康服務議題相關的各領域專家擔任資源人物，來到課堂與學生做面對面對話。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "配合課堂進度所進行PBL隨堂作業、校外參訪報告等"
        },
        {
            "type": "期中考",
            "weight": 20,
            "note": "健康服務點子大蒐集--國內外學校創新健康服務作法比較"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "學習的產生來自於彼此聆聽、對話與分享，因此課堂積極參與課堂進行的學習活動，是課堂美麗風景的呈現。"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "出席課堂學習情形"
        },
        {
            "type": "專題",
            "weight": 20,
            "note": "期末小組學校本位健康服務企畫案"
        },
        {
            "type": "其他",
            "weight": 10,
            "note": "個人期末整體學習心得報告"
        }
    ],
    "prerequisite": "",
    "general_core": []
}