{
    "year": 109,
    "term": 2,
    "name": "日語（二）",
    "teachers": [
        "張怡倩"
    ],
    "department": "GU",
    "code": "0HUG652",
    "credit": 2,
    "serial": 1057,
    "group": "B",
    "quota": {
        "limit": 50,
        "additional": 26
    },
    "schedule": [
        {
            "day": 1,
            "from": 8,
            "to": 9,
            "campus": "本部",
            "classroom": "誠109"
        }
    ],
    "programs": [],
    "comment": "日語母語者不可修本課程",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本課程乃賡續【日語(一)】的程度，讓已具備日語(一)的學生們能夠使用日常生活上的簡單會話用語，並逐步進入日語語法、特別是動詞變化的學習。學期結束後，期待學生能夠具有通過日語檢定N5的程度。",
    "goals": [
        "奠定中級日語能力基礎",
        "繼續對日本資訊的理解能力",
        "引領學生對日本社會與文化的正確認知，縮短彼此間的文化差異。",
        "奠定未來從事日本研究的語文能力"
    ],
    "syllabus": "第1週.\n\n(1) 第七課 歡迎光臨。首先，談論日本時事。接著，講解本課單字及句型。本課重點一，在於助詞的其他用法的使用。使用第一課到第七課的助詞來編寫對話。並學習詢問不懂日語時的日語句型表達。\n\n(2)第七課 授受動詞的使用。首先，教授旅遊日語的表達。接著，複習本課單字。然後，於說明「授受動詞」的基本表達後，進行教室活動。藉由傳遞物品的活動，來學習表達授受動詞。最後，講解及聽解會話，並且解答課本問題。\n\n第2週.第八課 該告辭了。首先，補充課外時事。接著，講解第八課單字。本課開始導入日語的形容詞。因此，重點在於讓學生學會「形容詞的現在肯否定」的表達。藉由形容詞句來詢問對方的感受，學會形容詞的用法。\n\n第3週.第八課形容詞的使用。首先，導入觀光日語。接著，複習第八課單字。然後，講解「形容詞的完整表達」。藉由完整的形容詞，進行猜謎活動。讓學生練習以形容詞猜謎的方式，學會形容詞的表達。\n\n第4週.第九課 真可惜呀。首先，導入時事用語。接著，講解第九課單字。然後，導入表「喜好」、「厭惡」及「能力」的表達。最後，導入基本的副詞表達。藉由喜好、厭惡及能力的句型及副詞修飾語，讓學生可以介紹自己的興趣。\n\n第5週. 第九課 表「喜好」、「厭惡」及「能力」的表達。首先，導入餐旅日語。接著，複習第九課單字。並補充蔬菜、水果、肉類、電影及興趣等語彙。然後，配合句型的練習，進行教室活動。藉由這樣的教室活動，讓學生學會表能力、好惡等形容詞的表達。最後，再講解和聽解本課會話文，解答課本問題。\n\n第6週.第十課 有魚子醬嗎?首先，導入時事用語。接著，講解第十課單字。然後，測試學生對方位語彙的熟悉度。接著，教授完整的「有生命」和「無生命」的句型。藉由單字和句型，讓學生分組進行編寫對話的活動。最後，再依序上台發表對話。\n\n第7週.第十課 有生命、無生命及方位的表達。首先，導入觀光日語。然後，複習單字。接著，講解另一部份的句型。然後，講解及聽解會話。最後，詢問會話內容，確認學生是否理解其內容。\n\n第8週. 期中考  筆試\n\n第9週.第十一課 頻率。首先，導入時事討論。接著，講解本課單字及片語。然後，教授表「頻率」的句型。運用單字及頻率句型的表達，導引出日常生活會話的例文。最後，導入教室活動練習，並使學生背誦課本例文及對話。\n\n第10週.第十一課量詞表達與使用。首先，導入觀光日語。接著，複習本課單字。然後教授課本基本的「量詞」語彙。藉由不同種類的量詞，不同情況的事例，來學習量詞的表達。並導入教室活動。最後，講解及聽解本課會話文。\n\n第11週.第十二課 比較。首先，導入時事討論。接著，講解單字。然後，講解「形容詞的過去肯否定的變化」。藉由例文來講解形容詞過去肯否定的變化，並練習創造新的例文。最後，講解課本裡的句型，並回答問題。\n\n第12週.第十二課 咖啡和紅茶您要選擇哪一個？首先，導入觀光日語。然後，複習單字。接著，講解以下兩句型，表「兩者比較」及做「三者以上選擇」時的要點及特點。藉由這些句型與範例來說明兩句型的不同，並讓學生練習造句。最後，講解及聽解會話文。\n\n第13週.第十三課 表目的。首先，導入餐旅日語。然後，講解單字與片語。本課重點在於利用「動態性名詞來表達目的」。因此，除了需把動態性名詞變成動詞的練習外，還需學習動態性名詞表目的的句型。藉由這樣表目的的句型，讓學生的日語表達變得更完整。\n\n第14週.第十三課 表目的。首先，導入餐旅日語。接著，複習單字及句型。並一一地與學生練習對話。然後，講解課本句型及講解練習題。最後，講解並聽解課本會話文並詢問問題。\n\n第15週.\n\n(1)第十四 課動詞變化。首先，導入觀光日語。然後，講解單字與片語。接著，導入動詞分類及變化。讓學生學會「動詞的音便規則」，並會做「動詞變化」。最後，運用動詞音便及句型，來學會請求對方做某事的句型表達。\n\n(1)第十四 您的家人？首先，導入觀光日語。然後，複習本課單字及句型。接著講解新的句型。利用新句型來表達「正在進行做某事」。藉由這種正在進行的句型，兩兩一組來編對話。最後，講解及聽解會話文，並詢問問題，來確認學生是否瞭解其內容。\n\n第16週.期末考  筆試\n\n第17週  複習14課動詞變化的內容，於MOODLE系統上放置上課用PPT及參考資料  以方便同學學習。\n\n第18週  總複習本學期7-14課的內容 ，於MOODLE系統上放置上課用PPT及參考資料  以方便同學學習。",
    "methodologies": [
        {
            "type": "講述法",
            "note": "教師講解語法"
        },
        {
            "type": "討論法",
            "note": "學生編寫會話文"
        },
        {
            "type": "合作學習",
            "note": "分組練習"
        },
        {
            "type": "媒體融入教學",
            "note": "使用PPT教學及影片教學"
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 30,
            "note": "筆試"
        },
        {
            "type": "期末考",
            "weight": 40,
            "note": "筆試"
        },
        {
            "type": "出席",
            "weight": 20,
            "note": "出席率"
        },
        {
            "type": "其他",
            "weight": 10,
            "note": "小考單字"
        }
    ],
    "prerequisite": "",
    "general_core": [
        "人文藝術"
    ]
}