{
    "year": 109,
    "term": 2,
    "name": "自主學習：專題探究",
    "teachers": [
        "胡衍南"
    ],
    "department": "GU",
    "code": "0SUG539",
    "credit": 2,
    "serial": 4582,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 0,
            "from": -1,
            "to": -1,
            "campus": "",
            "classroom": ""
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎第一階段需人工加選◎第二階段需人工加選◎加退選階段需人工加選允許重複修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "為鼓勵學生自主學習，培養跨域探索及終生學習之精神，學生得依據不同學習狀態及需求自主規劃學習方案，由個人或團隊自主規劃至少36小時之自主學習課程並提出學習計畫書，經審核通過後實施。本課程期許透過學生自行規劃與實踐學習方案的過程，激發學生自主、多元的學習能力。",
    "goals": [
        "促使學生能確立大學目標並培養良好的主動學習動機與方法。",
        "使同學探究大學之生涯規劃，以便日後大學生涯目標之訂定與實踐。"
    ],
    "syllabus": "基於參與開設本校109學年度第二學期五校聯盟微課程及科技系109-1專題製作課程中劉京昀等5人完成之結合RFID之機械手臂設施，透過學習轉移(Learning Transfer)及後設認知(Metacognition)，發想該RFID機械手臂之教學方案。希能培養參與學生以本系專業為基礎，結合聯合國SDGs良質教育及創新基礎建設兩大目標，進行跨領域探索及以機電整合為本課程核心任務，學習議題導向問題解決能力。\n\n本學期之課程主要以實作、工作坊及公開展覽之方式進行。有鑑於助教們均已有多次參與機械手臂之製作及競賽活動之經驗，故課程將從接觸本次改良後RFID機械手臂開始，透過奠基於現有之機械手臂教材(如：五校聯盟微課程及格致國中之教材)之認知，於準備階段由大家共同討論如何發展此部份之教案及教材設計原則。完成教案設計後，即將教案切割，由修課同學分配進度：透過各自經驗與自主學習之方式蒐集教學資料，自主完成教案及教材。\n\n教案及教材於籌備過程中，透過每週至少一次由同儕、指導教師(必要時加入國小端代表)組成之共同備課工作坊，檢視教學流程及實作環節之安排。另考量國小端學生程度差異甚大，爰於合作國小端確認授課年級後亦會透過此環節確保教學內容與對象之適切性及難易度。接續透過試教，落實行動教學的滾動式修正流程。再到正式授課時與學生的互動，除進行行動化教學的教案落實、教導學生有關機電整合、自動化工程、運算思維等知識與實務運用外，亦提供授課學生顯著之反思數據、資料及未來教學方式、教具教案等改善之參考。\n\n靠近學期末，配合新林國小的創客Maker展，我們將實際設置展覽及對參加展覽的民眾進行實際解說乃至交流互動。透過這過程希望讓全校師生乃至校外人士瞭解此創新教學計畫與實務，並透過此種雙向交流之方式提供多元刺激，不僅促成全民科普教育之認知，亦提供修課學生對教育社會責任及多元文化觀點一個良性之學習及交流之機會。\n\n本學期課程除機械手臂之教案教材發展外，整體課程於認知層面將著重於「後設認知」及「教中學」的參考。寒假階段我們將透過聚會，先從文獻探討開始，利用 Empirical Evidence on the Effectiveness of the Learning by Teaching Technique among University-level English as a Foreign Language Students (Kasim, Muslem & Mustafa, 2020)的內容，先就教中學的定義、實行方式有一定認知，闢利開學時自主學習評量標準之訂定。開學後隨同教案及教材設計，我們將逐漸帶入於附件區其餘兩篇論文，帶領大家反思在這過程中修課學生及國小學生後設認知與教案教材之關係。作為未來反思與自身生活經驗及未來發展思考的一大參考。\n\n此外本課程因涉及跨領域結合的部份，不得不提到STEM這個名詞。本名詞的定義是科學、科技、工程、數學四個學科的縮寫(Bybee, 2013)，由於此四學科相輔相成，許多不同領域的學者認為 STEM 有潛力為教育提供重要的創新機制，也可做為未來教育改革的重要元素。以日前微課程為例，修課學生可先透過科學學科，理解如摩擦力、靜力平衡等相關力學知識。透過工程學科，修課學生可進一步估算機械手臂各部位之力學數據，並透過工程知識進行相關材料之採購及組裝。再透過科技領域，修課學生將透過初步的程式設計去學習如何遠距控制手臂運作，並透過程式最大化手臂之功能範圍。最後在這整套過程中，透過數學學科之學習，修課學生能進行數據統計及分析，並藉此量化機械手臂之效能，進而將問題具體化進而解決之。對於國小生而言他們或許尚未需要接觸如數學、物理等較為複雜之內容，但這流程背後的科學精神科技素養正是本階段亟需培養之能力。對修課學生而言，如何透過機械手臂協助國小生發展本教案是極為重要的能力。此外無論是國小生或修正生生將在此過程中，透過彼此對科學問題的理解，由修課學生帶領國小生綜合前揭技能，引導他們學習解決問題之能力，甚與認知心理學等內容進行結合，使各自皆可回扣自身學習經歷，達到自我省思之目的，於國小生端亦或修課學生端完成一次完整之教育循環。",
    "methodologies": [
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "實驗/實作",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "報告",
            "weight": 30,
            "note": "就本學期教案及教材之發展內容、過程；共同備課之準備：現場授課之情況和與雙語教育或各領域再發展之可能性之結合進行反思"
        },
        {
            "type": "成果展覽",
            "weight": 20,
            "note": "新林國小創客Maker展覽"
        },
        {
            "type": "專題",
            "weight": 25,
            "note": "教案及教材設計"
        },
        {
            "type": "其他",
            "weight": 25,
            "note": "教學實踐"
        }
    ],
    "prerequisite": "",
    "general_core": [
        "專題探究"
    ]
}