{
    "year": 109,
    "term": 2,
    "name": "民主與溝通",
    "teachers": [
        "邵軒磊"
    ],
    "department": "GU",
    "code": "0SUG237",
    "credit": 2,
    "serial": 1067,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 0
    },
    "schedule": [
        {
            "day": 3,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "誠304"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "本課程藉由介紹公民素養與法治之基本觀念，如民主與環境權、民主政府體制等等並佐以各種生活中之民主實例，如大學校園、婚姻與家庭、職場與工作，訓練學員溝通能力，期待年輕公民該要如何循序漸進理解現代民主社會的運作，進養成應有的民主和守法的公民態度。期盼透過這些課題的安排，使年輕公民明瞭當代民主政治運作、養成法治觀念，進而形成應有的現代公民素養與態度。並安排課堂實踐形式，讓學員們能「練習」民主參與，溝通技巧，加深對公民素養之體認。授課教師並穿插講解現代政治哲學之基本教材（如：正義論Theory of Justice、自由與命運Freedom and Destiny等基礎政治哲學入門書。）能有效提升學員之當代公民素養。\n教材淺顯易懂，課程難易適中，不需前修課程，適合各學院與各專業之學員修習。本課程也使用MOODLE、FACEBOOK等各種網路電腦設備，將科技融入教學，使同學學習有效率。目標在於將基本學理、思維方法、議題探究等三方面結合，並發展公民行動方案，以積極行動參與社會改良，實踐公平正義。",
    "goals": [
        "使學員能結合以前所學了解公民素養與全球化知識。",
        "學員需要綜合跨領域跨文化知識思考民主與溝通，並增進對我國公民素養以及法制之了解，以擴充國際視野與增進對國際國內社會多元文化之認識。",
        "學員必須學習團隊溝通，並能主動表達自身主張，融合他人主張，並養成合作之習慣。",
        "透過正確理解「公民素養」，可以激發學生對社會關懷，將來投入公務行列或使更有參與公共事務能力。"
    ],
    "syllabus": "本課程並配合生活中重要情境，訓練修課同學們對於「民主與溝通」素養。教科書之外，本課程將以生動教學介面如：政治模擬機制，使同學進行各種體驗。本課程具有總整式課程，翻轉教室等特性，是現今相當前沿的教學模式。本課程藉由介紹公民素養與法治之基本觀念，如民主政府體制、溝通、政治談判等等事件，並佐以各種生活中之民主實例，期待年輕公民該要如何循序漸進理解現代民主社會的運作，進養成應有的民主和守法的公民態度。期盼透過這些課題的安排，使年輕公民明瞭當代民主政治運作、養成法治觀念，進而形成應有的現代公民素養與態度。並安排課堂實踐形式，設計模擬情境，讓學員們能「練習」民主參與，溝通技巧，談判交涉，加深對公民素養之體認。教材淺顯易懂，適合各學院與各專業之學員修習。本課程也將科技融入教學，使同學學習有效率。目標在於將基本學理、思維方法、實例學習等三方面結合，實踐公平正義。",
    "methodologies": [
        {
            "type": "講述法",
            "note": "以教授講述課程相關理論、觀念與技巧為主。"
        },
        {
            "type": "討論法",
            "note": "講述之餘，讓同學討論，能更激勵腦力激盪。"
        },
        {
            "type": "問題解決教學",
            "note": "以模擬形式，讓學員學習如何在生活中實踐公民素養，達到民主與溝通。"
        },
        {
            "type": "媒體融入教學",
            "note": "本課程將媒體融入教學，使同學學習有效率，將公民素養與溝通談判知識融入真正實踐當中，寓教於樂，能夠成為學生之長期記憶。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": "課堂作業"
        },
        {
            "type": "課堂討論參與",
            "weight": 40,
            "note": "課堂討論參與"
        },
        {
            "type": "出席",
            "weight": 20,
            "note": "課堂出席"
        },
        {
            "type": "其他",
            "weight": 10,
            "note": "其他課程相關學習表現"
        }
    ],
    "prerequisite": "",
    "general_core": [
        "社會科學"
    ]
}