{
    "year": 107,
    "term": 2,
    "name": "當代理論專題研究（一）",
    "teachers": [
        "李秀娟"
    ],
    "department": "LD21",
    "code": "END1026",
    "credit": 3,
    "serial": 1561,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 2,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "雲204"
        }
    ],
    "programs": [],
    "comment": "上課教室在雲和街大樓二樓，地址為雲和街1號(位於雲和小火鍋斜對面、Cafe a la mode正對面)，從師大側門右轉看見Starbucks右轉進入巷子步行約2分鐘(130公尺)，右手邊就會看到雲和街大樓，亦可使用Google Maps APP查詢位置。請同學使用學生證感應，進出雲和街上課教室。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "In February 2020, as COVID-19 began ravaging Europe, leftist thinkers including Giorgio Agamben, Jean-Luc Nancy, Roberto Esposito, and Slavoj Žižek offered critiques of pandemic measures, instigating a biopolitical debate. A year later, with no sign of the pandemic’s abating, we must still adhere to emergency pandemic protocols, normalizing in our daily lives the “state of exception” comprising elements such as masks, alcohol sanitizers, and social distancing. We have come to exist in a spatiotemporally confused spiritual malaise of simultaneous exception and normality, anxiety and repose, acceleration and furious deceleration.\nCompared with other viruses, the novel coronavirus seems to be more invasive, more likely to insinuate itself into our bodily organs, to reproduce, thrive, and suspend or subvert our daily routines; and measures such as quarantine and lockdown have similarly unfolded a suspended, abstracted temporality: The weird logic of viral contagion that has subsumed our lives is also a state of viscocity and unpredictable acceleration. We can draw on the research of University of Toronto East Asian Studies professor Eric Cazdyn to link the temporality of COVID-19 to that of chronic illness; diseases such as cancer and autoimmune diseases have become more prevalent, their diagnoses less certain, and their prognoses less assured. The interminable temporality of chronic illness has lost its linear segmentation, becoming flattened and thinned out. Perhaps, as the pandemic rages, our continuing discussions and anticipations of its end merely throw into stark relief our inability to imagine a real end or future. Might this be a contemporary spiritual malaise that we ought to fathom? At the intersection of the virus’s rapid spread and the interminability of chronic illness, in the face of the various global disasters wrought by the fast and the slow, how can the humanities and comparative literature in Taiwan and even Asia represent disaster and pandemic trauma? Can we develop a prosthetic for comprehension in an age of coronavirus? How can we respond to this spiritual malaise of our time and reflect on our (inter)disciplinarity? This conference hopes to respond to these questions from a wide variety of perspectives.\nContemporary French philosopher Paul Virilio sees speed as what separates modern from premodern society, and acceleration as a prominent political phenomenon of the former. To understand the history and technological engine of modern society, we cannot neglect “accidents” that are closely related to speed and acceleration. In his early Speed and Politics (1977), Virilio traces the fascination of modernity with speed and progress to the French Revolution. Virilio is particularly interested in the relation between speed and war; the history of modernity is the history of speed, involving the railroading of obstacles and limitations using martial technologies of violence or terrorism. Speed is akin to the utopian principle of the West, one might say the only principle of (hyper/post)modernity, whereupon stasis symbolizes death and decay. The “integral accident” is the other focus of Virilio’s work, constituting the un/subconscious of the politics of speed, suppressed yet always ready to strike. Hyperlinked information and communications technology allow anything, including accidents, to appear anywhere with unpredictable speed—the “hyper-present” is thus a temporality of accidents. Our inability to anticipate, let alone control, this temporality has caused modernity’s uncontrollable affect or crisis of the spirit. To Virilio, the integral accident has revealed the pursuit of movement, speed, and progress at the core of modernity; disaster is but the result of the headlong rush of the “empire of speed” into the fantasy of utopian progress. Disaster accompanies ubiquitous acceleration.\nUniversity of Melbourne researcher Robert Hassan writes in Empires of Speed: Time and the Acceleration of Politics and Society (2009), “Speed is of the essence, and through it, the global economy, along with its culture and society more generally, are pulled into the orbit of acceleration—a temporal hyper now—wherein humans (error-prone individuals) tend to cope imperfectly” (97). We even see an addiction to speed, or “speed mania” (99, 101). Neither the market economy, nor occasional buying and selling, nor climate change seem amenable to prediction and rationalization. Moreover, English scholar Benjamin Noys has proposed the term “accelerationism” to explore the impact of the temporality of contemporary capitalism and technology on the mental state of the subject. His Malign Velocities: Acceleration and Capitalism (2014) sets out broadly and critically his understanding of accelerationism, encompassing Italian Futurism, Marxism, TINA (Margaret Thatcher’s “There Is No Alternative”), cyberpunk, and Nick Land, among other elements.\nOf the many theorists to comprehend our current spiritual malaise in light of accelerationism, Italian philosopher Franco “Bifo” Berardi writes in Soul at Work: From Alienation to Autonomy (2009) that post-Fordism or “semio-capital” uses the control, distribution, and networking of labor by digital technology to turn soul, language, and creativity into the main means of value production. This system of production distorts and casts into spiritual malaise the laborer’s bodily rhythms, aesthetic sensibilities, social behavior, and psychological functions, generating symptoms such as attention deficit hyperactivity disorder (ADHD), dyslexia, and panic attacks. These symptoms, taken together with the frustrations and guilt of the hypercompetitive environment, show the institution of neoliberalism to be a massive “factory of unhappiness.” At the same time, we see an ideology of self-fulfillment and pursuit of happiness predominate, resulting in the prevalence and abuse of psychotropic substances, what Berardi calls a “Prozac-economy.”\nIn addition, Swiss-German philosopher Byung-Chul Han writes in The Burnout Society (2015) that the self-protective measures taken by bodies and governments in response to crises, prioritizing denial or removal, are no longer valid in contemporary society. The transition from a disciplinary society to an achievement (Leistung) society is a transition to a world without the other (horizons), a world of the violence of positivity. The pressure to achieve and to enhance productivity has become the highest priority, giving rise to self-exploitation and -criticism. French philosopher Bernard Stiegler, who passed away in the midst of the pandemic in August 2020, proposes the concept of the “disaffected individual” to highlight how the individual’s affect and connection to the other is suppressed by contemporary capitalist technologies, the control society, and consumer culture. The flip side of disaffection is a narcissistic subjectivity that subcontracts affect to products, losing the passion for life knowledge (Lebenswissen), art, language, and love, as well as the connection to the lifeworld (Lebenswelt). Stiegler calls this “symbolic misery,” a provocation to reflect on the uncontrollable speed and proliferating disasters of our globalized society. (The above is translated from Mandarin by Dr. Chingshun Sheu)\n\tThis course explores research areas and issues as stated above. Students are not only oriented into various contemporary theoretical thoughts but also learn to make critical response to current social, political realities or the world we are living in.",
    "goals": [
        "This course focuses on the issue of acceleration an its consequent psychosomatic malaise in capitalist technocultur."
    ],
    "syllabus": "**國立臺灣師範大學課程綱要**\n\n**一、課程基本資料**（任課教師不可異動部分，同一課程名稱此部分應相同）\n\n**課程代碼**\n\nEND\n\n**課程名稱**\n\n(Chinese Title)\n\n**當代理論專題研究** **(一)**\n\n**英文名稱**\n\n(English Title)\n\nSpecial Topics in Contemporary Theory (I)\n\n**全****/****半年**\n\n(year/semester)\n\n半年\n\n**必****/****選修**\n\n選修\n\n**學分數**\n\n(credits)\n\n3\n\n**每週授課時數**\n\n(hours/per week)\n\n3\n\n**開課系級**\n\n(grade)\n\n博士班\n\n**先修課程**\n\n(previous study)\n\n無\n\n**課程簡介**\n\n(Introduction)\n\nIn this course we choose a topic in contemporary literary/theories based on the research interest of the students enrolled in this course. In Spring 2019, the topic will be “Queer and Posthuman.” Readings are selected from the most updated publications in the field in queer and posthuman studies.\n\n**課程目標**(Teaching Goal)\n\n**對應系所核心能力**(core competence)\n\n1\n\n理解並能掌握文學與文化研究領域中重要的酷兒與後人類理論。\n\n\\*\\*1-1獨立從事專業學術研究的能力\n\n\\*\\*1-2熟悉跨語言、跨文化研究之相關知能\n\n\\*\\*2-1有效應用英語於專業領域及相關職場之能力\n\n\\*\\*2-2以專業擷取新知，加以整合創新及運用之能力\n\n□3-1具國際觀，能融合多元觀點、尊重不同意見，\n\n並能肯定自我\n\n\\*\\*3-2具有獨立思考、發掘問題及批判之能力\n\n□4-1能明辨是非、以身作則，遵守專業倫理\n\n□4-2具備人文素養，實踐社會關懷精神\n\n2\n\n能進行理論與文學/文化文本的互文比較。\n\n\\*\\*1-1獨立從事專業學術研究的能力\n\n\\*\\*1-2熟悉跨語言、跨文化研究之相關知能\n\n\\*\\*2-1有效應用英語於專業領域及相關職場之能力\n\n\\*\\*2-2以專業擷取新知，加以整合創新及運用之能力\n\n\\*\\*3-1具國際觀，能融合多元觀點、尊重不同意見，\n\n並能肯定自我\n\n\\*\\*3-2具有獨立思考、發掘問題及批判之能力\n\n□4-1能明辨是非、以身作則，遵守專業倫理\n\n□4-2具備人文素養，實踐社會關懷精神\n\n3\n\n培養思考與論述能力，能用文字清楚表達理論見解、分析文本。\n\n\\*\\*1-1獨立從事專業學術研究的能力\n\n\\*\\*1-2熟悉跨語言、跨文化研究之相關知能\n\n\\*\\*2-1有效應用英語於專業領域及相關職場之能力\n\n\\*\\*2-2以專業擷取新知，加以整合創新及運用之能力\n\n\\*\\*3-1具國際觀，能融合多元觀點、尊重不同意見，\n\n並能肯定自我\n\n\\*\\*3-2具有獨立思考、發掘問題及批判之能力\n\n\\*\\*4-1能明辨是非、以身作則，遵守專業倫理\n\n\\*\\*4-2具備人文素養，實踐社會關懷精神\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n**二、教學大綱**（任課教師可異動部分）\n\n**授課教師**\n\n(teacher)\n\n李秀娟\n\n**教學進度與主題**（可說明每週進度）\n\n(Teaching Content including topics of each week)\n\nWeek 1   Introduction \n\nWeek 2   Ahmed, Sara. _Queer Phenomenology_ (2006)\n\nWeek 3   Ahmed, Sara. _Queer Phenomenology_ (2006)\n\nWeek 4  Fryer, David Ross. _Thinking Queerly: Race, Sex, Gender, and the Ethics of Identity_ (2015). \\[Chapter 3: “Toward a Phenomenology of Gender Identity\\]\n\nWeek 5   Halberstam, Judith. _In a Queer Time and Place: Transgender Bodies, Subcultural Lives_ (2005)\n\nWeek 6   Halberstam, Judith. _The Queer Art of Failure_ (2011)\n\nWeek 7   Halberstam, Judith. _The Queer Art of Failure_ (2011)\n\nWeek 8   Stockton, Kathryn Bond. _The Queer Child, or Growing Sideways in the Twentieth Century_ (2009)\n\nWeek 9   Stockton, Kathryn Bond. _The Queer Child, or Growing Sideways in the Twentieth Century_ (2009)\n\nWeek 10  Halberstam, Jack. _Trans: A Quick and Quirky Account of Gender Variability_  (2018)\n\nWeek 11  Berlant, Lauren and Lee Edelman. _Sex, or the Unbearable_ (2014)\n\nWeek 12  Haraway, Donna. _Staying with the Trouble: Making Kin in the Chthulucene_ (2016)\n\nWeek 13  Haraway, Donna. _Staying with the Trouble: Making Kin in the Chthulucene_ (2016)\n\nWeek 14  Braidotti, Rosi. _Posthuman Feminism_ (2017)\n\nWeek 15  Braidotti, Rosi. _Posthuman Feminism_ (2017)\n\nWeek 16  Review\n\nWeek 17  Student Presentations\n\nWeek 18  Individual Consultation\n\n**教學方法**(Teaching Methods)\n\n**方式**\n\n**說明**\n\n講述法\n\n授課教師講授課程重點。\n\n 討論法\n\n教師與學生提出問題、全班共同討論。\n\n合作學習\n\n學生輪流報告與帶領討論、期末研究提綱發表等。\n\n \n\n 媒體融入教學\n\n放映相關影片、應用Moodle教學平台。\n\n專題研究\n\n期末研究論文。\n\n個別指導\n\n授課教師針對修課學生專題研究主題進行個別指導。\n\n**評量方法** **(**Evaluation Standard)\n\n**方式**\n\n**百分比**\n\n**說明**\n\n \n\n \n\n課堂討論參與\n\n25\n\n針對研讀內容提出問題與參與討論，包括在Moodle教學平台上的參與與分享。\n\n出席\n\n10\n\n學生準時出席每周課程。\n\n報告\n\n20\n\n根據指定閱讀材料內容與研究主題，3-4次口頭報告。\n\n成果展覽\n\n10\n\n學期結束前論文提綱發表。\n\n 專題\n\n35\n\n15頁以上研究論文。",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}