{
    "year": 107,
    "term": 2,
    "name": "英美犯罪小說專題研究",
    "teachers": [
        "高瑪麗"
    ],
    "department": "LD21",
    "code": "END1068",
    "credit": 3,
    "serial": 1563,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 2,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "雲204"
        }
    ],
    "programs": [],
    "comment": "上課教室在雲和街大樓二樓，地址為雲和街1號(位於雲和小火鍋斜對面、Cafe a la mode正對面)，從師大側門右轉看見Starbucks右轉進入巷子步行約2分鐘(130公尺)，右手邊就會看到雲和街大樓，亦可使用Google Maps APP查詢位置。請同學使用學生證感應，進出雲和街上課教室。",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "Among the most popular – and most-maligned -- sub-genres of fiction are detective and mystery novels, with plots that gradually “reveal the concealed” and uncover answers to ancient questions: Who did it? Who committed the crime? Who is guilty, and why? In this course we analyze the long-term and growing appeal of this sub-genre in its historical, sociological, cultural and literary contexts. We cover the historical and critical development of detective fiction as it began to emerge in the mid-nineteenth century in America (Poe) and England (Conan Doyle and Wilkie Collins), to the development of the figure of the private detective ( Sherlock Holmes, Agatha Christie’s Poirot and Miss Marple, Dorothy Sayers’ Lord Peter Wimsey) in the Golden Age of detective fiction in Britain (whodunits and puzzlers). In America, the sub-genre detours into hardboiled and noir crime thrillers, fiction featuring female detectives, police procedurals, courtroom thrillers, “ethnic” detective series and the advent of the psychopathic serial killer. We will also make a few forays into international examples of the genre, in Continental, African and possibly Asian work. In investigating the narrative structures of detective fiction, we consider the significance of its various sources: the Gothic novel and penny dreadfuls/dimestore novels, among other sources. The course also introduces contemporary critical and theoretical arguments concerning popular fiction and genre studies, to enable advanced students to develop a sophisticated understanding of these texts and their cultural contexts, as well as examples of these texts in film and television series.",
    "goals": [
        "Students will develop more sophisticated language skills to read widely and deeply in target language and employ these skills for cross-cultural understanding and improved communication",
        "In engaging with literary and critical texts from different periods, students will have a deeper understanding of cultural, historical and literary contexts",
        "In leading class discussions, presenting topics for seminar papers and drafting a research paper, students will develop greater professionalism as scholars of literature"
    ],
    "syllabus": "**Tentative Weekly Schedule of Readings**\n\n**Book List will Depend on Availability of Sources (online and in hard copy)**\n\n1.  Introduction to course. Background and stories by E A Poe, including “Murders in the Rue Morgue,” distinctions among crime, mystery and Gothic. [Edgar Allan Poe](https://en.wikipedia.org/wiki/Edgar_Allan_Poe \"Edgar Allan Poe\"): _[Tales of Mystery & Imagination](https://en.wikipedia.org/wiki/Tales_of_Mystery_%26_Imagination \"Tales of Mystery & Imagination\")_ (1852) “The Purloined Letter” Secondary reading: “The Gothic and the Creation of the Detective” [https://books.google.com.tw/books?id=xstGp7cOObMC&pg=PA6&lpg=PA6&dq=gothic+and+creation+of+detective&source=bl&ots=NUjGfjwNFS&sig=3wudqUyrLtJAgxwhcq5KDlX-cII&hl=en&sa=X&ved=0CBsQ6AEwAGoVChMI0tjxs8SiyAIVpRmmCh1m7Aof#v=onepage&q=gothic%20and%20creation%20of%20detective&f=false](https://books.google.com.tw/books?id=xstGp7cOObMC&pg=PA6&lpg=PA6&dq=gothic+and+creation+of+detective&source=bl&ots=NUjGfjwNFS&sig=3wudqUyrLtJAgxwhcq5KDlX-cII&hl=en&sa=X&ved=0CBsQ6AEwAGoVChMI0tjxs8SiyAIVpRmmCh1m7Aof#v=onepage&q=gothic%20and%20creation%20of%20detective&f=false)\n2.  Arthur Conan Doyle’s Sherlock Holmes. “A Scandal in Bohemia” and selected stories. [Arthur Conan Doyle](https://en.wikipedia.org/wiki/Arthur_Conan_Doyle \"Arthur Conan Doyle\"): _[The Complete Sherlock Holmes](https://en.wikipedia.org/wiki/Sherlock_Holmes \"Sherlock Holmes\")_ (1887-1927) [A Scandal in Bohemia](https://sherlock-holm.es/stories/html/cano.html#Story-3),\" \"[Adventure of the Speckled Band](http://www.enotes.com/topics/adventure-speckled),\" \"[Adventure of the Dancing Men](http://www.eastoftheweb.com/short-stories/UBooks/AdveDanc.shtml),\" \"[Five Orange Pips](https://sherlock-holm.es/stories/html/cano.html#Story-7),\" \"[The Musgrave Ritual](https://sherlock-holm.es/stories/html/cano.html#Story-19),\" and \"[The Final Problem](https://sherlock-holm.es/stories/html/cano.html#Story-25).\" Moretti, “Clues,” from _Signs Taken for Wonders_; S. S. Van Dine, “Twenty Rules for Writing Mystery Stories” ; Wilson, “Why Do People Read Mystery Fiction?”: Yi-Fu Tuan, \"The Landscapes of Sherlock Holmes\"\n3.   Agatha Christie and classic British whodunits.  _The Murder of Roger Ackroyd_ (1926). S. Van Dine, “Twenty Rules for Writing Detective Stories” [http://gaslight.mtroyal.ca/vandine.htm](http://gaslight.mtroyal.ca/vandine.htm); Grossvogel, David. \"Agatha Christie: Containment of the Unknown.\" In _Mystery and Its Fictions: From Oedipus to Agatha Christie_. Baltimore, MD: Johns Hopkins University Press, 1979. ISBN: 0801822017; Edmund Wilson, “Who Cares Who Killed Roger Ackroyd?” [http://www.crazyoik.co.uk/workshop/edmund\\_wilson\\_on\\_crime\\_fiction.htm](http://www.crazyoik.co.uk/workshop/edmund_wilson_on_crime_fiction.htm)\n4.  Dorothy Sayers and her aristocratic sleuth, Lord Peter Wimsey. _Gaudy Night_ (1935). Sayers essays: “Aristotle on Detective Fiction” and “The Omnibus of Crime Fiction”; selections from Josephine Tey (historical crime fiction, _The Daughter of Time_), Mary Higgins Clark, Mary Rinehart.\n\nTime Permitting, we will screen a film version of Sayers’ novel.\n\n5.  American hardboiled detectives Sam Spade (Dashiell Hammett) and Philip Marlowe (Raymond Chandler): _The Little Sister_ or _Farewell My Lovely_. Chandler, “The Simple Art of Murder” and “Notes on the Mystery Novel”; Haut, “Under the Sign of Hollywood: Dashiell Hammett and Raymond Chandler,” from Heartbreak and Vine; Mike Davis, “Sunshine or Noir?” City of Quartz\n\nTime Permitting, we will also screen _The Maltese Falcon_ or _The Big Sleep_\n\n6.  American Hardboiled, continued: Raymond Chandler’s _The Little Sister_ (or _Farewell My Lovely_, depending on availability); Stowe, William. \"From Semiotics to Hermeneutics: Modes of Detection in Doyle and Chandler.\" In _Poetics of Murder: Detective Fiction and Literary Theory_. Edited by Glenn Most and William Stowe. New York, NY: Harcourt Brace, 1983, pp. 366-84. ISBN: 0156723123; Ron Goulart, The Dime Detectives (1988); Tom Naremore, \"Modernism and Blood Melodrama\" in _More Than Night_ (1998)\n7.  Hardboiled, continued. James Cain, _The Postman Always Rings Twice_ (1934).\n\nEssays: Nathaniel West, \"Notes on Violence\"; H. L. Mencken, \"American Slang\" The American Language, v 1 ; “Nothing More American: On James M Cain.” [https://lareviewofbooks.org/essay/nothing-more-american-on-james-m-cain](https://lareviewofbooks.org/essay/nothing-more-american-on-james-m-cain)\n\nTime permitting, we will screen _The Postman Always Rings Twice_.\n\n8.  Alfred Hitchcock and Patricia Highsmith, _Strangers on a Train_. Kermode, “Secrets and Narrative Sequence”.\n\nTime permitting, we will screen _Strangers on a Train_\n\n9.  The Police Procedural: Wilkie Collins, _The Moonstone_, and Ed McBain, _Cop Hater_. Mickey Spillane. D. A. Miller, “The Novel and the Police” from _The Novel and The Police: The Art of Telling_\n\n10.  Ethnic detectives: Native American crime writer Tony Hillerman, _A Thief of Time_\n\nJohn Ball, “The Ethnic Detective”; Jane Bakerman, “Cutting Both Ways: Race, Prejudice and Motive in Tony Hillerman’s Detective Fiction”\n\n11.  Ethnic Detectives, continued. Earl Biggers’ Charlie Chan film detective; Ed Lin’s Robert Chow, _This is a Bust_\n\n12.  International Crime Fiction: Alexander McCall Smith, _The No. 1 Ladies’ Detective Agency_; Scandinavian Crime Thrillers from Stieg Larsson, Henning Mankell\n\n13.  International Crime Fiction, continued: Examples from Asia, detective manga, etc.\n\n14.  Female Detectives: Sara Paretsky (_Blood Shot_ or _Indemnity Only_, Sue Grafton (_A is for Alibi_ or _G is for Gumshoe_);  Kathleen Gregory Klein, “The Woman Detective: Gender and Genre” (1995);\"The Hard-boiled Private Eye and Her Classical Competition\" Chapter 6 in _Issues of Gender and Genre_\n\n15.  Female Detectives, continued. Patricia Cornwell, _Postmortem_\n\n16.  Courtroom Thrillers: Perry Mason, Scott Turow, _Presumed Innocent_; John Grisham\n\nTime Permitting, we will screen a film or TV program such as from the Perry Mason series or other.\n\n17.  The Sociopath Killer: Ira Levin, _A Kiss Before Dying_; Thomas Harris, _Silence of the Lambs_; Elmore Leonard, “Ten rules for Writing”  \n      \n    18\\. Final Presentations",
    "methodologies": [
        {
            "type": "討論法",
            "note": "Mainly discussion, after initial lecture to introduce topic"
        },
        {
            "type": "合作學習",
            "note": "Students will take turns introducing topics and leading class discussion"
        },
        {
            "type": "媒體融入教學",
            "note": "PPT and other media,  including film and TV series"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 15,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 50,
            "note": "Final seminar paper with presentation"
        },
        {
            "type": "專題",
            "weight": 15,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}