{
    "year": 108,
    "term": 2,
    "name": "中國思想史",
    "teachers": [
        "沈信甫"
    ],
    "department": "IU84",
    "code": "CLU0023",
    "credit": 2,
    "serial": 1444,
    "group": "B",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 1,
            "to": 2,
            "campus": "本部",
            "classroom": "正401"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "3",
    "classes": "",
    "dept_group": "B",
    "hours": 2,
    "description": "一、中國思想史的基本認識\n一般而言，中國思想史的內容有別於純粹的哲學史，除了關照歷代各家思想產生的背景，即知人論事之外，主要以彰顯各家思想在歷代演變的傳承與創新，及其延伸為古代文化層面和精神內涵，例如歷代的國家、家族、性別、群體、個人，亦稱為五倫關係（君臣、父子、夫婦、兄弟、朋友，或為天、地、君、親、師）等社會結構性的概念。在雅俗並存、生死交關的古代傳統文化裡，它們彼此連結和互動，形成一種有機的整體。這些歷代各家不同的思想型態與學說傳承，便構成「古代中國」和「近現代中國」的本來面貌。\n二、本課程的設計理念\n老師引領學生在現代語境下，以思辨和實證兼具的視角，從自身的基本理解為出發點，在課堂中透過對中國思想史各朝代著名經典的選讀，老師運用「文獻與圖像」、「文化脈絡重現」的解讀方式，探索古代各思想家的核心概念，讓學生在面對現實人生和社會環境的變化下，能夠對於各類問題提出合宜的反思與批判。\n三、本課程的課綱安排\n（一）課程以四大核心議題為主軸，分別為「政治社會」、「生命修養」、「宗教情懷」、「中西交流」，每一議題授課節數為四週（若遇國定假日，即調整為三週）。四大議題則按照歷史演進，挑選各具特色的朝代及學說進行闡述。\n（二）在每個議題中，老師盡量做到：一為鋪陳思想發生的背景與原因，二為闡述思想家的義理內容與特色，三為指出歷代各家思想出現前後繼承或批判的關係，予以適當的統整和解說。四為引導學生思考各學說的現代意義，以連結到個人的生命經驗和學科本位為主。\n四、實際授課的預期成果\n（一）開學前幾週，老師會跟全班討論適合的學期評量方式，並依照教學評量的建議及班級學習風氣稍作調整。授課以學生的學習為本位，老師作為引導思考的角色，針對中國各家思想進行重點式說明和比較，並結合時事以凸顯其思潮特色，展現出現代意義的反思。\n（二）在不同思想型態的對照之下，老師期盼學生能夠掌握中國歷代各家思想特色及其流變的脈絡。以課堂作業或是自主學習的方式，檢視學生用心投入的態度及其思辨表達的能力，或是藉由師生的問答和互動交流，激盪思辨的火花與真誠的學習回饋。",
    "goals": [
        "鋪陳各朝代思想發生的背景與原因，從外部探究其原因，從內部省察其發展，兼具宏觀和微觀、整體和部分，使學生理解中國思想史在各時期的起源根據、發展流變、及其義理內涵的思想活力。",
        "闡述思想家的義理內容與特色，由縱向的時間軸貫穿各時期思想的轉變，以及由橫向的同時期比較各家的學理，呈現各思想家的基本立場和義理特色，方能以古衡今，鑒往知來，促進學生以關懷他人取代本位思考，並能夠藉由古人智慧回應當今時代的社會議題。",
        "指出歷代各家思想出現前後繼承或批判的錯綜關係，從各思想家提出的核心概念作為討論的焦點，讓學生閱讀歷代傳統文獻，並撰寫學習單。其後以分組方式讓各組同學分享其理解的經驗，強化學生溝通技巧和思辨的能力。"
    ],
    "syllabus": "修正版4/16\n\n第一週（3/06）中國思想史導論（含課程介紹、學術倫理宣導、分組）\n\n第二週（3/13）先秦諸子思想：儒家(一)孔子\n\n第三週（3/20）先秦諸子思想：儒家(二)孟子\n\n第四週（3/27）先秦諸子思想：儒家(三)荀子\n\n第五週（4/03）清明節補假\n\n第六週（4/10）先秦諸子思想：道家(一)老子（疫情改採遠距教學）\n\n第七週（4/17）先秦諸子思想：道家(二)莊子（疫情改採遠距教學）\n\n第八週（4/24）先秦諸子思想：墨家墨子和法家韓非（疫情改採遠距教學）\n\n第九週（5/01）期中考 （因應疫情順延一週）\n\n第十週（5/08）漢代思想（一）黃老學派、禮記、易傳\n\n第十一週（5/15）漢代思想（二）董仲舒、淮南子、揚雄、王充\n\n第十二週（5/22）魏晉玄學（一）王弼、何晏、郭象\n\n第十三週（5/29）魏晉玄學（二）裴頠、阮籍、嵇康\n\n第十四週（6/05）隋唐佛教（一）三論宗、天台宗、法相宗（98週年校慶）\n\n第十五週（6/12）隋唐佛教（二）華嚴宗、禪宗\n\n第十六週（6/19）期末考\n\n第十七週（6/26）端午節調整放假\n\n第十八週（7/03）彈性補充教學週（因應武漢肺炎疫情延後開學教學設計）",
    "methodologies": [
        {
            "type": "講述法",
            "note": "按各週進度講授課程內容，並且依照實際情況作適當調整"
        },
        {
            "type": "討論法",
            "note": "以分組方式適時安排學生參與課堂討論"
        },
        {
            "type": "合作學習",
            "note": "以分組方式強化學生溝通和表達的能力"
        },
        {
            "type": "媒體融入教學",
            "note": "按各週主題適時播放相關影片給學生觀賞"
        },
        {
            "type": "專題研究",
            "note": "按各週進度指定作業（學習單）讓學生課後自主學習，培養其獨立研究和思辨的能力"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": "指定作業（學習單）讓學生練習表達和思考能力，使其具備中國思想史的基本認識與文化涵養"
        },
        {
            "type": "期中考",
            "weight": 30,
            "note": "檢視學生期中階段的學習成效"
        },
        {
            "type": "期末考",
            "weight": 30,
            "note": "檢視學生期末階段的學習成效"
        },
        {
            "type": "課堂討論參與",
            "weight": 5,
            "note": "透過師生的問答和互動交流，促進學生邏輯思考的表達能力"
        },
        {
            "type": "出席",
            "weight": 5,
            "note": "檢視學生重視自身參與和受教權益的程度"
        }
    ],
    "prerequisite": "",
    "general_core": []
}