{
    "year": 110,
    "term": 1,
    "name": "知識與課程專題研究",
    "teachers": [
        "甄曉蘭"
    ],
    "department": "ED03",
    "code": "ECD0014",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 354,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "教803"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "什麼知識最有價值？知識是如何產生的？學校應傳遞、教導什麼樣的知識？學校課程知識內容的選擇與分配應該如何決定？由誰決定？學校課程呈現了誰的知識？反映了誰的利益？怎樣的課程組織才是合理適切的知識佈局？如何傳遞、溝通、建構值得學習的知識？等問題，不僅僅是課程意識型態問題，更反映出課程知識假設的問題。本課程主要從哲學、心理學及社會學觀點來探討知識與課程的關係，以瞭解課程知識背後複雜的權力、文化及政治角力因素，透過對知識本質的反思以及相關文獻的分析與討論，本課程企圖解析認識論假設、認知途徑與學習、知識選擇等對學校課程的影響，並且進一步探討全球化、數位化時代學校課程知識的挑戰與回應。",
    "goals": [
        "能從教育哲學、認知心理學、教育社會學觀點解析知識與課程的關係",
        "能掌握學校課程知識背後的知識論假設、認知途徑及知識選擇議題",
        "能探討當前全球化、數位化發展趨勢對學校課程知識的影響",
        "能與同儕合作探討課程知識議題，並綜合分析與批判相關文獻，提出個人的見解"
    ],
    "syllabus": "1.第一週\n\n  Course Introduction/ Defining “Knowledge”\n\n2.第二週、第三週\n\n  The Nature of Knowledge/What Knowledge Is of Most Worth?\n\nSchrag, F. (1992). Conceptions of knowledge. In P. W. Jackson (Ed.).Handbook of research on curriculum. (pp. 268-301). NY: Macmillan.\n\nHamm, C. (1989). Educational curricula and the nature of knowledge. In C. Hamm Philosophical issues in education. (pp.59-75). NY: The Falmer Press.\n\nHirst, P. H. (1974). Knowledge and the curriculum. London: Routledge & Kegan Paul. (Chapt.4, 6)\n\n(Brady, M. (1989). What’s worth teaching? Selecting, organizing, and integrating knowledge. New York: SUNY Press.)\n\n3.第四週、第五週\n\n  Philosophical Perspectives on Knowledge and Curriculum\n\nReid, L. A. (1962). Philosophy and educational assumptions. In L. A. Reid Philosophy and education. (pp.17-40). London: Heinemann.\n\nBrent, A. (1978). Philosophical foundations for the curriculum. London: George Allen & Unwin. (Chapt. 3).\n\nSoltis, J. F. (1981). Education and the concept of knowledge. In F. F. Soltis (Ed.). Philosophy and education. Eightieth yearbook of the NSSE. Chicago: Univ. of Chicago Press.\n\nOrnstein, A. C. (1995). Philosophy as a basis for curriculum decision. In A. C. Ornstein & L. S. Behar (Eds.). Contemporary issues in curriculum. (pp. 10-17). Boston: Allyn and Bacon.\n\n4.第六週\n\n  Exercise: Epistemological/Ideological Assumptions and the Curriculum\n\nEisner, E. W. (1985). Five basic orientations to the curriculum. In E. W. Eisner The educational imagination. (pp. 61-86).NY: Macmillan.\n\nEisner, E. W. (1992). Curriculum ideologies. In P. W. Jackson (Ed.), Handbook of research on curriculum (pp. 302-326). New York: Macmillan.\n\n(Eisner, E. W. & Vallance E. (1974). Conflicting conceptions of curriculum. Berkeley, CA: McCutchan.)\n\n5.第七週、第八週\n\n  Psychological Perspectives on Knowledge and Curriculum\n\nEisner, E. (Ed.). (1985). Learning and teaching the ways of knowing. Righty-fourth yearbook of the NSSE. Chicago: Univ. of Chicago Press. (Chapt.2-7)\n\nGagne, R. M. (1972). Domains of learning. Interchange, 3(1), 1972.\n\nBiggs, J. B. (1992). Modes of learning, forms of knowing, and ways of schooling. In Demetriou, A., Shayer, M. & Efklides, A. (Eds.). Neo-Piagetian theories of cognitive development: Implications and applications for education. London: Routledge.\n\nGardner, H. (1999). The Disciplined Mind. New York: Penguin Books. (Chapter 9)\n\n6.第九週、第十週\n\n  Exercise: Ways of Knowing/Learning and the Curriculum\n\nVallance, E. (1985). Ways of knowing and curricular conceptions: Implications for program planning. In E. Eisner (Ed.). Learning and teaching the ways of knowing. Eighty-fourth yearbook of the NSSE. Chicago: Univ. of Chicago Press.\n\n7.第十一週、第十二週\n\n  Sociological Perspectives on Knowledge and Curriculum\n\nYoung, M. F. D. (1971). An approach to the study of curricula as socially organized knowledge. In M. F. D. Young (Ed.). Knowledge and control: New directions for the sociology of education. (pp.19-46). London: Collier-Macmillan.\n\nBernstein, B. (1971). On the classification and framing of educational knowledge. In M. F. D. Young (Ed.). Knowledge and control: New directions for the sociology of education. (pp.47-69). London: Collier-Macmillan.\n\nBeyer, L. E. (1988). Knowledge, ideology, and inquiry. In L. E. Beyer Knowing and acting: Inquiry, ideology and educational studies. NY: The Falmer Press.\n\nBernstein, B. (2006). Thoughts on the trivium and quadrivium: The divorce of knowledge from the knower. In H. Lauder, P. Brown, J. Dillabough & A. H. Halsey (Eds.), Education, globalization & social change (pp. 119-123). Oxford: Oxford University Press.\n\nMoore, R. (2004). The problems of knowledge. In Education and society: Issues and explanations in the sociology of education (pp. 147-175). Cambridge: Polity Press.\n\n(Apple, M. W. (1993). Official knowledge: Democratic education in a conservative age. NY: Routledge.)\n\n8.第十三週\n\n  Exercise: Knowledge Selection and the Curriculum\n\nBanks, J. (1993). The Canon Debate, Knowledge Construction, and Multicultural Education. Educational Researcher, 22(5), pp. 4-14.\n\nApple, M. W. (1998). The Culture and Commerce of the Textbook. In L. E. Beyer & M. W. Apple (Eds.). The curriculum: Problems, politics, and possibilities (2nd ed.). (pp. 157-176). NY: SUNY Press.\n\nNoffke, S. E. (1998). Multicultural Curricula: “Whose Knowledge?” and Beyond. In L. E. Beyer & M. W. Apple (Eds.). The curriculum: Problems, politics, and possibilities (2nd ed.). (pp. 101-116). NY: SUNY Press.\n\n9.第十四週\n\n  Power, Culture, and the Politics of Knowledge\n\nSmith, L. T. (2006). Colonizing Knowledge. In H. Lauder, P. Brown, J. Dillabough & A. H. Halsey (Eds.), Education, globalization & social change (pp. 358-369). Oxford: Oxford University Press.\n\nBrown, P. & Lauder, H. (2006). Globalization, Knowledge and the Myth of the Magnet Economy. In H. Lauder, P. Brown, J. Dillabough & A. H. Halsey (Eds.), Education, globalization & social change (pp. 317-340). Oxford: Oxford University Press.\n\nPopkewitz, T. S. (2000). Globalization/reginalization, knowledge, and the educational practices: Some notes on comparative strategies of educational research. In T. S. Popkewitz (Ed.). Educational knowledge: Changing relationships between the State, civil society, and the educational community. New York: SUNY Press.\n\n10.第十五週\n\n  Knowledge and Curriculum Construction\n\nKing, Jr. A. R. & Brownell, J. A. (1966). The curriculum and the disciplines of knowledge: A theory of curriculum practice. NY: Wiley. (Chapt. 2,3,4,6)\n\nPhillips, D. C. (1974). Perspectives on structure of knowledge and the curriculum. In P. W. Musgrave (Ed.). Contemporary studies in the curriculum. (pp. 15-29). London: Angus & Robertson. \n\nKelly, A. V. (1986). Knowledge and curriculum planning. London: Harper & Row. ( chapt.1,4)\n\nGuile, D. (2006). What is distinctive about the knowledge economy? Implications for education. In H. Lauder, P. Brown, J. Dillabough & A. H. Halsey (Eds.), Education, globalization & social change (pp. 355-366). Oxford: Oxford University Press.\n\nMcFarlane, A. (2006). ICT and the curriculum canon: Responding to and exploring ‘alternative knowledge’. In A. Moore (Ed.).Schooling, society and curriculum (pp. 130-141). London: Routledge.\n\n11.第十六週、第十七週\n\n  Report on Rationale for Ideal School Curriculum Design\n\n12.第十八週\n\n  Turn in Final Project Report",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "期末考",
            "weight": 25,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 25,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 25,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 25,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}