{
    "year": 109,
    "term": 2,
    "name": "行銷的藝術：孫子兵法的現代管理意涵",
    "teachers": [
        "蕭中強"
    ],
    "department": "O",
    "code": "O5M0003",
    "credit": 3,
    "serial": 2437,
    "group": "",
    "quota": {
        "limit": 35,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "雲508"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "本課程旨在培養學生利用孫子兵法的核心本質，在高度動態競爭的環境中建構無競爭的目標市場。孫子兵法所發展出的各種管理思想，不僅在社會行為方面，甚且在政治、體育和商業的競爭性互動上，已顯著地影響華人。這種驚人的影響從中國蔓延到周邊國家，如日本，韓國，東南亞，甚至西方國家。孫子是一位2500年前具有傳奇色彩的中國將軍，他所編寫的“戰爭藝術”被西點軍校授予十大軍事經典之一，並在海灣戰爭期間被指定為所有美國軍官必讀書籍。藉由孫子兵法傳統智慧所引發的管理思維，本課程重新定義當代管理典範，並為企業在當今競爭激烈的環境中，擬定管理問題的最佳解決方案帶來策略性遠見。\n\nThis is an advanced marketing course aiming at preparing students to successfully develop and undertake the marketing strategy by drawing upon the managerial essence of “The Art of War” in a highly uncertain and competitive environment. “The Art of War” is a military strategy book written by Sun Tzu, a legendary Chinese general, about 2500 years ago. This book has demonstrated tremendous influence on how Chinese engage in competitive endeavors of not only the battle fields, but also politics, social campaigns, sports, and businesses. Such an influence spilt over from China to the surrounding areas, such as Japan, Korea, South Eastern Asia, and even western countries. In particular, this book was assigned one of top ten military classics by Military Academic at West Point and a required reading for United State military officers during the Gulf war.\n\nIn the modern business environment, the market competition shares quite a few critical factors with the ancient war. In order to win the battle, the general has to come up with a winning strategy by well coordinating the limited resources (and in most cases inferior to counterparts) to bring about the victory in a way that even the much stronger enemy is not able to make. Following the guideline of “The Art of War”, this course is designed to revitalize the contemporary role of Marketing Management by not only delivering general marketing knowledge and frameworks for making conceivably good decisions, but also guiding class participants the unique way to derive the best decision in relation to the creation of a seemingly monopoly market as in how a battle field is conquered and dominated. Students will be able to learn the core backbone of strategic foresight and comprehensive framework proposed by Sun Tzu, and also the way to apply such a systematic structure to the true scenarios of highly intensive competitive environment businesses encounter nowadays",
    "goals": [
        "Understand the role of value chains and how businesses compete in the market",
        "Undertake business analyses, make strategic decisions, and propose solutions"
    ],
    "syllabus": "1.     Course Introduction\n\n2/3. Core Essence of The Art of War\n\n4.  Case Study: Xiaomi: Designing an Ecosystem For the \"Internet of Things\"\n\n5/6. How to Create an Uncontested Market in the Red Ocean\n\n7\\.  Case Study: Lenovo: Being on Top in a Declining Industry\n\n8/9. Market Driven Management\n\n10.  Case Study: Uber vs. Didi: The Race for China's Ride-hailing Market\n\n11/12. Value Creation and Value Delivery\n\n13.  Case Study: A Dark Horse in the Global Smartphone Market: Huawei's Smartphone Strategy\n\n14/15. Value Innovation and Sustainability\n\n16.  Case Study: Alibaba Group: Technology, Strategy, and Sustainability\n\n17/18. Final Project",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 40,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}