{
    "year": 108,
    "term": 1,
    "name": "績效管理研究",
    "teachers": [
        "鄭道有"
    ],
    "department": "IM86",
    "code": "IWM0070",
    "credit": 3,
    "serial": 1423,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 12
    },
    "schedule": [
        {
            "day": 4,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "誠105"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "1",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course covers the theory of employee performance, process and methods of performance appraisal, as well as the design and implementation of a performance management system for various organizations. Lecturing, group discussions, case studies, and oral presentations will be employed to fulfill the educational goals of the course.",
    "goals": [
        "Understand the theories about human performance.",
        "Gain insights about the processes and techniques of performance appraisal.",
        "Develop the skill of diagnosing and coaching for performance improvement.",
        "Design a performance management system."
    ],
    "syllabus": "This course addresses a timely and important issue for all managers and HR professionals: How to measure and develop the performance of individuals and groups and align performance with the organization’s strategic objectives. Specifically, this course is designed to expose students to the methods, theories, research findings, and issues regarding employee performance in organizations. At the end of the semester, students will be expected to have a very good knowledge of how to design and implement performance management systems. The class will consist of a combination of lectures, class discussion, oral presentations, and analysis of readings and cases.\n\n Upon successful completion of this course, the student will be able to:  \n\n1\\. Expose students to fundamental theories and best practices in performance management.\n\n2\\. Provide a forum for students to discuss personal experiences as they relate to performance management practices in organizations. Gain insights about the processes and techniques of performance appraisal.\n\n3\\. Aid the development of student’s leadership and interpersonal skills through in-class experiential exercises and discussion.\n\n4\\. Provide students with the opportunity to use the knowledge acquired in class in the design of a performance management system.\n\n**COURSE OUTLINE**\n\n**Week**\n\n**Date**\n\n**Topic**\n\n1\n\n9/12\n\nIntroduction to syllabus, course schedule and grading measurement\n\n2\n\n9/19\n\nHow performance management system works in organization? Challenges, implication and issues?\n\n3\n\n9/26\n\nBasic concept of Performance Management (PM)\n\n4\n\n10/3\n\nView Org. as system/Three levels of performance/Org. level of performance\n\n5\n\n10/10\n\nNO Class (Double Tenth Holiday)\n\n  6   \n\n10/17\n\nAguinis-Ch 2: Performance Management Process (use O\\*Net system)\n\n7\n\n10/24\n\nAguinis- Ch 3: PM & Strategic Planning (Balance Scorecard as a strategic Management System)\n\n8\n\n10/31\n\nDiscussion Week\n\n9\n\n11/7\n\nJob description\n\n10\n\n11/14\n\nAguinis- Ch 4: Defining Performance and choose a measurement\n\n11\n\n11/21\n\nAguinis-Ch 5: Measure results and behaviors (1)\n\n12\n\n11/28\n\nAguinis-Ch 5: Measure results and behaviors (2)\n\n13\n\n12/5\n\nAguinis-Ch 6&7: Gathering performance Information& Implementing a PM system\n\n14\n\n12/12\n\nAguinis- Ch 8: 360 Degree Feedback System (p.188-)\n\n15\n\n12/19\n\nAguinis-Ch 9: Performance Management skills (1)\n\n16\n\n12/26\n\nAguinis-Ch 9: Performance Management skills (2)\n\n17\n\n1/2\n\nAguinis-Ch10&11 : Reward Systems, Legal Issues and Team Performance Management\n\n18\n\n1/9\n\n**Final Project Presentations**\n\n**\\*****Lecturing schedule is subject to change depending upon class performance.**",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Lecture, video, group discussions, and case study."
        },
        {
            "type": "討論法",
            "note": "Students are expected to study the reading assignment prior to \neach class and participate actively in case analysis and class discussion."
        },
        {
            "type": "合作學習",
            "note": "1. In this course, students will learn to develop interpersonal communication skills \nnecessary in the work place. Students learn how communication principles, \nstrategies, and methods works through discussions, exercises, and case studies.\n2. After the entire semester, students will be familiar with current practices/business conducts in \ninternational contexts from diverse culture."
        },
        {
            "type": "專題研究",
            "note": "1. Small teams will be established at the start of the semester to \nhelp facilitate case study and experience team work dynamics.\n2. Assignments include but are not limited to performance management. A major project is the production of a\nteam report and presentation on a topic of interest to a managerial \naudience."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "Team Case: Analysis of HBS Case Questions"
        },
        {
            "type": "期末考",
            "weight": 30,
            "note": "Completion of a team project on performance management system."
        },
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": "Energetic and active participation is welcome and encouraged"
        },
        {
            "type": "出席",
            "weight": 20,
            "note": "Attendance"
        }
    ],
    "prerequisite": "",
    "general_core": []
}