{
    "year": 111,
    "term": 1,
    "name": "特殊教育論題",
    "teachers": [
        "吳亭芳",
        "郭靜姿",
        "洪儷瑜"
    ],
    "department": "EM09",
    "code": "SPC8013",
    "credit": 3,
    "serial": 506,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 8,
            "to": 10,
            "campus": "本部",
            "classroom": "特230"
        }
    ],
    "programs": [],
    "comment": "建議修習過「特殊教育導論」(SPU5007)同學修習，課程中將不再介紹基礎課程。",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "了解特殊教育的內涵、發展和意義Understanding the content, developmental and purpose of special education",
        "了解特殊教育的分類、對象和其需求Understanding the classification of individuals with special needs, and their needs",
        "了解各國特殊教育實施和趨勢Understanding the international trend and practice of special education",
        "能夠因應問題閱讀特殊教育工作所需之文獻Able to search the reference and to read for the problem solving in special education",
        "評估特殊學生的能力、特質、 工作能力Able to assess competence, traits, working competence.",
        "探討資優的身心特質與教育意義Psychological and physiological traits of the gifted and their implications in education",
        "分析創造力的評量與工具運用Analysis of assessment tools and application in measuring creativity",
        "探討身心障礙者就業相關資源與介入Exploring employment related resources and services for persons with disabilities",
        "認同因應特殊需求的專業工作Identifying the professionals for the individual with special needs."
    ],
    "syllabus": "1\n\n9/8\n\nIntroduction on special education: disabilities, giftedness and talent, rehabilitation (D, Hung)\n\n1\\. CEC (2020)  Initial practice-based professional preparation standards for special educators.  Retrieved at [https://exceptionalchildren.org/standards/initial-practice-based-professional-preparation-standards-special-educators](https://exceptionalchildren.org/standards/initial-practice-based-professional-preparation-standards-special-educators)\n\n2\\. MOE (2016) Special Education. In Education in Taiwan. Retrieved at https://english.moe.gov.tw/public/Attachment/59411132971.pdf\n\n2\n\n9/15\n\nInternational special education: history and current classification system of disabilities (D, Hung)\n\n1\\. Gargiulo, r., & Metcaff, D. (2010). Teacher in Today’s inclusive classroom: A universal design for learning approach. Belmont, Ca: Wadswroth. P.1-29, Teaching in today classroom.\n\n2\\. Anatasiou, D. & Keller, C. (2011). International differences in provision for exceptional learners. In J. Kauffman, & D. Hallahan (Eds.) Handbook of special education, pp773-787. New York : Routledge.\n\n3\n\n9/22\n\nInternational policy and local policy of the special education for students with disabilities (D, Hung)\n\n1\\. UN (2006). Convention on the right of the persons with disabilities. Retrieved at https://www.un.org/development/desa/disabilities/convention-on-the-rights-of-persons-with-disabilities.html\n\n2\\. UN(1994). The Salamanca statement and the framework for action. Retrieved at https://www.right-to-education.org/sites/right-to-education.org/files/resource-attachments/Salamanca\\_Statement\\_1994.pdf\n\n3\\. Hornby, G. (2014). Inclusive Special Education: Evidence-Based Practices for Children with Special Needs and Disabilities. Chapter 5, 83-102. Springer, Switzerland.\n\n4\n\n9/29\n\nEvidenced-based practice for students with disabilities (D, Hung)\n\n1\\. Hornby, G. (2014). Inclusive Special Education: Evidence-Based Practices for Children with Special Needs and Disabilities. Chapter 4, 61-82. Springer, Switzerland.\n\n2\\. Llyod, J., Forneess, S. R., Kavale, K. (1996). Some methods are more effective than others.  Intervention in School and Clinic, 33, 195-200.\n\n3.Singh, N. N. (2016). Implementing evidenced-based practices wisely.  In Singh ed. Handbook of Evidence- Based Practices in Intellectual and Developmental Disabilities, 1-7. Springer, Switzerland.\n\n5\n\n10/06\n\nSchool-visit (D, Hung)\n\n6\n\n10/13\n\nPolicy making and implementation of gifted and talented education  (G, Kuo)\n\nHsu, He, Kuo, Tan, Lya, & Chan (2018). Gaps and go’s in policy, practice and research of gifted education in China, Hong Kong, Singapore and Taiwan. In K. Kennedy & J. Lee(Eds.). Routledge international handbook of schools and schooling in Asia. (pp. 555-569) London: Routledge.\n\nKuo, C.C. (2018). Developments and issues of gifted education in Taiwan. In. B. Wallace; D.A. Sisk & J. Senior (Eds.). The SAGE handbook of gifted and talented education (pp. 479-491). London: SAGE Publications.\n\n7\n\n10/20\n\nEffects of identification criteria on the discovery of disadvantaged minority students (G, Kuo)\n\nKuo, C.-C.\\*, Su, F.-L., & Maker, C. J. (2011). Cultivating problem solving abilities in gifted preschoolers. _Gifted Education International, 27_, 311-326.\n\nKuo, C. C., Chang, L. W., & Wang, M. N. (2008). Mediating strategy of learning for children of culturally diverse and disadvantage. In Ai-Girl Tan and Kurt A. Heller (Eds.), _The Korean Journal of Thinking & Problem Solving_, _18_(1), 35-44.\n\nSusan K. Johnsen, Sonia L. Parker, Yara N. Farah. (2015) Providing services for students with gifts and talents within a Response-to-Intervention framework. _Teaching Exceptional Children,_ 47(4), 226-233. \n\n8\n\n10/27\n\nMaximizing strengths and improving weakness: Conflicts or Complementary  (G, Kuo)\n\nOlszewski-Kubilius, P. & Thomson, D. (2015). Talent development as a framework for gifted education. _Gifted Child Today, 38(1),_ 49-59.\n\nKuo, C.-C., Tseng, Y.-C., Chang, C.-F., Chen, C.-S., Li Y.-J., & Wang, H.-T.\\* (2019). Using video modeling package on improving workplace social skills of young adults with talent traits and autism: A case study in Taiwan. _Universal Journal of Educational Research, 7_(12), 2806-2816. (Scopus)\n\n9\n\n11/03\n\nPsychological and physiological traits of the gifted and their implications in education  (G, Kuo)\n\nChang, H. J. & Kuo, C. C.\\* (2013). Over-excitabilities: Empirical studies and application. Learning and Individual Differences, 23, 53-63.\n\nKuo, C. C., Lin, C. P., & Wang, H. L. Sharon. (2015). Neuroscience research on science-talented learners. In Keith S Taber & Manabu Sumida (Eds.), International perspectives on science education for the gifted: Key issues and challenges (pp. 194-208). London: Routledge.\n\n10\n\n11/10\n\nDomain-specific creativity and its assessment (G, Kuo)\n\nChen, Y.-W., Chang, W.-H., & Kuo, C.-C.\\* (2016). A comparative study of the divergent problem solving abilities of mathematically and scientifically talented students and non-gifted students. Thinking Skills and Creativity, 22, 247-255.\n\n11\n\n11/17\n\nVocational rehabilitation service system for persons with disabilities (R, Wu)\n\nFabian, E. S., & Macdonald-Wilson, K. L. (2012). Professional practice in rehabilitation service delivery system and related system resources. In R. M. Parker & J. B. Patterson (5th Eds.), _Rehabilitation Counseling: Basic & Beyond_ (pp.55-84). Austin, TX: Pro-Ed.\n\n12\n\n11/24\n\nCareer development and counselling of persons with disabilities(R,Wu)\n\nSzymanski, E. M., Enright, M. S., Hershenson, D. B., & Ettinger, J. M.\n\n(2010). Career development theories, constructs, and Research: Implications for people with disabilities. In E. M. Szymanski, &. R. M. Parker, (2 nd Eds.), Work and disability: Contexts, issues, and strategies for enhancing employment outcomes for people with disabilities (pp. 91-153). Austin, TX: Pro-Ed.\n\n13\n\n12/01\n\nVocational Assessment for persons with disabilities (R, Wu)\n\nParker, R. M., & Schaller, J. L. (2010). Vocational assessment and Disabilities. In E. M. Szymanski, &. R. M. Parker, (2 nd Eds.), _Work and disability: Contexts, issues, and strategies for enhancing employment outcomes for people with disabilities_ (pp. 155-200).  Austin, TX: Pro-Ed.\n\n14\n\n12/08\n\nJob Accommodation for persons with disabilities (R, Wu)\n\nBrodwin, M., Parker, R. M., & DeLaGarza, D. (2010). Disabilities and accommodation. In E. M. Szymanski, &. R. M. Parker, (2 nd. Eds.), _Work and disability: Contexts, issues, and strategies for enhancing employment outcomes for people with disabiliti_es (pp. 201-245).  Austin, TX: Pro-Ed.\n\n15\n\n12/15\n\nShelter workshop visit (Dr. Wu)\n\n16.\n\n12/22\n\nFinal Assessment",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "Formal lecture"
        },
        {
            "type": "Group discussion",
            "note": "Group discussion"
        },
        {
            "type": "Field work",
            "note": "Special school and Shelter workshop visiting"
        },
        {
            "type": "Media, audio, visual materials",
            "note": "Moodle"
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 20,
            "note": "Assigned by instructors in class"
        },
        {
            "type": "Final exam",
            "weight": 30,
            "note": "Final exam (close book)"
        },
        {
            "type": "Class discussion involvement",
            "weight": 20,
            "note": ""
        },
        {
            "type": "Attendances",
            "weight": 10,
            "note": ""
        },
        {
            "type": "Presentation",
            "weight": 20,
            "note": "Assigned by instructors in class"
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}