{
    "year": 110,
    "term": 2,
    "name": "翻譯與國際組織",
    "teachers": [
        "鄭永康"
    ],
    "department": "LM25",
    "code": "TIC0055",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 1628,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "譯506"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "前半學期以講授及討論方式探討國際組織運作之基本概念及其他相關面向，並著重於語言層面；後半學期依國際組織為四大單元分別研討。每一單元各週課程包括語言政策、翻譯資源、翻譯人才等議題分別由教師設定研究子題，由學生先行分組研究後，於課堂集中報告及討論，並繳交分組作業。",
    "goals": [
        "熟悉國際組織基本概念",
        "了解國際組織語言特色及政策",
        "研究國際組織使用翻譯之狀況",
        "探討翻譯於特定國際組織中所扮演之角色"
    ],
    "syllabus": "翻譯新聞和社論需要有專門的格式、風格和語調。 透過實務作業本課程將使學生熟悉將中文新聞和社論翻譯成英語的技巧。 練習的重點以社會、商業和政治等等為主題的平面新聞和社論原文。 在課程的最後幾周，學生將學習如何根據幾篇中文原文改寫或綜合成一篇新聞文本。\n\nThe translation of news and editorials requires a specialized format, register and tone. This course will familiarize students with the techniques of translating news into English. Exercises will focus on news articles centering on social, business and political topics, as well as editorials. In the last few weeks of the course, students will learn how to rewrite/summarize news articles based on several Chinese sources. Classes will be conducted as follows:\n\nClasses will be conducted as follows:\n\n(1) A weekly translation exercise of about 800 words/characters long. At least 14 exercises during the term. Depending upon the size of the class, students may be assigned to work in groups of two.\n\n(2) Source-language texts will include select news articles and editorial. Handouts or relevant online links will be given to students for prior reading before doing their translation assignments.\n\n(3) Weekly translation projects submitted by students will be discussed in class, including analysis of mistranslations, omissions, corrections and improvements. \n\n(4) Emphasis of student-work analysis: accuracy, grammar, diction, vocabulary, tone, language register, style and format. \n\n(5) Peer Review: Students will be regularly assigned to study and comment on the work of their classmates as a means to learn others’ adopted techniques, as well as consider their pros and cons, in comparison with their own work. Class discussion will combine students' peer review comments and corrections/suggestions made by the professor. Due to time constraints, it would not be possible to thoroughly review the complete translation works of students, for which they are encourage to compare their versions with those of their classmates in class. Students thus learn how to translate through their own assigned work, comparison with those of their classmates and comments made by the professor.\n\n(6) As a way to develop speed, students may at times be required to do translation of short passages on-site, to be followed by a review of their work.",
    "methodologies": [
        {
            "type": "討論法",
            "note": "Guided peer review"
        },
        {
            "type": "合作學習",
            "note": "Students may be assigned to work in groups of two"
        },
        {
            "type": "其他",
            "note": "Weekly translation assignments"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 40,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 30,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}