{
    "year": 110,
    "term": 2,
    "name": "自我覺察與成長",
    "teachers": [
        "Joshua.K.",
        "Swift."
    ],
    "department": "EU01",
    "code": "PCU0180",
    "credit": 2,
    "serial": 656,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 16
    },
    "schedule": [
        {
            "day": 1,
            "from": 9,
            "to": 10,
            "campus": "本部",
            "classroom": "教513"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "Through lecture, reading, discussion, group report, meditation, self-awareness exercise, homework, and films, we hope to have students look into themselves and explore self. Enhance self-understanding and growth, and then integrate and enhance self-efficacy and mental health. Therefore, this course hopes to help students in: 1Understanding the importance of self-awareness, self-exploration and self-growth. 2. Understand how personal growth affects the efficiency and professional role of the helping profession, such as counselors and teachers. 3. Can apply to personal daily life and enhance personal mental health. 4. Cultivate interest and willing attitude to engage in counseling.",
    "goals": [
        "具備深入自我探索、了解自我的心理、輔導的基礎知識",
        "透過各個諮商理論的內涵深入了解自己各個層面，具備輔導知能，促進個人的身心健康",
        "培養國際觀，由多元不同的角度深入了解自己與他人",
        "深入了解自己，並尊重每個人的獨特性與個別差異",
        "培養以「人」為本的人文情懷，及樂於助人及助己的態度"
    ],
    "syllabus": "**Week**\n\n**Topic & Assignments**\n\n**Readings**\n\nFeb 14\n\nIntroduction to self-awareness & growth\n\nFeb 21\n\nResearch on self-awareness & growth for counselors\n\n*   Derthick et al. (2015)\n*   Coleman et al. (2016)\n*   Psluns & Gall (2020)\n\nFeb 28\n\nPeace Memorial Day (no classes)\n\nMar 7\n\nIntrospection – values and beliefs **(Activity 1: Values)**\n\n*   Schwartz (2012)\n\nMar 14\n\nIntrospection – strengths and weaknesses **(Activity 2: Strengths)**\n\n*   Clements-Hickman (2018)\n\nMar 21\n\nIntrospection – goals and purpose **(Activity 3: Goals)**\n\n*   Norcross (2012)\n\nMar 28\n\nMindfulness – introduction, beginner’s mind, non-judging, & patience **(Activity 4: Mindfulness Practice 1)**\n\n*   Dunn et al. (2017)\n*   Bruce et al. (2010)\n\nApr 4\n\nChildren’s Day (no classes)\n\nApr 11\n\nMindfulness – trust, acceptance, letting go, and non-striving **(Activity 5: Mindfulness Practice 2)**\n\n*   Davis & Hayes (2011)\n*   Bishop et al. (2004)\n\nApr 18\n\nHealthy living – exercise, nutrition, and sleep **(Activity 6: Healthy physical habits)**\n\n*   Briguglio et al. (2020)\n\nApr 25\n\nHealthy living – rewarding activities **(Activity 7: Rewarding activities)**\n\n*   Jacobson et al. (1996)\n\nMay 2\n\nHealthy living – volunteering **(Activity 8: Volunteering)**\n\n*   CNCS (2007)\n\nMay 9\n\nRelationships – non-verbal communication and listening **(Activity 9: Relationships 1)**\n\n*   Martin (2016a)\n\nMay 16\n\nRelationships – basic responding skills **(Activity 10: Relationships 2)**\n\n*   Martin (2016b)\n\nMay 23\n\nRelationships – empathy **(Activity 11: Relationships 3)**\n\n*   Martin (2016c)\n\nMay 30\n\nProfessional strategies to avoid burnout **(Activity 12: Practice schedule)**\n\nJun 6\n\nShare what you care about 1 **(Group A presentations)**\n\nJun 13\n\nShare what you care about 2 **(Group B presentations) (Final paper)**",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Each week (except for the two flex weeks) will include a lecture by the instructor on the assigned topics. Lectures will make up about 1/3 of the class time."
        },
        {
            "type": "討論法",
            "note": "Each week (except for the two flex weeks) will include group discussion led by the instructor on the assigned topics. Some of these will be large group discussions with the entire class, others will be small group discussions with 3 to 5 students per group. Group discussions will make up about 1/3 of the class time."
        },
        {
            "type": "合作學習",
            "note": "During the class period covering the research support for self-awareness and growth, students will be asked to work in small groups (3 to 5 students) to either design a research study in this topic area or review and critique an existing study in this topic area. Periodically, some of the other class periods will include exercises where students work together to solve accomplish a task that I give to them (see description of Other: In Class Practices and Exercises)"
        },
        {
            "type": "其他",
            "note": "Most weeks will also include in class practices and exercises with the topics. For example, when studying mindfulness, class time will also be spent engaging in formal and informal mindfulness exercises. In class practices and exercises will make up about 1/3 of the class time."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 36,
            "note": "Students will be asked to complete 12 different activities designed to produce increased self-awareness and growth. These activities match the topics covered in the previous class lecture (e.g., after discussing mindfulness in class, students will be asked to engage in a short mindfulness exercise at home once per day until the next class period). Students will be asked to write about their experiences completing these activities. Each activity is worth 30 points (3% of the total class grade)."
        },
        {
            "type": "課堂討論參與",
            "weight": 32,
            "note": "Students will be graded on their participation in the class. This includes participation in the lectures (asking questions), participation in group discussions (engaging with their classmates), and participation in the in class practices. 20 points (2% of the final grade) will be awarded for each class period."
        },
        {
            "type": "成果展覽",
            "weight": 16,
            "note": "At the end of the class, students will be asked to showcase something that they care about to the class. This could be a talent, hobby, interest, relationship, etc. They will be asked to create a visual display of the thing they care about as well as explain why it is important to them."
        },
        {
            "type": "其他",
            "weight": 16,
            "note": "Students will be asked to write a final paper for the course. In this paper they will be asked to summarize some of the main things they learned in the course, describe some of their favorite self-awareness and growth exercises from the semester, and make a plan for future self-awareness and growth."
        }
    ],
    "prerequisite": "",
    "general_core": []
}