{
    "year": 108,
    "term": 1,
    "name": "全球強震特論",
    "teachers": [
        "陳卉瑄"
    ],
    "department": "SU44",
    "code": "ESC9003",
    "credit": 3,
    "serial": 3016,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 1,
            "from": 7,
            "to": 9,
            "campus": "公館",
            "classroom": "綜合館202"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大三大四 ◎限碩一碩二碩三以上修習",
    "form_s": "",
    "classes": "9",
    "dept_group": "",
    "hours": 3,
    "description": "地球上每天都在發生地震，一年約有五百萬次，而其中釀成災害的超過一千次。瞭解全球地震活動的分佈、以及探討它們發生的機制，是地震學的重要課題。",
    "goals": [
        "讓學生藉由上網搜尋每週在全球發生的地震事件，漸進式學習地震發生的成因與地體構造的關係。學生會從這門課學到：地震最常發生在哪些地點？這些地點的共通性和相異處在哪裡？大地震的發生時間、地點有沒有可能具規則性？可預測性？學生在課程中會學到全世界不同構造環境中，大地震的特徵和起源。"
    ],
    "syllabus": "讓學生藉由上網搜尋每週在全球發生的地震事件，漸進式學習地震發生的成因與地體構造的關係。學生會從這門課學到：地震最常發生在哪些地點？這些地點的共通性和相異處在哪裡？大地震的發生時間、地點有沒有可能具規則性？可預測性？\n\nThese weekly courses by the students present current large events in the world and by the faculty introduce to the possible causes for the reported events.\n\n\\- Where large earthquakes occur in the world every week?\n\n\\- What causes these earthquakes?  \n\n\\- Which regions we have had frequent large events and why?\n\nYou will learn to evaluate world-wide earthquake-search and understand the causes of large earthquakes at the diverse tectonic settings around the world.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "其他",
            "note": "讓學生藉由上網搜尋每週在全球發生的地震事件，漸進式學習地震發生的成因與地體構造的關係。學生會從這門課學到：地震最常發生在哪些地點？這些地點的共通性和相異處在哪裡？大地震的發生時間、地點有沒有可能具規則性？可預測性？"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 25,
            "note": "Students are assigned to present weekly earthquake activity in the world by introducing where, when, and how large the earthquakes are."
        },
        {
            "type": "期中考",
            "weight": 30,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 20,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 25,
            "note": "For your class project, you will present on a basic introduction to your choosing earthquakes and review articles associated with the historic seismicity in the study area. In the end of presentation you will have to infer the possible causes for the earthquakes considered."
        }
    ],
    "prerequisite": "",
    "general_core": []
}