{
    "year": 110,
    "term": 2,
    "name": "天文中的物理",
    "teachers": [
        "陳林文"
    ],
    "department": "SU44",
    "code": "ESU0201",
    "type": "選",
    "grade": 3,
    "credit": 3,
    "serial": 2940,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 5
    },
    "schedule": [
        {
            "day": 5,
            "from": 7,
            "to": 9,
            "campus": "公館",
            "classroom": "Ｂ413"
        }
    ],
    "programs": [],
    "comment": "中階課程，適合大三以上且修習過天文學(含實習)的學生修習。",
    "restrict": "◎必須先修過【ESU0178  天文學（含實習）】 ◎課程開放上修",
    "form_s": "3",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course is designed to introduce students to fundamental physical concepts and their applications in Astronomy. Although this course will cover a wide range of astrophysics, it will be kept close to practical consideration.  The study of astronomical objects, that are planets, stars, galaxies and the Universe itself, require a good understanding of the fundamental physics, from the classical concepts to the modern ones.   This course will provide an overview of the basics in Physics and how it is applied to understand Astronomy. Qualitative lectures will be supported by quantitative exercise during the lectures and under the form of homework. Midterm and final exams will assess the work of the students.",
    "goals": [
        "To introduce students to fundamental physical concepts and their applications in Astronomy."
    ],
    "syllabus": "**Weekly topics**\n\n01     lecture introduction: co-evolution of physics and astronomy\n\n02     Overview of topics in astrophysics, units, physics & observations / measuring physical properties of astronomical objects in antique era\n\n03     From kepler’s laws to Newtonian mechanics: Orbital motion in planetary systems\n\n04     Classical astrophysical problem - binary systems\n\n05     Potential energy and stellar systems: star clusters and galaxies\n\n06     dark matter: matter distribution in galaxies and large scale structure\n\n07     Compact objects and modern physics in astronomy\n\n08     _midterm exam_\n\n09     Review of midterm exam / Tidal force and accretion phenomena\n\n10     instability and structure formation – thermal pressure and gravitational force\n\n11     Interstellar & star formation\n\n12     Stellar structure and evolution - HR diagram\n\n13     Nature of light: blackbody radiation and continuum radiation / Atomic physics and spectral lines – atmospheres, nebulae, & AGN\n\n14     Opacity and atmospheres / Superluminal motion and, lensing / Relativity and cosmological models\n\n15     _final exam_\n\n16     _National holiday_\n\n17—18 _term project Presentations \\*\\* / essay \\[tentative\\]_",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": "presentations and term essay, Homework, Mid-term and final exams / quizzes, In-class participation"
        }
    ],
    "prerequisite": "◎必須先修過【ESU0178  天文學（含實習）】",
    "general_core": []
}