{
    "year": 111,
    "term": 1,
    "name": "華語方言教材教法",
    "teachers": [
        "曾金金"
    ],
    "department": "IM84",
    "code": "CLC8005",
    "credit": 3,
    "serial": 1385,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 0
    },
    "schedule": [
        {
            "day": 1,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "博1002"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "The design of this course is based on the training of teachers for teaching Chinese dialects. The writing example is based on Taiwanese Hokkien as the teaching language, which can be applied to the teaching of other dialects according to the teacher's expertise and the needs of the students taking the course. The content of the course includes the general situation of Taiwanese Hokkien language teaching in Taiwan, and in the United States and in Japan.  We will introduce the current representative Taiwan Hokkien textbooks and reference books, and compile teaching materials and discuss teaching methods. Teaching content includes Taiwanese language origin, Taiwanese Hokkien Roman pinyin, Taiwan Hokkien pronunciation (consonants, finals, tones, consonants, tone sandhi, colloquial and literal pronunciation, phonological rules), introduction to morphology, grammatical structure, pragmatics, Taiwanese Hokkien journals, Taiwan Hokkien website, Taiwan Hokkien computer word processing and writing of lesson plans: including teaching objectives, teaching content, teaching time, teaching activities, teaching steps, teaching materials and teaching aids. In addition, there will be trainings in listening, speaking, reading and writing in Taiwanese Hokkien. Since most students learning Chinese dialects have a background in Mandarin, the comparison between Mandarin/Mandarin and Taiwanese Hokkien can help students master the dialect more quickly.",
    "goals": [
        "the training of teachers for teaching Chinese dialects.",
        "based on Taiwanese Hokkien as the teaching language, which can be applied to the teaching of other dialects according to the teacher's expertise and the needs of the students taking the course"
    ],
    "syllabus": "1.  課程簡介\n2.  華語方言語音教學（基本音素及羅馬拼音）\n3.  華語方言字詞教學、如何使用華語方言字詞典\n4.  華語方言詞法教學\n5.  華語方言句法教學\n6.  華語方言教材介紹\n7.  華語方言教材編寫\n8.  華語方言作為第二語言的教學法\n9.  華語方言聽力訓練\n10.  華語方言口語訓練\n11.  華語方言閱讀教學\n12.  華語方言寫作教學\n13.  華語方言源流、演變及特色\n14.  華語方言歌謠教學\n15.  華語方言諺語教學\n16.  文白異讀與方音差教學\n17.  教師彈性補充教學\n18.  教師彈性補充教學",
    "methodologies": [
        {
            "type": "講述法",
            "note": "台灣語言源流、演變及特色"
        },
        {
            "type": "討論法",
            "note": "台語作為第二語言的教學法"
        },
        {
            "type": "實驗/實作",
            "note": "台語教材編寫"
        },
        {
            "type": "實地考察、參訪",
            "note": "台語教學觀摩、講座、訪談"
        },
        {
            "type": "媒體融入教學",
            "note": "台語教學網站資源"
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 20,
            "note": "羅馬拼音與方言用字"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "口頭報告及課堂討論"
        },
        {
            "type": "出席",
            "weight": 20,
            "note": "不遲到早退, 因故無法出席, 儘可能事先告知任課教師，並透過學務處學生請假系統請假"
        },
        {
            "type": "成果展覽",
            "weight": 20,
            "note": "期末試教"
        },
        {
            "type": "專題",
            "weight": 20,
            "note": "設計針對性教學活動、編製數位教學材料、教師提問與教學實務討論"
        }
    ],
    "prerequisite": "",
    "general_core": []
}