{
    "year": 107,
    "term": 1,
    "name": "服務學習（二）－英語系學會",
    "teachers": [
        "陳浩然"
    ],
    "department": "LU21",
    "code": "0000019",
    "credit": 0,
    "serial": 1785,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 0,
            "from": -1,
            "to": -1,
            "campus": "",
            "classroom": ""
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎第一階段需人工加選◎第二階段需人工加選◎加退選階段需人工加選",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 1,
    "description": "服務學習課程以「協同合作」、「互惠」、「尊重多元差異」、「學習為基礎」、「社會正義為焦點」等特質為基礎，以「準備」、「服務」、「反思」、「慶賀」等學習歷程，服務範圍以自己的生活與學習環境為起點而推展至專業社群，服務的技能由一般服務推展至專業服務，服務地點由系所而校園乃至於社區，依序漸進。以培養學生關懷社會及服務人群的情操，並促進公民責任之實踐。\n服務學習課程（二）為必修0學分，基本課程時數為18小時(包括服務知能4-8小時及服務實作10-14小時)課程內容以校園服務、社區服務及機構服務為原則。除學系開課外，另有行政單位及社團開課，鼓勵學生依興趣選修，以發展多元價值觀及問題解決的能力。",
    "goals": [
        "增進服務學習理念與服務技巧",
        "發展尊重多元文化與價值觀",
        "培養關懷社會及服務人群的情懷",
        "促進學生實踐公民責任",
        "養成規劃服務方案與解決問題的能力"
    ],
    "syllabus": "I. Course objective: This course combines service and learning, so as to combine classroom instruction with meaningful community service, and to provide a pragmatic, progressive learning experience. It emphasizes critical thinking and personal reflection while encouraging a heightened sense of community, civic engagement, and personal responsibility.\n\nII. Schedule:\n\n1.     To establish criteria for distinguishing service-learning from other types of service programs;\n\n2.     To provide a basis for clarifying distinctions among different types of service-oriented experiential education programs;\n\n3.     To require connection of the traditional classroom experience with the real life lessons that come through service. \n\nIII. Tasks：to plan and execute English Summer Camp for the community\n\nIV. Contents：\n\n1.      Concept and skills of service learning;\n\n2.      Discussion of service subjects and job assignment’\n\n3.      Demonstration and sharing of service learning;\n\n4.      Service learning;\n\n5.      Reflection on the service learning. \n\n  \n \n\n一、課程目標：本課程將「服務」與「學習」相互結合，以事先規劃的社會服務活動與結構化設計的反思過程，讓學生運用課堂所學貢獻社區或服務團隊。透過服務過程中得到的啟發及省思，強調社群意識、公民參與、及自我責任等價值。\n\n二、課程進度：\n\n1.     建立服務學習與其他服務模式之差異化；\n\n2.     建立服務學習與其他教育模式之差異化；\n\n3.     建立傳統課室學習與實作經驗之關連。\n\n三、服務學習重點：師大暑期英語社區活動之規劃及執行\n\n四、課程內容：\n\n1.     服務學習理念與服務技巧；\n\n2.     服務實作主題討論、服務實作分組；\n\n3.     經驗分享與服務工作示範；\n\n4.     服務階段：服務實作；\n\n5.     反思階段：檢討及反思",
    "methodologies": [
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "實驗/實作",
            "note": ""
        },
        {
            "type": "實地考察、參訪",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": "服務學習一、二課程成績之考評採「通過」或「不通過」之考評方式，不通過者，必須重修；通過者，如得畢業。(二)服務課程基本時數包括服務知能4-8小時與服務實作10-14小時，共計18小時；學生因故不能上課請假經核准者視為缺課，未請假或請假未經核准視為曠課，曠課1小時作缺課5小時計，缺課逾3分之1者，該學期成績以「不通過」評定之。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}