{
    "year": 107,
    "term": 1,
    "name": "流行文學與文化",
    "teachers": [
        "邵毓娟"
    ],
    "department": "LU21",
    "code": "ENU0158",
    "credit": 3,
    "serial": 1817,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 1,
            "from": 5,
            "to": 7,
            "campus": "本部",
            "classroom": "正202"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大二大三大四修習",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "The 21st century has seem the influence of the War of Terror, the financial tsunami, the 311 tsunami, the mushrooming of diverse family, the blasting of FB, twitter, LINE, the smart-phone revolution, the Sunflower Revolution, the rise of China, etc. In the age of post-revolution, a review of our everyday life and its embedded cultural politics would help us re-examine our assumptions and compel us to seek alternative framework that would re-define our self-identity and relation to others. \n\nThe goal of this course is to provide students with a reasonably compact introduction to the study of everyday life (a.k.a. popular culture) as it is problematized in critical theory and in literary work. A selected number of literary and theoretical texts will be read and discussed to give students a theoretical understanding, as well as a literary appreciation, of everyday life. With emphasis on everyday life, this course hopes to map the theoretical and literary landscapes of the contemporary world for students to be oriented toward a conceptualization of the cultural politics of everyday life. \n\nThree novels will be read back-to-back. Ed Lin, Ghost Month (2014); Tao Lin, Taipei (2013); and J. D. Salinger, The Catcher in the Rye (1951). The texts are chosen to firstly indulge students in the joy of literature and secondly to relate the geo-cultural politics of everyday life in Taiwan to the rest of the world. Students are required to follow the weekly reading schedule and make presentations about the assigned reading. The oral presentations will include the following components: 1) a plot summary; 2) an analysis of everyday life as being presented in the text; 3) related films/videos/clips from YouTube, etc. 4) a list of questions for class discussion; and 5) a written version of the presentation that the distribution of work, the list all bibliographies, and personal reflections (each member); the written report is due one week after the oral presentation. The oral presentation will take up about 30 minutes and should be supplemented with PPT, film, and all relevant audio-visual resources whenever relevant and helpful. I’d highly encourage students to design the group presentation as a “high fashion show” by incorporating all audio-visual materials to entertain fellow students and mobilize thought-provocative questions for debate and discussions in class.   \n\nWeekly theoretical conceptualizations will be done by the instructor in the way of lecture and quizzes. Basically, twelve sets of binary construct (e.g., man vs. woman; life vs. death, etc.) will be highlighted in order to introduce students to key concerns of the study of everyday life. The textbook is John Storey’s Cultural Studies and the Study of Popular Culture (2003). Weekly the instructor will present a lecture to introduce students to the history, schools of thoughts, and keywords about the study of everyday life. Major concerns include the history of the study of popular culture as a field of enquiry; the distinction between popular culture/mass culture and high culture; Marxist critique of mass capitalism; Althusser’s theory of ideology, Gramsci’s notion of hegemony; the relationship between America and popular culture; the Frankfurt School’s theory of commodity fetishism, cultural industry, modern capitalism; and the rise of postmodernism and its impact to everyday life in the contemporary world.",
    "goals": [
        "to provide students with a reasonably compact introduction to the study of cultural theory and popular culture. A number of literary",
        "to give the student of popular culture a taste of the popular culture material",
        "to map the conceptual landscape of popular culture for students to adopt an in-depth view of culture"
    ],
    "syllabus": "**Studies on Popular Literature and Popular Culture**\n\n**流行文學與文化研究**\n\n**Fall 2018**  \n\nInstructor: Jessie Shao 邵毓娟                  Email: [ycshao@ntnu.edu.tw](mailto:ycshao@ntnu.edu.tw)\n\nOffice: Cheng 808                             Tel: 77341786\n\nOffice Hours: (Tues. 12:00-14:00; Fris. 10:00-12:00)\n\n**I. Goals:**\n\nLiving in the age of the _aestheticization of everyday life_, how would we make use of the popular and keep the same kind of faith Walter Benjamin keeps in a more liberated life made possible by the power of mechanical reproduction and the formation of a new mode of sense perception? This course aims to provide students with a reasonably compact introduction to the study of cultural theory and popular culture so as to explore issues which may provide students with a general survey of studies in popular culture. The selected topics and readings are meant to help them develop an extensive and also in-depth view of popular culture and everyday life. With emphasis on enhancing students’ ability in critical thinking and analytical reading of popular literature and culture, this course will focus on the study of cultural theory and critical monographs so as to shape a theoretical outline of popular culture and foster a critical perspective for the contested social, historical, and political dimensions embedded in popular culture, as well as the psychological complexity underlying the empirical forms of everyday life.\n\n**II. Tentative Syllabus:**\n\n**Week 1 (Sep. 10):** Orientation\n\nCultural Theory: Chapter 1 What is Popular Culture? 何謂大眾/通俗文化\n\n**Week 2 (Sep. 17):** Cultural Theory: Chapter 2 The “Culture and Civilization” Tradition “文化與文明”傳統的文化論述; Chapter 3 Culturalism文化主義\n\nReadings for this week: Chapter 3 Culturalism; “The Young Audience” by Stuart Hall and Paddy Whannel.\n\n**Week 3 (Sep. 24): No Class (Mid-Autumn Festival)**\n\n**Week 4 (Oct. 1):**\n\nCultural Theory: Chapter 7 Gender and Sexuality性別與情慾\n\nTopic for discussion: Popular Culture—Hedonism or Utopian Possibilities?\n\nReadings for this week: Chapter 7 Gender and Sexuality; “Soap Opera and Utopia” by Christine Geraghty (Supplementary material:〈徘徊於《慾望城市》內的維多利亞女性〉by張曌菲.)\n\n**Week 5 (Oct. 8):**\n\nCultural Theory: Chapter 7 Gender and Sexuality\n\nTopic for discussion: Why does the romance consist of?\n\nReading for this week: “Reading _Reading the Romance_” by Janice Radway. (Supplementary material: Excerpts from _Pride and Prejudice_ and _Bridget Jones’s Diary_.)\n\n**Week 6 (Oct. 15):**\n\nCultural Theory: Chapter 7 Gender and Sexuality\n\nTopic for discussion: The Making and Unmaking of Gender identity\n\nReading for this week: “Imitation and Gender Insubordination” by Judith Butler.\n\n**Week 7 (Oct. 22):**\n\nCultural Theory: Chapter 4 Marxisms馬克思主義論述\n\nTopic: What is an ideological reading?\n\nReadings for this week: Chapter 4 Marxisms; “The Rediscovery of ‘Ideology’: Return of the Repressed in Media Studies” by Stuart Hall.\n\n**Week 8 (Oct. 29):**\n\nCultural Theory: Chapter 5 Psychoanalysis 精神分析論述\n\nReading for this week: “From Reality to the Real” by Slavoj Zizek.\n\n**Week 9 (Nov. 5): Make-up Class for Dec. 31**                  \n\nTopic: Aesthetics and Everyday Life 美學與日常生活\n\nVideo-viewing: _The Road Home_ by Zhang Yimou; _In the Mood for Love_ by Wong Kar-wai.\n\nReading for this week: “Sentimental Returns: On the Uses of the Everyday in the Recent Films of Zhang Yimou and Wong Kar-wai” by Rey Chow.\n\n**Week 10 (Nov. 12):**\n\nTopic: Aesthetics and Everyday Life\n\nReading for this week: “Sentimental Returns: On the Uses of the Everyday in the Recent Films of Zhang Yimou and Wong Kar-wai” by Rey Chow.\n\n**Week 11 (Nov. 19): Take-home Midterm**\n\nTopic: Visual Culture: Cultures of the Visual; Regulating Photographic Meanings\n\nReadings for this week: “Rhetoric of the Image” by Roland Barthes; “The Image World” by Susan Sontag.\n\n**Week 12 (Nov. 26):**\n\nTopic: Cinema and Experience\n\nReading for this week: “The Voyeur’s Desire” by Norman K. Denzin.\n\n**Week 13 (Dec. 3): Take-home Midterm Due**\n\nTopic: Japanese Visual Culture\n\nReading for this week: “Contemporary Anime in Japanese Pop Culture” by Gilles Poitras.\n\n**Week 14 (Dec. 10): Group Presentation on Pop Culture**\n\n**Week 15 (Dec. 17): No Class (Dragon Boat Festival)**\n\n**Week 16 (Dec. 24):**\n\nTopic: Japanese Visual Culture\n\nReadings for this week: “The Utopian ‘Power to Live’: The Significance of the Miyasaki Phenomenon” by Hiroshi Yamanaka; “Heart of Japaneseness: History and Nostalgia in Hayao Miyazaki’s _Spirited Away_” by Shiro Yoshioka.\n\n**Week 17 (Dec. 31): No Class**\n\n**Week 18 (Jan. 7): Term Project Due**\n\n**V. Requirements:**\n\n1\\. Finish assigned readings in advance of each class meeting.\n\n2\\. Follow basic classroom etiquette rules: Be punctual for class and send a notice to the instructor in advance when you cannot attend a class meeting.\n\n3\\. Assignments:\n\n(1) Individual work: In-class worksheets and a term project. The in-class worksheets are meant for attendance check and helping the instructor to understand students’ thoughts on some topics. Students will be given a number of topics to answer, and the worksheets may be in the form of a quiz or short-answer questions. For the term project, students are expected to demonstrate their critical insight by applying a number of critical approaches discussed in class to an analysis of popular culture of their own choice.\n\n(2) Group work: Each group is expected to give 2 oral presentations on the assigned topics.\n\n4\\. Exam: There is one take-home exam scheduled for this semester.\n\n**VI. Grading Policy**: Your grade will be given based on your performance on the following aspects:\n\n1\\. Attendance and participation 25%\n\n2\\. Group presentations 25%\n\n3\\. Midterm exam 25%\n\n4\\. Term project 25%\n\n**V. References:**\n\n1.  Storey, John.  _Cultural Theory and Popular Culture_: _An Introduction_.  Athens: The U of Georgia P, 2006.  4th edition.\n2.  Storey, John.  _Cultural Theory and Popular Culture_: _A Reader_.  Athens: The U of Georgia P, 2006.  3rd edition.\n3.  Highmore, Ben. Ed.  _Everyday Life: Critical Concepts in Media and Cultural Studies_.  New York: Routledge, 2012. \n4.  Evans, Jessica and Stuart Hall, eds.  _Visual Culture: The Reader_.  London: Sage, 1999.\n5.  McCracken, Scott.  _Pulp: Reading Popular Fiction_.  Manchester: Manchester UP, 1998.\n6.  Denzin, Norman K..  _The Cinematic Society: The Voyeur’s Gaze_.  London: Sage, 1995.\n\n1.  Hansen, Miriam.  _Cinema and Experience_.  Berkeley: Univ. of California P, 2012.\n2.  Rancière, Jacques.  _The Future of the Image_.  Trans. Gregory Elliott.  London: Verso, 2009.\n3.  MacWilliams, Mark W. Ed.  _Japanese Visual Culture: Explorations in the World of Manga and Anime_.  London: Routledge, 2008.\n4.  Iwabuchi, Koichi.  _Recentering Globalization:_ _Popular Culture and Japanese Transnationalism_.  Durham: Duke UP, 2002.\n\n  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=1e27582bfd504c58a24a0a3a24448fd7&fno=8f1e9849ca1a441cbf8d5c20bed4fcd7)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "引介並講述稍嫌艱澀的文化理論"
        },
        {
            "type": "討論法",
            "note": "透過課堂共同討論來檢視論述的有力見解與盲點"
        },
        {
            "type": "合作學習",
            "note": "透過小組合作來進行分組計畫"
        },
        {
            "type": "媒體融入教學",
            "note": "播放相關影像作品進行課堂討論"
        },
        {
            "type": "專題研究",
            "note": "分組計畫分別包含歷史回顧與當代大眾文化省思."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 50,
            "note": "Midterm journal and term project"
        },
        {
            "type": "課堂討論參與",
            "weight": 15,
            "note": "In-class worksheets"
        },
        {
            "type": "出席",
            "weight": 15,
            "note": "Attendance and participation"
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "Group presentations"
        }
    ],
    "prerequisite": "",
    "general_core": []
}