{
    "year": 107,
    "term": 1,
    "name": "研究方法：文學／文化論述策略",
    "teachers": [
        "李秀娟"
    ],
    "department": "LU21",
    "code": "ENU0320",
    "credit": 3,
    "serial": 1831,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 2,
            "from": 8,
            "to": 10,
            "campus": "本部",
            "classroom": "誠701A"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大二大三大四修習",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "In this course students learn the basic skills of doing research in literature and cultural studies: read cinematic, literary and critical texts, find research topics, gather reference materials, learn appropriate reference style, and write papers. A central theme of research will be chosen every time this course is offered. In Fall 2020, the central topic of research will be “language.” A series of films, literary and critical texts on issues of language/communication will be gathered for the study of the nature of language: What is language? What are the functions of language? Is language a tool of communication or does it hamper communication? Do we use language or does language use us? Is language gendered? Is there power in language or does the power come from the person who uses language? Also, how does language travel across cultures? Are there specific languages which are more capable of communicating love and emotions than other languages? What are the differences between adults’ and children’s languages? What would extraterrestrial beings’ language look/sound like and in what way could different languages affect our conceptions of reality? Questions like these and others will be asked throughout the semester. Students are encouraged to come up with their own discussions and critical opinions based on their understanding of the selected cinematic and literary texts. In addition to probing into specific texts, students will also be introduced to library catalogues and databases, as well as learn the basic MLA reference style, practice the skills of citation and documentation, build up a bibliography on the research topic of their choice, read sample papers, sharpen writing ability and ultimately produce a short research paper of 5-7 pages.",
    "goals": [
        "學習文學與文化研究論述技巧。",
        "培養基本學術寫作能力。"
    ],
    "syllabus": "  \n[教學進度與主題附件](https://ap.itc.ntnu.edu.tw/NtnuFileShare/file.do?action=dl&gno=3eedc9cda32b406aae2a0f740bf2c350&fno=7a43415f2ddb4b828c9bc033c51ef80f)",
    "methodologies": [
        {
            "type": "講述法",
            "note": "授課教師講授課程重點"
        },
        {
            "type": "討論法",
            "note": "教師或學生提出問題、全班共同討論"
        },
        {
            "type": "合作學習",
            "note": "小組完成圖書館資料蒐集、小組書目製作"
        },
        {
            "type": "實地考察、參訪",
            "note": "圖書館資源利用"
        },
        {
            "type": "媒體融入教學",
            "note": "研究主題相關影片放映、Moodle教學平台研究資料分享"
        },
        {
            "type": "專題研究",
            "note": "期末研究小論文"
        },
        {
            "type": "其他",
            "note": "授課教師針對修課學生專題研究主題進行個別指導"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": "圖書館資料蒐集、書目製作、研究論文提綱"
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "針對研讀內容提出問題與參與討論，包括在Moodle教學平台上的參與與分"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "學生準時出席每周課程。"
        },
        {
            "type": "報告",
            "weight": 10,
            "note": "根據指定閱讀材料內容與研究主題，1-2次口頭報告與帶領討論。"
        },
        {
            "type": "成果展覽",
            "weight": 20,
            "note": "研究論文提綱與草稿分享"
        },
        {
            "type": "專題",
            "weight": 10,
            "note": "期末研究論文"
        }
    ],
    "prerequisite": "",
    "general_core": []
}