{
    "year": 107,
    "term": 1,
    "name": "文學作品導讀（一）",
    "teachers": [
        "邵毓娟"
    ],
    "department": "LU21",
    "code": "ENU0257",
    "credit": 2,
    "serial": 1812,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "正302"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "1",
    "classes": "2",
    "dept_group": "",
    "hours": 2,
    "description": "The goal of this course is to provide students with a reasonably compact introduction to the study and appreciation of fiction, poetry, and drama. The selected literary works are studied in terms of basic elements such as plot, setting, point of view, theme, style and tone, symbolism and also in terms of critical concepts and approaches so as to enhance students’ meaningful reading of literature and to heighten their sensibility and appreciation of aesthetic, social, cultural, ethical, and philosophical dimensions of literary expressions.",
    "goals": [
        "Learn key terms and concepts generally applied to the evaluation of literature",
        "Hone skills of close reading and critical thinking",
        "Develop curiosity about the world through context-specific analysis of literary works",
        "Improve sensitivity to the English language"
    ],
    "syllabus": "**Approaches to Literary Works** 文學作品導讀\n\n**Fall 2018**\n\nInstructor: Jessie Shao 邵毓娟                                        Email: ycshao@ntnu.edu.tw\n\nOffice: Cheng 808                                                              Tel: 77341786\n\nOffice Hour: Tues. (12:00—2:00) & Fris. (10:00-12:00)\n\n**I. Goals:**\n\nThe goal of this course is to provide students with a reasonably compact introduction to the study and appreciation of fiction, poetry, and drama. The selected literary works are studied in terms of basic elements such as plot, character, setting, point of view, theme, symbolism so as to enhance students’ ability in meaningful reading of literature and critical thinking. Students will be introduced to a number of critical concepts and approaches so as to heighten their sensibility to appreciate the cultural, socio-political, and philosophical dimensions of literary expressions.\n\n**II. Required Textbook:**\n\nKelly J. Mays ed. _The Norton Introduction to Literature._ New York: Norton, 2016. 12th edition.\n\n**III. Tentative Syllabus:**\n\n**Week 1 (Sep.12):** Orientation\n\nTopic: What is literature? And what is fiction? (See “Basic Elements of Fiction.”) **Week 2** **(Sep.19):** \n\nElements of Fiction: Narration (敘事) and Point of View (敘事觀點)\n\nTopic: Media Mediation and Modern Life\n\nAssigned Reading: “Cathedral” by Raymond Carver\n\n**Week 3** **(Sep.26):** Elements of Fiction: Plot (情節); Theme (主題/主旨)\n\nTopic: Conformism and Individuality\n\nAssigned Reading: “A & P” by John Updike\n\n**Week 4 (Oct.3):** Elements of Fiction: Setting (場景)\n\nTopic: Cultural Identity (文化身分/屬性) and Self-Identity\n\nAssigned Readings: “A Pair of Tickets” by Amy Tan; “Mother Tongue” by Amy Tan\n\n**Week 5 (Oct.10): No class. (Double-Tenth Day)**\n\n**Week 6 (Oct.17):** Elements of Fiction: Character (人物)\n\nTopic: Racial Identity and Self-identity \n\nAssigned Reading: “Recitatif” by Toni Morrison\n\n**Week 7 (Oct.24):** Elements of Fiction: Symbol (象徵) and Figurative Language\n\nTopic: Conflict and Initiation Stories (啟蒙故事) \n\nAssigned Reading: “Araby” by James Joyce\n\n**Week 8 (Oct.31):**\n\n Topics: Initiation Stories; Gender and Subjectivity \n\nAssigned Reading: “Boys and Girls” by Alice Munro\n\n**Week 9 (Nov.7):**  **Mid-term Exam**\n\n**Week 10 (****Nov.14****):** \n\nFilm-Viewing: _Stranger than Fiction_\n\n**Week 11 (Nov.21):**\n\nTopic: Cross-Cultural Encounters and Conflicts\n\nAssigned Reading: “Interpreter of Maladies” by Jhumpa Lahiri \n\n**Week 12 (Nov.28):**\n\nTopic: Cultural Encounters and Cultural Confrontations\n\nAssigned Reading: “The Management of Grief” by Bharati Mukherjee\n\n**Week 13 (****Dec.5****):**\n\nCritical Casebook: The Author’s Work as Context: Flannery O’Connor \n\nTopic: Self-consciousness, Violence, and Truth\n\nAssigned Reading: “Everything that Rises Must Converge” by Flannery O’Connor  **Week 14 (Dec.12)**:\n\nTopic: Faith and Morality\n\nAssigned Reading: “A Good Man Is Hard to Find” by Flannery O’Connor \n\n**Week 15 (Dec.19)**: \n\nTopic: Paternalism and Gender Formation\n\nAssigned Reading: “A Rose for Emily” by William Faulkner\n\n**Week 16 (Dec.26)**:\n\nTopic: Life and Writing\n\nAssigned Reading: “A Conversation with My Father” by Grace Paley\n\n**Week 17 (Jan.2): Final Exam**\n\n**Week 18 (Jan.9): Individual Conference**\n\n**IV. Requirements:**\n\n1.  It is advised that you finish each reading assignment in advance of class meeting. \n2.  Follow basic classroom etiquette rules: Be punctual for class and send a notice to the instructor in advance when you cannot attend a class meeting.\n3.  Attendance and participation are important. Discussing these texts with the instructor and your peers will enhance your ability in the understanding and appreciation of literary works. Your responses and questions will help facilitate more discussion and reflection on the assigned readings.\n4.  Assignments:\n\n(1) Individual work: In-class worksheets and online forum. The in-class worksheets are meant for attendance check and helping the instructor to understand students’ thoughts on some topics. You will be given a number of topics to answer, and the worksheets may be in the form of a quiz or short-answer questions. For online forum, you are expected to demonstrate your critical insight through your responses to topics related to the film.\n\n(2) Group work: Each group is expected to give 2 oral presentations on the assigned topics. Each group is expected to help facilitate more discussion and reflection on the assigned reading by sharing your group reflection and questions with regard to the assigned reading.\n\n1.  There are two exams scheduled for this semester: Midterm and Final.\n\n**V. Grading Policy:** Your grade will be given based on your performance on the following aspects: 1. Individual Work: Attendance, participation, and weekly worksheets 45%; 2. Group Work 20%; 3. Exams 30%; 4. Online Forum 5%.",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "其他",
            "weight": 100,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}