{
    "year": 107,
    "term": 1,
    "name": "英語教學概論",
    "teachers": [
        "劉宇挺"
    ],
    "department": "LU21",
    "code": "ENU0150",
    "credit": 2,
    "serial": 1841,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 2,
            "from": 6,
            "to": 7,
            "campus": "本部",
            "classroom": "正302"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大二修習",
    "form_s": "2",
    "classes": "2",
    "dept_group": "",
    "hours": 2,
    "description": "Course Description: This is a one emester, 2 credit, mandatory course for English majors. The main objective of this course is to introduce you to theories and methods of teaching English to speakers of other languages. In this course, we will trace the historical development of second language teaching methods from grammar based curricula to present day interactive methods, where most of our focus will be placed. TESOL approaches and methods will be studied in their practical settings and in terms of their theoretical underpinnings. In addition to the theoretical focus, we will also discuss the practical aspects of teaching English as a foreign/second language. By the end of the course, you will be well-versed in applying major teaching methods that are currently being used in most EFL/ESL classrooms. teaching.",
    "goals": [
        "To introduce you to theories and methods of teaching English to speakers of other languages",
        "To trace the historical development of second language teaching methods from grammar-based curricula to present-day interactive methods",
        "To discuss the practical aspects of teaching English as a foreign/second language"
    ],
    "syllabus": "英語教學概論\n\n**Classroom:**  正305\n\n**Instructors:** Dr. Yeu-Ting Liu (yeutingliu@ntnu.edu.tw)\n\n  \n\n**Texts:**\n\n·       Nunan, D. (2015). _Teaching English to speakers of other languages._ New York: Routledge.\n\n**Course Description and Objectives:**\n\nThis is a 2-point course designed to introduce you to the fundamental principles underlying second/foreign language acquisition and their implications for language teaching. This course addresses second/foreign language development from an interdisciplinary, multi-dimensional approach. The topics covered revolve around issues on the learners\\` language and development, internal and external factors affecting second/foreign language acquisition, curriculum and materials development, classroom practices, as well as learner strategies and styles.  \n\n**Requirements:**\n\n1.         Grading policy:   \n\n   Attendance & in-class participation 20%\n\n   Class assignments 20%\n\n   Mid-term project 30%\n\n   Final project 30%\n\n2.         Active in-class participation is expected.  \n\n3.         As a courtesy to me and to your peers, I expect you to come to every class _on time_ with your readings completed and prepared to participate in discussion and group activities. You are allowed to miss one session for justifiable reasons (i.e. illness, family emergencies, or important occasions such as religious holidays, job interviews, or an “extremely important” ball game between _Red Sox_ and _Yankees_). If you have to miss a class session, please notify me as early as possible. Also, it is your responsibility to hand in any assignments on time and to find out what you have missed. Multiple absences may result in an automatic failing grade.\n\n4.         Any student who plagiarizes ideas from others without acknowledgement would fail the course.\n\n**Fall Semester Schedule**\n\n**Week**\n\n**Date**\n\n**Contents**\n\n1\n\n9/17\n\nOrientation: course overview\n\n2\n\n9/24\n\nVideo Viewing\n\n3\n\n10/1\n\nLanguage Teaching Methodology\n\n4\n\n10/8\n\nLearner-Centered language Teaching\n\n5\n\n10/15\n\nListening\n\n6\n\n10/22\n\nSpeaking\n\n7\n\n10/29\n\nReading\n\n8\n\n11/5\n\nMid-term project date\n\n9\\*\n\n11/12\n\nMid-term project presentation\n\n10\n\n11/19\n\nWriting\n\n11\n\n11/26\n\nPronunciation\n\n12\n\n12/3\n\nVocabulary\n\n13\n\n12/10\n\nGrammar\n\n14\n\n12/17\n\nDiscourse\n\n15\n\n12/24\n\nLearning styles and strategies\n\n16\n\n12/31\n\nAssessment\n\n17\\*\n\n1/7\n\nFinal Project Presentation\n\n  \n\n**Guidelines for the Final G****roup (Picture Book) Project**\n\nFor the final project, you will be working with your group members in developing a picture book that fits the spirit, theories, and principles of language teaching and learning for English language learners. The picture book should be at least 15 pages long and no more than 20 pages. The actual number should be based on the completeness of the content. Besides the picture book, you will also hand in a written explanation about the connection between the design of the picture books and the principles, theories, and rationales behind. The explanations should be no more than three pages. The following guidelines are to guide you to develop an interesting picture book based on the theories and principles discussed in class.\n\n1.         **Age level and language proficiency level:** Before developing the picture book, you will need to decide the age level and language proficiency level that the material is intended for. The target audience should be English language learners.\n\n2.         **Topic and theme:** There is no limitation concerning topics and themes that you can select. It can be either expository or narrative, fiction or non-fiction. The only thing you need to keep in mind is if the topic/theme is adequate for the target age group.\n\n3.         **Bring in principles and theories:** Before developing the content, review the theories, principles, and concepts discussed in class and in the textbook. Utilize them to develop the content, the picture, and the overall design.\n\n4.         **Language of the picture book:** It can be monolingual or bilingual depending on the target audience and the purpose of the picture book (ex. language oriented or story oriented).     \n\n5.         **Text and Picture:** In developing your picture book, make sure that the text and picture **TOGETHER** tell the story and/or deliver the message.\n\n6.         **Cover and End page:** The completeness of design should also take the cover and end page (even the author’s page) into consideration.\n\n7.         **Final Product:** You need to hand in two versions of the final product. One hard copy of the picture book (and the explanation). In addition, an electronic version (DVD) of the picture book (excluding explanation).",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "實地考察、參訪",
            "note": ""
        },
        {
            "type": "媒體融入教學",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 30,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "Teaching demonstration"
        },
        {
            "type": "其他",
            "weight": 30,
            "note": "Final Project on Textbook Evaluation. The project for the first semester is a review of a set of ELT textbooks and analysis of what ELT theories and approaches are applied."
        }
    ],
    "prerequisite": "",
    "general_core": []
}