{
    "year": 107,
    "term": 1,
    "name": "語言與心理",
    "teachers": [
        "颯楊"
    ],
    "department": "LU21",
    "code": "ENU0167",
    "credit": 3,
    "serial": 1818,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 2,
            "from": 8,
            "to": 10,
            "campus": "本部",
            "classroom": "誠304"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "This course is intended to introduce the students to the exciting field of language and  cognition. In the past three decades, a new scientific discipline called cognitive science  emerged. Linguistics is one important component of this highly interdisciplinary field. In this  course, you will be introduced to the important landmarks in cognitive science and  psychology of language. From time to time, you will receive updated information on the new  advancements in this field.  This course is intended to stimulate creative thoughts and critical readings of the  literature. You are encouraged to think about and challenge the issues that we touch upon in  class. There will be pop quizzes and in-class exercises. You are required to keep up with the  course materials at all times to achieve satisfactory performance.  There is a Blackboard website set up for this class. It will be necessary to access your  account at Blackboard as handouts, slides, and course-related materials will be posted there.  You will also turn in your assignments, and monitor your grades there.",
    "goals": [
        "To introduce the students to the exciting field of language and",
        "Be introduced to the important landmarks in cognitive science and",
        "To stimulate creative thoughts and critical readings of the"
    ],
    "syllabus": "**Description:**\n\nThis course is designed as an overview of topics dealing with the relation between language and mind. We usually tend to notice how language is used in the real world and how it's used for communicative purposes, that is, an **external** view of language and linguistics.\n\nThere's another trend in linguistics that views language as a phenomenon that is **internal to human beings' brains**. This will be the focus of this course. Rather than analyzing language as a cultural, external object, we're going to analyze it as a psychological, internal one.\n\nWe'll be talking about linguistics and grammar not as you see them in textbooks but **as they're represented in the mind**. Any normal human being speaks at least one language, which means that we have lots of linguistic knowledge in our head. We'll study how that knowledge is organized.\n\n  \n\nTentative Schedule:  \n\n  \n\n**Week**\n\n**Content**\n\n**1**\n\nIntroduction, Syllabus, Questions?\n\n**2**\n\nSounds (i): Sounds and phonemes\n\n**3**\n\nSounds (ii): Acquisition of sounds by babies\n\n**4**\n\nSounds (iii): Sounds in the mind\n\n**5**\n\nSounds (iv): Categorical perception\n\n**6**\n\nSounds (v): Sound production, Speech errors, Mondegreens\n\n**7**\n\n**MID-TERM EXAM**\n\n**8**\n\nWords (i): Morphology across languages\n\n**9**\n\nWords (ii): Morphology in sign language  \n(American Sign Language and Taiwanese Sign Language)\n\n**10**\n\nWords (iii): The mental lexicon and priming\n\n**11**\n\nSentences (i): Basic concepts in syntax\n\n**12**\n\nSentences (i): Basic concepts in syntax\n\n**13**\n\nSentences (ii): Early syntax in English and Chinese\n\n**14**\n\nSentences (iii): Sentence comprehension\n\n**15**\n\nSentences (iii): Sentence comprehension\n\n**16**\n\nSentences (iv): Syntactic trees in the mind\n\n**17**\n\n**TAKE-HOME FINAL EXAM DUE**",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 40,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 50,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "Participation and attendance"
        }
    ],
    "prerequisite": "",
    "general_core": []
}