{
    "year": 107,
    "term": 1,
    "name": "語言與文化",
    "teachers": [
        "常紹如"
    ],
    "department": "LU21",
    "code": "ENU0065",
    "credit": 3,
    "serial": 1814,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "正304"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大二大三大四修習",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "本課程旨在介紹語言與文化的關係，以及語言與文化在華語研究與教學的應用。課程主題涵蓋：文化的定義、語言如何反映文化、文化如何影響語言、跨語言與跨文化溝通、東西文化對比、語言文化的教學策略、教學程序與測試技巧、華語教學的文化議題、華語教師必備的文化知識、語言與文化的研究課題與研究方法等。本課程培養學生透過語言分析進行文化解構的能力，為從事語言與文化研究奠定基礎，並學習在課程設計中結合語言與文化，幫助學習者掌握母語與目標語的文化異同。",
    "goals": [
        "本課程培養主動獨立學習的能力與習慣"
    ],
    "syllabus": "本課旨在探討文化之意涵、文化與語言之關連，及跨文化溝通（intercultural communication）之原則、特色與能力。在文化意涵方面，學生將習得探究文化之理論架構，中西文化差異，及不同文化團體之特色。在文化與語言之關連方面，學生將探討文化價值體系對語言及非語言行為之影響。而在跨文化溝通之議題上，學生將涉獵跨文化溝通障礙之相關文獻，及不同跨文化溝通情境之實証研究。課程進行方式以老師解說與小組討論為主，遊戲、影片欣賞、校外參觀，與交換學生座談等活動為輔。  \n The course aims to explore and examine the meaning and construct of culture, the relationship between culture and language, and intercultural communicative competence in various social settings. Specifically students are introduced to different theories regarding general cultural patterns, the influence of cultural values an beliefs on verbal and nonverbal communication, specific differences between mainstream Chinese and Taiwanese aboriginal cultures, between the cultures of males and females, and between and among Chinese and various English-speaking cultures and their language behaviors, obstacles to intercultural communication, and intercultural competence in educational, relational and business contexts. The class materials are imparted mostly via lectures and small group or whole class discussion. Films, simulation games, field trips and talk with foreign exchange students will also be arranged to facilitate students’ learning of certain topics.   \n  \nWeek & Content  \n1   Orientation & Introduction: Culture, Communication, and Intercultural Communication  \n2   Film Watching   \n3   Obstacles to Intercultural Communication: Ethnocentrism, Stereotyping, Prejudice, Discrimination, and Racism  \n4   Cultural Patterns: Foundations and Taxonomies  \n5   Cultural Patterns: Foundations and Taxonomies (cont.)  \n6   Cultural Patterns: Foundations and Taxonomies (cont.)  \n7   Film Watching  \n8   Midterm Exam  \n9   Culture and Verbal/Nonverbal Codes (Simulation Game)  \n10 Culture and Verbal/Nonverbal Codes (cont.)  \n11 Culture and Verbal/Nonverbal Codes (cont.)  \n12 American Culture & English Language   \n13 Film Watching   \n14 Chinese Culture & Language  \n15 Guest speaker(s)  \n16 Group Project Presentation   \n17 Group Project Presentation   \n  \nMidterm Exam:       30%   \nFilm Analysis:          30% (10% each)  \nGroup Project:        30%   \nClass Participation: 10%",
    "methodologies": [
        {
            "type": "講述法",
            "note": "The instructor briefly lectures on the reading materials."
        },
        {
            "type": "討論法",
            "note": "The group will go over the discussion questions each week, and then the instructor will lead the class discussion on the reading materials."
        },
        {
            "type": "合作學習",
            "note": "Group members will collaborate with one another in weekly group discussion, film analysis, the midterm, and the final group project."
        },
        {
            "type": "專題研究",
            "note": "A final group project (be it a thorough literature review or an empirical study) on one of the themes or topics covered in class is required."
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": "weekly upload of reading materials and reflection"
        },
        {
            "type": "期中考",
            "weight": 30,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 5,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 20,
            "note": "theme- or topic-based final group project"
        },
        {
            "type": "其他",
            "weight": 15,
            "note": "film analysis: (5% each)"
        }
    ],
    "prerequisite": "",
    "general_core": []
}