{
    "year": 107,
    "term": 1,
    "name": "文法與修辭",
    "teachers": [
        "丁仁"
    ],
    "department": "LU21",
    "code": "ENU6025",
    "credit": 3,
    "serial": 1840,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 5,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "誠305"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限大二修習",
    "form_s": "2",
    "classes": "1",
    "dept_group": "",
    "hours": 3,
    "description": "This course will give an overview of the major features of English grammar. It will not cover all grammatical features in English, but rather aim at initiating independent thinking and research on the problematic areas of English grammar. You will become familiar with the intricacies of English grammar, particularly those that tend to be challenging to nonnative speakers. In this course you will learn to describe how English sentences are constructed and you will develop the skills necessary to analyze and explain English words, phrases and sentences, as well as learn the terminology to talk about them. In addition, you will learn about a corpus-based approach to studying vocabulary. Examining the use of words in natural contexts and different registers sheds light on our understanding of their true senses",
    "goals": [
        "understand how English grammar works and feel more confident about helping your peers and/or ESL students use English accurately, meaningfully, and appropriately",
        "identify and correct grammatical errors in spoken and written English and provide grammar explanations with commonly used terminology",
        "explain how a word is used appropriately and how related words are distinguished"
    ],
    "syllabus": "教學目標\n\nThis course will give an overview of the major features of English grammar. It will **not** cover **all** grammatical features in English, but rather aim at initiating independent thinking and research on the **problematic** areas of English grammar. You will become familiar with the intricacies of English grammar, particularly those that tend to be challenging to nonnative speakers. In this course you will learn to describe how English sentences are constructed and you will develop the skills necessary to analyze and explain English words, phrases and sentences, as well as learn the terminology to talk about them. You will also learn about rhetorical patterns in writing and how to apply the grammatical patterns to writing for the purpose of clarity and effectiveness.\n\n教材大綱（含每週教學主題）\n\nWeek 1 Orientation\n\nWeek 2-4  Tense/aspect\n\nWeek 5-6  Passives\n\nWeek 7-8  Modal auxiliaries\n\nWeek 9 Mid-term\n\nWeek 10-11  Rhetorical skills\n\nWeek 12-13 Conditional clauses\n\nWeek 14 Restrictive & non-restrictive relative clauses\n\nWeek 15  Relative adverb clauses\n\nWeek 16-17  Adverbial clauses & reduced adverbials \n\nWeek 18  Final exam",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "期中考",
            "weight": 30,
            "note": ""
        },
        {
            "type": "期末考",
            "weight": 30,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 15,
            "note": ""
        },
        {
            "type": "其他",
            "weight": 25,
            "note": "複習測驗"
        }
    ],
    "prerequisite": "",
    "general_core": []
}