{
    "year": 111,
    "term": 1,
    "name": "建築史研究導論",
    "teachers": [
        "Candida",
        "Syndikus"
    ],
    "department": "TM67",
    "code": "AHM0116",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 3130,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 1,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "青田405室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "To increase students’ knowledge of the development of architecture and architectural theory through the ages.",
        "To train students’ ability of analytical description and comparative analysis of form using the correct terminology.",
        "To enhance students’ knowledge of the development of architectural theory and methodology.",
        "To improve students’ capacity of esthetic judgment.",
        "To instruct students how to read and interpret contemporary sources of architectural theory and evaluate them with regard to the relevant buildings.",
        "To promote students’ competencies to collect and interpret related literature and to maintain a critical distance towards scientific opinions.",
        "To give an introduction with technical instructions for writing a scientific text and composing a paper."
    ],
    "syllabus": "Teaching Content (weekly Topic):  \n 1 Introduction: Historic building research today–questions and possibilities. Techniques of description and interpretation in building research. Description of architecture and specific language (with reference to terminology catalogue).  \n 2 Distribution of topics for written papers.  \nForms of graphic/schematic representation. How to read architecture.  Building types: Traditional building types. New building types as of the 18th/19th centuries. Introduction to descriptive methods. Training of terminology.  \n 3 Short history of western architecture I: General outline: Introduction: buildings in history–form and function–roots in antiquity. The architectural orders from antiquity to classicism and their terminology. Romanesque and Gothic architecture in France, Italy, Germany.  \n 4 Short history of western architecture II: Renaissance architecture in the fifteenth century (Florence, Brunelleschi; Urbino, Rimini, Mantua, Alberti; Venice).  \n 5 Architectural theory: Origins: Vitruvius, De architectura libri decem. Vitruvius in the Middle Ages (Manuscript Sélestat, Bibl. Munic., Ms. 1153 bis). Theorists of the Early Renaissance: Leon Battista Alberti, De re aedificatoria/On the Art of Building (c. 1452; publ. 1485). Filarete, Trattato di architettura/Treatise on Architecture (compl. around 1464). Francesco di Giorgio Martini, Trattati di architettura, ingegneria e arte militare/Treatise of architecture, engineering, and art of warfare (ms., 80s/90s fifteenth century). Early editions of Vitruvius (Florence 1496; Fra Giocondo, Venice 1511, 1513; Cesare Cesariano, Como 1521). Architectural treatises of the sixteenth century. Great Britain: Inigo Jones; Vitruvius Britannicus (publ. 1715, 2nd vol.: 1717; supplement: 1725). 16 examples reproduced in the first volume. With an accent on the projects of Sir John Vanbrugh. Germany: Wendel Dietterlin, Leonhard Christoph Sturm.  \n 6 Short history of western architecture III: Church building in sixteenth century Rome (Bramante, Michelangelo: St Peter’s). High Renaissance palaces and villas (Rome, Tuscany, Palladio/Veneto). Mannerist architecture (Michelangelo, Florence).  \n 7 Short history of western architecture IV: Short history of western architecture V: Palladianism: Palladio’s legacy in Great Britain and the United States. Abundance and order in Baroque architecture, new forms: Baroque church architecture (Rome, Southern Germany). Baroque castles (France: Vaux-le-Vicomte; Southern Germany: Würzburg).  \n 8 Short history of western architecture V: Revolutionary architecture and architecture parlante (Étienne-Louis Boullée: Cenotaph for Isaac Newton, 1784; Peter Speeth: Würzburg, Former Women’s Prison, 1809–10). Stylistic variety in 19th-century architecture and revival of styles in 19th-century architecture (Heinrich Huebsch: “In what style should we build?,” 1828; style and function: Schinkel, Berlin). Short history of western architecture VI: Architectural movements in the 2nd half of the 19th century: Arts & Crafts and Art Nouveau. Ornament and crime, 1910 (Adolf Loos).  \n 9 Historical outline of research: Architectural theory and methodology. The art of description in early times: architecture in literature/historical sources/ekphrasis. Procopius of Caesarea: Peri Ktismaton/De aedificiis/On the Buildings, 6 books, 561 (Description of the Haghia Sophia). St Bernard of Clairvaux (letter against decoration of monasteries); compare Cistercian monasteries. Traditional methods of art history with special regard to architecture. The origins (Plinius: Naturalis historia, Vitruvius: De architectura, Renaissance and Baroque).  \n10 The concept of style, history of style, analysis of style. Origins: Winckelmann, Goethe (Straßburg, Münster; Palladio). Gottfried Semper (function, material, technique). Jacob Burckhardt and Renaissance (Cicerone, 1855). Alois Riegl and the Vienna School of Art History: Kunstwollen/will to art (Stilfragen: Grundlegungen zu einer Geschichte der Ornamentik/Problems of style: foundations for a history of ornament, 1893). Heinrich Wölfflin: Principles of Art History (Renaissance und Barock, 1888/ Renaissance and Baroque, London 1964). Problems of transfer from painting to architecture. John Ruskin: analysis of form (Stones of Venice, 1851–53)  \n11 Iconography and Iconology. Aby Warburg. Erwin Panofsky: Meaning in the Visual Arts (f. e. Introduction of Abbot Suger on the Abbey Church of St.-Denis and its art treasures, Princeton 1946, pp. 1–37; or: Gothic Architecture and Scholasticism, Latrobe, Pa. 1951). Otto von Simson: The Gothic Cathedral: Origins of Gothic Architecture and the Medieval Concept Order, London 1956. Structural analysis: Hans Sedlmayr: Die Schauseite der Karlskirche in Wien, in: Kunstgeschichtliche Studien für Hans Kauffmann, Berlin 1956, pp. 262–271.  \n12 Short history of western architecture VII: New theories in twentieth-century architecture. Architecture after 1900. The “free plan” and organic space: Walter Gropius, Ludwig Mies van der Rohe. “Curtain wall.” Le Corbusier and the five points of modern architecture. Henry-Russel Hitchcock/Philipp Johnson, “The International Style” (1932). Ornament and modern architecture. Discussion of Postmodernism. After postmodern architecture/21st century.  \n13 Presentation I  \n14 Presentation II  \n15 Presentation III  \n16 Presentation IV  \n17 Historical context: archive studies around 1900: Julius von Schlosser. Cornel von Fabriczy. New approaches of architectural history. Semiotics: Umberto Eco, A Theory of Semiotics, Bloomington, Ind. 1976. Günter Bandmann: Medieval Architecture as Carrier of Meaning, Berlin 1951. Aesthetic of reception. Wolfgang Kemp, Kunstwissenschaft und Rezeptionsästhetik, in: Id. (ed.), Der Betrachter ist im Bild. Kunstwissenschaft und Rezeptionsästhetik, Cologne 1985, pp. 7–27. Current research/case studies.  \n18 Preservation of monuments and historic buildings. Current problems. UNESCO World Heritage. Preservation–transformation–conversion–demolition. Possibilities of conversion: case studies. Reconstruction: The history of the Berlin Stadtschloss as case study. Final discussion.",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": ""
        },
        {
            "type": "Group discussion",
            "note": ""
        },
        {
            "type": "Field work",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "Class discussion involvement",
            "weight": 20,
            "note": ""
        },
        {
            "type": "Presentation",
            "weight": 80,
            "note": "Paper 50%: Students submit a written paper (12–15 pages) at the end of the semester. Presentation 30%: Students prepare a half-hour talk with power point presentation, which is followed by a 15-minute discussion."
        }
    ],
    "prerequisite": "◎Available for junior and senior year B.A. program students (Doctoral program courses excepted) and M.A. program students.",
    "general_core": []
}