{
    "year": 110,
    "term": 2,
    "name": "氣候變遷",
    "teachers": [
        "陳正達"
    ],
    "department": "SM44",
    "code": "ESC0257",
    "type": "選",
    "grade": null,
    "credit": 3,
    "serial": 2656,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 2,
            "to": 4,
            "campus": "公館",
            "classroom": "Ｃ409"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "Introducing to the basic physical principle on climate dynamics and the key issues in the climate change science.",
        "Reading, presenting and discussing the latest scientific assessment report on future climate projection by IPCC.",
        "Learning the climate modeling and basic analysis tool used in climate studies; Analyzing the climate model simulation and projection data from model data archive."
    ],
    "syllabus": "16+2 weeks course schedule\n--------------------------\n\nFlexible weeks remarks: Additional assignment for Lab sessions on climate modeling exsercises and climate data analysis team works require extra hours for the learning process. That will take up the class hours for 2 weeks.\n-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\nI. Seminar series in the class:\n-------------------------------\n\nThere will be a series of weekly reports arranged by lecturer and students on the following chapters listed in the IPCC AR6.   \nAdditional assessment report for regionally focusing at Taiwan is complement to the IPCC AR6.  \n  \nIPCC AR6 WG1: The Physical Science Basis  \n（1）Framing, context, methods  \n（2）Changing state of the climate system  \n（3）Human influence on the climate system  \n（4）Future global climate: scenario-based projections and near-term information  \n（5）Global carbon and other biogeochemical cycles and feedbacks  \n（6）Short-lived climate forcers  \n（7）The Earth's energy budget, climate feedbacks, and climate sensitivity  \n（8）Water cycle changes  \n（9）Ocean, cryosphere, and sea level change  \n（10）Linking global to regional climate change  \n（11）Weather and climate extreme events in a changing climate  \n（12）Climate change information for regional impact and for risk assessment  \n  \nTaiwan Climate Change Projection and Information Platform (TCCIP)   \nTaiwan Climate Change Scientific Report 2017  \n  \n（1）Global Climate Change  \n（2）Ocean System and Change  \n（3）Climate Modes, Interdecadal Climate Variation, Climate Shift, Warming Hiatus  \n（4）East Asian and Western North Pacific Climate Change  \n（5）Analysis of Observed Taiwan Climate  \n（6）Future Taiwan Climate Change Projection\n\nII. Class Schedule:\n-------------------\n\nWeek 1: Course Introduction and Brief Review on the IPCC AR6  \nWeek 2: Overview on Climate Change Sciences and introduction on climate modeling  \nWeek 3: Lab session on IPCC model data archive and data analysis tools  \nWeek 4: Lab session on IPCC model data archive and data analysis tools  \nWeek 5: Lecturer report on IPCC AR6 Chapter1: Framing, context, methods  \nWeek 6: Student report on IPCC AR6 Chapters  \nWeek 7: Student report on IPCC AR6 Chapters  \nWeek 8: Student report on IPCC AR6 Chapters  \nWeek 9: Student report on IPCC AR6 Chapters  \nWeek 10: Student report on IPCC AR6 Chapters  \nWeek 11: Student report on IPCC AR6 Chapters  \nWeek 12: Discussion on Climate Change Debate? What do the Skeptics say about Climate Change?  \nWeek 13: Discussion on Taiwan Past Climate Change and Future Climate Projection; Impacts and Mitigation of Climate Change  \nWeek 14: IPCC AR5 WG2 and WG3 Climate Change 2014: Impacts, Adaptation, Vulnerability, and Mitigation of Climate Change  \nWeek 15: IPCC model data analysis report (I)  \nWeek 16: IPCC model data analysis report (I)\n\nIII. Extra notes:\n-----------------\n\n*   Please use “moodle” course system from university for class information.\n*   Students are required to select one of the seminar topics focusing on different chapters of AR6 report for their class presentation and discussion. (prepare 50 minutes talk and 25 minutes discussion after the talk)\n*   Students are encouraged to team up and work on a data analysis project based on the IPCC model data archive and/or downscaled future Taiwan climate change projection data and make report at the end of semester (prepare 20 minutes talk and 5-10 minutes discussion after the talk)\n*   Both Presentation files will be posted to course webpage and considered heavily for the final marks of your class performance.\n*   The questions and discussions by students are encouraged and evaluated as part of class performance.\n*   Please do not limit your talk to only from the content of IPCC AR6 Chpaters.  Please also check the reference therein.\n*   More references will be posted in the course webpage or by hand-outs.\n*   I will collect a number of documentary film or videos on the climate change related topics for review.\n*   The special discussion class require students to study the issues related to the topics and give 5-minutes brief thought on your finding.",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "Seminar series focusing on IPCC AR6 WG1 report chapters"
        },
        {
            "type": "Group discussion",
            "note": "Discussions following the seminar presentations"
        },
        {
            "type": "Cooperative learning",
            "note": "Team up for climate data analysis project"
        },
        {
            "type": "Lab/Studio",
            "note": "Climate modeling lab exercises"
        },
        {
            "type": "Media, audio, visual materials",
            "note": "Reviews on media report, video related to climate changes"
        },
        {
            "type": "Case studies",
            "note": "climate simulation and projection data analysis"
        }
    ],
    "grading": [
        {
            "type": "Assignments",
            "weight": 20,
            "note": "Climate modeling lab exercises"
        },
        {
            "type": "Class discussion involvement",
            "weight": 20,
            "note": "Class discussions dr=uringh the seminar series"
        },
        {
            "type": "Presentation",
            "weight": 60,
            "note": "Mid-term report（30%）; Final report（30%）"
        }
    ],
    "prerequisite": "◎Unavailable for M.A. program students (M.A. program courses excepted) and B.A. program students.",
    "general_core": []
}