{
    "year": 109,
    "term": 2,
    "name": "技職教育教學法研究",
    "teachers": [
        "詹育"
    ],
    "department": "HM70",
    "code": "IEM0406",
    "credit": 2,
    "serial": 1103,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 3,
            "to": 4,
            "campus": "本部",
            "classroom": "研討二"
        }
    ],
    "programs": [],
    "comment": "教師：詹勳育",
    "restrict": "◎課程開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 2,
    "description": "1.使學生瞭解行為主義心理學派相關學習理論。2.使學生瞭解認知心理學派相關學習理論。3.使學生瞭解技術領域相關學習心裡理論。4.探討各種教學法之使用與相關學習理論基礎。",
    "goals": [
        "使學生瞭解行為主義心理學派相關學習理論。",
        "使學生瞭解認知心理學派相關學習理論。",
        "使學生瞭解技術領域相關學習心裡理論。",
        "探討各種教學法之使用與相關學習理論基礎"
    ],
    "syllabus": "**This course is delivered in English**. That said, students with limited English proficiency are encouraged to take this class and **will be fully supported**. \n\nThis course introduces students to effective teaching methods commonly used in secondary and postsecondary career and technical education (CTE). We will survey the psychological and developmental foundation of learning, theory-inspired teaching methods, and their application to teaching. \n\nExpectation:  \nStudents are expected to complete the assigned readings before class. During class, students should be fully engaged in scholarly discussion and respect differences. Students should turn in the assignments on time, and check with the instructor when questions arise.\n\nAssignments:\n\n1.  Questions and critiques: Starting from Week 2 (Foundation: Behaviorism; see below for more information), students should submit at least a question or critique about the assigned readings each week. The questions and/or critiques should be submitted two days before the class. Students are not required to submit the questions and/or critiques if they will deliver the Topic Presentation (see below) in the next week.\n2.  Topic presentation: Each student will choose a topic from the list and give a 30-minute presentation in class and in English. In the presentation, the student will summarize the assigned readings and discuss the application to teaching in CTE. In addition, the presenting student should incorporate the questions/critiques proposed by peers (see Assignment #1) as an integral part of the presentation. The format of presentation is open, and students are encouraged to engage the class with activities and multimedia material. All presentations should be delivered in English.\n3.  Term paper: Compare and contrast three teaching methods introduced in this class. Students should attend to the theoretical foundation and appropriate age group of each method, and discuss the application of each method in CTE. The paper should be no more than 10-page (when written in English) or 20-page (when written in Chinese) long (A4-size paper, double-spaced, 1” or 2.54 cm margin, font 12). \n\nSchedule (tentative, subject to change):  \n1.    Course introduction  \n2.    Foundation: Behaviorism  \n3.    Foundation: Metacognition  \n4.    Foundation: Constructivism  \n5.    Foundation: Social cognitive theory  \n6.    Foundation: Sociocultural and collaborative learning  \n7.    (Spring recess; no class)  \n8.    Human development: Multiple Intelligence   \n9.    Theory: Learning style   \n10.    Theory: Motivation   \n11.    Teaching methods: Self-regulated learning   \n12.    Teaching methods: Multimedia, technology, and e-learning   \n13.    Teaching methods: Problem-based learning and project-based learning  \n14.    Teaching methods: Active learning   \n15.    Teaching methods: Flipped classroom  \n16.    Teaching methods: Makerspace   \n17.    Teaching methods: Assessment   \n18.    Final thoughts",
    "methodologies": [
        {
            "type": "講述法",
            "note": "Class lectures"
        },
        {
            "type": "討論法",
            "note": "Class discussion"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 50,
            "note": "Assignment #3"
        },
        {
            "type": "期末考",
            "weight": 30,
            "note": "Assignment #1"
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "Assignment #2"
        }
    ],
    "prerequisite": "",
    "general_core": []
}