{
    "year": 110,
    "term": 2,
    "name": "科技與工程課程發展及評鑑研究",
    "teachers": [
        "游光昭"
    ],
    "department": "HM71",
    "code": "ITM0095",
    "credit": 3,
    "serial": 1087,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 5
    },
    "schedule": [
        {
            "day": 2,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "科技系TB211"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "Using intensive readings and seminar discussions, we will explore the mutual shaping understanding of curriculum development and evaluation in technology education programs. A brief introduction of technology and engineering education curriculum development in Taiwan and USA will be offered to provide students’ understanding the difference in context of culture and educational system.",
    "goals": [
        "Understanding the history and development of the profession",
        "Developing aims, objectives for contemporary technology and engineering education",
        "Selecting and organizing content for technology and engineering education",
        "Preparing curriculum guides, courses of study and instructional materials"
    ],
    "syllabus": "**Date**\n\nTentative Schedule\n\n3/3\n\n**Course Overview & Introduction**\n\n3/10\n\n**Topic: Process of Curriculum Development**\n\n**Reading:** The Process of Designing the Curriculum\n\n3/17\n\n**Topic: Development of Technology Education Curriculum**\n\n**Reading:** 工藝教育思想的流變\n\n3/24\n\n**Topic: Technology Curriculum in Taiwan (I)**\n\n**Reading:** 科技領域課程綱要草案\n\n3/31\n\n**Topic: Technology Curriculum in Taiwan (II)**\n\n**Reading:** 生活科技課程理念\n\n4/7\n\n**Topic: Trend of Technology Education Curriculum (I)**\n\n**Reading**: Infusing engineering design into high school STEM courses (p. 8-13)\n\n4/14\n\n**Topic: Trend of Technology Education Curriculum (II)**\n\n**Reading**: Five good reasons for engineering design as the focus for technology education\n\n4/21\n\n**Topic: Technology Curriculum in Other Countries (I)**\n\n**Group Report**\n\n4/28\n\n**Topic: Technology Curriculum in Other Countries (II)**\n\n**Group Report**\n\n5/5\n\n**Topic: Technology Curriculum in Other Countries (III)**\n\nGroup Report\n\n5/12\n\nTopic: What is STEM and Why STEM\n\n5/19\n\n**Topic: What is STEM and Why STEM**\n\n**Reading**: Technology Education and Designerly Ways of Knowing: The Pedagogical Goal of Design is Understanding\n\n5/26\n\n**Topic: Developing a Technology Curriculum**\n\n**Reading**: Developing a Technology Curriculum\n\n6/2\n\n**Manuscript Report and Discussion**\n\n6/9\n\n**Manuscript Report and Discussion**\n\n6/16\n\n**Manuscript Report and Discussion**\n\n6/23\n\n**Manuscript Report and Discussion**",
    "methodologies": [
        {
            "type": "講述法",
            "note": "講述教育理論對科技及工程教育課程發展歷史與現況"
        },
        {
            "type": "討論法",
            "note": "討論科技及工程教育課程發展的議題與問題"
        },
        {
            "type": "專題研究",
            "note": "科技及工程教育課程發展的議題與問題的研究"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": "A journal article manuscript will be prepared and submitted to a journal. The article should be related to an approved interest in technology and engineering education curriculum. The manuscript should be between 5000 to 7000 words. Each student will report a summary of his/her paper with an appropriate visual aid in the class scheduled."
        },
        {
            "type": "期末考",
            "weight": 15,
            "note": "Final Exam"
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "In order for the proper atmosphere in the class to be developed and maintained, everyone must be prepared to participate in the discussion topics listed below. Each person must synthesize the reading required and write a page summary for class discussion."
        },
        {
            "type": "專題",
            "weight": 25,
            "note": "A learning activity report is required by every students at the end the semester. The learning activity will be given at middle of the semester. Each student will write a report based on the guidelines provided by the instructor."
        }
    ],
    "prerequisite": "",
    "general_core": []
}