{
    "year": 107,
    "term": 1,
    "name": "成人數位學習發展與研究",
    "teachers": [
        "王雅鈴"
    ],
    "department": "EM02",
    "code": "SOC0133",
    "credit": 3,
    "serial": 440,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "教710"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "This seminar is designed to provide a foundational overview of theories and research on e-learning. Topics to be covered include the differences between traditional learning and e-learning, game-based learning, mobile learning, as well as several seminars regarding eye-tracking technique and robotics. To maximize the benefit that students get from the seminar, students will be required to complete a review regarding weekly topics before class. Aside from weekly readings, students will engage in guided in-class activities and discussions. Also, to cultivate students’ ability to raise an issue, address a research question, and develop a research proposal, at the end of the semester, a mini-conference activity will be built into the course.",
    "goals": [
        "能了解數位學習基本概念",
        "能應用數位學習基本軟體工具",
        "能了解數位學習軟硬體環境建置狀況",
        "能了解數位學習之研究發展"
    ],
    "syllabus": "**1\\. Introduction to E-learning Developtment and Research**\n\n**2\\. 專題講座(1): 如何有效率地閱讀期刊論文?  Seminar (I): How to read a journal paper effectively?**\n\nThe topics this week involve the discussion on the style, content, and format of a journal article, developing a method to choose the right papers as well as attaining a skill to read a scientific paper effectively and efficiently. \n\n**3\\. Special Issues (1): Culture differences**\n\nCulture and online learning: Chapters 1, 2, and 15\n\n**4\\. Special issues (II): Gender and individual differences**\n\nCulture and online learning: Chapters 8 & 12\n\n**5\\. 行動學習(Mobile learning)**\n\nMobile learning: Chapters 1 and 4\n\nWu, W.-H., Wu, J. Y.-C., Chen, C.-Y., Kao, H.-Y., Lin, C.-H., & Huang, S.-H. (2012). Review of trends from mobile learning studies: A meta-analysis. Computers & Education, 59, 817-827.\n\n**6\\. 科技教學內容知識(Technological Pedagogical Content Knowledge, TPACK)**\n\nMishra, P. & Koehler, M. J. (2006). Technological pedagogical content knowledge: A framework for integrating technology in teacher knowledge. Teachers College Record, 108, 1017-1054.\n\nChai, C.-S., Koh, J. H.-L., & Tsai, C.-C. (2013). A review of technological pedagogical content knowledge. Educational Technology & Society, 16, 31-51.\n\n**7\\. 遊戲式學習(Game-based learning)**\n\nJabbar, A. I. A., & Felicia, P. (2015). Gameplay engagement and learning in\n\ngame-based learning: A systematic review. Review of Educational Research, 85, 740-779.\n\nPlass, J. L., Homer, B. D., & Kinzer, C. K. (2015). Foundations of game-based learning. Educational Psychologist, 50, 258-283.\n\n**8\\. 擴增實境(Augmented reality, AR)** \n\nWu, H.-K., Lee, S. W.-Y., Chang, H.-Y., & Liang, J.-C. (2013). Current status, opportunities and challenges of augmented reality in education. Computers &\n\nEducation, 62, 41-49.\n\n**9\\. 專題講座(II): 眼動技術基本概念介紹 (Eye-tracking technique)**\n\nLai, M.-L., Tsai, M.-J., Yang, F.-Y., Hsu, C.-Y., Liu, T.-C., Lee, W.-Y., Lee, M.-H., Chiou, G.-L., Liang, J.-C., & Tsai, C.-C. (2013). A review of using eye-tracking technology in exploring learning from 2000 to 2012. Educational Research Review, 10, 90-115.\n\nTsai, M.-J., Huang, L. J., Hou, H. T., Hsu, C.-Y., & Chiou, G. L. (2016). Visual behavior, flow and achievement in game-based learning. Computers & Education, 98, 115-129.\n\n**10\\.  使用者經驗 (User experience)**\n\nMobil learning: Chapter 9 Design and User experience\n\n**11\\. 行為分析(Behavioral analysis)**\n\nRourke, L., & Anderson, T. (2004). Validity in quantitative content analysis. Educational Technology Research and Development, 52, 5-18.\n\nHsu, C.-Y., Tsai, M.-J., Hou, H.-T., & Tsai, C.-C. (2013). Epistemic beliefs, online search strategies, and behavioral patterns while exploring socioscientific Issues. Journal of Science Education and Technology, 23, 471-480.\n\n**12\\. 刺激回憶法(Stimulated recall)與放聲思考(Think aloud)**\n\nLyle, J. (2003). Stimulated recall: A report on its use in naturalistic research. British Educational Research Journal, 29, 861-878.\n\nCotton, D., & Gresty, K. (2006). Reflecting on the think-aloud method for evaluating e-learning. British Journal of Educational Technology, 37, 45-54.\n\n**13\\. 機器人(Robotics)**\n\nBers, M. I., Flannery, L., Kazakoff, E. R., & Sullivan, A. (2014). Computational thinking and tinkering: Exploration of an early childhood robotics curriculum. Computers & Education, 72, 145-157.\n\n**14\\. 專題講座(III): 機器人實驗基地參觀**\n\n**15\\.  One-on-one discussion**\n\nEach student is required to submit the abstract onto the course discussion forum by this week and discuss with the lecturer in this week. \n\n**16\\. 大數據(Big data)與學習分析(Learning analytics)**\n\nMobile learning: Chapter 10 Data, evaluation, and learning analytics\n\nSiemens, G. (2013). Learning analytics: The emergence of a discipline. American Behavioral Scientist, 57, 1380-1400.\n\nPapamitsiou, Z., & Economides, A. (2014). Learning analytics and educational data mining in practice: A systematic literature review of empirical evidence. Educational Technology & Society, 17, 49-64.\n\n**17\\. Mini Conference (I): Oral & Poster Presentation**\n\n**18\\. Mini Conference (II): Oral & Poster Presentation**",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "實地考察、參訪",
            "note": ""
        },
        {
            "type": "專題研究",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": "Attendance is required. Repeated failure to attend lectures or discussion may result in a lowered semester grade. Participation in class discussions also counts. Students will earn points each week for their contributions to class discussions."
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "Collaborative/ Group-based Project:  \n\n\n\n\nThis assignment will be marked as collaborative or group-based. Students must work with the other members in the group including hosting discussion or presenting in class. Each group is required to select a topic related to e-learning and review latest research papers for class discussion."
        },
        {
            "type": "成果展覽",
            "weight": 40,
            "note": "Mini Conference_Oral or Poster Presentation: \n\n\n\n\n\nEach student is required to propose his research ideas or questions and discuss with the lecturer during the midterm week. Research topics may focus on relevant theories or methods in the fields of e-learning. Please submit the abstract onto the course discussion forum in the 14th week and be prepared to share them at the end of the semester. \n\nTry to limit the abstract to a short paragraph (about 300 words) and prepare for a 10-15 min presentation. Each abstract and presentation will be graded based on clarity, coherence, relevance, and originality."
        }
    ],
    "prerequisite": "",
    "general_core": []
}