{
    "year": 110,
    "term": 1,
    "name": "指揮個別指導（三）",
    "teachers": [
        "許心"
    ],
    "department": "MM90",
    "code": "MUM0113",
    "type": "必",
    "grade": null,
    "credit": 1,
    "serial": 2068,
    "group": "B",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 0,
            "from": -1,
            "to": -1,
            "campus": "",
            "classroom": ""
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限本系(含雙主修)修習 ◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 1,
    "description": "In class, students gain a broader appreciation, and deeper understanding of the symphonic standard literature by music making. Practicing the method of rehearsing, conducting and teaching an ensemble, working though careful listening, executing details, examining details, team work and performing through standard master symphonic repertoire. The administrative aspects of orchestra management, in rehearsals, performance, daily management, librarian duties, run-out concert preparations, program note writing, personnel management, equipment coordination, rehearsal space maintenance, etc. are all part of the practicum covered area. Students gain a thorough knowledge in the on and off stage workings of running an ensemble. The score preparation is thoroughly examined through analysis in harmony, structure, compositional technique, historical background and all pertinent area related to the creation of the composition. The art of conducting technique is carefully studied and acquired to best interpret and express the repertoire studied.",
    "goals": [
        "增進指揮技法與知能"
    ],
    "syllabus": "【授課方式：18週】\n\nDvorak Symphony No. 5\n\nHaydn Symphony No. 44\n\nCopland Symphony No. 3\n\nElgar Enigma Variations\n\nTower Fanfare for the Uncommom Women Overture\n\n依個別需求選擇適合曲目學習",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        },
        {
            "type": "合作學習",
            "note": ""
        },
        {
            "type": "實驗/實作",
            "note": ""
        },
        {
            "type": "實地考察、參訪",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "期末考",
            "weight": 30,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 30,
            "note": ""
        },
        {
            "type": "成果展覽",
            "weight": 20,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}