{
    "year": 109,
    "term": 2,
    "name": "課程社會學研究",
    "teachers": [
        "卯靜儒"
    ],
    "department": "EM00",
    "code": "EDC0213",
    "credit": 3,
    "serial": 426,
    "group": "",
    "quota": {
        "limit": 30,
        "additional": 10
    },
    "schedule": [
        {
            "day": 4,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "教801"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "台灣的課程社會學研究約起始於陳伯璋和歐用生兩位課程學者在一九八0年代時期引借英美在一九六0末至一九七0年初發展的「新教育社會學」，和美國一九七0年初發展的「課程研究第三勢力」（見陳伯璋 1983）。兩位學者為台灣的課程研究開啟一頁新紀元。陳伯璋（1985）重要的論文著作『潛在課程研究』，以及歐用生（1985）發表在學術期刊具代表性的『國小社會科教科書的意識型態分析』，不僅表示課程研究新紀元的開始，也為台灣教育社會學研究注入英美新教育社會學的精神；更重要的，他們的研究也正與台灣當時的社會脈動同步呼吸。\n知識社會學研究的議題包括:「什麼是知識」、「誰來決定」、「知識是如何生產的」、「生產之外，知識的分配與消費又牽涉到哪些過程」。而課程社會學研究的議題則包括: 什麼是學校知識?學校知識與我們日常生活知識的關聯為何? 課程的內容選擇,組織與分類,教學傳遞,與評量的原則為何?其與政治,經濟,文化結構之間的關係為何? 文化轉化與政治實踐的教學可能性何在?\nJames Ladwig曾認為新教育（課程）社會學在英美經過了二十幾年的時光，除了累積豐富的「否定和批評」(negation and critique)學術資產之外，其學術發展即使不能稱為「死亡」(demise)，至少就目前而言也看不出任何可以找到解決的徵兆（Ladwig 1996: 3-4）。在英美這十年來，新教育社會學所受到來自後結構主義的批評，也促使其作自身的轉化（見Apple 1996; Bernstein 1996; Giroux 1991）。而台灣在經過了這將近二十年的政經社會與教育改革，以及網路時代的快速知識交通，和大量學術論文的生產，課程社會學此一研究領域在台灣是一個怎樣的發展面貌？\n基於上述的學術關懷脈絡，課程的基本架構，是以文化史(cultural history)的觀點，探究英美課程社會學研究，其構成的知識為何？怎樣的政治經濟社會文化脈絡構成這個領域的生成與轉變？希望藉由知識脈絡化的探索，瞭解課程社會學研究的學術知識之生成，從英美的學術傳統裡，看見台灣課程社會學研究的可能與侷限。希冀這樣的課程能幫助研究生，不只理解課程社會學研究的知識內涵，更能「看見」知識與社會權力關係交錯而生成的學術論述場域（discursive field）。",
    "goals": [
        "瞭解課程社會學研究之內涵及趨勢",
        "培養問題導向思維及研究能力",
        "探析學術論述場域之知識/權力關係"
    ],
    "syllabus": "**教學內容與進度**\n\n一、自我/課程介紹與課務分配\n\n二、學校課程的社會學研究取向\n\nWhitty, G. (1985) Sociology and School Knowledge: Curriculum Theory, Research and Politics. Ch1 “Sociological approaches to the school curriculum.”\n\nGiroux, H. (1981) Curriculum and Instruction: Alternatives in Education Ch7“ Towards a Sociology of Curriculum”\n\n參考：姜添輝(2001)。課程社會學的範疇與要素。載於90年10月至21日國立中正大學教育研究所所承辦之「課程與教學論壇」，頁Ⅰ-Ⅸ。\n\n三、 Bernstein：教育知識的分類與架構\n\nBernstein, B. (1971) Knowledge and Control. “On the Classification and Framing of Educational Knowledge”\n\n四、Young：課程作為一種社會性組織的知識\n\nYoung, M. (1971) Knowledge and Control.“ An Approach to the Study of Curricula as Socially Organized Knowledge”\n\n五、 Bernstein：社會階級與教學實踐\n\nBernstein, B. (2004). Social Class and Pedagogic Practice. In S. Ball (ed.) The RoutledgeFalmer Reader in Sociology of Education (pp.196-217). New York and London: RoutledgeFalmer.（中譯：Basil Bernstein 原著， 王瑞賢譯（2006）教育論述之結構化（階級、符碼與控制第四卷）。第二章「社會階級與教學實踐」。台北：巨流。\n\n六、Bernstein：教育論述的社會建構\n\n中譯：Basil Bernstein 原著， 王瑞賢譯（2006）教育論述之結構化（階級、符碼與控制第四卷）。第五章「教育論述之社會建構」。台北：巨流。\n\n七、 當代課程議題之社會性本質討論: Bernstein 觀點的應用(邀請四位參與共備紀錄與教學觀察同學分享經驗與開放性座談)\n\n八、 Bourdieu:文化再製與學校教育\n\nMoore, A. (2006). Curriculum as Culture: Entitlement, Bias and the Bourdieusean arbitrary. In A. Moore (ed.) Schooling, Society and Curriculum (pp.87-99). London and New York: Routledge.\n\nReay, D. (1998) Cultural Reproduction: Mothers’ Involvement in their Children’s Primary Schooling. In M. Grenfell & D. James (Eds.) Bourdieu and Education: Acts of Practical Theory (pp.). New York and London: Falmer Press.\n\n參考(一)：邱天助（1998）布爾迪厄文化再製理論（pp.109-220）。台北：桂冠。\n\n蘇峰山，2002，布爾迪厄: 《教育社會與文化中的再製》導讀，蘇峰山編， 意識、權力與教育， pp. 205-218。嘉義：南華大學教育社會學研究所。\n\n參考(二): Apple:課程與文化霸權\n\nApple, M.W. (1990). “Ideology and Cultural and Economic Reproduction” In Ideology and Curriculum. Ch1, Ch2 (中譯: 艾波原著、王麗雲譯 (2002). 意識形態與課程.台北:桂冠。)\n\n張恆豪&蘇峰山 (2009). \"戰後台灣國小教科書中的障礙者意象分析.\" 臺灣社會學刊 42: 143-188.\n\nApple, M. W. and Weis, L. (1983) “Ideology and Practice in Schooling: A Political and Conceptual Introduction”\n\n歐用生（1985）「國小社會科教科書意識型態分析，新竹師範學院學刊，12期:91-125。\n\n卯靜儒（2002）個人的/政治的: 艾波的權力、知識與教育，蘇峰山（編），意識、權力與教育，pp. 77-115。嘉義：南華大學教育社會學研究所\n\n九、課程社會學觀點的學科研究與知識疆界問題\n\nGoodson, I. (1981) Becoming an Academic Subject. British Journal of Sociology of Education, 2(2):163-180.\n\nPaechter, C. (2000). Negotiating a new school subject: the case of design and technology. In C. Paechter Changing School Subjects: Power, Gender and Curriculum (pp.63-90). Open University Press.\n\nSiskin, L. S. (1995). Subject Divisions.\n\n十、課程社會學研究的新觀點: 後結構主義觀點（一）\n\nCherryholmes, C. (1988) Power and Criticism: Post-structural Investigations in Education. Ch3 “Thinking about Education Post-structurally”\n\nPopkewitz, T. S. (1987). The Formation of School Subjects and the Political Context of Schooling. In T. S. Popkewitz (ed.) The Formation of the School Subjects(pp.1-24). New York : Falmer Press.\n\n十一、課程社會學研究的新觀點: 後結構主義觀點（二）\n\nPopkewitz, T. S. (2000)”Curriculum as a Problem of Knowledge, Governing, and the Social Administration of the Soul,” in B. M. Franklin (Ed.) Curriculum & Consequence: Herbert M. Kliebard and the Promise of Schooling.(pp.75-99). New York and London: Teachers College Press.\n\nPopkewitz, T. S. (2009). Curriculum study, curriculum history, and curriculum theory: the reason of reason. Journal of Curriculum Studies, 41(3), 301-319.\n\n參考:卯靜儒（2004）從新馬克斯到後結構主義─課程社會學研究的再概念化，教育研究集刊，50（1）: 119-142。\n\n卯靜儒(2014)改革即改變嗎?教育改革理解路徑之探索.教育學刊,42,PP.1-37\n\n十二、課程社會學研究的新觀點: 後結構主義觀點（三）\n\nANT理論與課程研究\n\n十三、個別討論期末報告作業\n\n十四、課程社會學研究新議題：數位科技時代的教學與學習\n\nSingh, P., Mallan, K., & Giardina, N. (2008). Just Google it: Students constructing knowledge through internet travel. Paper presented at the AARE conference.\n\nTONY LAWSON & CHRIS COMBER(2000). Introducing Information and Communication Technologies into Schools: the blurring of boundaries.British Journal of Sociology of Education, 21(3):419-433.\n\nDaniel A. Menchik (2004). Placing cybereducation in the UK classroom. British Journal of Sociology of Education, 25(2):193-213.\n\n參考: Somekh, B. (2007). Pedagogy and Learning with ICT: researching the art of innovation. London and New York: Routledge. Ch2 “inside innovation: learning from research into pedagogy and learning with ICT”\n\nLoveless, A. (et.al.) (2001). ICT, Pedagogy and the Curriculum: subject to change. New York and London: RoutledgeFalmer. Ch4,”Something old, something new..:is pedagogy affected by ICT?”\n\n十五、課程社會學研究的新觀點:全球化與知識社會學\n\nWhitty, G. (2010). Revisiting School Knowledge: some sociological perspectives on new school curricula. European Journal of Education, 45(1):28-45.\n\nYates, L. & Grumet, M. (2011).Curriculum in Today’s World: Configuring knowledge, identities, work and politics.\n\n卯靜儒（2008.6）全球化效應下的課程改革─ 知識社會學的幾點觀察。教育研究月刊, 170: 5-14.\n\n參考：Yates, L. & Young, M. (2010). Editorial: Globalization, Knowledge and the Curriculum. European Journal of Education, 45(1):4-10.\n\nYoung, M. & Muller, J. (2010) Three Educational Scenarios for the future: lessons from the sociology of knowledge. European Journal of Education, 45(1):11-27.\n\n十六、課程回顧與議題深探\n\n課程社會學研究的過去,現在與未來 (老師講授/同學討論)：\n\n(1)新教育社會學 & 課程研究第三勢力\n\n(2)課程社會學 VS 學校知識社會學\n\n(3)新馬克思主義 & 批判教育學\n\n(4)後學的衝擊\n\n(5)知識 VS 主體\n\n(6)課程社會學研究: 取徑與方法上的舊幹與新枝\n\n(7)課程社會學研究：新議題與舊關懷\n\n閱讀：\n\n卯靜儒(2014). 把知識帶回來：從社會建構主義到社會實在主義的教育社會學.當代教育研究季刊, 22(1), 211-221.\n\n參考：\n\nYoung, M. (2008). Bring Knowledge Back in : from social constructivism to social realism in the sociology of education. In Ch1 “rescuing the sociology of educational knowledge from the extremes of voice discourse.”\n\nMoore, R. & Young, M. (2001). Knowledge and the Curriculum in the Sociology of Education: towards a reconceptualization. British Journal of Sociology of Education, 22(4): 445-461.",
    "methodologies": [
        {
            "type": "講述法",
            "note": "老師講授與帶領討論"
        },
        {
            "type": "討論法",
            "note": "1. 每週由負責小組同學帶領討論 (交一份重點摘要（含作者簡介，但不要中文翻譯）及討論的問題) 2.每位同學準備上課與大家分享的閱讀心得與問題，思考的方向與準備方式如下: (1)\tPoints of clarification: List any questions you might have about your understanding of the reading itself. (i.e. terms used that you found confusing, arguments that you weren’t clear on ) (2)\tIssues for discussion: select the issues you would most like to discuss as a class.  Which ideas did you find particularly compelling? Are there points you’d like to disagree with or argue more fully? What are problematic or exciting? (3)\tPersonal response: be thinking of any personal experiences you may have had as a teacher/student that were brought to mind during your reading. How does the reading relate to your direct, lived knowledge of curriculum and schooling?"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "課堂參與討論＋出席情形 30％"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "課堂參與討論＋出席情形 30％"
        },
        {
            "type": "報告",
            "weight": 30,
            "note": "口頭報告＋帶領討論（作者背景介紹、文章寫作背景、內容摘要與問題討論等）30％"
        },
        {
            "type": "專題",
            "weight": 40,
            "note": "期末報告 +（8000字左右）40％"
        }
    ],
    "prerequisite": "",
    "general_core": []
}