{
    "year": 108,
    "term": 1,
    "name": "家政教育概論",
    "teachers": [
        "曾慶玲"
    ],
    "department": "EU06",
    "code": "HGU0001",
    "credit": 2,
    "serial": 801,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 3,
            "from": 10,
            "to": 11,
            "campus": "本部",
            "classroom": "誠104"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "1",
    "classes": "",
    "dept_group": "E",
    "hours": 2,
    "description": "本課程之學習目標為1.瞭解家政教育在變動社會中的內涵與功能 2.熟知國內外家政教育的發展3.瞭解國內家政教育實施現況 4.知悉家政教育相關專業內涵之知能5.積極開展與規劃家政專業生涯。          課程內容，包括家政教育在變動社會中的內涵與功能、國內外家政教育的發展、瞭解國內家政教育實施現況，如學校教育中的家政教育（九年一貫課程、後期中等教育階段、高等教育階段中的家政教育），同時也探討社會中家政教育的實施（如社教體系家庭教育、農漁會體系中家政推廣教育）；另外，也分析家政教育專業內涵的相關知能（如服裝、營養餐飲、家庭、綠色生活），並針對家政專業生涯作深入的研析…等等，以涵養同學家政教育專業的專業能力，加強其未來擔任相關工作之知能，另外，為增進同學對家政教育實施現況之進一步瞭解，除邀請相關專業人士從不同角度進行家政生涯專題座談外，以期提供同學對家政教育有更寬廣的視野。         課程之進行，以課堂講述、小組討論評析、專題座談、訪問、專題成果發表等方式為主，教學策略將融入創造思考教學，並輔以師大數位學習平台實施機制，提供師生密切之溝通互動管道與同學間的討論平台。 本課程尤其著重同學網路學習社群的建立，其中「討論區」的經營，提供小組對話與分享，建立同學互助支持系統，進而達成多元適性與創意學習。同時，為呼應世界節能減碳趨勢，除因沒有電子檔案之資料外，其餘相關資訊、資料、延伸閱讀講義皆存放於數位平台上，供同學下載閱讀，不再另行列印紙本資料。",
    "goals": [
        "瞭解家政教育在變動社會中的內涵與功能",
        "熟知國內外家政教育的發展",
        "瞭解國內家政教育實施現況",
        "知悉家政教育相關專業內涵之知能",
        "積極開展與規劃家政專業生涯"
    ],
    "syllabus": "課程內容，包括家政教育在變動社會中的內涵與功能、國內外家政教育的發展、瞭解國內家政教育實施現況，如學校教育中的家政教育（九年一貫課程、後期中等教育階段、高等教育階段中的家政教育），同時也探討社會中家政教育的實施（如社教體系、農漁會體系中的家政教育）；另外，也分析家政教育專業內涵的相關知能（如服裝、營養餐飲、家庭、綠色生活），並針對家政專業生涯作深入的研析…等等，以涵養同學家政教育專業的專業能力，加強其未來擔任相關工作之知能，另外，為增進同學對家政教育實施現況之進一步瞭解，除邀請相關專業人士從不同角度進行家政生涯專題座談外，也進行訪問活動，以期提供同學對家政教育有更寬廣的視野。  \n  \n課程之進行，以課堂講述、小組討論評析、專題座談、訪問、專題成果發表等方式為主，並輔以師大數位學習平台實施機制，提供師生密切之溝通互動管道與同學間的討論平台。  \n尤其著重同學網路學習社群的建立，其中「討論區」的經營，提供小組對話與分享，建立同學互助支持系統，進而達成多元適性與創意學習。同時，為呼應世界節能減碳趨勢，除因沒有電子檔案之資料外，其餘相關資訊、資料、延伸閱讀講義皆存放於數位平台上，供同學下載閱讀，不再另行列印紙本資料。",
    "methodologies": [
        {
            "type": "講述法",
            "note": "教師於課堂講述課程各主題之內容。"
        },
        {
            "type": "討論法",
            "note": "1.課堂針對不同議題之討論分享。 2. 規劃與主持「數位平台討論區」，負責提出問題並引導討論與回應。 3.著重同學網路學習社群的建立，其中數位平台「討論區」的經營，提供小組對話與分享，建立同學互助支持系統，進而達成多元適性與創意學習。"
        },
        {
            "type": "合作學習",
            "note": "小組合作專訪家政專業人員，另規劃「家政專業生涯」專題成果發表之計畫"
        },
        {
            "type": "實地考察、參訪",
            "note": "專訪家政專業人員"
        },
        {
            "type": "媒體融入教學",
            "note": "1.至資訊中心進行課程，以提升學生運用國內外家政教育網路資源，以及moodle數位平台之經營與使用之能力。 2.呼應節能減碳之趨勢，提供教材之電子檔於數位平台供同學參閱 3.著重同學網路學習社群的建立，其中數位平台「討論區」的經營，提供小組對話與分享，建立同學互助支持系統，進而達成多元適性與創意學習。"
        },
        {
            "type": "專題研究",
            "note": "小組選定一主題，針對該主題進行「家政專業生涯」專題成果發表"
        },
        {
            "type": "其他",
            "note": "針對家政相關專業人士進行訪談。"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 20,
            "note": "兩人一組，報告內容需包括訪問理念、訪談內容與感想。其中報告內容（15％），報告呈現創意（5％）。"
        },
        {
            "type": "期末考",
            "weight": 20,
            "note": "採紙筆測驗，考試方式由同學表決決定之。"
        },
        {
            "type": "課堂討論參與",
            "weight": 15,
            "note": "包括出席情形、上課參與討論分享、值日生工作"
        },
        {
            "type": "出席",
            "weight": 5,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 20,
            "note": "「家政專業生涯」專題成果發表：以20分鐘時間介紹小組整理之家政專業生涯發展，報告需於報告前兩天交給老師，當天需繳交包括書面報告與ppt，同時需提供報告重點綱要給同學。"
        },
        {
            "type": "其他",
            "weight": 20,
            "note": "1.\t數位平台討論區之參與(10%)：每位同學全學期需上討論區參與意見之發表、並就本學期上課相關內容所引發之各項感想與省思討論或回應。全學期至少需分享十次。 2.\t「數位平台討論區」負責規劃與主持（10％）：每組同學需選取一次擔任該週主要經營者，提出問題並引導討論與回應。"
        }
    ],
    "prerequisite": "",
    "general_core": []
}