{
    "year": 107,
    "term": 2,
    "name": "行政法",
    "teachers": [
        "劉恆妏"
    ],
    "department": "EU07",
    "code": "CEU0046",
    "credit": 3,
    "serial": 860,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 20
    },
    "schedule": [
        {
            "day": 2,
            "from": 3,
            "to": 5,
            "campus": "本部",
            "classroom": "誠401"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "",
    "form_s": "3",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "「行政法」課程為公領系三年級選修，課程安排為一學期2學分。行政法是有關國家行政之行政組織、行政程序、行政作用與行政救濟之法律體制。行政法制牽涉的範圍廣泛，影響人民生活權益深遠。由於行政領域層面廣泛，無法期望進行全面性掌握，除對行政法基本體系與架構進行介紹外，亦擇要分別具體論述行政法在分則領域之不同實踐。\n相較於一般法律系所，本系具有培訓未來國中「社會學習領域公民專長」、高中「公民與社會」或相關課程教師之特殊目標。除一般性引領同學發現行政法、一窺行政法學堂奧外，本課程主要希望配合中等教育相關科目之教學目標，協助同學充實未來教學基本知能。其次，在具備行政法學基本知識之後，亦可作為未來準備其他公職考試之基礎。\n由於行政法學領域廣泛，有關各種行政組織、作用等之實體法、程序法，乃至進階之實例演習、審判實務都應計入術業範圍內，惟時間有限，難以深究細部分則，除介紹行政法基本概念架構與原理原則外。本課程針對大學部學生設計，希望以深入淺出、生活化之方式，介紹我國行政法之基本概念、一般原則、基本問題、行政組織、行政作用、行政程序、行政制裁、行政執行及行政救濟等基本架構，並旁及各領域重要行政法之學理與實務問題，期能引發同學往後的學習興趣。\n本課程以指定教科書為教材，輔以任課老師之補充教材。本課程為入門性質，課程進行仍以授課教師講授為主，視情形輔以問題討論，另將安排一次活動。為避免一試定江山，本課程的評量方式將綜合作業、考試與報告成績併計，並酌參上課參與情形。",
    "goals": [
        "瞭解行政法體系、原理及其在各領域之實踐",
        "透過行政規範與實踐，整體性瞭解臺灣政治、社會、文化各層面之運作",
        "從人民權利角度思考國家行政正當性與妥當性，並學習透過權利救濟制衡權力濫用"
    ],
    "syllabus": "第1週 本學期課程進行方式介紹與課程簡介  \n第2週 行政之概念、行政法之發展、公法與私法之區分  \n第3週 行政法之法源  \n第4週 行政程序法緒論  \n第5週 行政法之基本概念與基本原則  \n第6週 行政組織法  \n第7週 行政作用法概論  \n第8週 行政處分\n\n第9週  其他行政程序  \n第10週 公物與公共營造物的區別  \n第11週 【電影座談會】  \n第12週 行政救濟法（一）  \n第13週 行政救濟法（二）  \n第14週 行政執行法  \n第15週 行政法各論（一）  \n第16週 行政法各論（二）\n\n第17週 行政法各論（三）\n\n第18週 【期末考試】",
    "methodologies": [
        {
            "type": "講述法",
            "note": "第1週 本學期課程進行方式介紹與課程簡介  第2週 行政之概念、行政法之發展、公法與私法之區分  第3週 行政法之法源  第4週 行政程序法緒論  第5週 行政法之基本概念與基本原則  第6週 行政組織法 第7週 行政作用法概論  第8週 行政處分 第9週  其他行政程序 第10週 公物與公共營造物的區別 第11週 【電影座談會】 第12週 行政救濟法（一）  第13週 行政救濟法（二） 第14週 行政執行法 第15週 行政法各論（一） 第16週 行政法各論（二） 第17週 行政法各論（三） 第18週 【期末考試】"
        },
        {
            "type": "專題研究",
            "note": "行政法相關電影欣賞主題討論"
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 10,
            "note": "期中作業：行政法實例練習題A4WORD檔上網繳交書面作業"
        },
        {
            "type": "期末考",
            "weight": 60,
            "note": "期末考試：依上課進度指定「主要教材」部分內容為範圍，進行筆試。"
        },
        {
            "type": "出席",
            "weight": 10,
            "note": "斟酌考量同學上課出席與參與等狀況。"
        },
        {
            "type": "報告",
            "weight": 20,
            "note": "座談會心得報告：A4 規格word檔上網繳交心得報告800字書面報告"
        }
    ],
    "prerequisite": "",
    "general_core": []
}