{
    "year": 109,
    "term": 2,
    "name": "中文閱讀之心理認知研究",
    "teachers": [
        "官英華"
    ],
    "department": "IM84",
    "code": "CLC8035",
    "credit": 3,
    "serial": 1387,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 2,
            "from": 6,
            "to": 8,
            "campus": "本部",
            "classroom": "綜901"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "8",
    "dept_group": "",
    "hours": 3,
    "description": "本課程以心理語言學和認知神經科學為取向的研究為出發點，讓學生能了解中文閱讀相關的理論、研究議題和研究方法。\n本學期預計要研讀的主題包括：\n1. 閱讀的基礎理論\n2. 漢字辨識的歷程：漢字形、音、義處理的心理歷程\n3. 中文句子、篇章理解的相關研究\n4. 母語閱讀和外語閱讀的不同以及母語對中文閱讀的影響\n5. 理論在中文閱讀教學上的應用\n課程參與者需要搜尋和閱讀相關的中、英期刊論文或專書文獻，並且積極參與課堂的討論，完成口頭和書面報告的要求。",
    "goals": [
        "與學生討論特定主題下的中文為母與及外語閱讀的研究發現及其與華語教學的關聯性",
        "從閱讀的論文中讓學生瞭解母語背景對外語閱讀心理歷程的影響",
        "訓練學生閱讀和批判中/英文專書或重要國際期刊論文的能力，並瞭解各研究所使用的研究方法以及優缺點為何。從整理閱讀文獻的研究趨勢與訓練學生的研究能力",
        "帶領學生討論與思考如何將理論應用在中文閱讀的教學中"
    ],
    "syllabus": "2/23\n\n主題: 閱讀相關基礎理論介紹 I以及閱讀研究議題的概述\n\n眼球移動測量及在中文閱讀研究之應用  (蔡介立, 顏妙璇, & 汪勁安, 2005)\n\n漢語閱讀眼動控制：20年研究的總結 (白學軍, 李馨, & 閻國利, 2015)\n\n3/02\n\n主題:閱讀相關基礎理論介紹 II\n\nSpecialization and Universals in the Development of Reading Skill: How Chinese Research Informs a Universal Science of Reading (Perfetti, Cao, & Booth, 2013)\n\nA componential model of reading in Chinese (Yeung, Ho, Chan, & Chung, 2016)\n\n3/09\n\n主題:中文閱讀的基本單位（部首、字、詞）(L1 Chinese)\n\n從校稿失誤探討中文閱讀的單位  (高千惠, 胡志偉, 曾昱翔, & 羅明, 2009)\n\nThe temporal signatures of semantic and phonological activations for Chinese sublexical processing: An event-related potential study (C. Y. Lee, Tsai, Huang, Hung, & Tzeng, 2006)\n\n3/16\n\n主題:中文閱讀的基本單位（部首、字、詞）(L2 Chinese)\n\nEmerging development of semantic and phonological routes to character decoding in Chinese as a foreign language learners (Williams, 2012)\n\nElectrophysiological evidence of sublexical phonological access in character processing by L2 Chinese learners of L1 alphabetic scripts (Yum et al., 2016)\n\n3/23\n\n主題:中文斷詞與否的呈現方式對閱讀的影響\n\nReading Spaced and Unspaced Chinese Text: Evidence From Eye Movements (L1 Chinese) (X. Bai, Yan, Liversedge, Zang, & Rayner, 2008)\n\nInterword spacing effects on the acquisition of new vocabulary for readers of Chinese as a second language (Xuejun Bai et al., 2013) (L2 Chinese)\n\n3/30\n\n主題:中文字詞辨識研究：中文字的形、音、義在中文母語者閱讀中文時內在的處理歷程\n\nPHONOLOGICAL ACTIVATION IN CHINESE READING: AN EVENT-RELATED POTENTIAL STUDY USING LOW-RESOLUTION ELECTROMAGNETIC TOMOGRAPHY (Ren, Liu, & Han, 2009)\n\nTracking the temporal dynamics of the processing of phonetic and semantic radicals in Chinese character recognition by MEG (Hung, Hung, Tzeng, & Wu, 2014)\n\n4/06\n\nHoliday (no class)\n\n4/13\n\n主題:中文字音表徵對閱讀的影響 (L1 Chinese)\n\nCross-linguistic Analysis of Developmental Dyslexia─Does Phonology Matter in Learning to Read Chinese? (J. R. Lee, Hung, & Tzeng, 2006)\n\nReliance on orthography and phonology in reading of Chinese: A developmental study (W. Zhou, Shu, Miller, & Yan, 2018)\n\nLimited role of phonology in reading Chinese two-character compounds: Evidence from an EPR study (A. W. Wong, Wu, & Chen, 2014)\n\n4/20\n\n期中分組報告：檢視文獻收集和趨勢分析結果\n\n4/27\n\n主題: 中文字詞辨識研究:  中文字的形、音、義在不同背景外國學生閱讀中文時內在處理歷程的差異\n\nReading proficiency modulates parafoveal processing efficiency: Evidence from reading Chinese as a second language (Wang, Zhou, Shu, & Yan, 2014)\n\nThe role of radical awareness in Chinese-as-a-second language learners’\n\nChinese character reading development (Y. K. Wong, 2017)\n\n以眼動實驗探索歐美、日本與臺灣大學生閱讀漢字詞時，利用字形、字音線索的差異。(官英華, 2020)\n\n5/4\n\n主題:中文字詞辨識研究(L1/L2 Chinese)\n\nWord Reading in L1 and L2 Learners of Chinese: Similarities and Differences in the Functioning of Component Processes (Zhang, 2017)\n\nCharacter reading fluency, word segmentation accuracy, and reading comprehension in L2 Chinese (Shen & Jiang, 2013)\n\n5/11\n\n主題: 中文句子理解研究 （L2 中文）\n\n不同母语类型留学生理解汉语句子的实验研究 (王永德, 2004)\n\nCan L2 sentence processing strategies be native-like? Evidence from English speakers’ L2 processing of Chinese base-generated-topic sentences (Yuan, 2017)\n\n5/18\n\n主題: 中文為二/外語閱讀相關的研究 I\n\n以漢語為第二語言的留學生高級階段閱讀眼動研究 (付玉萍, 2008)\n\n5/25\n\n主題: 中文為二/外語閱讀相關的研究 II\n\nForeign language reading anxiety in a Chinese as a foreign language context  (J. Zhou, 2017)\n\nStrategy use in L2 Chinese reading: The effect of L1 background and L2 proficiency (Ke & Chan, 2017)\n\n6/1\n\n主題: 中文為二/外語閱讀相關的研究 III\n\nAn Investigation on Instructional-Level Reading Among Chinese L2 Learners (Shen, 2019)\n\nOral reading fluency of Chinese second language learners (Yang, 2020)\n\n6/8\n\n主題: 中文為二/外語閱讀相關的研究 IV\n\nChinese L2 Learners’ Depth of Vocabulary Knowledge and Its Role in Reading Comprehension (Zhang & Yang, 2016)\n\nRadical repetition effects in beginning learners of Chinese as a foreign language reading (Takashima & Verhoeven, 2019)\n\n6/15\n\n撰寫期末書面報告\n\n6/22\n\n撰寫期末書面報告/繳交期末書面報告截止日",
    "methodologies": [
        {
            "type": "講述法",
            "note": "講述閱讀相關的理論和一些中文閱讀的近期研究發現"
        },
        {
            "type": "討論法",
            "note": "老師與學生針對各項研究的議題和研究方法進行深入的討論"
        },
        {
            "type": "合作學習",
            "note": "讓學生進行分組報告的任務"
        },
        {
            "type": "媒體融入教學",
            "note": "使用moodle學習平台與學生分享資源，並利用PPT和影片輔助教學"
        },
        {
            "type": "專題研究",
            "note": "學生成立小組，針對有興趣的研究主題進行文獻探勘和整理，並於期末針對自選的研究主題寫文獻回顧或研究計畫書"
        }
    ],
    "grading": [
        {
            "type": "課堂討論參與",
            "weight": 20,
            "note": "學生一定要參與課堂討論才能通過這門課，參與討論次數越多者，分數越高。"
        },
        {
            "type": "出席",
            "weight": 5,
            "note": "監控學生出席率"
        },
        {
            "type": "報告",
            "weight": 45,
            "note": "期中分組口頭報告(20%)和個人選定週次論文主題的口頭報告(25%)"
        },
        {
            "type": "專題",
            "weight": 30,
            "note": "期末書面報告：以自選的中文閱讀之相關研究主題來撰寫文獻回顧或研究計畫書"
        }
    ],
    "prerequisite": "",
    "general_core": []
}