{
    "year": 109,
    "term": 2,
    "name": "北美華人專題研究",
    "teachers": [
        "楊聰榮"
    ],
    "department": "IM84",
    "code": "CLM0053",
    "credit": 3,
    "serial": 1370,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 5,
            "from": 2,
            "to": 4,
            "campus": "本部",
            "classroom": "綜10樓華語系教室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎課程不開放上修",
    "form_s": "",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "本課程教學目標在於使研究生學習移民研究的理論與方法，並將此用來研究北美華人的社會與文化情況。族群研究是指在由一個社會或國家中的群體移居到另一個社會或國家，在多數的情況下，華人應該視為當地移民，可以用當地的脈絡來看待移民。移民研究是研究超越單一國家或社會的群體，華裔存在世界各地已經是歷史悠久的事實，也應該以移民的角度來理解這些現象，移民研究已經行之有年，如果能以此來研究北美華人，比較能與其他學科及其他移民研究的情況，進行對話。",
    "goals": [
        "學習移民研究的理論與方法，並將此用來研究北美華人的社會與文化情況"
    ],
    "syllabus": "★教學目標：本課程教學目標在於使研究生學習移民研究的理論與方法，並將此用來研究北美華人的社會與文化情況。族群研究是指在由一個社會或國家中的群體移居到另一個社會或國家，在多數的情況下，華人應該視為當地移民，可以用當地的脈絡來看待移民。移民研究是研究超越單一國家或社會的群體，華裔存在世界各地已經是歷史悠久的事實，也應該以移民的角度來理解這些現象，移民研究已經行之有年，如果能以此來研究華人，比較能與其他學科及其他移民研究的情況，進行對話。\n\n★實施方式：\n\n(1) 上課方式：上課報告及討論、發展研究計劃\n\n(2) 課程要求：閱讀與討論，構思研究計劃，撰寫報告。\n\n(3) 評分標準：課堂報告及作業：60%期末報告：40%\n\n★課程主題：\n\n1.  移民研究的架構與範圍\n\nStephen Castles and Mark J. Miller, “The Next Waves: The Globalisation of International Migration”, The Age of Migration. (MacMillan, 1993)\n\n1.  社會變遷與社區發展\n\nRichard A. Easterlin,“Economic and Social Characteristics of the Immigrants”Immigration. (Harvard, 1982)\n\n1.  移民理論系統探究\n\nPeter C. Meilaender, “Sorting Out the Arguments”, Toward a Theory of Immigration. (Palgrave, 2001)\n\n4.移民研究方法\n\nMiko Agozino,”Methods of Data Reception”, Theoretical and Methodological Issues in Migration Research. (Ashgate, 2000)\n\n5.移民史\n\nMorrison Wong,“The Chinese American Family”, Harry Kitano,“The Japanese American Family”. Ethnic Families in America. (Elsevier, 1998, 1976)\n\n6.移民地域與文化\n\nCharles A. Price, “The Asian and Pacific Island Peoples of Australia”, Pacific Bridges: The New Immigration from Asia and the Pacific Islands. (Center for Migration Studies, 1987)\n\n7.移民政治文化\n\nCristina Szanton Blanc “The Thoroughly Modern Asian: Capital, Culture, and Nation in Thailand and the Philippines”, Aihwa Ong and Donald M. Nonini, Ungrounded Empires: The Cultural Politics of Modern Chinese Transnationalism. (Routledge, 1997)\n\n8.移民歷史模式\n\nIshtiaq Ahmed, “Exit, Voice and Citizenship” International Migration, Immobility and Development. (Berg, 1997)\n\n9.社群與組織\n\nAnchalee Singhanetra-Renard, “The Mobilization of Labour Migrants in Thailand: Personal Links and Facilitating Networks”International Migration Systems. (Oxford, 1992)\n\n10.移民與認同\n\nFranklin Ng, “An Evolving Taiwanese American Identity”, The Taiwanese Americans. (Greenwood, 1998)\n\n11.移民與全球化\n\nTimothy J. Hatton, Jeffrey G. Williamson, “Coda: The Evolution of a Global Labor Market”,The Age of Mass Migration: Causes and Economic Impact. (Oxford, 1988)\n\n12.移民與社群互動、社區生活\n\nBulrny Diken, “Hybridity, Globalization and the Stranger”, Strangers, Ambivalence and Social Theory. (Ashgate, 1988)\n\n13.姓別社會\n\nSharon K. Hom, Chinese Women Traversing Diaspora. (Library of Congress, 1999)\n\n14.經濟模式\n\nYoko Sellek, “Illegal Foreign Migrant Workers in Japan: Change and Challenge”, Judith Brown and Rosemary Foot, Migration: The Asian Experience. (MicMillan Press, 1994)\n\n15.移民與政治\n\nRobin Cohen, The Politics of Migration. (Edward, 1997)\n\n16.拓殖與開發\n\nLudger Pries,“New Migration in Transnational Spaces”, Migration and Transnational Social Spaces. (Ashgate, 1999)",
    "methodologies": [
        {
            "type": "講述法",
            "note": ""
        },
        {
            "type": "討論法",
            "note": ""
        },
        {
            "type": "問題解決教學",
            "note": ""
        }
    ],
    "grading": [
        {
            "type": "作業",
            "weight": 30,
            "note": ""
        },
        {
            "type": "課堂討論參與",
            "weight": 30,
            "note": ""
        },
        {
            "type": "出席",
            "weight": 10,
            "note": ""
        },
        {
            "type": "專題",
            "weight": 30,
            "note": ""
        }
    ],
    "prerequisite": "",
    "general_core": []
}