{
    "year": 111,
    "term": 1,
    "name": "國際服務業人力資源專題研究",
    "teachers": [
        "盧承杰"
    ],
    "department": "IM86",
    "code": "IWM0062",
    "type": "選",
    "grade": 2,
    "credit": 3,
    "serial": 1408,
    "group": "",
    "quota": {
        "limit": 50,
        "additional": 10
    },
    "schedule": [
        {
            "day": 3,
            "from": 7,
            "to": 9,
            "campus": "本部",
            "classroom": "人資所會議室"
        }
    ],
    "programs": [],
    "comment": "",
    "restrict": "◎限本系(含雙主修)修習 ◎課程不開放上修",
    "form_s": "2",
    "classes": "",
    "dept_group": "",
    "hours": 3,
    "description": "",
    "goals": [
        "Describe current research that is being done in the field of human resource development and management in international service industries.",
        "Explain the important issues and trends in managing and developing human resources in international service companies.",
        "Develop a research topic that pertains to current and important human resource problems in the international service industries.",
        "Critically review extant literature related to the research topic.",
        "Carry out the appropriate research procedure to help solve human resource problems in the international service industries."
    ],
    "syllabus": "This course is designed to train students in research and project development related to human resource issues in international service industries. Relevant HR problems, issues and research methods will be introduced and discussed to generate research ideas. Students will then practice how to develop ideas into a workable research proposal. This course will be taught using a combination of instructional methods including group discussions, student presentations, and independent study.\n\nWeek 1\n\nCourse introduction, syllabus review\n\nWeek 2\n\nThe nature of international service companies\n\nWeek 3- 5\n\nHuman resource issues in international service industries\n\nWeek 6- 10\n\nResearch issues in HR in international service industries\n\nWeek 11-15\n\nResearch methods of HR in international service companies\n\nWeek 16-18\n\nReporting of HR research in international service companies",
    "methodologies": [
        {
            "type": "Formal lecture",
            "note": "Important issues and trends in managing and developing human resources in international service companies will be introduced."
        },
        {
            "type": "Group discussion",
            "note": "Students will discuss related issues and trends introduced by the instructor and research topics presented by fellow students."
        },
        {
            "type": "Case studies",
            "note": "Students will develop a research or project proposal to study a current problem in human resources."
        }
    ],
    "grading": [
        {
            "type": "Class discussion involvement",
            "weight": 15,
            "note": "Students are encouraged to actively participate in class discussions to enrich the learning."
        },
        {
            "type": "Attendances",
            "weight": 15,
            "note": "Attendance is required."
        },
        {
            "type": "Presentation",
            "weight": 30,
            "note": "Students are required to introduce and present assigned readings in class."
        },
        {
            "type": "Case study reports",
            "weight": 40,
            "note": "Students will develop a research or project proposal to study a current problem in human resources. Students are required to present the proposal orally in class and submit the completed written proposal at the end of semester."
        }
    ],
    "prerequisite": "◎Exclusive for students within this department(including dual degree program) ◎Unavailable for M.A. program students (M.A. program courses excepted) and B.A. program students.",
    "general_core": []
}